["(0:52) Eli Manning rush up the middle for a loss of 1 yard to the Cle31.","(0:52) Eli Manning rush up the middle for a loss of 1 yard to the Cle30.","(0:59) Josh McCown sacked at Cle29 for a loss of 1 yard by Jason Pierre-Paul. FUMBLE, recovered by NYG (Kerry Wynn). Tackled by Alvin Bailey.","(1:35) Josh McCown pass to the middle to Seth DeValve for 10 yards to the Cle30. Tackled by Coty Sensabaugh.","(1:43) Brad Wing punts for 52 yards to Cle0. Touchback.","(1:43) Cleveland Browns timeout.","(1:51) Paul Perkins rush to the left for 6 yards to the NYG48. Tackled by Ed Reynolds.","(1:51) Cleveland Browns timeout.","(2:00) Paul Perkins rush to the left for 3 yards to the NYG42. Tackled by Jamie Meder and Demario Davis.","(2:00) Two Minute Warning.","(2:32) Paul Perkins rush to the left for 4 yards to the NYG39. Tackled by Jamie Collins and Jamar Taylor.","(2:32) Penalty: False Start on New York (Paul Perkins) -5 yards.","(2:39) Josh McCown incomplete pass to the left intended for Corey Coleman defensed by Janoris Jenkins.","(2:47) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr. defensed by Dominique Rodgers-Cromartie.","(3:22) Josh McCown sacked at NYG40 for a loss of 9 yards by Janoris Jenkins.","(3:27) Josh McCown incomplete pass to the left intended for Corey Coleman.","(4:09) Josh McCown pass to the left to Rashard Higgins for 15 yards to the NYG31. Tackled by Janoris Jenkins and Romeo Okwara.","(4:13) Josh McCown incomplete pass to the left intended for Andrew Hawkins.","(4:41) Josh McCown pass to the left to Seth DeValve for 8 yards to the NYG46. Tackled by Landon Collins.","(5:10) Josh McCown pass to the left to Seth DeValve for 21 yards to the Cle46. Tackled by Andrew Adams.","(5:10) Robbie Gould kicks off to the endzone. Touchback.","(5:10) Robbie Gould extra point is good.","(5:15) Eli Manning pass to the right to Odell Beckham Jr. for 4 yards for a TOUCHDOWN.","(5:57) Rashad Jennings rush to the right for 2 yards to the Cle4. Tackled by Briean Boddy-Calhoun.","(6:04) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(6:49) Sterling Shepard rush to the right for 22 yards to the Cle6. Tackled by Jamie Collins.","(7:29) Eli Manning pass to the right to Odell Beckham Jr. for 41 yards to the Cle28. Tackled by Ed Reynolds.","(8:09) Rashad Jennings rush to the left for 4 yards to the NYG31. Tackled by Emmanuel Ogbah.","(8:17) Cody Parkey kicks off to the NYG2. Bobby Rainey return for 25 yards to NYG27. Tackled by Tracy Howard.","(8:17) Cody Parkey extra point is good.","(8:23) Josh McCown pass to the left to Corey Coleman for 21 yards for a TOUCHDOWN.","(9:09) Josh McCown sacked at NYG21 for a loss of 4 yards by Olivier Vernon.","(9:55) Josh McCown pass to the middle to Isaiah Crowell for 13 yards to the NYG17. Tackled by Jonathan Casillas.","(10:30) Josh McCown pass to the right to Isaiah Crowell for 11 yards to the NYG30. Tackled by Jonathan Casillas.","(10:58) Josh McCown pass to the right to Rashard Higgins for 19 yards to the Cle44. Tackled by Keenan Robinson. Penalty: Face Mask on New York (Keenan Robinson) 15 yards.","(10:58) Robbie Gould kicks off to the endzone. Touchback.","(10:58) Robbie Gould extra point is NO GOOD.","(11:08) Josh McCown sacked at Cle43 for a loss of 7 yards by Johnathan Hankins. FUMBLE, recovered by NYG (Jason Pierre-Paul) and returned for 43 yards for a TOUCHDOWN.","(12:09) Penalty: False Start on Cleveland (Alvin Bailey) -5 yards.","(12:09) Josh McCown pass to the left to Danny Vitale for a loss of 4 yards to the NYG45. Tackled by Olivier Vernon.","(12:47) Josh McCown pass to the right to Terrelle Pryor Sr. for 54 yards to the NYG41. Tackled by Eli Apple.","(13:00) Brad Wing punts for 43 yards to Cle5. No return.","(13:07) Eli Manning incomplete pass to the left intended for Roger Lewis.","(13:14) Eli Manning incomplete pass to the middle intended for Roger Lewis defensed by Briean Boddy-Calhoun.","(13:56) Paul Perkins rush to the right for 2 yards to the Cle48. Tackled by Jamie Collins and Christian Kirksey.","(14:03) Britton Colquitt punts for 54 yards to NYG41. Odell Beckham Jr. return for 19 yards to Cle40. Penalty: Holding on New York (Mark Herzlich) -10 yards.","(14:52) Josh McCown sacked at Cle5 for a loss of 8 yards by Jason Pierre-Paul.","(15:00) Josh McCown incomplete pass to the left intended for Duke Johnson Jr..","(0:14) Josh McCown pass to the middle to Duke Johnson Jr. for 5 yards to the Cle13. Tackled by Devon Kennard.","(0:22) Brad Wing punts for 56 yards to Cle8. No return.","(0:48) Rashad Jennings rush to the right for 6 yards to the NYG36. Tackled by Xavier Cooper.","(0:55) Eli Manning incomplete pass to the right intended for Victor Cruz.","(1:31) Rashad Jennings rush to the right for 3 yards to the NYG30. Tackled by Jamie Collins.","(2:07) Rashad Jennings rush to the left for 7 yards to the NYG27. Tackled by Jamie Meder.","(2:48) Rashad Jennings rush to the left for 6 yards to the NYG20. Tackled by Demario Davis and Jamie Meder.","(2:56) Britton Colquitt punts for 42 yards to NYG14. No return.","(3:04) Josh McCown incomplete pass to the left intended for Seth DeValve.","(3:45) Isaiah Crowell rush to the right for 1 yard to the Cle44. Tackled by Romeo Okwara.","(4:02) Josh McCown pass to the right to Isaiah Crowell for 6 yards to the Cle43. Tackled by Landon Collins.","(4:16) Brad Wing punts for 56 yards to Cle28. Duke Johnson Jr. return for 9 yards to Cle37. Tackled by Bobby Rainey and Mark Herzlich.","(4:20) Eli Manning incomplete pass to the right intended for Odell Beckham Jr. defensed by Emmanuel Ogbah.","(4:58) Paul Perkins rush to the right for 2 yards to the NYG16. Tackled by Christian Kirksey and Jamie Collins.","(5:04) Eli Manning incomplete pass to the right intended for Roger Lewis defensed by Briean Boddy-Calhoun.","(5:20) Britton Colquitt punts for 50 yards to NYG20. Odell Beckham Jr. return for 4 yards to NYG24. Tackled by Derrick Kindred. Penalty: Illegal Block on New York (Eli Apple) -10 yards.","(5:25) Josh McCown incomplete pass to the left intended for Terrelle Pryor Sr..","(6:07) Josh McCown sacked at Cle30 for a loss of 3 yards by Olivier Vernon.","(6:48) Isaiah Crowell rush to the left for 2 yards to the Cle33. Tackled by Olivier Vernon.","(7:30) Josh McCown pass to the right to Terrelle Pryor Sr. for 18 yards to the Cle31. Tackled by Landon Collins.","(8:04) Isaiah Crowell rush to the left for 1 yard to the Cle13. Tackled by Jonathan Casillas and Damon Harrison.","(8:17) Brad Wing punts for 58 yards to Cle15. Duke Johnson Jr. return for a loss of 3 yards to Cle12. Tackled by Dwayne Harris and B.J. Goodson.","(8:51) Rashad Jennings rush to the right for 8 yards to the NYG27. Tackled by Xavier Cooper and Jamie Collins.","(9:27) Eli Manning pass to the left to Rashad Jennings for no gain to the NYG19. Tackled by Danny Shelton.","(9:59) Rashad Jennings rush to the left for a loss of 2 yards to the NYG19. Tackled by Christian Kirksey.","(10:11) Britton Colquitt punts for 39 yards to NYG9. Odell Beckham Jr. return for 12 yards to NYG21. Tackled by Ricardo Louis and Joe Schobert.","(10:16) Josh McCown incomplete pass to the right intended for Gary Barnidge.","(10:53) Isaiah Crowell rush to the left for no gain to the NYG48. Tackled by Jason Pierre-Paul and Damon Harrison.","(11:16) Josh McCown pass to the right to Terrelle Pryor Sr. for 9 yards to the NYG48.","(11:40) Penalty: False Start on Cleveland (John Greco) -5 yards.","(12:12) Isaiah Crowell rush to the left for 4 yards to the Cle48. Tackled by Keenan Robinson.","(13:00) Isaiah Crowell rush to the left for 7 yards to the Cle44. Tackled by Damon Harrison.","(13:26) Duke Johnson Jr. rush to the left for 6 yards to the Cle37. Tackled by Landon Collins.","(14:13) Josh McCown pass to the left to Corey Coleman for 4 yards to the Cle31. Tackled by Dominique Rodgers-Cromartie.","(14:55) Isaiah Crowell rush to the left for 4 yards to the Cle27. Tackled by Damon Harrison.","(15:00) Robbie Gould kicks off to the Cle-1. Ricardo Louis return for 24 yards to Cle23. Tackled by B.J. Goodson and Dwayne Harris.","(0:05) Cody Parkey 25 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(0:09) Josh McCown incomplete pass to the left intended for Terrelle Pryor Sr. defensed by Janoris Jenkins.","(0:16) Josh McCown pass to the left to Duke Johnson Jr. for 12 yards to the NYG7. Tackled by Keenan Robinson.","(0:17) Josh McCown incomplete pass to the middle.","(0:32) Josh McCown pass to the middle to Terrelle Pryor Sr. for 14 yards to the NYG19. Tackled by Janoris Jenkins.","(0:36) Penalty: Holding on New York (Trevin Wade) 5 yards.","(0:36) Cleveland Browns timeout.","(0:45) Josh McCown pass to the right to Terrelle Pryor Sr. for 22 yards to the NYG38. Tackled by Eli Apple.","(0:45) Cleveland Browns timeout.","(0:55) Josh McCown sacked at Cle40 for a loss of 5 yards by Jason Pierre-Paul.","(0:55) New York Giants timeout.","(1:02) Penalty: Face Mask on Cleveland (Corey Coleman) -15 yards.","(1:08) Penalty: Pass Interference on New York (Eli Apple) 35 yards.","(1:13) Josh McCown incomplete pass to the left intended for Corey Coleman defensed by Romeo Okwara.","(1:13) Robbie Gould kicks off to the endzone. Touchback.","(1:13) Robbie Gould extra point is good.","(1:22) Eli Manning pass to the right to Odell Beckham Jr. for 32 yards for a TOUCHDOWN.","(1:25) Eli Manning incomplete pass to the right intended for Victor Cruz.","(1:32) Eli Manning pass to the right to Victor Cruz for 37 yards to the Cle32. Tackled by Marcus Burley.","(1:35) Eli Manning incomplete pass to the right intended for Victor Cruz defensed by Corey Lemonier.","(1:43) Cody Parkey kicks off to the NYG5. Bobby Rainey return for 26 yards to NYG31. Tackled by Ibraheim Campbell.","(1:46) Cody Parkey 20 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(1:53) Josh McCown incomplete pass to the right intended for Duke Johnson Jr..","(1:53) New York Giants timeout.","(1:59) Isaiah Crowell rush to the left for 2 yards to the NYG2. Tackled by Landon Collins.","(1:59) Two Minute Warning.","(2:04) Duke Johnson Jr. rush to the right for 2 yards to the NYG4. Tackled by Jason Pierre-Paul and Keenan Robinson.","(2:49) Duke Johnson Jr. rush to the left for 4 yards to the NYG6. Tackled by Keenan Robinson.","(3:29) Josh McCown pass to the right to Isaiah Crowell for 9 yards to the NYG10. Tackled by Jonathan Casillas.","(4:06) Isaiah Crowell rush to the right for 2 yards to the NYG19. Tackled by Kelvin Sheppard.","(4:06) Cleveland Browns timeout.","(4:46) Isaiah Crowell rush to the right for no gain to the NYG21. Tackled by Damon Harrison and Janoris Jenkins.","(5:28) Josh McCown pass to the middle to Isaiah Crowell for 9 yards to the NYG21. Tackled by Damon Harrison.","(5:34) Josh McCown incomplete pass to the left intended for Gary Barnidge.","(5:50) Britton Colquitt punts for 41 yards to NYG38. Bobby Rainey - no return. FUMBLE, recovered by Cle (Dominique Alexander) and returned for 2 yards.","(5:50) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(5:57) Josh McCown incomplete pass to the left intended for Isaiah Crowell.","(6:21) Penalty: False Start on Cleveland (John Greco) -5 yards.","(6:57) Isaiah Crowell rush to the right for 6 yards to the Cle26. Tackled by Kelvin Sheppard.","(7:03) Robbie Gould kicks off to the Cle-1. Ricardo Louis return for 21 yards to Cle20. Tackled by Paul Perkins.","(7:03) Robbie Gould extra point is good.","(7:08) Eli Manning pass to the left to Dwayne Harris for 13 yards for a TOUCHDOWN.","(7:45) Eli Manning pass to the right to Roger Lewis for 18 yards to the Cle13. Tackled by Briean Boddy-Calhoun.","(7:54) Isaiah Crowell rush to the left for 3 yards to the Cle28. Tackled by Damon Harrison. FUMBLE, recovered by NYG (Devon Kennard). Tackled by Spencer Drango.","(8:33) Josh McCown pass to the left to Corey Coleman for 13 yards to the Cle25. Tackled by Devon Kennard.","(8:43) Brad Wing punts for 45 yards to Cle13. Duke Johnson Jr. return for a loss of 1 yard to Cle12. Tackled by B.J. Goodson.","(9:15) Paul Perkins rush to the right for 3 yards to the NYG42. Tackled by Xavier Cooper and Emmanuel Ogbah.","(9:21) Eli Manning incomplete pass to the left intended for Victor Cruz.","(9:58) Eli Manning pass to the middle to Paul Perkins for 4 yards to the NYG39. Tackled by Carl Nassib.","(10:13) Penalty: False Start on New York (Bobby Hart) -5 yards.","(10:39) Penalty: Holding on New York (Ereck Flowers) -10 yards.","(10:49) Britton Colquitt punts for 51 yards to NYG43. Bobby Rainey return for 7 yards to NYG50. Tackled by Ricardo Louis.","(10:56) Josh McCown incomplete pass to the left intended for Andrew Hawkins defensed by Andrew Adams.","(11:35) Duke Johnson Jr. rush to the right for a loss of 2 yards to the Cle6. Tackled by Janoris Jenkins.","(12:12) Duke Johnson Jr. rush to the right for 4 yards to the Cle8. Tackled by Kelvin Sheppard and Damon Harrison.","(12:18) Brad Wing punts for 43 yards to Cle4. No return.","(12:59) Rashad Jennings rush to the right for no gain to the Cle47. Tackled by Christian Kirksey and Derrick Kindred.","(13:32) Rashad Jennings rush to the right for 6 yards to the Cle47. Tackled by Christian Kirksey.","(14:01) Rashad Jennings rush to the right for 3 yards to the NYG47. Tackled by Emmanuel Ogbah and Danny Shelton.","(14:26) Rashad Jennings rush to the right for 11 yards to the NYG44. Tackled by Ed Reynolds and Christian Kirksey.","(15:00) Eli Manning pass to the right to Will Tye for 5 yards to the NYG33. Tackled by Christian Kirksey.","(0:33) Eli Manning pass to the right to Will Tye for 7 yards to the NYG28. Tackled by Carl Nassib.","(1:06) Rashad Jennings rush to the right for a loss of 1 yard to the NYG21. Tackled by Christian Kirksey and Jamie Meder.","(1:53) Eli Manning pass to the right to Odell Beckham Jr. for 7 yards to the NYG22. Tackled by Jamar Taylor.","(2:28) Rashad Jennings rush to the left for 4 yards to the NYG15. Tackled by Christian Kirksey and Ed Reynolds.","(2:38) Britton Colquitt punts for 44 yards to NYG20. Bobby Rainey - no return. Tackled by Christian Kirksey. Penalty: Illegal Fair Catch on New York (Bobby Rainey) -5 yards.","(2:43) Josh McCown incomplete pass to the middle intended for Terrelle Pryor Sr. defensed by Janoris Jenkins.","(3:23) Isaiah Crowell rush to the right for 2 yards to the Cle36. Tackled by Jason Pierre-Paul.","(3:30) Duke Johnson Jr. incomplete pass to the right intended for Terrelle Pryor Sr..","(4:11) Josh McCown pass to the right to Terrelle Pryor Sr. for 14 yards to the Cle34. Tackled by Nat Berhe.","(4:16) Josh McCown incomplete pass to the left intended for Corey Coleman.","(4:25) Brad Wing punts for 36 yards to Cle20. No return.","(5:02) Eli Manning sacked at NYG44 for a loss of 2 yards by Corey Lemonier.","(5:08) Eli Manning incomplete pass to the right intended for Odell Beckham Jr. defensed by Joe Haden.","(5:37) Paul Perkins rush to the left for 4 yards to the NYG46. Tackled by Jamie Collins.","(6:17) Eli Manning pass to the right to Odell Beckham Jr. for 11 yards to the NYG42. Tackled by Joe Haden.","(6:58) Eli Manning pass to the right to Odell Beckham Jr. for 1 yard to the NYG31. Tackled by Joe Haden.","(7:33) Paul Perkins rush to the left for 4 yards to the NYG30. Tackled by Christian Kirksey and Jamie Meder.","(8:13) Eli Manning pass to the right to Paul Perkins for 10 yards to the NYG26. Tackled by Ed Reynolds and Jamie Collins.","(8:52) Paul Perkins rush to the right for 1 yard to the NYG16. Tackled by Carl Nassib.","(8:56) Eli Manning incomplete pass to the middle intended for Odell Beckham Jr..","(9:09) Britton Colquitt punts for 41 yards to NYG15. No return.","(9:48) Josh McCown pass to the middle to Duke Johnson Jr. for 9 yards to the Cle44. Tackled by Dominique Rodgers-Cromartie.","(10:11) Penalty: Delay of Game on Cleveland (Josh McCown) -5 yards.","(10:58) Isaiah Crowell rush to the right for 3 yards to the Cle40. Tackled by Johnathan Hankins and Damon Harrison.","(11:34) Josh McCown pass to the right to Isaiah Crowell for a loss of 1 yard to the Cle37. Tackled by Devon Kennard.","(12:19) Josh McCown pass to the right to Gary Barnidge for 11 yards to the Cle38. Tackled by Landon Collins.","(12:58) Isaiah Crowell rush to the right for 9 yards to the Cle27. Tackled by Kelvin Sheppard and Landon Collins.","(13:41) Isaiah Crowell rush to the right for a loss of 2 yards to the Cle18. Tackled by Jason Pierre-Paul.","(13:50) Brad Wing punts for 38 yards to Cle20. No return.","(13:57) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(14:34) Rashad Jennings rush to the left for a loss of 2 yards to the NYG42. Tackled by Briean Boddy-Calhoun.","(15:00) Eli Manning pass to the left to Rashad Jennings for 4 yards to the NYG44. Tackled by Briean Boddy-Calhoun.","(15:00) Cody Parkey kicks off to the NYG3, out of bounds. No return."]