["(0:35) Jameis Winston rush up the middle for a loss of 1 yard to the TB30.","(1:18) Jameis Winston rush up the middle for a loss of 1 yard to the TB31.","(1:18) Seattle Seahawks timeout.","(1:19) Jameis Winston rush up the middle for a loss of 2 yards to the TB32.","(1:36) Russell Wilson pass intended for Tyler Lockett INTERCEPTED by Bradley McDougald and returned for 32 yards. Tackled by George Farmer.","(2:00) Russell Wilson pass to the right to Doug Baldwin for 3 yards to the TB31. Tackled by Lavonte David.","(2:00) Two Minute Warning.","(2:11) Russell Wilson pass to the right to Paul Richardson for 17 yards to the TB34. Tackled by Brent Grimes.","(2:19) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(2:19) Seattle Seahawks timeout.","(2:26) Russell Wilson sacked at Sea49 for a loss of 6 yards by Ryan Russell.","(2:59) Russell Wilson pass to the middle to Jimmy Graham for 21 yards to the TB45. Tackled by Chris Conte.","(3:21) Russell Wilson pass to the left to Jermaine Kearse for 18 yards to the Sea34. Tackled by Alterraun Verner.","(3:21) Seattle Seahawks timeout.","(3:37) Russell Wilson sacked at Sea16 for a loss of 8 yards by Gerald McCoy.","(3:42) Russell Wilson incomplete pass to the left intended for George Farmer.","(4:06) Russell Wilson pass to the left to George Farmer for 4 yards to the Sea24. Tackled by Daryl Smith.","(4:10) Jameis Winston pass intended for Mike Evans INTERCEPTED by Kam Chancellor. No return. Touchback.","(4:17) Penalty: Illegal Use of Hands on Tampa Bay (Demar Dotson) -10 yards.","(4:59) Doug Martin rush up the middle for a loss of 1 yard to the Sea10. Tackled by Frank Clark and Jarran Reed.","(5:41) Doug Martin rush up the middle for 3 yards to the Sea9. Tackled by Kam Chancellor.","(6:23) Jameis Winston pass to the right to Adam Humphries for 18 yards to the Sea12. Tackled by Richard Sherman.","(7:01) Adam Humphries rush to the right for a loss of 5 yards to the Sea30. Tackled by Cliff Avril.","(7:19) Russell Wilson pass to the left to Jimmy Graham for 5 yards to the TB22. Tackled by Lavonte David and Vernon Hargreaves III. FUMBLE, recovered by TB (Lavonte David) and returned for 53 yards. Tackled by Russell Wilson.","(8:02) Thomas Rawls rush up the middle for 3 yards to the TB27. Tackled by Kwon Alexander.","(8:08) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(8:35) Russell Wilson pass to the left to Jimmy Graham for 13 yards to the TB30. Tackled by Chris Conte.","(9:12) Russell Wilson pass to the left to Doug Baldwin for a loss of 1 yard to the TB43. Tackled by Vernon Hargreaves III.","(9:41) Russell Wilson rush to the right for 13 yards to the TB42. Tackled by Bradley McDougald.","(10:14) Russell Wilson pass to the right to Doug Baldwin for 4 yards to the Sea45. Tackled by Brent Grimes.","(10:22) Doug Martin rush up the middle for 3 yards to the Sea45. Tackled by Ahtyba Rubin and Cliff Avril. FUMBLE, recovered by Sea (Steven Terrell). Tackled by Cameron Brate.","(10:58) Doug Martin rush to the right for 5 yards to the Sea48. Tackled by Tony McDaniel and Ahtyba Rubin.","(11:37) Doug Martin rush to the left for 11 yards to the TB47. Tackled by Bobby Wagner and K.J. Wright.","(11:49) Jon Ryan punts for 55 yards to TB12. Adam Humphries return for 24 yards to TB36. Tackled by Nolan Frese. FUMBLE, recovered by TB.","(11:58) Russell Wilson incomplete pass to the left intended for Tyler Lockett defensed by Bradley McDougald.","(11:58) Tampa Bay Buccaneers timeout.","(12:04) Russell Wilson incomplete pass to the right intended for Jimmy Graham.","(12:09) Russell Wilson incomplete pass to the right intended for Jermaine Kearse defensed by Brent Grimes.","(12:36) Thomas Rawls rush up the middle for 2 yards to the Sea33. Tackled by Bradley McDougald and Sealver Siliga.","(13:03) Russell Wilson pass to the middle to Jimmy Graham for 9 yards to the Sea31. Tackled by Chris Conte.","(13:31) Russell Wilson pass to the middle to Doug Baldwin for 8 yards to the Sea22. Tackled by Vernon Hargreaves III.","(14:03) Russell Wilson rush to the left for 7 yards to the Sea14. Tackled by Chris Conte.","(14:13) Bryan Anger punts for 56 yards to Sea7. Tyler Lockett - no return. Tackled by Josh Robinson.","(15:00) Jameis Winston pass to the right to Cameron Brate for 13 yards to the TB37. Tackled by K.J. Wright.","(0:21) Peyton Barber rush up the middle for 7 yards to the TB24. Tackled by Bobby Wagner.","(0:30) Jameis Winston incomplete pass to the right intended for Cecil Shorts III.","(0:47) Penalty: Illegal Use of Hands on Tampa Bay (Ali Marpet) -10 yards.","(1:45) Penalty: False Start on Tampa Bay (Gosder Cherilus) -5 yards.","(1:45) Peyton Barber rush up the middle for 4 yards to the TB32. Tackled by Cassius Marsh.","(2:30) Jameis Winston rush up the middle for 8 yards to the TB28. Tackled by Cassius Marsh.","(2:39) Jon Ryan punts for 45 yards to TB20. No return.","(3:12) Will Tukuafu rush up the middle for no gain to the Sea35. Tackled by Akeem Spence and Lavonte David.","(3:53) Thomas Rawls rush up the middle for 8 yards to the Sea35. Tackled by Kwon Alexander.","(4:29) Thomas Rawls rush up the middle for 1 yard to the Sea27. Tackled by Lavonte David and Robert Ayers Jr..","(5:03) Russell Wilson pass to the middle to Jimmy Graham for 17 yards to the Sea26. Tackled by Chris Conte.","(5:13) Bryan Anger punts for 31 yards to Sea9. No return.","(5:18) Jameis Winston incomplete pass to the left intended for Mike Evans.","(5:59) Doug Martin rush to the left for a loss of 1 yard to the Sea40. Tackled by Cassius Marsh.","(6:35) Doug Martin rush up the middle for 5 yards to the Sea39. Tackled by Kam Chancellor.","(7:10) Jameis Winston pass to the left to Mike Evans for 10 yards to the Sea44. Tackled by Bobby Wagner.","(7:10) Tampa Bay Buccaneers timeout.","(7:55) Jameis Winston pass to the right to Mike Evans for 10 yards to the TB46. Tackled by Kam Chancellor.","(8:31) Doug Martin rush up the middle for 3 yards to the TB36. Tackled by Neiko Thorpe.","(9:04) Jameis Winston pass to the left to Russell Shepard for 5 yards to the TB33. Tackled by Jeremy Lane.","(9:11) Jon Ryan punts for 42 yards to TB28. No return.","(9:17) Russell Wilson incomplete pass to the left intended for Tyler Lockett.","(10:01) Russell Wilson pass to the right to Doug Baldwin for 1 yard to the Sea30. Tackled by Kwon Alexander.","(10:10) Russell Wilson incomplete pass to the left intended for Paul Richardson.","(10:46) Russell Wilson rush to the right for 13 yards to the Sea29.","(11:12) Russell Wilson pass to the right to Doug Baldwin for 12 yards to the Sea16. Tackled by Vernon Hargreaves III.","(11:24) Bryan Anger punts for 46 yards to Sea4. No return.","(12:11) Doug Martin rush to the left for a loss of 3 yards to the TB50. Tackled by K.J. Wright.","(12:47) Jameis Winston pass to the left to Cameron Brate for 7 yards to the Sea47. Tackled by Steven Terrell.","(13:27) Doug Martin rush to the left for 2 yards to the TB46. Tackled by Kam Chancellor and Jeremy Lane.","(13:35) Jon Ryan punts for 43 yards to TB33. Adam Humphries return for 11 yards to TB44. Tackled by DeAndre Elliott.","(13:42) Russell Wilson incomplete pass to the left intended for Tyler Lockett.","(14:29) Russell Wilson rush to the right for 11 yards to the Sea24. Tackled by Chris Conte.","(14:35) Russell Wilson incomplete pass to the left intended for Jermaine Kearse defensed by Alterraun Verner.","(15:00) Penalty: Illegal Block on Seattle (Joey Hunt) -12 yards.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback.","(0:15) Jameis Winston pass to the right to Cameron Brate for 2 yards to the Sea30. Tackled by K.J. Wright.","(0:22) Jameis Winston incomplete pass to the right intended for Russell Shepard.","(0:22) Tampa Bay Buccaneers timeout.","(0:29) Jameis Winston pass to the right to Russell Shepard for 18 yards to the Sea32. Tackled by Neiko Thorpe.","(0:29) Tampa Bay Buccaneers timeout.","(0:37) Jameis Winston pass to the right to Alan Cross for 10 yards to the TB50. Tackled by K.J. Wright.","(0:37) Tampa Bay Buccaneers timeout.","(0:43) Doug Martin rush up the middle for 9 yards to the TB40. Tackled by Kam Chancellor.","(0:53) Russell Wilson pass intended for Paul Richardson INTERCEPTED by Alterraun Verner and returned for 16 yards. Tackled by George Farmer.","(0:53) Seattle Seahawks timeout.","(1:04) Russell Wilson rush to the left for 8 yards to the TB29. Tackled by Lavonte David.","(1:12) Russell Wilson rush to the left for 8 yards to the TB37.","(1:34) Russell Wilson rush up the middle for 3 yards to the TB45. Tackled by Lavonte David.","(2:00) Russell Wilson pass to the left to Doug Baldwin for 7 yards to the TB48. Tackled by Alterraun Verner.","(2:00) Two Minute Warning.","(2:10) Thomas Rawls rush up the middle for 7 yards to the Sea45. Tackled by Gerald McCoy.","(2:17) 48 yard field goal attempt by Roberto Aguayo is NO GOOD. Holder: Bryan Anger.","(2:47) Jameis Winston pass to the right to Cecil Shorts III for 6 yards to the Sea29.","(3:20) Jameis Winston pass to the right to Doug Martin for a loss of 2 yards to the Sea35. Tackled by K.J. Wright.","(3:51) Doug Martin rush to the right for 1 yard to the Sea33. Tackled by Bobby Wagner.","(4:16) Jameis Winston pass to the left to Mike Evans for 8 yards to the Sea49. Tackled by Richard Sherman. Penalty: Unnecessary Roughness on Seattle (Frank Clark) 15 yards.","(4:24) Jameis Winston incomplete pass to the right intended for Mike Evans defensed by K.J. Wright.","(4:34) Jon Ryan punts for 43 yards to TB43. No return.","(5:13) Russell Wilson sacked at Sea14 for a loss of 6 yards by Kwon Alexander.","(5:59) Thomas Rawls rush up the middle for 1 yard to the Sea20. Tackled by William Gholston and Akeem Spence.","(6:30) Thomas Rawls rush to the left for 5 yards to the Sea19. Tackled by Clinton McDonald.","(6:39) Bryan Anger punts for 27 yards to Sea14. No return.","(7:13) Doug Martin rush up the middle for a loss of 1 yard to the Sea41. Tackled by Frank Clark and Cassius Marsh.","(7:23) Jameis Winston incomplete pass to the left intended for Cecil Shorts III defensed by Steven Terrell.","(8:06) Adam Humphries rush to the left for 8 yards to the Sea40. Tackled by Kam Chancellor.","(8:38) Doug Martin rush to the right for 10 yards to the Sea48. Tackled by Kam Chancellor.","(9:15) Jameis Winston pass to the right to Luke Stocker for 3 yards to the TB42. Tackled by Jordan Tripp.","(9:52) Jameis Winston pass to the left to Mike Evans for 14 yards to the TB39. Tackled by Kam Chancellor.","(10:34) Doug Martin rush to the right for 2 yards to the TB25. Tackled by Tony McDaniel.","(10:39) Steven Hauschka kicks off to the TB-1. Ryan Smith return for 24 yards to TB23. Tackled by Paul Richardson.","(10:43) Steven Hauschka 43 yard field goal attempt is GOOD. Holder: Jon Ryan.","(10:48) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(11:31) Thomas Rawls rush to the right for 2 yards to the TB25. Tackled by Noah Spence.","(12:11) Thomas Rawls rush to the right for 3 yards to the TB27. Tackled by Brent Grimes and Kwon Alexander.","(12:18) Penalty: Pass Interference on Tampa Bay (Bradley McDougald) 29 yards.","(12:23) Russell Wilson incomplete pass to the left intended for Thomas Rawls.","(12:38) Russell Wilson sacked at Sea41 for a loss of 4 yards by Robert Ayers Jr..","(13:13) Russell Wilson rush to the right for 17 yards to the Sea45. Tackled by Chris Conte.","(13:16) Russell Wilson incomplete pass to the middle intended for Doug Baldwin.","(13:23) Bryan Anger kicks off to the Sea13. Tyler Lockett return for 15 yards to Sea28. Tackled by Keith Tandy.","(13:29) Peyton Barber rush up the middle for no gain to the TB4. Tackled by Jarran Reed and Bobby Wagner. Penalty: Holding on Tampa Bay (Luke Stocker) -4 yards. Safety.","(14:21) Jon Ryan punts for 48 yards to TB4. No return.","(15:00) Russell Wilson sacked at Sea48 for a loss of 4 yards by Noah Spence. FUMBLE, recovered by Sea (Russell Wilson).","(0:25) Thomas Rawls rush to the left for a loss of 2 yards to the TB48. Tackled by Bradley McDougald and Noah Spence.","(1:04) Thomas Rawls rush to the left for 7 yards to the TB46. Tackled by Vernon Hargreaves III and Lavonte David.","(1:43) Russell Wilson pass to the right to Luke Willson for 11 yards to the Sea47. Tackled by Brent Grimes.","(2:19) Tyler Lockett rush to the right for 9 yards to the Sea36. Tackled by Brent Grimes.","(2:53) Russell Wilson pass to the right to Jimmy Graham for 2 yards to the Sea27. Tackled by Bradley McDougald.","(2:53) Roberto Aguayo kicks off to the endzone. Touchback.","(2:53) Roberto Aguayo extra point is good.","(3:00) Jameis Winston pass to the left to Mike Evans for 23 yards for a TOUCHDOWN.","(3:36) Jameis Winston pass to the left to Cameron Brate for 27 yards to the Sea23. Tackled by Kevin Pierre-Louis and Steven Terrell.","(4:14) Doug Martin rush to the left for 10 yards to the TB50. Tackled by Neiko Thorpe.","(4:58) Doug Martin rush to the right for 2 yards to the TB40. Tackled by Kevin Pierre-Louis.","(5:19) Penalty: Illegal Formation on Tampa Bay (Gosder Cherilus) -5 yards.","(5:54) Jameis Winston pass to the left to Doug Martin for 5 yards to the TB43. Tackled by Kevin Pierre-Louis.","(6:06) Jon Ryan punts for 54 yards to TB25. Adam Humphries return for 13 yards to TB38. Tackled by Neiko Thorpe.","(6:15) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(6:59) Russell Wilson sacked at Sea21 for a loss of 5 yards by Noah Spence and Gerald McCoy.","(7:34) Thomas Rawls rush to the left for 1 yard to the Sea26. Tackled by Bradley McDougald.","(7:34) Roberto Aguayo kicks off to the endzone. Touchback.","(7:34) Roberto Aguayo extra point is good.","(7:41) Jameis Winston pass to the left to Mike Evans for 3 yards for a TOUCHDOWN.","(8:18) Jameis Winston pass to the middle to Peyton Barber for 4 yards to the Sea3. Tackled by Bobby Wagner and Tony McDaniel.","(8:56) Peyton Barber rush up the middle for 1 yard to the Sea7. Tackled by Tony McDaniel and Bobby Wagner.","(9:25) Peyton Barber rush to the left for 4 yards to the Sea8. Tackled by Steven Terrell.","(10:01) Doug Martin rush to the left for 7 yards to the Sea12. Tackled by Bobby Wagner.","(10:36) Doug Martin rush to the left for 7 yards to the Sea19. Tackled by Neiko Thorpe and Steven Terrell.","(11:04) Doug Martin rush up the middle for 4 yards to the Sea26. Tackled by Neiko Thorpe.","(11:40) Jameis Winston pass to the left to Mike Evans for 26 yards to the Sea30. Tackled by Bobby Wagner.","(11:45) Penalty: False Start on Tampa Bay (Doug Martin) -5 yards.","(11:45) Jameis Winston incomplete pass to the right intended for Cameron Brate.","(12:23) Doug Martin rush to the right for 3 yards to the TB49. Tackled by Steven Terrell and K.J. Wright.","(12:59) Jameis Winston pass to the right to Mike Evans for 10 yards to the TB46. Tackled by Jeremy Lane.","(13:37) Doug Martin rush to the left for 4 yards to the TB36. Tackled by Cliff Avril.","(14:20) Jameis Winston rush to the left for 8 yards to the TB32. Tackled by K.J. Wright.","(14:54) Doug Martin rush to the left for 2 yards to the TB24. Tackled by Tony McDaniel and Frank Clark.","(15:00) Steven Hauschka kicks off to the TB4. Ryan Smith return for 18 yards to TB22. Tackled by Dewey McDonald."]