["(0:02) Colin Kaepernick rush to the right for 4 yards to the Mia2. Tackled by Ndamukong Suh and Kiko Alonso.","(0:05) Colin Kaepernick incomplete pass to the right intended for Torrey Smith defensed by Byron Maxwell.","(0:11) Colin Kaepernick pass to the right to Jeremy Kerley for 18 yards to the Mia6. Tackled by Byron Maxwell.","(0:12) Colin Kaepernick incomplete pass to the middle.","(0:30) Colin Kaepernick rush up the middle for 20 yards to the Mia24. Tackled by Byron Maxwell.","(0:34) Colin Kaepernick incomplete pass to the middle intended for Vance McDonald.","(0:41) Colin Kaepernick pass to the left to Shaun Draughn for 2 yards to the Mia44. Tackled by Tony Lippett.","(0:50) Colin Kaepernick pass to the middle to Torrey Smith for 17 yards to the Mia46.","(0:50) San Francisco 49ers timeout.","(1:02) Colin Kaepernick pass to the left to Carlos Hyde for 10 yards to the SF37. Tackled by Andre Branch.","(1:30) Colin Kaepernick pass to the left to Carlos Hyde for 4 yards to the SF27. Tackled by Andre Branch.","(1:37) Penalty: Face Mask on San Francisco (Trenton Brown) -15 yards.","(1:44) Colin Kaepernick incomplete pass to the left intended for Carlos Hyde.","(1:50) Matt Darr punts for 39 yards to SF38. No return.","(1:50) San Francisco 49ers timeout.","(1:55) Jay Ajayi rush to the left for 8 yards to the Mia23. Tackled by Jimmie Ward and Nick Bellore.","(1:55) Miami Dolphins timeout.","(2:00) Ryan Tannehill incomplete pass to the left intended for Jarvis Landry.","(2:00) Two Minute Warning.","(2:11) Jay Ajayi rush to the right for 1 yard to the Mia15. Tackled by Chris Jones and Eli Harold.","(2:15) Phil Dawson kicks off to the Mia0. Jakeem Grant return for 14 yards to Mia14. Tackled by Blake Bell.","(2:20) Phil Dawson 36 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(2:56) Colin Kaepernick pass to the right to Shaun Draughn for 7 yards to the Mia18. Tackled by Byron Maxwell and Bobby McCain.","(3:04) Colin Kaepernick incomplete pass to the right intended for Chris Harper.","(3:09) Penalty: Face Mask on San Francisco (Trenton Brown) -15 yards.","(3:27) Colin Kaepernick rush up the middle for 8 yards to the Mia10. Tackled by Bacarri Rambo.","(3:55) Colin Kaepernick pass to the right to Shaun Draughn for 16 yards to the Mia18. Tackled by Kiko Alonso and Bacarri Rambo.","(4:00) Colin Kaepernick incomplete pass to the right intended for Blake Bell.","(4:06) Colin Kaepernick pass to the right to Chris Harper for 16 yards to the Mia34.","(4:10) Colin Kaepernick incomplete pass to the middle intended for Rod Streater.","(4:25) Colin Kaepernick sacked at SF50 for a loss of 5 yards by Andre Branch.","(4:25) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley.","(4:40) Colin Kaepernick pass to the left to Vance McDonald for 10 yards to the Mia45. Tackled by Bacarri Rambo.","(4:40) San Francisco 49ers timeout.","(4:48) Colin Kaepernick pass to the left to Rod Streater for 7 yards to the SF45. Tackled by Jelani Jenkins.","(5:19) Colin Kaepernick pass to the middle to Rod Streater for 12 yards to the SF38. Tackled by Neville Hewitt.","(5:51) Colin Kaepernick rush up the middle for 6 yards to the SF26. Tackled by Isa Abdul-Quddus.","(6:14) Matt Darr punts for 53 yards to SF18. Jeremy Kerley return for 2 yards to SF20. Tackled by Mike Hull.","(7:00) Ryan Tannehill pass to the right to Damien Williams for 5 yards to the Mia29. Tackled by Ronald Blair.","(7:32) Ryan Tannehill rush to the left for 2 yards to the Mia24. Tackled by Nick Bellore.","(7:38) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry.","(7:42) Phil Dawson kicks off to the Mia20. Kenyan Drake - no return. FUMBLE, recovered by Mia (Damien Williams).","(7:42) Phil Dawson extra point is good.","(7:52) Colin Kaepernick pass to the left to Torrey Smith for 1 yard for a TOUCHDOWN.","(8:29) Carlos Hyde rush to the right for no gain to the Mia1. Tackled by Donald Butler and Terrence Fede.","(8:57) Carlos Hyde rush up the middle for 8 yards to the Mia1. Tackled by Isa Abdul-Quddus and Kiko Alonso.","(9:42) Colin Kaepernick pass to the middle to Vance McDonald for 35 yards to the Mia9. Tackled by Isa Abdul-Quddus and Bacarri Rambo.","(10:24) Colin Kaepernick pass to the left to Chris Harper for 16 yards to the Mia44. Tackled by Bacarri Rambo.","(10:42) Penalty: Delay of Game on San Francisco (Colin Kaepernick) -5 yards.","(11:18) Colin Kaepernick rush to the right for 3 yards to the SF45.","(11:22) Colin Kaepernick incomplete pass to the right intended for Vance McDonald.","(11:27) Penalty: Pass Interference on Miami (Byron Maxwell) 17 yards.","(11:31) Colin Kaepernick incomplete pass to the left intended for Garrett Celek.","(11:31) Andrew Franks kicks off to the endzone. Touchback.","(11:31) Andrew Franks extra point is good.","(11:41) Ryan Tannehill pass to the right to Leonte Carroo for 15 yards for a TOUCHDOWN.","(12:18) Jay Ajayi rush to the left for a loss of 2 yards to the SF15. Tackled by DeForest Buckner.","(12:57) Ryan Tannehill pass to the right to Jarvis Landry for 12 yards to the SF13. Tackled by Antoine Bethea.","(13:31) Jay Ajayi rush up the middle for 1 yard to the SF25. Tackled by Glenn Dorsey and Gerald Hodges Jr..","(14:17) Ryan Tannehill pass to the left to Dion Sims for 23 yards to the SF26. Tackled by Tramaine Brock.","(14:54) Jay Ajayi rush to the right for 18 yards to the SF49. Tackled by Antoine Bethea.","(15:00) Bradley Pinion punts for 44 yards to Mia33. No return.","(0:35) Colin Kaepernick sacked at SF23 for a loss of 9 yards by Cameron Wake.","(1:09) Carlos Hyde rush to the left for a loss of 2 yards to the SF32. Tackled by Ndamukong Suh and Neville Hewitt.","(1:33) Colin Kaepernick pass to the left to Vance McDonald for 9 yards to the SF34. Tackled by Kiko Alonso and Isa Abdul-Quddus.","(1:33) Andrew Franks kicks off to the endzone. Touchback.","(1:33) Andrew Franks extra point is good.","(1:40) Ryan Tannehill pass to the left to Kenny Stills for 43 yards for a TOUCHDOWN.","(1:56) Ryan Tannehill incomplete pass to the left intended for DeVante Parker defensed by Tramaine Brock.","(2:21) Ryan Tannehill pass to the right to Dion Sims for 7 yards to the SF43. Tackled by Michael Wilhoite.","(2:51) Ryan Tannehill rush to the right for 10 yards to the Mia50.","(3:23) Jay Ajayi rush to the right for no gain to the Mia40. Tackled by Gerald Hodges Jr..","(3:36) Bradley Pinion punts for 42 yards to Mia39. Jarvis Landry return for 1 yard to Mia40. Tackled by Michael Wilhoite.","(4:11) Colin Kaepernick pass to the left to Rod Streater for 2 yards to the SF19. Tackled by Bobby McCain.","(4:52) DuJuan Harris rush to the left for 7 yards to the SF17. Tackled by Terrence Fede.","(5:05) Colin Kaepernick incomplete pass to the middle intended for Torrey Smith defensed by Byron Maxwell.","(5:19) Penalty: Holding on San Francisco (Joe Staley) -10 yards.","(5:30) Matt Darr punts for 40 yards to SF0. Touchback.","(6:05) Penalty: Delay of Game on Miami (Ryan Tannehill) -5 yards.","(6:38) Ryan Tannehill sacked at SF35 for a loss of 9 yards by Ronald Blair and Eli Harold.","(6:45) Ryan Tannehill incomplete pass to the right intended for Kenny Stills.","(7:22) Ryan Tannehill rush to the right for a loss of 2 yards to the SF26. Tackled by Ahmad Brooks and Gerald Hodges Jr..","(7:34) Phil Dawson kicks off to the Mia-2. Kenyan Drake return for 78 yards to SF24. Tackled by Jaquiski Tartt.","(7:34) Phil Dawson extra point is good.","(7:39) Colin Kaepernick pass to the left to Garrett Celek for 4 yards for a TOUCHDOWN.","(8:22) Carlos Hyde rush to the left for 4 yards to the Mia4. Tackled by Donald Butler and Tony Lippett.","(9:06) Carlos Hyde rush to the left for 3 yards to the Mia8. Tackled by Terrence Fede and Neville Hewitt.","(9:42) Colin Kaepernick pass to the middle to Shaun Draughn for 16 yards to the Mia11. Tackled by Bobby McCain and Kiko Alonso.","(10:07) Colin Kaepernick pass to the right to Rod Streater for 25 yards to the Mia27. Tackled by Byron Maxwell.","(10:38) Colin Kaepernick pass to the left to Jeremy Kerley for 6 yards to the SF48. Tackled by Bobby McCain.","(11:26) Carlos Hyde rush to the left for a loss of 1 yard to the SF42. Tackled by Andre Branch and Cameron Wake.","(12:01) Carlos Hyde rush to the left for 24 yards to the SF43. Tackled by Isa Abdul-Quddus.","(12:26) Colin Kaepernick rush to the left for 10 yards to the SF19. Tackled by Kiko Alonso.","(12:31) Andrew Franks kicks off to the SF-2. JaCorey Shepherd return for 11 yards to SF9. Tackled by Kenyan Drake and Mike Hull.","(12:34) Andrew Franks 24 yard field goal attempt is GOOD. Holder: Matt Darr.","(13:18) Ryan Tannehill pass to the right to DeVante Parker for 11 yards to the SF6. Tackled by Rashard Robinson.","(13:27) Ryan Tannehill incomplete pass to the left intended for Kenny Stills.","(14:06) Jay Ajayi rush to the right for a loss of 6 yards to the SF17. Tackled by Ahmad Brooks.","(14:49) Ryan Tannehill pass to the right to Kenny Stills for 15 yards to the SF11. Tackled by Jimmie Ward.","(15:00) Colin Kaepernick pass intended for Torrey Smith INTERCEPTED by Kiko Alonso defensed by Tony Lippett and returned for 10 yards. Tackled by Quinton Patton.","(15:00) Andrew Franks kicks off to the endzone. Touchback.","(0:40) Ryan Tannehill sacked at Mia24 for a loss of 13 yards by Nick Bellore and Ahmad Brooks.","(0:47) Ryan Tannehill pass to the right to Dion Sims for 7 yards to the Mia37. Tackled by Jaquiski Tartt.","(0:58) Bradley Pinion punts for 44 yards to Mia24. Jarvis Landry return for 6 yards to Mia30. Tackled by Kyle Nelson and Rod Streater.","(1:01) Colin Kaepernick incomplete pass to the left intended for Chris Harper defensed by Bacarri Rambo.","(1:07) Colin Kaepernick incomplete pass to the right intended for Vance McDonald.","(1:38) Colin Kaepernick pass to the right to Shaun Draughn for 1 yard to the SF32. Tackled by Kiko Alonso.","(2:00) Colin Kaepernick pass to the right to Torrey Smith for 6 yards to the SF31. Tackled by Jelani Jenkins.","(2:00) Two Minute Warning.","(2:11) Colin Kaepernick pass to the right to Shaun Draughn for 7 yards to the SF25. Tackled by Jelani Jenkins.","(2:17) Andrew Franks kicks off to the SF4. JaCorey Shepherd return for 14 yards to SF18. Tackled by Mike Hull and Lafayette Pitts.","(2:17) Andrew Franks extra point is good.","(2:26) Ryan Tannehill pass to the right to Dion Sims for 16 yards for a TOUCHDOWN.","(3:03) Ryan Tannehill pass to the right to DeVante Parker for 7 yards to the SF16. Tackled by Jimmie Ward.","(3:15) Penalty: Holding on Miami (Jermon Bushrod) -10 yards.","(3:55) Ryan Tannehill pass to the right to MarQueis Gray for 7 yards to the SF13. Tackled by Tramaine Brock.","(4:32) Kenyan Drake rush to the left for 9 yards to the SF20. Tackled by Keith Reaser and DeForest Buckner.","(5:03) Ryan Tannehill pass to the left to Jarvis Landry for 10 yards to the SF29. Tackled by Keith Reaser.","(5:47) Ryan Tannehill rush to the left for 1 yard to the SF39. Tackled by DeForest Buckner and Shayne Skov.","(6:27) Ryan Tannehill rush to the left for 17 yards to the SF40. Tackled by Antoine Bethea and Jimmie Ward.","(7:20) Ryan Tannehill pass to the middle to Jay Ajayi for 11 yards to the Mia43. Tackled by Antoine Bethea and Dontae Johnson.","(7:57) Damien Williams rush to the right for 7 yards to the Mia32. Tackled by Antoine Bethea.","(8:39) Jay Ajayi rush to the right for 10 yards to the Mia25. Tackled by Jimmie Ward and Tramaine Brock.","(9:07) Jay Ajayi rush to the left for a loss of 1 yard to the Mia15. Tackled by Keith Reaser.","(9:22) Colin Kaepernick pass to the middle to Garrett Celek for 15 yards to the Mia16. Tackled by Byron Maxwell and Bacarri Rambo. FUMBLE, recovered by Mia (Kiko Alonso). Tackled by Daniel Kilgore.","(9:57) DuJuan Harris rush up the middle for 8 yards to the Mia31. Tackled by Neville Hewitt and Kiko Alonso.","(10:26) Carlos Hyde rush up the middle for 5 yards to the Mia39. Tackled by Kiko Alonso and Andre Branch.","(10:56) Colin Kaepernick rush to the left for 30 yards to the Mia44. Tackled by Tony Lippett.","(11:42) Carlos Hyde rush to the left for a loss of 2 yards to the SF26. Tackled by Donald Butler and Neville Hewitt.","(12:15) Colin Kaepernick pass to the right to Carlos Hyde for 3 yards to the SF28. Tackled by Earl Mitchell and Kiko Alonso.","(12:22) Andrew Franks kicks off to the SF0. JaCorey Shepherd return for 25 yards to SF25. Tackled by Bacarri Rambo and Mike Hull.","(12:22) Andrew Franks extra point is good.","(12:28) Jay Ajayi rush to the left for 2 yards for a TOUCHDOWN.","(13:10) Ryan Tannehill pass to the left to Jarvis Landry for 8 yards to the SF2. Tackled by Gerald Hodges Jr..","(13:18) Ryan Tannehill incomplete pass to the right intended for DeVante Parker.","(13:41) Ryan Tannehill pass to the right to Kenny Stills for 14 yards to the SF10. Tackled by Tramaine Brock.","(14:24) Jay Ajayi rush to the left for 2 yards to the SF24. Tackled by Rashard Robinson.","(15:00) Ryan Tannehill pass to the left to Jarvis Landry for 17 yards to the SF26. Tackled by Antoine Bethea.","(0:28) Jay Ajayi rush to the right for a loss of 1 yard to the SF43. Tackled by Jaquiski Tartt and Chris Jones.","(0:36) Ryan Tannehill incomplete pass to the left intended for Kenny Stills.","(1:23) Ryan Tannehill pass to the left to DeVante Parker for 46 yards to the SF42. Tackled by Tramaine Brock.","(2:13) Jay Ajayi rush to the right for no gain to the Mia12. Tackled by Nick Bellore and Ahmad Brooks.","(2:50) Jay Ajayi rush to the left for 3 yards to the Mia12. Tackled by Tony Jerod-Eddie and Gerald Hodges Jr..","(3:04) Bradley Pinion punts for 59 yards to Mia10. Jakeem Grant return for a loss of 1 yard to Mia9. FUMBLE, recovered by Mia (Jakeem Grant).","(3:35) Carlos Hyde rush to the right for 6 yards to the SF31. Tackled by Cameron Wake.","(4:05) Penalty: False Start on San Francisco (Joe Staley) -5 yards.","(4:30) Carlos Hyde rush up the middle for 4 yards to the SF30. Tackled by Ndamukong Suh.","(4:46) Penalty: Holding on San Francisco (Aaron Burbridge) -10 yards.","(4:57) Colin Kaepernick incomplete pass to the middle intended for Jeremy Kerley defensed by Bobby McCain.","(5:29) Colin Kaepernick rush to the right for 12 yards to the SF36. Tackled by Isa Abdul-Quddus.","(6:05) Carlos Hyde rush up the middle for 5 yards to the SF24. Tackled by Mario Williams and Donald Butler.","(6:11) Colin Kaepernick incomplete pass to the right intended for Torrey Smith.","(6:30) Matt Darr punts for 35 yards to SF19. No return.","(7:02) Ryan Tannehill pass to the left to Damien Williams for 6 yards to the Mia46. Tackled by Dontae Johnson and Nick Bellore.","(7:08) Ryan Tannehill incomplete pass to the left intended for Jarvis Landry.","(7:53) Jay Ajayi rush to the right for a loss of 5 yards to the Mia40. Tackled by Nick Bellore.","(8:35) Jay Ajayi rush to the left for 8 yards to the Mia45. Tackled by Michael Wilhoite.","(9:09) Jay Ajayi rush up the middle for 5 yards to the Mia37. Tackled by Antoine Bethea.","(9:17) Ryan Tannehill incomplete pass to the left intended for DeVante Parker defensed by Rashard Robinson.","(9:40) Ryan Tannehill rush to the left for 6 yards to the Mia27. Tackled by DeForest Buckner. Penalty: Holding on San Francisco (Tramaine Brock) 5 yards.","(9:46) Phil Dawson kicks off to the Mia0. Kenyan Drake return for 21 yards to Mia21. Tackled by Rod Streater and Blake Bell.","(9:46) Phil Dawson extra point is good.","(9:51) Colin Kaepernick pass to the right to Carlos Hyde for 11 yards for a TOUCHDOWN.","(9:55) Colin Kaepernick incomplete pass to the left intended for Vance McDonald defensed by Michael Thomas.","(9:55) San Francisco 49ers timeout.","(10:38) Colin Kaepernick rush to the right for 6 yards to the Mia11. Tackled by Bacarri Rambo.","(11:21) Colin Kaepernick pass to the left to Vance McDonald for 6 yards to the Mia17. Tackled by Neville Hewitt.","(11:43) Carlos Hyde rush to the right for 11 yards to the Mia23. Tackled by Kiko Alonso and Byron Maxwell.","(12:10) Colin Kaepernick pass to the middle to Quinton Patton for 12 yards to the Mia34. Tackled by Tony Lippett.","(12:42) Colin Kaepernick pass to the left to Carlos Hyde for 2 yards to the Mia46. Tackled by Bobby McCain.","(13:16) Colin Kaepernick rush to the right for 14 yards to the Mia48. Tackled by Isa Abdul-Quddus.","(13:23) Matt Darr punts for 42 yards to SF38. No return.","(13:29) Ryan Tannehill incomplete pass to the middle intended for Jay Ajayi defensed by Michael Wilhoite.","(14:10) Jay Ajayi rush to the left for 2 yards to the Mia20. Tackled by Eli Harold.","(14:54) Ryan Tannehill pass to the left to MarQueis Gray for 5 yards to the Mia18. Tackled by Nick Bellore.","(15:00) Phil Dawson kicks off to the Mia2. Jakeem Grant return for 21 yards to Mia23. Tackled by Aaron Burbridge and Michael Wilhoite. Penalty: Holding on Miami (Neville Hewitt) -10 yards."]