["(0:21) Dak Prescott rush up the middle for a loss of 1 yard to the Was36.","(0:55) Dak Prescott rush up the middle for a loss of 1 yard to the Was35.","(0:55) Washington Redskins timeout.","(1:00) Ezekiel Elliott rush up the middle for 2 yards to the Was34. Tackled by Ryan Kerrigan.","(1:47) Dak Prescott pass to the left to Cole Beasley for 8 yards to the Was36. Tackled by Duke Ihenacho.","(1:47) Washington Redskins timeout.","(1:51) Ezekiel Elliott rush to the right for 3 yards to the Was44. Tackled by Ricky Jean Francois and Duke Ihenacho.","(1:53) Dustin Hopkins onside kickoff to the Was47. No return.","(1:53) Dustin Hopkins extra point is good.","(2:00) Kirk Cousins pass to the left to Jordan Reed for 8 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:09) Kirk Cousins pass to the left to Jordan Reed for 7 yards to the Dal8. Tackled by Orlando Scandrick and Sean Lee.","(2:34) Kirk Cousins pass to the right to Chris Thompson for 3 yards to the Dal15. Tackled by Byron Jones.","(2:58) Kirk Cousins rush up the middle for 2 yards to the Dal18. FUMBLE, recovered by Was (Kirk Cousins).","(3:05) Kirk Cousins incomplete pass to the right intended for Ryan Grant defensed by Anthony Brown.","(3:32) Kirk Cousins pass to the left to Jamison Crowder for 9 yards to the Dal20. Tackled by Kavon Frazier.","(3:37) Kirk Cousins pass to the left to Chris Thompson for 5 yards to the Dal29. Tackled by Sean Lee.","(4:04) Kirk Cousins pass to the left to Jamison Crowder for 10 yards to the Dal34. Tackled by Sean Lee.","(4:06) Kirk Cousins incomplete pass to the right intended for Jordan Reed defensed by Byron Jones.","(4:08) Penalty: False Start on Washington (Ty Nsekhe) -5 yards.","(4:36) Kirk Cousins pass to the left to Chris Thompson for 4 yards to the Dal39. Tackled by Damien Wilson.","(5:00) Kirk Cousins pass to the middle to Jordan Reed for 11 yards to the Dal43. Tackled by Sean Lee.","(5:20) Kirk Cousins pass to the left to Jordan Reed for 6 yards to the Was46. Tackled by Byron Jones.","(5:43) Kirk Cousins pass to the left to Jamison Crowder for 5 yards to the Was40. Tackled by Brandon Carr.","(6:07) Kirk Cousins pass to the right to Jordan Reed for 5 yards to the Was35.","(6:29) Kirk Cousins pass to the right to Jordan Reed for 5 yards to the Was30. Tackled by Anthony Brown.","(6:29) Dan Bailey kicks off to the endzone. Touchback.","(6:29) Dan Bailey extra point is good.","(6:32) Ezekiel Elliott rush to the left for 1 yard for a TOUCHDOWN.","(6:51) Dak Prescott pass to the right to Dez Bryant for 26 yards to the Was1. Tackled by Kendall Fuller.","(7:19) Dak Prescott pass to the right to Lance Dunbar for 1 yard to the Was27. Tackled by Mason Foster.","(7:26) Ezekiel Elliott rush to the right for 3 yards to the Was18. Penalty: Holding on Dallas (Vince Mayle) -10 yards.","(8:08) Ezekiel Elliott rush to the right for 7 yards to the Was21. Tackled by Josh Norman.","(8:37) Dak Prescott rush up the middle for 7 yards to the Was43. Tackled by Donte Whitner. Penalty: Unnecessary Roughness on Washington (Donte Whitner) 15 yards.","(9:15) Ezekiel Elliott rush up the middle for 3 yards to the Dal50. Tackled by Chris Baker.","(9:21) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(9:22) Dustin Hopkins onside kickoff to the Dal47. Onside kick recovered by receiving team by Damien Wilson.","(9:22) Dustin Hopkins extra point is good.","(9:32) Kirk Cousins pass to the right to DeSean Jackson for 67 yards for a TOUCHDOWN.","(10:15) Rob Kelley rush to the left for 1 yard to the Was33. Tackled by Cedric Thornton.","(10:49) Rob Kelley rush up the middle for 7 yards to the Was32. Tackled by Jeff Heath and Sean Lee.","(10:49) Dan Bailey kicks off to the endzone. Touchback.","(10:49) Dan Bailey extra point is good.","(10:56) Dak Prescott rush to the right for 6 yards for a TOUCHDOWN.","(11:44) Dak Prescott pass to the right to Dez Bryant for 13 yards to the Was6. Tackled by Josh Norman.","(12:13) Dak Prescott rush to the right for 3 yards to the Was19. Tackled by Bashaud Breeland.","(12:49) Dak Prescott pass to the right to Cole Beasley for 12 yards to the Was22. Tackled by Quinton Dunbar.","(13:26) Ezekiel Elliott rush to the right for 1 yard to the Was34. Tackled by Mason Foster and Will Compton.","(14:12) Dak Prescott pass to the middle to Ezekiel Elliott for 19 yards to the Was35. Tackled by Duke Ihenacho and Mason Foster.","(14:54) Ezekiel Elliott rush to the right for 21 yards to the Dal46. Tackled by Mason Foster.","(14:54) Dustin Hopkins kicks off to the endzone. Touchback.","(14:54) Kirk Cousins 2 pt conversion pass is NO GOOD - intended for Derek Carrier.","(15:00) Kirk Cousins pass to the left to Jordan Reed for 5 yards for a TOUCHDOWN.","(0:19) Rob Kelley rush to the right for a loss of 2 yards to the Dal5. Tackled by Sean Lee.","(0:50) Kirk Cousins pass to the right to Jordan Reed for 33 yards to the Dal3. Tackled by Byron Jones.","(1:31) Kirk Cousins pass to the right to Jamison Crowder for 4 yards to the Dal36. Tackled by Sean Lee.","(2:08) Kirk Cousins pass to the right to Vernon Davis for 2 yards to the Dal40. Tackled by Jeff Heath.","(2:47) Kirk Cousins pass to the right to Pierre Garcon for 3 yards to the Dal42. Tackled by Anthony Brown.","(3:33) Kirk Cousins pass to the left to DeSean Jackson for 6 yards to the Dal45. Tackled by Brandon Carr.","(4:19) Rob Kelley rush up the middle for a loss of 2 yards to the Was49. Tackled by Anthony Hitchens and Demarcus Lawrence.","(5:02) Kirk Cousins pass to the right to Derek Carrier for 4 yards to the Dal49. Tackled by Byron Jones.","(5:36) Kirk Cousins pass to the right to Vernon Davis for 26 yards to the Was47. Tackled by J.J. Wilcox.","(5:40) Kirk Cousins incomplete pass to the left intended for DeSean Jackson defensed by Orlando Scandrick.","(6:20) Rob Kelley rush to the right for 2 yards to the Was21. Tackled by Demarcus Lawrence.","(7:08) Rob Kelley rush to the left for 1 yard to the Was19. Tackled by Damien Wilson and Anthony Hitchens.","(7:49) Rob Kelley rush to the right for 8 yards to the Was18. Tackled by Byron Jones.","(7:57) Chris Jones punts for 35 yards to Was10. No return.","(8:05) Dak Prescott incomplete pass to the left intended for Terrance Williams.","(8:45) Ezekiel Elliott rush up the middle for 1 yard to the Was45. Tackled by Su'a Cravens.","(8:45) Washington Redskins timeout.","(9:18) Dak Prescott pass to the middle to Jason Witten for 8 yards to the Was46. Tackled by Bashaud Breeland.","(9:46) Penalty: Holding on Dallas (Tyron Smith) -10 yards.","(10:27) Ezekiel Elliott rush up the middle for 9 yards to the Was44. Tackled by Will Compton.","(11:01) Dak Prescott rush to the left for 9 yards to the Dal47. Tackled by Mason Foster.","(11:36) Dak Prescott pass to the right to Jason Witten for 21 yards to the Dal38. Tackled by Duke Ihenacho.","(12:17) Ezekiel Elliott rush to the left for 1 yard to the Dal17. Tackled by Ryan Kerrigan and Ziggy Hood.","(12:20) Tress Way punts for 39 yards to Dal16. No return.","(13:03) Kirk Cousins pass to the left to Chris Thompson for 9 yards to the Was45. Tackled by Orlando Scandrick and Sean Lee.","(13:44) Kirk Cousins pass to the right to Chris Thompson for a loss of 4 yards to the Was36. Tackled by Anthony Hitchens.","(13:52) Kirk Cousins incomplete pass to the right intended for DeSean Jackson defensed by Orlando Scandrick.","(14:17) Chris Thompson rush to the left for 11 yards to the Was40. Tackled by Byron Jones.","(15:00) Rob Kelley rush to the right for 4 yards to the Was29. Tackled by Maliek Collins.","(15:00) Dan Bailey kicks off to the endzone. Touchback.","(0:03) Dak Prescott rush up the middle for a loss of 2 yards to the Dal23.","(0:03) Dustin Hopkins kicks off to the Dal25. Ryan Davis - no return.","(0:07) Dustin Hopkins 20 yard field goal attempt is GOOD. Holder: Tress Way.","(0:11) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(0:11) Washington Redskins timeout.","(0:33) Kirk Cousins pass to the right to Pierre Garcon for 8 yards to the Dal2. Tackled by Anthony Brown.","(0:38) Kirk Cousins incomplete pass to the left intended for DeSean Jackson defensed by Brandon Carr.","(1:04) Kirk Cousins pass to the left to DeSean Jackson for 26 yards to the Dal10. Tackled by Jeff Heath.","(1:04) Washington Redskins timeout.","(1:13) Kirk Cousins pass to the right to Maurice Harris for 6 yards to the Dal36. Tackled by J.J. Wilcox.","(1:20) Kirk Cousins pass to the left to Vernon Davis for 12 yards to the Dal42. Tackled by Brandon Carr.","(1:27) Kirk Cousins incomplete pass to the right intended for Vernon Davis defensed by Byron Jones.","(1:32) Kirk Cousins incomplete pass to the right intended for Chris Thompson.","(1:40) Kirk Cousins pass to the right to Jamison Crowder for 14 yards to the Was46. Tackled by Sean Lee.","(1:45) Kirk Cousins pass to the right to Jamison Crowder for 7 yards to the Was32. Tackled by Anthony Brown.","(1:45) Dan Bailey kicks off to the endzone. Touchback.","(1:45) Dan Bailey extra point is good.","(1:53) Dak Prescott pass to the right to Terrance Williams for 10 yards for a TOUCHDOWN.","(1:53) Dallas Cowboys timeout.","(2:00) Dak Prescott rush to the left for 18 yards to the Was10. Tackled by Donte Whitner.","(2:00) Two Minute Warning.","(2:36) Dak Prescott pass to the left to Dez Bryant for 10 yards to the Was28. Tackled by Josh Norman.","(3:10) Dak Prescott pass to the left to Cole Beasley for 5 yards to the Was38. Tackled by Kendall Fuller.","(3:44) Alfred Morris rush up the middle for 12 yards to the Was43. Tackled by Duke Ihenacho.","(3:51) Dak Prescott incomplete pass to the right intended for Cole Beasley.","(3:56) 55 yard field goal attempt by Dustin Hopkins is NO GOOD. Holder: Tress Way.","(4:04) Kirk Cousins incomplete pass to the left intended for Vernon Davis defensed by J.J. Wilcox.","(4:53) Kirk Cousins pass to the right to Maurice Harris for 5 yards to the Dal38. Tackled by Anthony Brown.","(5:54) Kirk Cousins pass to the right to Rob Kelley for a loss of 3 yards to the Dal43. Tackled by Cedric Thornton.","(6:32) Kirk Cousins pass to the left to Pierre Garcon for 27 yards to the Dal40. Tackled by Orlando Scandrick.","(7:16) Rob Kelley rush to the right for 4 yards to the Was33. Tackled by Sean Lee.","(7:57) Rob Kelley rush to the left for 4 yards to the Was29. Tackled by Damien Wilson.","(7:57) Dan Bailey kicks off to the endzone. Touchback.","(8:02) Dan Bailey 46 yard field goal attempt is GOOD. Holder: Chris Jones.","(8:08) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(8:14) Dak Prescott incomplete pass to the right intended for Brice Butler.","(8:56) Ezekiel Elliott rush to the left for 5 yards to the Was28. Tackled by Donte Whitner.","(9:28) Dak Prescott pass to the right to Cole Beasley for 18 yards to the Was33. Tackled by Kendall Fuller.","(9:53) Dak Prescott sacked at Dal49 for a loss of 5 yards by Ryan Kerrigan.","(10:34) Ezekiel Elliott rush to the left for 1 yard to the Was46. Tackled by Ryan Kerrigan and Chris Baker.","(11:13) Dak Prescott pass to the middle to Dez Bryant for 14 yards to the Was47. Tackled by Kendall Fuller.","(11:54) Ezekiel Elliott rush up the middle for a loss of 2 yards to the Dal39. Tackled by Ziggy Hood.","(12:39) Dak Prescott pass to the right to Jason Witten for 4 yards to the Dal41. Tackled by Will Compton.","(13:17) Ezekiel Elliott rush to the left for 3 yards to the Dal37. Tackled by Trent Murphy.","(14:04) Dak Prescott pass to the left to Dez Bryant for 9 yards to the Dal34. Tackled by Josh Norman.","(14:04) Dustin Hopkins kicks off to the endzone. Touchback.","(14:08) Dustin Hopkins 24 yard field goal attempt is GOOD. Holder: Tress Way.","(14:16) Kirk Cousins incomplete pass to the right intended for Jordan Reed.","(14:23) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(15:00) Rob Kelley rush to the right for a loss of 1 yard to the Dal6. Tackled by Byron Jones.","(0:05) Kirk Cousins pass to the right to Vernon Davis for 22 yards to the Dal5. Tackled by Anthony Brown.","(0:55) Kirk Cousins pass to the left to Jamison Crowder for 38 yards to the Dal27. Tackled by Justin Durant.","(1:38) Kirk Cousins pass to the right to Pierre Garcon for 5 yards to the Was35. Tackled by Anthony Brown.","(2:27) Chris Thompson rush to the right for 3 yards to the Was30. Tackled by Sean Lee.","(3:06) Rob Kelley rush to the left for 8 yards to the Was27. Tackled by Brandon Carr and Maliek Collins.","(3:14) Kirk Cousins incomplete pass to the middle intended for DeSean Jackson.","(3:28) Chris Jones punts for 53 yards to Was19. No return.","(3:33) Dak Prescott incomplete pass to the left intended for Brice Butler.","(3:41) Dak Prescott incomplete pass to the left.","(4:24) Ezekiel Elliott rush up the middle for a loss of 5 yards to the Dal28. Tackled by Chris Baker.","(4:29) 43 yard field goal attempt by Dustin Hopkins is NO GOOD. Holder: Tress Way.","(4:29) Washington Redskins timeout.","(5:18) Kirk Cousins pass to the right to Jamison Crowder for 1 yard to the Dal25. Tackled by Justin Durant.","(6:03) Chris Thompson rush up the middle for 6 yards to the Dal26. Tackled by Demarcus Lawrence and Terrell McClain.","(6:08) Penalty: Holding on Washington (Ty Nsekhe) -10 yards.","(6:48) Chris Thompson rush to the right for a loss of 3 yards to the Dal22. Tackled by Tyrone Crawford and Sean Lee.","(6:53) Penalty: Holding on Dallas (Orlando Scandrick) 5 yards.","(7:32) Kirk Cousins pass to the right to Jordan Reed for 12 yards to the Dal24. Tackled by J.J. Wilcox.","(8:15) Kirk Cousins pass to the left to Jordan Reed for 3 yards to the Dal36. Tackled by J.J. Wilcox.","(8:55) Rob Kelley rush to the left for no gain to the Dal39. Tackled by Cedric Thornton.","(9:29) Kirk Cousins pass to the right to DeSean Jackson for 19 yards to the Dal39. Tackled by Brandon Carr.","(10:08) Rob Kelley rush to the left for 3 yards to the Was42. Tackled by Terrell McClain and Sean Lee.","(10:47) Kirk Cousins pass to the middle to Rob Kelley for 8 yards to the Was39. Tackled by Damien Wilson.","(11:09) Kirk Cousins pass to the right to Vernon Davis for 6 yards to the Was31. Tackled by Sean Lee.","(11:09) Dan Bailey kicks off to the endzone. Touchback.","(11:09) Dan Bailey extra point is good.","(11:15) Ezekiel Elliott rush up the middle for 4 yards for a TOUCHDOWN.","(11:59) Ezekiel Elliott rush up the middle for 7 yards to the Was4. Tackled by Will Compton and Trent Murphy.","(12:24) Dak Prescott pass to the right to Cole Beasley for 13 yards to the Was11. Tackled by Kendall Fuller.","(13:11) Ezekiel Elliott rush to the right for 12 yards to the Was24. Tackled by Su'a Cravens.","(13:50) Ezekiel Elliott rush to the right for 20 yards to the Was36. Tackled by Donte Whitner.","(14:25) Dak Prescott pass to the right to Ezekiel Elliott for 4 yards to the Dal44. Tackled by Bashaud Breeland.","(15:00) Lucky Whitehead rush to the right for 15 yards to the Dal40. Tackled by Bashaud Breeland and Ryan Kerrigan.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback."]