["(0:41) Matt Ryan rush up the middle for a loss of 1 yard to the Ari38.","(1:21) Matt Ryan rush up the middle for a loss of 1 yard to the Ari37.","(1:30) Carson Palmer pass intended for Jermaine Gresham INTERCEPTED by De'Vondre Campbell and returned for 7 yards. Tackled by A.Q. Shipley.","(1:53) Carson Palmer pass to the right to David Johnson for 9 yards to the Ari37. Tackled by Keanu Neal.","(1:57) Carson Palmer incomplete pass to the right intended for David Johnson.","(1:57) Two Minute Warning.","(2:03) Carson Palmer pass to the right to Jermaine Gresham for 3 yards to the Ari28. Tackled by Brian Poole.","(2:07) Carson Palmer incomplete pass to the left intended for J.J. Nelson defensed by Robert Alford.","(2:07) Matt Wile kicks off to the endzone. Touchback.","(2:07) Matt Bryant extra point is good.","(2:14) Devonta Freeman rush to the left for 5 yards for a TOUCHDOWN.","(3:00) Devonta Freeman rush to the right for 7 yards to the Ari5. Tackled by D.J. Swearinger.","(3:47) Matt Ryan pass to the middle to Mohamed Sanu for 12 yards to the Ari12. Tackled by D.J. Swearinger.","(3:47) Arizona Cardinals timeout.","(3:52) Matt Ryan pass to the right to Mohamed Sanu for 8 yards to the Ari24. Tackled by Chandler Jones.","(4:38) Devonta Freeman rush to the right for a loss of 3 yards to the Ari32. Tackled by Calais Campbell.","(4:43) Devonta Freeman rush to the right for 2 yards to the Ari44. Tackled by D.J. Swearinger. Penalty: Face Mask on Arizona (D.J. Swearinger) 15 yards.","(4:44) Chandler Catanzaro onside kickoff to the Ari46. Onside kick recovered by receiving team by Austin Hooper.","(4:44) Carson Palmer 2 pt conversion pass is NO GOOD - intended for Michael Floyd.","(4:48) Carson Palmer pass to the right to David Johnson for 3 yards for a TOUCHDOWN.","(4:52) Carson Palmer incomplete pass to the left intended for David Johnson defensed by De'Vondre Campbell.","(5:24) Carson Palmer pass to the left to Larry Fitzgerald for 8 yards to the Atl6. Tackled by Jalen Collins and Keanu Neal. Penalty: Unnecessary Roughness on Atlanta (Keanu Neal) 3 yards.","(5:29) Carson Palmer incomplete pass to the right intended for Jermaine Gresham defensed by Jalen Collins.","(6:14) Carson Palmer pass to the right to Jermaine Gresham for 11 yards to the Atl14. Tackled by Jalen Collins.","(6:19) Penalty: Holding on Atlanta (Jalen Collins) 5 yards.","(6:25) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Jalen Collins.","(6:53) Carson Palmer pass to the right to Michael Floyd for 19 yards to the Atl30. Tackled by Ricardo Allen.","(6:58) Carson Palmer incomplete pass to the left intended for Brittan Golden.","(7:34) Carson Palmer pass to the left to David Johnson for 21 yards to the Atl49. Tackled by Ricardo Allen.","(8:09) Carson Palmer sacked at Ari30 for a loss of 8 yards by Brian Poole.","(8:15) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(8:45) Carson Palmer pass to the left to J.J. Nelson for 13 yards to the Ari38. Tackled by Robert Alford.","(8:48) Carson Palmer incomplete pass to the middle intended for David Johnson.","(8:48) Matt Wile kicks off to the endzone. Touchback.","(8:48) Matt Bryant extra point is good.","(8:58) Matt Ryan pass to the left to Taylor Gabriel for 25 yards for a TOUCHDOWN.","(9:36) Devonta Freeman rush to the right for 1 yard to the Ari25. Tackled by Corey Peters.","(10:14) Matt Ryan pass to the left to Mohamed Sanu for 7 yards to the Ari26. Tackled by Tyrann Mathieu.","(10:53) Tevin Coleman rush to the right for a loss of 1 yard to the Ari33. Tackled by Josh Mauro.","(11:26) Devonta Freeman rush to the right for 11 yards to the Ari22. Tackled by Tony Jefferson. Penalty: Holding on Atlanta (Ryan Schraeder) -10 yards.","(12:09) Devonta Freeman rush to the left for 5 yards to the Ari33. Tackled by Frostee Rucker and Deone Bucannon.","(12:16) Penalty: Offside on Arizona (Calais Campbell) 5 yards.","(12:59) Matt Ryan pass to the left to Taylor Gabriel for 7 yards to the Ari43. Tackled by Marcus Cooper.","(13:04) Matt Ryan incomplete pass to the right intended for Patrick DiMarco.","(13:43) Tevin Coleman rush to the right for a loss of 2 yards to the Atl50. Tackled by Corey Peters.","(14:17) Matt Ryan pass to the left to Mohamed Sanu for 12 yards to the Ari48. Tackled by D.J. Swearinger.","(14:22) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Jalen Collins.","(14:22) Arizona Cardinals timeout.","(14:57) Carson Palmer pass to the left to Andre Ellington for 10 yards to the Atl40. Tackled by Deion Jones.","(15:00) Carson Palmer incomplete pass to the left intended for Andre Ellington.","(0:10) Carson Palmer sacked at Ari50 for a loss of 7 yards by Courtney Upshaw and Brooks Reed.","(0:46) Carson Palmer pass to the left to Michael Floyd for 12 yards to the Atl43. Tackled by Jalen Collins.","(1:29) David Johnson rush to the left for a loss of 1 yard to the Ari45. Tackled by Deion Jones and Grady Jarrett.","(2:06) Carson Palmer pass to the right to Jermaine Gresham for 5 yards to the Ari46. Tackled by Keanu Neal and Brian Poole.","(2:13) Penalty: Holding on Atlanta (Robert Alford) 5 yards.","(2:56) David Johnson rush to the left for 11 yards to the Ari36. Tackled by Grady Jarrett.","(2:56) Matt Wile kicks off to the endzone. Touchback.","(2:56) Matt Bryant extra point is good.","(2:59) Tevin Coleman rush to the right for 2 yards for a TOUCHDOWN.","(3:41) Devonta Freeman rush to the right for 2 yards to the Ari2. Tackled by Patrick Peterson and Tony Jefferson.","(4:21) Devonta Freeman rush to the right for 4 yards to the Ari4. Tackled by Kevin Minter.","(4:58) Devonta Freeman rush to the left for 8 yards to the Ari8. Tackled by Marcus Cooper.","(5:31) Matt Ryan rush to the right for 11 yards to the Ari16. Tackled by Deone Bucannon.","(5:36) Matt Ryan incomplete pass to the middle intended for Julio Jones defensed by D.J. Swearinger.","(5:41) Matt Ryan incomplete pass to the right.","(6:05) Matt Ryan pass to the right to Austin Hooper for 5 yards to the Ari27. Tackled by Tony Jefferson.","(6:48) Matt Ryan pass to the right to Mohamed Sanu for 6 yards to the Ari32. Tackled by Marcus Cooper.","(7:11) Devonta Freeman rush to the left for 2 yards to the Ari38. Tackled by Calais Campbell.","(7:44) Matt Ryan pass to the right to Levine Toilolo for 18 yards to the Ari40. Tackled by Patrick Peterson.","(8:22) Matt Ryan pass to the right to Julio Jones for 15 yards to the Atl42.","(9:01) Tevin Coleman rush to the right for 4 yards to the Atl27. Tackled by Corey Peters.","(9:13) Drew Butler punts for 51 yards to Atl22. Eric Weems return for 1 yard to Atl23. Tackled by Aaron Brewer.","(9:18) Carson Palmer incomplete pass to the left intended for Michael Floyd defensed by Robert Alford.","(10:04) David Johnson rush to the right for no gain to the Ari27. Tackled by Courtney Upshaw.","(10:07) Carson Palmer incomplete pass to the right intended for Jermaine Gresham.","(10:20) Matt Wile punts for 59 yards to Ari21. Patrick Peterson return for 6 yards to Ari27. Tackled by LaRoy Reynolds.","(11:03) Matt Ryan sacked at Atl20 for a loss of 6 yards by Markus Golden.","(11:50) Matt Ryan pass to the right to Devonta Freeman for 5 yards to the Atl26. Tackled by Calais Campbell.","(12:35) Matt Ryan sacked at Atl21 for a loss of 11 yards by Tyrann Mathieu.","(13:06) Penalty: Illegal Contact on Arizona (Deone Bucannon) 4 yards.","(13:49) Matt Ryan sacked at Atl28 for a loss of 8 yards by Tony Jefferson.","(14:22) Tevin Coleman rush to the right for 7 yards to the Atl36. Tackled by Corey Peters.","(15:00) Tevin Coleman rush to the left for 4 yards to the Atl29. Tackled by D.J. Swearinger.","(15:00) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:01) Chandler Catanzaro 54 yard field goal attempt is GOOD. Holder: Drew Butler.","(0:01) Arizona Cardinals timeout.","(0:05) Carson Palmer pass to the right to Larry Fitzgerald for 10 yards to the Atl36.","(0:05) Atlanta Falcons timeout.","(0:08) Carson Palmer incomplete pass to the left intended for Brittan Golden.","(0:25) Carson Palmer pass to the right to J.J. Nelson for 17 yards to the Atl46. Tackled by Robert Alford.","(0:33) Matt Ryan pass intended for Julio Jones INTERCEPTED by D.J. Swearinger and returned for 1 yard. Lateral to Tyrann Mathieu for 5 yards to the Ari37. Tackled by Mohamed Sanu.","(0:37) Matt Ryan incomplete pass to the right intended for Justin Hardy.","(0:54) Matt Ryan pass to the right to Justin Hardy for 11 yards to the Ari35. Tackled by Marcus Cooper.","(1:16) Matt Ryan pass to the right to Austin Hooper for 3 yards to the Ari46. Tackled by Tony Jefferson.","(1:36) Matt Ryan pass to the right to Taylor Gabriel for 8 yards to the Ari49. Tackled by Marcus Cooper.","(1:43) Matt Ryan pass to the middle to Devonta Freeman for 12 yards to the Atl43. Tackled by Marcus Cooper.","(1:53) Drew Butler punts for 36 yards to Atl31. No return.","(1:56) Carson Palmer incomplete pass to the middle intended for Jermaine Gresham defensed by De'Vondre Campbell.","(1:56) Atlanta Falcons timeout.","(2:00) Carson Palmer incomplete pass to the left intended for Jermaine Gresham.","(2:00) Two Minute Warning.","(2:19) Carson Palmer pass to the left to David Johnson for 8 yards to the Ari33. Tackled by De'Vondre Campbell.","(2:19) Matt Wile kicks off to the endzone. Touchback.","(2:19) Matt Bryant extra point is good.","(2:28) Matt Ryan pass to the left to Taylor Gabriel for 35 yards for a TOUCHDOWN.","(2:28) Atlanta Falcons timeout.","(3:10) Matt Ryan pass to the right to Julio Jones for 10 yards to the Ari35. Tackled by Patrick Peterson.","(3:20) Drew Butler punts for 39 yards to Ari45. No return.","(3:59) Carson Palmer pass to the right to Brittan Golden for a loss of 1 yard to the Ari6. Tackled by Brian Poole.","(4:03) Carson Palmer incomplete pass to the middle defensed by Vic Beasley Jr.. Penalty: Intentional Grounding on Arizona (Carson Palmer) -12 yards.","(4:17) Penalty: Holding on Arizona (Mike Iupati) -9 yards.","(4:55) David Johnson rush to the left for a loss of 1 yard to the Ari28. Tackled by Jonathan Babineaux and LaRoy Reynolds.","(5:09) Matt Wile punts for 57 yards to Ari23. John Brown return for 6 yards to Ari29. Tackled by Eric Weems.","(5:13) Matt Ryan incomplete pass to the right intended for Taylor Gabriel defensed by Tyrann Mathieu.","(5:50) Matt Ryan pass to the left to Julio Jones for 4 yards to the Atl20. Tackled by Deone Bucannon.","(6:20) Tevin Coleman rush to the right for no gain to the Atl16. Tackled by Josh Mauro.","(6:31) Drew Butler punts for 40 yards to Atl11. Eric Weems return for 5 yards to Atl16. Tackled by Zaviar Gooden.","(7:07) Carson Palmer pass to the left to Andre Ellington for 9 yards to the Ari49. Tackled by De'Vondre Campbell.","(7:11) Carson Palmer incomplete pass to the right intended for Andre Ellington.","(7:42) Penalty: Holding on Arizona (A.Q. Shipley) -10 yards.","(7:45) Carson Palmer incomplete pass to the left intended for Andre Ellington.","(8:30) Carson Palmer pass to the left to David Johnson for 25 yards to the Ari50. Tackled by Ricardo Allen.","(8:30) Matt Wile kicks off to the endzone. Touchback.","(8:36) Matt Bryant 45 yard field goal attempt is GOOD. Holder: Matt Schaub.","(9:14) Devonta Freeman rush to the left for a loss of 1 yard to the Ari27. Tackled by Chandler Jones.","(9:53) Devonta Freeman rush to the left for 1 yard to the Ari26. Tackled by Frostee Rucker.","(10:26) Matt Ryan pass to the right to Mohamed Sanu for 7 yards to the Ari27. Tackled by Marcus Cooper.","(10:33) Penalty: Pass Interference on Arizona (Patrick Peterson) 4 yards.","(10:36) Matt Ryan incomplete pass to the left intended for Devonta Freeman.","(11:17) Tevin Coleman rush to the left for a loss of 5 yards to the Ari38. Tackled by D.J. Swearinger.","(11:48) Matt Ryan pass to the right to Justin Hardy for 9 yards to the Ari33. Tackled by Marcus Cooper.","(12:23) Matt Ryan rush to the right for 6 yards to the Ari42.","(12:52) Taylor Gabriel rush to the left for 27 yards to the Ari48. Tackled by Marcus Cooper.","(12:52) Chandler Catanzaro kicks off to the endzone. Touchback.","(12:56) Chandler Catanzaro 25 yard field goal attempt is GOOD. Holder: Drew Butler.","(13:36) Carson Palmer pass to the left to David Johnson for 10 yards to the Atl7. Tackled by Deion Jones.","(14:22) Carson Palmer rush up the middle for no gain to the Atl4. FUMBLE, recovered by Ari (Carson Palmer).","(15:00) David Johnson rush to the left for 2 yards to the Atl4. Tackled by Ben Garland.","(0:20) David Johnson rush to the right for 16 yards to the Atl6. Tackled by Ricardo Allen.","(0:52) Carson Palmer pass to the left to David Johnson for 14 yards to the Atl22. Tackled by De'Vondre Campbell.","(1:28) David Johnson rush to the right for 2 yards to the Atl36. Tackled by De'Vondre Campbell.","(2:06) David Johnson rush to the right for 5 yards to the Atl38. Tackled by Grady Jarrett.","(2:53) Carson Palmer pass to the left to Larry Fitzgerald for 18 yards to the Atl43. Tackled by Deion Jones.","(2:58) Carson Palmer incomplete pass to the right intended for John Brown.","(3:38) David Johnson rush to the right for 14 yards to the Ari39. Tackled by Ricardo Allen and Jalen Collins.","(3:38) Matt Wile kicks off to the endzone. Touchback.","(3:38) Matt Bryant extra point is good.","(3:42) Devonta Freeman rush to the right for 1 yard for a TOUCHDOWN.","(3:46) Penalty: Pass Interference on Arizona (Patrick Peterson) 1 yards.","(4:24) Mohamed Sanu rush to the right for 5 yards to the Ari2. Tackled by Tony Jefferson and Frostee Rucker.","(5:06) Matt Ryan pass to the right to Tevin Coleman for 2 yards to the Ari7. Tackled by Kevin Minter.","(5:44) Matt Ryan pass to the left to Justin Hardy for 27 yards to the Ari9.","(5:49) Matt Ryan incomplete pass to the left intended for Julio Jones.","(6:24) Matt Ryan pass to the left to Mohamed Sanu for 7 yards to the Ari36. Tackled by D.J. Swearinger.","(7:10) Matt Ryan pass to the right to Tevin Coleman for 2 yards to the Ari43. Tackled by Tony Jefferson.","(7:51) Devonta Freeman rush to the right for a loss of 1 yard to the Ari45. Tackled by Patrick Peterson.","(8:28) Matt Ryan pass to the right to Mohamed Sanu for 6 yards to the Ari44. Tackled by Deone Bucannon.","(9:05) Devonta Freeman rush to the left for 16 yards to the Atl50. Tackled by Deone Bucannon.","(9:33) Matt Ryan pass to the left to Julio Jones for 6 yards to the Atl34. Tackled by Patrick Peterson.","(9:39) Chandler Catanzaro kicks off to the Atl5. Eric Weems return for 23 yards to Atl28. Tackled by Brandon Williams.","(9:39) Chandler Catanzaro extra point is good.","(9:45) Carson Palmer pass to the right to Jermaine Gresham for 1 yard for a TOUCHDOWN.","(10:15) David Johnson rush to the right for no gain to the Atl1. Tackled by Deion Jones and Courtney Upshaw.","(10:48) Carson Palmer pass to the right to David Johnson for 13 yards to the Atl1. Tackled by Keanu Neal.","(11:35) David Johnson rush to the right for 2 yards to the Atl14. Tackled by Jalen Collins.","(12:20) Carson Palmer pass to the right to Larry Fitzgerald for 17 yards to the Atl16. Tackled by Brian Poole.","(13:04) David Johnson rush to the left for 2 yards to the Atl33. Tackled by Keanu Neal and Tyson Jackson.","(13:42) David Johnson rush to the right for 6 yards to the Atl35. Tackled by Tyson Jackson.","(14:24) Carson Palmer pass to the right to John Brown for 19 yards to the Atl41. Tackled by Keanu Neal.","(15:00) Carson Palmer pass to the left to Jermaine Gresham for 15 yards to the Ari40. Tackled by LaRoy Reynolds.","(15:00) Matt Wile kicks off to the endzone. Touchback."]