["(0:34) Jordan Todman rush up the middle for 19 yards to the Pit43. Tackled by Mike Mitchell.","(1:09) Jordan Todman rush to the right for 6 yards to the Ind38. Tackled by Lawrence Timmons.","(1:42) Jordan Todman rush up the middle for 12 yards to the Ind32. Tackled by Mike Mitchell.","(1:53) Jordan Berry punts for 50 yards to Ind0. Touchback.","(2:00) Landry Jones incomplete pass to the left intended for Jesse James.","(2:00) Two Minute Warning.","(2:31) Fitzgerald Toussaint rush to the left for 3 yards to the Pit50. Tackled by D'Qwell Jackson and Akeem Ayers.","(3:18) Fitzgerald Toussaint rush up the middle for 3 yards to the Pit47. Tackled by Arthur Jones and D'Qwell Jackson.","(3:24) Fitzgerald Toussaint rush to the left for 16 yards to the Pit44. Tackled by Erik Walden.","(4:08) Fitzgerald Toussaint rush up the middle for 4 yards to the Pit28. Tackled by David Parry.","(4:16) Scott Tolzien pass intended for Donte Moncrief INTERCEPTED by William Gay. No return. Tackled by Donte Moncrief.","(4:21) Scott Tolzien pass to the left to Phillip Dorsett for 12 yards to the Pit46. Tackled by Artie Burns.","(4:47) Scott Tolzien pass to the left to Robert Turbin for 3 yards to the Ind42. Tackled by Bud Dupree.","(4:53) Scott Tolzien incomplete pass to the right intended for Phillip Dorsett defensed by William Gay.","(5:00) Scott Tolzien pass to the left to Donte Moncrief for 11 yards to the Ind39. Tackled by William Gay.","(5:05) Scott Tolzien incomplete pass to the left intended for Donte Moncrief.","(5:30) Scott Tolzien pass to the right to Phillip Dorsett for 3 yards to the Ind28. Tackled by Ross Cockrell.","(5:30) Chris Boswell kicks off to the endzone. Touchback.","(5:30) Chris Boswell extra point is good.","(5:38) Ben Roethlisberger pass to the right to Antonio Brown for 22 yards for a TOUCHDOWN.","(6:24) Le'Veon Bell rush to the left for 3 yards to the Ind22. Tackled by Hassan Ridgeway.","(7:04) Le'Veon Bell rush to the right for 4 yards to the Ind25. Tackled by Rashaan Melvin.","(7:51) Ben Roethlisberger pass to the right to Ladarius Green for 35 yards to the Ind29. Tackled by Edwin Jackson.","(8:09) Scott Tolzien pass intended for Phillip Dorsett INTERCEPTED by Mike Mitchell and returned for 26 yards. Tackled by Scott Tolzien.","(8:47) Scott Tolzien pass to the right to Donte Moncrief for 12 yards to the Pit43. Tackled by Ryan Shazier.","(9:11) Scott Tolzien pass to the left to Jack Doyle for 18 yards to the Ind45. Tackled by Mike Mitchell.","(9:18) Jordan Berry punts for 54 yards to Ind27. No return.","(9:26) Penalty: Running into Kicker on Indianapolis (T.J. Green) 5 yards.","(9:31) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates.","(10:00) Penalty: Holding on Pittsburgh (David DeCastro) -10 yards.","(10:43) Le'Veon Bell rush to the left for 7 yards to the Pit24. Tackled by Edwin Jackson.","(11:22) Le'Veon Bell rush to the right for 1 yard to the Pit17. Tackled by D'Qwell Jackson.","(11:58) Le'Veon Bell rush up the middle for 9 yards to the Pit16. Tackled by Rashaan Melvin.","(12:43) Le'Veon Bell rush to the right for 3 yards to the Pit7. Tackled by Henry Anderson and David Parry.","(13:27) Le'Veon Bell rush up the middle for 3 yards to the Pit4. Tackled by T.J. Green.","(13:31) Scott Tolzien incomplete pass to the right intended for Phillip Dorsett.","(14:16) Scott Tolzien rush to the right for 1 yard to the Pit1. Tackled by Mike Mitchell.","(15:00) Frank Gore rush up the middle for 2 yards to the Pit2. Tackled by Stephon Tuitt and Ryan Shazier.","(0:26) Robert Turbin rush to the left for 2 yards to the Pit4. Tackled by Lawrence Timmons.","(1:08) Scott Tolzien pass to the middle to Dwayne Allen for 12 yards to the Pit6. Tackled by Lawrence Timmons.","(1:15) Scott Tolzien incomplete pass to the left intended for Robert Turbin.","(1:57) Scott Tolzien pass to the left to Dwayne Allen for 6 yards to the Pit18. Tackled by Artie Burns.","(2:06) Scott Tolzien incomplete pass to the left intended for Donte Moncrief.","(2:49) Scott Tolzien pass to the middle to Donte Moncrief for 10 yards to the Pit24. Tackled by Sean Davis.","(2:49) Pittsburgh Steelers timeout.","(3:34) Scott Tolzien pass to the right to Jack Doyle for 7 yards to the Pit34. Tackled by Ryan Shazier.","(4:20) Robert Turbin rush to the left for 18 yards to the Pit41. Tackled by Mike Mitchell.","(5:04) Frank Gore rush up the middle for no gain to the Ind41. Tackled by Lawrence Timmons.","(5:38) Frank Gore rush up the middle for 7 yards to the Ind41. Tackled by Sean Davis.","(6:15) Scott Tolzien pass to the right to Phillip Dorsett for 16 yards to the Ind34. Tackled by Ross Cockrell.","(7:02) Scott Tolzien sacked at Ind18 for a loss of 6 yards by Javon Hargrave.","(7:47) Scott Tolzien pass to the right to Donte Moncrief for 1 yard to the Ind24. Tackled by Artie Burns.","(8:25) Scott Tolzien pass to the left to Donte Moncrief for 6 yards to the Ind23. Tackled by Artie Burns.","(9:09) Frank Gore rush up the middle for 3 yards to the Ind17. Tackled by Javon Hargrave.","(9:49) Scott Tolzien pass to the left to T.Y. Hilton for 4 yards to the Ind14. Tackled by William Gay.","(9:55) Jordan Berry punts for 37 yards to Ind10. No return.","(9:56) Penalty: False Start on Pittsburgh (Cobi Hamilton) -5 yards.","(10:04) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates.","(10:48) Ben Roethlisberger pass to the left to Le'Veon Bell for 5 yards to the Ind42. Tackled by Akeem Ayers.","(11:34) Le'Veon Bell rush to the left for 3 yards to the Ind47. Tackled by D'Qwell Jackson and T.Y. McGill.","(12:22) Ben Roethlisberger pass to the right to Le'Veon Bell for 10 yards to the Pit50. Tackled by T.J. Green.","(12:59) Le'Veon Bell rush to the left for 5 yards to the Pit40. Tackled by Erik Walden.","(13:35) Ben Roethlisberger pass to the middle to Cobi Hamilton for 5 yards to the Pit35. Tackled by Patrick Robinson.","(14:17) Le'Veon Bell rush to the left for 6 yards to the Pit30. Tackled by Arthur Jones and Edwin Jackson.","(14:54) Le'Veon Bell rush to the right for 3 yards to the Pit24. Tackled by Edwin Jackson and Arthur Jones.","(15:00) Pat McAfee kicks off to the Pit0. Sammie Coates return for 21 yards to Pit21. Tackled by Matthias Farley.","(0:10) Le'Veon Bell rush up the middle for 4 yards to the Pit14. Tackled by D'Qwell Jackson.","(0:50) Le'Veon Bell rush up the middle for 8 yards to the Pit10. Tackled by Rashaan Melvin.","(0:58) Penalty: Holding on Pittsburgh (David DeCastro) -2 yards.","(0:58) Indianapolis Colts timeout.","(1:08) Le'Veon Bell rush up the middle for 3 yards to the Pit4. Tackled by Erik Walden.","(1:12) Scott Tolzien incomplete pass to the right intended for Chester Rogers defensed by Mike Mitchell.","(1:12) Pittsburgh Steelers timeout.","(1:12) Indianapolis Colts timeout.","(2:00) Scott Tolzien rush to the right for no gain to the Pit1. Tackled by Sean Davis.","(2:00) Two Minute Warning.","(2:39) Frank Gore rush up the middle for 1 yard to the Pit1. Tackled by Ricardo Mathews.","(3:18) Frank Gore rush up the middle for no gain to the Pit2. Tackled by Sean Davis.","(3:41) Scott Tolzien pass to the middle to T.Y. Hilton for 32 yards to the Pit2. Tackled by Mike Mitchell.","(4:19) Frank Gore rush to the right for a loss of 1 yard to the Pit34. Tackled by Ryan Shazier and Javon Hargrave.","(4:23) Penalty: Roughing Passer on Pittsburgh (Lawrence Timmons) 15 yards.","(4:30) Scott Tolzien incomplete pass to the left intended for Erik Swoope defensed by Ross Cockrell.","(5:07) Frank Gore rush to the left for 6 yards to the Pit48. Tackled by Artie Burns and Ryan Shazier.","(5:49) Scott Tolzien pass to the middle to Dwayne Allen for 9 yards to the Ind46. Tackled by Lawrence Timmons.","(5:55) Scott Tolzien incomplete pass to the right intended for T.Y. Hilton.","(6:03) Jordan Berry punts for 36 yards to Ind37. No return.","(6:17) Penalty: Illegal Formation on Indianapolis (Josh McNary) 5 yards.","(6:56) Ben Roethlisberger pass to the middle to Antonio Brown for 9 yards to the Pit22. Tackled by Darius Butler.","(7:13) Penalty: Illegal Use of Hands on Pittsburgh (Ladarius Green) -10 yards.","(7:18) Ben Roethlisberger incomplete pass to the right intended for Ladarius Green.","(7:25) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates defensed by Patrick Robinson.","(7:34) Pat McAfee punts for 50 yards to Pit23. No return.","(8:08) Scott Tolzien rush up the middle for 5 yards to the Ind27. Tackled by Javon Hargrave.","(8:46) Frank Gore rush up the middle for no gain to the Ind22. Tackled by Anthony Chickillo.","(8:53) Scott Tolzien incomplete pass to the right intended for Donte Moncrief defensed by Ross Cockrell.","(9:00) Chris Boswell kicks off to the Ind-2. Josh Ferguson return for 24 yards to Ind22. Tackled by Anthony Chickillo.","(9:00) Chris Boswell extra point is good.","(9:08) Ben Roethlisberger pass to the right to Antonio Brown for 33 yards for a TOUCHDOWN.","(9:50) Fitzgerald Toussaint rush up the middle for 2 yards to the Ind33. Tackled by Hassan Ridgeway.","(10:33) Ben Roethlisberger pass to the left to Ladarius Green for 32 yards to the Ind35. Tackled by Darius Butler.","(11:12) Le'Veon Bell rush up the middle for 3 yards to the Pit33. Tackled by David Parry and Robert Mathis.","(11:17) Penalty: Pass Interference on Pittsburgh (Antonio Brown) -10 yards.","(12:00) Le'Veon Bell rush up the middle for 4 yards to the Pit40. Tackled by Edwin Jackson.","(12:37) Le'Veon Bell rush up the middle for 5 yards to the Pit36. Tackled by Arthur Jones.","(13:02) Ben Roethlisberger pass to the left to Eli Rogers for 6 yards to the Pit31. Tackled by Patrick Robinson.","(13:02) Pat McAfee kicks off to the endzone. Touchback.","(13:02) Adam Vinatieri extra point is good.","(13:07) Scott Tolzien pass to the left to Donte Moncrief for 5 yards for a TOUCHDOWN.","(13:53) Frank Gore rush up the middle for 3 yards to the Pit5. Tackled by Lawrence Timmons and Mike Mitchell.","(14:55) Pat McAfee pass to the right to Erik Swoope for 35 yards to the Pit8. Tackled by Justin Gilbert.","(15:00) Scott Tolzien incomplete pass to the middle intended for Dwayne Allen.","(0:16) Scott Tolzien pass to the middle to Frank Gore for 3 yards to the Pit43. Tackled by Bud Dupree.","(0:56) Frank Gore rush to the left for 1 yard to the Pit46. Tackled by Lawrence Timmons.","(1:06) Chris Boswell kicks off to the Ind10. Jordan Todman return for 43 yards to Pit47. Tackled by Tyler Matakevich.","(1:06) Chris Boswell extra point is good.","(1:13) Ben Roethlisberger pass to the right to Antonio Brown for 25 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Pittsburgh -15 yards.","(1:54) Ben Roethlisberger pass to the right to Le'Veon Bell for 5 yards to the Ind25. Tackled by Edwin Jackson.","(2:01) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown defensed by Darius Butler.","(2:34) Le'Veon Bell rush to the right for 12 yards to the Ind30. Tackled by Rashaan Melvin.","(2:41) Ben Roethlisberger incomplete pass to the middle intended for Le'Veon Bell.","(3:25) Le'Veon Bell rush to the right for 12 yards to the Ind42. Tackled by Rashaan Melvin and Edwin Jackson.","(4:08) Le'Veon Bell rush up the middle for 4 yards to the Pit46. Tackled by Henry Anderson.","(4:13) 52 yard field goal attempt by Adam Vinatieri is NO GOOD. Holder: Pat McAfee.","(4:37) Scott Tolzien sacked at Pit34 for a loss of 5 yards by James Harrison.","(5:19) Scott Tolzien pass to the middle to Dwayne Allen for 9 yards to the Pit29. Tackled by Lawrence Timmons.","(6:02) Frank Gore rush to the left for no gain to the Pit38. Tackled by Anthony Chickillo.","(6:49) Scott Tolzien pass to the left to T.Y. Hilton for 18 yards to the Pit38. Tackled by Sean Davis.","(6:55) Scott Tolzien incomplete pass to the left intended for Donte Moncrief.","(7:32) Frank Gore rush to the right for 2 yards to the Ind44. Tackled by Stephon Tuitt and Lawrence Timmons.","(8:11) Scott Tolzien pass to the middle to Dwayne Allen for 13 yards to the Ind42. Tackled by Lawrence Timmons.","(8:42) Frank Gore rush up the middle for 3 yards to the Ind29. Tackled by James Harrison.","(9:10) Frank Gore rush to the right for 1 yard to the Ind26. Tackled by Ryan Shazier.","(9:10) Chris Boswell kicks off to the endzone. Touchback.","(9:10) Chris Boswell extra point is good.","(9:16) Le'Veon Bell rush to the left for 5 yards for a TOUCHDOWN.","(9:59) Le'Veon Bell rush up the middle for 3 yards to the Ind5. Tackled by Arthur Jones and D'Qwell Jackson.","(10:46) Ben Roethlisberger pass to the middle to Eli Rogers for 30 yards to the Ind8. Tackled by Patrick Robinson.","(11:30) Ben Roethlisberger pass to the left to Antonio Brown for 2 yards to the Ind38. Tackled by Vontae Davis.","(12:11) Fitzgerald Toussaint rush to the right for no gain to the Ind40. Tackled by David Parry.","(12:56) Le'Veon Bell rush to the left for 10 yards to the Ind40. Tackled by D'Qwell Jackson.","(13:29) Ben Roethlisberger pass to the right to Le'Veon Bell for 2 yards to the Pit50. Tackled by Darius Butler.","(13:38) Pat McAfee punts for 42 yards to Pit48. No return.","(14:12) Scott Tolzien pass to the left to Robert Turbin for a loss of 5 yards to the Ind10. Tackled by Javon Hargrave.","(14:17) Scott Tolzien incomplete pass to the middle intended for T.Y. Hilton.","(15:00) Scott Tolzien sacked at Ind15 for a loss of 10 yards by William Gay. FUMBLE, recovered by Ind (Scott Tolzien).","(15:00) Chris Boswell kicks off to the endzone. Touchback."]