["(0:05) Cairo Santos 34 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(0:05) Kansas City Chiefs timeout.","(0:37) Alex Smith pass to the middle to Travis Kelce for 16 yards to the Den16. Tackled by Justin Simmons.","(0:37) Alex Smith incomplete pass to the middle.","(0:55) Alex Smith pass to the left to Tyreek Hill for 11 yards to the Den32. Tackled by Aqib Talib.","(1:03) Penalty: Offside on Denver (DeMarcus Ware) 5 yards.","(1:08) 62 yard field goal attempt by Brandon McManus is NO GOOD. Holder: Riley Dixon.","(1:08) Denver Broncos timeout.","(1:13) Trevor Siemian incomplete pass to the right intended for Bennie Fowler.","(1:17) Trevor Siemian incomplete pass to the left defensed by Chris Jones.","(2:00) Kapri Bibbs rush to the left for no gain to the KC44. Tackled by Derrick Johnson.","(2:00) Two Minute Warning.","(2:47) Trevor Siemian pass to the left to A.J. Derby for 10 yards to the KC44. Tackled by Kenneth Acker.","(2:47) Denver Broncos timeout.","(3:27) Kapri Bibbs rush to the left for 7 yards to the Den46. Tackled by Kendall Reyes.","(3:31) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(4:09) Devontae Booker rush to the left for 6 yards to the Den39. Tackled by Ramik Wilson and Derrick Johnson.","(4:19) Trevor Siemian rush to the left for 8 yards to the Den33.","(4:19) Cairo Santos kicks off to the endzone. Touchback.","(4:23) Cairo Santos 37 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(4:28) Alex Smith incomplete pass to the left intended for Travis Kelce.","(4:28) Kansas City Chiefs timeout.","(4:32) Alex Smith incomplete pass to the right intended for Chris Conley.","(5:10) Knile Davis rush up the middle for 1 yard to the Den19. Tackled by Darian Stewart.","(5:46) Charcandrick West rush to the left for 4 yards to the Den20. Tackled by Shane Ray.","(6:06) Spencer Ware rush to the left for 7 yards to the Den24. Tackled by Shane Ray.","(6:43) Alex Smith pass to the right to Travis Kelce for 21 yards to the Den31. Tackled by Aqib Talib.","(7:23) Charcandrick West rush to the left for 2 yards to the KC48. Tackled by DeMarcus Ware.","(8:03) Alex Smith pass to the left to Tyreek Hill for 5 yards to the KC46. Tackled by Todd Davis and Brandon Marshall.","(8:46) Spencer Ware rush up the middle for 1 yard to the KC41. Tackled by Jared Crick and Derek Wolfe.","(8:46) Penalty: Too Many Men on Field on Denver 5 yards.","(8:51) Brandon McManus kicks off to the KC-6. De'Anthony Thomas return for 41 yards to KC35. Tackled by Brandon McManus.","(8:55) Brandon McManus 44 yard field goal attempt is GOOD. Holder: Riley Dixon.","(9:33) Trevor Siemian sacked at KC26 for a loss of 7 yards by Tamba Hali.","(10:15) Trevor Siemian rush to the left for 1 yard to the KC19. Tackled by Justin Houston.","(10:55) Devontae Booker rush to the left for no gain to the KC20. Tackled by Eric Berry.","(11:01) Penalty: Pass Interference on Kansas City (Kenneth Acker) 12 yards.","(11:39) Kapri Bibbs rush to the right for a loss of 2 yards to the KC32. Tackled by Justin Houston.","(12:22) Trevor Siemian pass to the right to Devontae Booker for 22 yards to the KC30. Tackled by Derrick Johnson.","(13:04) Kapri Bibbs rush up the middle for 3 yards to the Den48. Tackled by Kendall Reyes.","(13:09) Trevor Siemian incomplete pass to the middle intended for Jordan Taylor defensed by Phillip Gaines.","(13:47) Trevor Siemian pass to the right to Demaryius Thomas for 11 yards to the Den45. Tackled by Marcus Peters and Eric Berry.","(14:26) Devontae Booker rush to the left for 2 yards to the Den34. Tackled by Tamba Hali.","(15:00) Devontae Booker rush up the middle for 7 yards to the Den32. Tackled by Phillip Gaines.","(15:00) Cairo Santos kicks off to the endzone. Touchback.","(0:12) Trevor Siemian rush up the middle for a loss of 1 yard to the Den24.","(0:12) Cairo Santos kicks off to the endzone. Touchback.","(0:12) Alex Smith 2 pt conversion pass to Demetrius Harris is GOOD.","(0:15) Alex Smith pass to the left to Tyreek Hill for 3 yards for a TOUCHDOWN.","(0:19) Alex Smith pass to the left to Tyreek Hill for 11 yards to the Den3.","(0:25) Alex Smith incomplete pass to the left intended for Albert Wilson.","(0:29) Alex Smith incomplete pass to the right intended for Charcandrick West defensed by Von Miller.","(0:35) Alex Smith incomplete pass to the left intended for Albert Wilson.","(0:41) Penalty: Illegal Contact on Denver (T.J. Ward) 5 yards.","(1:02) Alex Smith pass to the right to Chris Conley for 6 yards to the Den19. Tackled by Aqib Talib.","(1:26) Alex Smith pass to the middle to Travis Kelce for 9 yards to the Den25. Tackled by T.J. Ward.","(1:29) Alex Smith incomplete pass to the middle intended for Travis Kelce defensed by Brandon Marshall.","(1:51) Alex Smith pass to the right to Tyreek Hill for 8 yards to the Den34. Tackled by Chris Harris Jr..","(1:51) Penalty: Offside on Denver (Von Miller) 5 yards.","(1:56) Penalty: Holding on Denver (Kayvon Webster) 5 yards.","(1:56) Two Minute Warning.","(2:01) Alex Smith pass to the left to Chris Conley for 13 yards to the KC48. Tackled by Bradley Roby.","(2:26) Alex Smith pass to the left to Travis Kelce for 10 yards to the KC35. Tackled by Justin Simmons.","(2:31) Alex Smith pass to the left to Chris Conley for 7 yards to the KC25. Tackled by Chris Harris Jr..","(3:00) Alex Smith sacked at KC18 for a loss of 7 yards by Derek Wolfe.","(3:00) Brandon McManus kicks off to the endzone. Touchback.","(3:00) Brandon McManus extra point is good.","(3:12) Trevor Siemian pass to the left to Bennie Fowler for 76 yards for a TOUCHDOWN.","(3:12) Kansas City Chiefs timeout.","(3:27) Trevor Siemian rush up the middle for 14 yards to the Den24. Tackled by Rakeem Nunez-Roches.","(3:27) Penalty: False Start on Denver (Emmanuel Sanders) -5 yards.","(3:27) Kansas City Chiefs timeout.","(3:31) Devontae Booker rush to the left for a loss of 1 yard to the Den15. Tackled by Rakeem Nunez-Roches.","(4:14) Trevor Siemian pass to the left to A.J. Derby for 13 yards to the Den16. Tackled by Ron Parker.","(5:01) Devontae Booker rush to the right for no gain to the Den3. Tackled by Derrick Johnson and Rakeem Nunez-Roches.","(5:37) Devontae Booker rush to the right for a loss of 1 yard to the Den3. Tackled by Chris Jones.","(5:50) Dustin Colquitt punts for 53 yards to Den7. Jordan Norwood - no return. Tackled by D.J. Alexander. Penalty: Holding on Denver (Kayvon Webster) -3 yards.","(5:55) Alex Smith incomplete pass to the right intended for Travis Kelce defensed by Justin Simmons.","(6:35) Knile Davis rush up the middle for 3 yards to the KC40. Tackled by Von Miller.","(6:41) Alex Smith incomplete pass to the right intended for Travis Kelce defensed by Corey Nelson.","(7:24) Spencer Ware rush to the left for 3 yards to the KC37. Tackled by Derek Wolfe.","(7:47) Alex Smith pass to the left to Tyreek Hill for 9 yards to the KC34. Tackled by Brandon Marshall.","(7:47) Brandon McManus kicks off to the endzone. Touchback.","(7:47) Brandon McManus extra point is good.","(7:53) Trevor Siemian pass to the left to Emmanuel Sanders for 35 yards for a TOUCHDOWN.","(8:29) Devontae Booker rush up the middle for 3 yards to the KC35. Tackled by Justin Houston.","(8:46) Trevor Siemian pass to the left to Emmanuel Sanders for 64 yards to the KC23. Tackled by Eric Berry. Penalty: Unsports. Conduct on Denver -15 yards.","(9:24) Devontae Booker rush to the right for 1 yard to the Den13. Tackled by Justin Houston.","(9:32) Dustin Colquitt punts for 44 yards to Den12. No return.","(10:17) Alex Smith pass to the middle to Travis Kelce for 6 yards to the KC44. Tackled by Chris Harris Jr..","(10:17) Kansas City Chiefs timeout.","(11:04) Alex Smith sacked at KC38 for a loss of 7 yards by Von Miller.","(11:50) Alex Smith pass to the right to Spencer Ware for 14 yards to the KC45. Tackled by Brandon Marshall and Aqib Talib.","(12:19) Penalty: Holding on Kansas City (Laurent Duvernay-Tardif) -10 yards.","(12:29) Dustin Colquitt punts for 44 yards to KC48. Jordan Norwood - no return. FUMBLE, recovered by KC (James Winchester). Tackled by Jordan Taylor.","(12:34) Penalty: False Start on Kansas City (Demarcus Robinson) -4 yards.","(13:19) Alex Smith sacked at KC8 for a loss of 3 yards by Shane Ray.","(14:04) Alex Smith sacked at KC11 for a loss of 4 yards by DeMarcus Ware.","(14:43) Spencer Ware rush up the middle for 1 yard to the KC15. Tackled by Jared Crick.","(14:54) Riley Dixon punts for 55 yards to KC14. No return.","(15:00) Trevor Siemian incomplete pass to the left intended for Jordan Norwood defensed by Kenneth Acker.","(0:25) Trevor Siemian pass to the left to Demaryius Thomas for 6 yards to the Den31. Tackled by Phillip Gaines.","(0:30) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(0:30) Cairo Santos kicks off to the endzone. Touchback.","(0:30) Cairo Santos extra point is good.","(0:37) Tyreek Hill rush to the right for 3 yards for a TOUCHDOWN.","(1:06) Spencer Ware rush up the middle for 3 yards to the Den3. Tackled by Derek Wolfe.","(1:44) Spencer Ware rush up the middle for 6 yards to the Den6. Tackled by Jared Crick and Todd Davis.","(1:51) Penalty: Illegal Formation on Denver 5 yards.","(2:43) Alex Smith pass to the left to De'Anthony Thomas for 4 yards to the Den17. Tackled by Aqib Talib and Bradley Roby.","(3:26) Alex Smith pass to the right to Tyreek Hill for a loss of 2 yards to the Den21. Tackled by Chris Harris Jr..","(4:06) Spencer Ware rush up the middle for 6 yards to the Den19. Tackled by Todd Davis.","(4:44) Alex Smith pass to the left to Spencer Ware for 18 yards to the Den25. Tackled by Brandon Marshall.","(5:27) Alex Smith pass to the left to Travis Kelce for 8 yards to the Den43. Tackled by Will Parks.","(5:32) Alex Smith incomplete pass to the left intended for Travis Kelce.","(6:15) Spencer Ware rush up the middle for 3 yards to the KC49. Tackled by Von Miller.","(6:54) Alex Smith pass to the right to Travis Kelce for 16 yards to the KC46. Tackled by Darian Stewart.","(7:37) Spencer Ware rush up the middle for 5 yards to the KC30. Tackled by Derek Wolfe.","(7:37) Brandon McManus kicks off to the endzone. Touchback.","(7:37) Brandon McManus extra point is good.","(7:48) Trevor Siemian pass to the right to Jordan Taylor for 6 yards for a TOUCHDOWN.","(7:53) Trevor Siemian incomplete pass to the middle intended for Jordan Taylor defensed by Phillip Gaines.","(8:32) Devontae Booker rush up the middle for 2 yards to the KC6. Tackled by Ramik Wilson and Derrick Johnson.","(9:01) Trevor Siemian rush up the middle for 1 yard to the KC8. Tackled by Eric Berry.","(9:45) Trevor Siemian pass to the right to A.J. Derby for 12 yards to the KC9. Tackled by Ron Parker.","(9:45) Denver Broncos timeout.","(10:21) Kapri Bibbs rush up the middle for a loss of 2 yards to the KC21. Tackled by D.J. Alexander.","(10:58) Kapri Bibbs rush to the right for a loss of 1 yard to the KC19. Tackled by Justin Houston.","(11:04) Trevor Siemian pass to the left to Demaryius Thomas for 24 yards to the KC18. Tackled by Kenneth Acker.","(11:49) Devontae Booker rush to the right for 5 yards to the KC42. Tackled by Tamba Hali.","(11:53) Trevor Siemian incomplete pass to the left defensed by Justin Houston.","(12:32) Devontae Booker rush up the middle for 13 yards to the KC47. Tackled by Ron Parker and Eric Berry.","(12:57) Devontae Booker rush up the middle for 3 yards to the Den40. Tackled by Ramik Wilson.","(13:07) Dustin Colquitt punts for 42 yards to Den34. Jordan Norwood return for 3 yards to Den37. Tackled by D.J. Alexander.","(13:12) Alex Smith incomplete pass to the left intended for Demetrius Harris.","(13:58) Alex Smith rush to the right for 3 yards to the KC24. Tackled by Jared Crick.","(14:39) Alex Smith pass to the right to Tyreek Hill for 1 yard to the KC21. Tackled by Von Miller.","(15:00) Penalty: Illegal Shift on Kansas City -5 yards.","(15:00) Brandon McManus kicks off to the endzone. Touchback.","(0:13) Alex Smith rush up the middle for a loss of 1 yard to the KC18.","(0:22) Riley Dixon punts for 37 yards to KC19. No return.","(0:22) Kansas City Chiefs timeout.","(0:34) Trevor Siemian pass to the left to A.J. Derby for 8 yards to the Den44. Tackled by Daniel Sorensen.","(0:39) Trevor Siemian incomplete pass to the left intended for Devontae Booker defensed by Derrick Johnson.","(0:44) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(0:56) Dustin Colquitt punts for 55 yards to Den27. Jordan Norwood return for 9 yards to Den36. Tackled by D.J. Alexander.","(0:56) Denver Broncos timeout.","(1:01) Alex Smith sacked at KC18 for a loss of 4 yards by Von Miller and Derek Wolfe.","(1:01) Denver Broncos timeout.","(1:05) Charcandrick West rush up the middle for 2 yards to the KC22. Tackled by Von Miller and Derek Wolfe.","(1:47) Alex Smith sacked at KC20 for a loss of 5 yards by Von Miller.","(1:47) Brandon McManus kicks off to the endzone. Touchback.","(1:51) Brandon McManus 33 yard field goal attempt is GOOD. Holder: Riley Dixon.","(1:55) Trevor Siemian incomplete pass to the middle intended for Jordan Taylor defensed by Kendall Reyes.","(2:00) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders defensed by Phillip Gaines.","(2:00) Penalty: False Start on Denver (A.J. Derby) -4 yards.","(2:00) Two Minute Warning.","(2:49) Trevor Siemian pass to the right to Demaryius Thomas for 9 yards to the KC11. Tackled by Eric Berry.","(3:23) Kapri Bibbs rush up the middle for 2 yards to the KC20. Tackled by Jarvis Jenkins.","(3:55) Trevor Siemian pass to the right to Emmanuel Sanders for 8 yards to the KC22. Tackled by Marcus Peters.","(4:20) Trevor Siemian pass to the left to Emmanuel Sanders for 14 yards to the KC45. Tackled by Phillip Gaines and Eric Berry. Penalty: Unnecessary Roughness on Kansas City (Eric Berry) 15 yards.","(5:00) Devontae Booker rush to the left for 7 yards to the Den41. Tackled by Eric Berry and Ramik Wilson.","(6:04) Devontae Booker rush to the left for 4 yards to the Den34. Tackled by Jarvis Jenkins.","(6:04) Devontae Booker rush up the middle for 5 yards to the Den30. Tackled by Rakeem Nunez-Roches.","(6:04) Cairo Santos kicks off to the endzone. Touchback.","(6:04) Cairo Santos extra point is good.","(6:16) Riley Dixon kicks off to the KC14. Tyreek Hill return for 86 yards for a TOUCHDOWN.","(6:20) Trevor Siemian sacked at Den0 for a loss of 8 yards by Justin Houston. FUMBLE, recovered by Den (Russell Okung). Safety.","(6:28) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(7:04) Devontae Booker rush to the left for 3 yards to the Den8. Tackled by Tamba Hali.","(7:18) Dustin Colquitt punts for 61 yards to Den3. Jordan Norwood return for 2 yards to Den13. FUMBLE, recovered by Den (Jordan Norwood).","(7:25) Alex Smith incomplete pass to the right.","(8:07) Knile Davis rush to the right for 2 yards to the KC36. Tackled by Jared Crick and DeMarcus Ware.","(8:12) Alex Smith incomplete pass to the right intended for Tyreek Hill defensed by Sylvester Williams.","(8:22) Riley Dixon punts for 45 yards to KC23. Tyreek Hill return for 11 yards to KC34. Tackled by Bennie Fowler.","(8:29) Penalty: Holding on Denver (Thomas Gafford) -10 yards.","(9:01) Trevor Siemian sacked at Den42 for a loss of 5 yards by Justin Houston.","(9:43) Kapri Bibbs rush to the right for 8 yards to the Den47. Tackled by Derrick Johnson.","(10:27) Trevor Siemian sacked at Den39 for a loss of 4 yards by Kendall Reyes.","(10:33) Penalty: Holding on Denver (Ty Sambrailo) -10 yards.","(11:05) Trevor Siemian pass to the left to Emmanuel Sanders for 20 yards to the KC47. Tackled by Kenneth Acker.","(11:05) Denver Broncos timeout.","(11:09) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas defensed by Kenneth Acker.","(11:45) Devontae Booker rush to the right for 1 yard to the Den33. Tackled by Justin Houston.","(12:16) Devontae Booker rush up the middle for 10 yards to the Den32. Tackled by Ramik Wilson.","(12:48) Devontae Booker rush to the left for 4 yards to the Den22. Tackled by Tamba Hali.","(12:48) Penalty: Encroachment on Kansas City (Chris Jones) 5 yards.","(12:56) Dustin Colquitt punts for 45 yards to Den13. No return.","(13:27) Alex Smith pass to the right to Albert Wilson for 2 yards to the KC42. Tackled by T.J. Ward.","(14:53) Spencer Ware rush up the middle for no gain to the KC40. Tackled by Todd Davis.","(14:53) Alex Smith pass to the right to James O'Shaughnessy for a loss of 1 yard to the KC40. Tackled by Von Miller.","(15:00) Penalty: Illegal Plyr Downfld on Kansas City (Eric Fisher) -5 yards.","(0:36) Spencer Ware rush up the middle for 3 yards to the KC46. Tackled by Shane Ray.","(1:20) Spencer Ware rush up the middle for 4 yards to the KC43. Tackled by Derek Wolfe.","(1:55) Alex Smith pass to the left to Albert Wilson for 4 yards to the KC39. Tackled by Chris Harris Jr..","(2:37) Alex Smith pass to the right to Travis Kelce for 15 yards to the KC35. Tackled by Von Miller.","(3:16) Spencer Ware rush up the middle for 7 yards to the KC20. Tackled by Sylvester Williams.","(3:24) Riley Dixon punts for 40 yards to KC13. No return.","(3:59) Devontae Booker rush to the left for a loss of 1 yard to the Den47. Tackled by Rakeem Nunez-Roches.","(4:41) Trevor Siemian pass to the left to Emmanuel Sanders for 7 yards to the Den48. Tackled by Kenneth Acker.","(5:02) Penalty: False Start on Denver (Emmanuel Sanders) -5 yards.","(5:33) Kapri Bibbs rush up the middle for 7 yards to the Den46. Tackled by Eric Berry.","(6:09) Trevor Siemian pass to the left to Emmanuel Sanders for 14 yards to the Den39. Tackled by Phillip Gaines.","(6:14) Penalty: Holding on Kansas City (Phillip Gaines) 5 yards.","(6:22) Dustin Colquitt punts for 38 yards to Den0. Touchback.","(6:26) Alex Smith incomplete pass to the left intended for Albert Wilson.","(6:30) Alex Smith incomplete pass to the left intended for Travis Kelce.","(6:56) Penalty: Pass Interference on Kansas City (Albert Wilson) -10 yards.","(7:03) Alex Smith incomplete pass to the right.","(7:49) Spencer Ware rush to the right for 7 yards to the Den28. Tackled by Brandon Marshall.","(8:26) Spencer Ware rush to the left for 4 yards to the Den35. Tackled by Brandon Marshall and Billy Winn.","(8:31) Penalty: Holding on Denver (Chris Harris Jr.) 5 yards.","(9:12) Alex Smith pass to the left to Tyreek Hill for 6 yards to the Den44. Tackled by T.J. Ward.","(9:17) Alex Smith incomplete pass to the right intended for Travis Kelce.","(9:27) Riley Dixon punts for 35 yards to Den50. No return.","(10:05) Trevor Siemian sacked at Den15 for a loss of 4 yards by Justin Houston.","(10:43) Devontae Booker rush to the left for 4 yards to the Den19. Tackled by Dontari Poe.","(11:19) Devontae Booker rush up the middle for 2 yards to the Den15. Tackled by Rakeem Nunez-Roches.","(11:27) Dustin Colquitt punts for 49 yards to Den13. No return.","(11:32) Alex Smith incomplete pass to the right intended for Albert Wilson defensed by Chris Harris Jr..","(12:12) Spencer Ware rush up the middle for 2 yards to the KC38. Tackled by Von Miller.","(12:51) Spencer Ware rush to the right for 2 yards to the KC36. Tackled by Jared Crick.","(13:05) Riley Dixon punts for 59 yards to KC17. Tyreek Hill return for 17 yards to KC34. Tackled by Justin Simmons.","(13:20) Penalty: Holding on Denver (Kapri Bibbs) -10 yards.","(13:54) Devontae Booker rush up the middle for no gain to the Den34. Tackled by Justin Houston.","(14:26) Trevor Siemian pass to the right to Demaryius Thomas for 10 yards to the Den34. Tackled by Ron Parker.","(15:00) Trevor Siemian pass to the left to Andy Janovich for a loss of 1 yard to the Den24. Tackled by Derrick Johnson.","(15:00) Cairo Santos kicks off to the endzone. Touchback."]