["(0:25) Marcus Mariota rush up the middle for a loss of 1 yard to the Ten50.","(0:27) Cody Parkey onside kickoff to the Cle49. No return.","(0:27) Tennessee Titans timeout.","(0:27) Cody Parkey extra point is good.","(0:30) Duke Johnson Jr. rush up the middle for 1 yard for a TOUCHDOWN.","(0:30) Tennessee Titans timeout.","(0:40) Cody Kessler rush to the right for 3 yards to the Ten1. Tackled by Sean Spence.","(0:40) Cleveland Browns timeout.","(0:48) Isaiah Crowell rush up the middle for 3 yards to the Ten4. Tackled by Avery Williamson.","(0:56) Cody Kessler pass to the left to Terrelle Pryor Sr. for 16 yards to the Ten14. Tackled by Daimion Stafford. Penalty: Horse Collar Tackle on Tennessee (Daimion Stafford) 7 yards.","(0:56) Cleveland Browns timeout.","(1:02) Cody Kessler sacked at Ten30 for a loss of 10 yards by Derrick Morgan.","(1:09) Cody Kessler pass to the left to Rashard Higgins for 14 yards to the Ten20.","(1:17) Cody Kessler incomplete pass to the right intended for Jordan Payton.","(1:56) Cody Kessler pass to the middle to Duke Johnson Jr. for 28 yards to the Ten34. Tackled by Jurrell Casey.","(1:56) Two Minute Warning.","(2:05) Cody Parkey onside kickoff to the Cle38. Onside kick recovered by kicking team by Rashard Higgins. Cody Kessler incomplete pass to the right intended for Jordan Payton.","(2:07) Cody Kessler 2 pt conversion pass is NO GOOD - intended for Ricardo Louis.","(2:10) Cody Kessler pass to the right to Terrelle Pryor Sr. for 5 yards for a TOUCHDOWN.","(2:14) Cody Kessler incomplete pass to the right intended for Duke Johnson Jr..","(2:23) Cody Kessler pass to the right to Andrew Hawkins for 22 yards to the Ten5. Tackled by Avery Williamson.","(3:05) Cody Kessler pass to the right to Ricardo Louis for 7 yards to the Ten27. Tackled by Perrish Cox.","(3:05) Penalty: False Start on Cleveland (Austin Pasztor) -5 yards.","(3:05) Cleveland Browns timeout.","(3:11) Cody Kessler incomplete pass to the right intended for Ricardo Louis.","(3:42) Cody Kessler pass to the right to Gary Barnidge for 3 yards to the Ten29. Tackled by Kevin Byard.","(3:49) Cody Kessler pass to the right to Andrew Hawkins for 16 yards to the Ten32. Tackled by Brice McCain.","(4:34) Cody Kessler sacked at Ten48 for a loss of 2 yards by Sean Spence.","(5:01) Duke Johnson Jr. rush up the middle for 6 yards to the Ten46. Tackled by Sean Spence.","(5:48) Cody Kessler pass to the right to Terrelle Pryor Sr. for 14 yards to the Cle48. Tackled by Daimion Stafford.","(5:52) Cody Kessler incomplete pass to the left intended for Terrelle Pryor Sr. defensed by Jason McCourty.","(6:39) Cody Kessler pass to the left to Terrelle Pryor Sr. for 9 yards to the Cle34. Tackled by Jason McCourty.","(6:43) Cody Kessler incomplete pass to the left intended for Duke Johnson Jr..","(6:43) Ryan Succop kicks off to the endzone. Touchback.","(6:43) Ryan Succop extra point is good.","(6:54) Marcus Mariota pass to the left to Anthony Fasano for 15 yards for a TOUCHDOWN.","(7:39) DeMarco Murray rush to the left for no gain to the Cle15. Tackled by Cam Johnson and Christian Kirksey.","(8:20) Marcus Mariota pass to the left to Kendall Wright for 11 yards to the Cle15. Tackled by Tyrone Holmes and Tramon Williams.","(9:00) DeMarco Murray rush to the right for a loss of 1 yard to the Cle26. Tackled by Gabe Wright and Ibraheim Campbell.","(9:34) DeMarco Murray rush to the right for 3 yards to the Cle25. Tackled by Stephen Paea.","(10:06) Marcus Mariota pass to the left to Kendall Wright for 4 yards to the Cle28. Tackled by Tramon Williams.","(10:46) DeMarco Murray rush to the right for 4 yards to the Cle32. Tackled by Christian Kirksey.","(11:24) DeMarco Murray rush up the middle for 4 yards to the Cle36. Tackled by Jamie Meder.","(11:55) Marcus Mariota pass to the right to Kendall Wright for 13 yards to the Cle40. Tackled by Briean Boddy-Calhoun.","(12:34) DeMarco Murray rush up the middle for 2 yards to the Ten47. Tackled by Christian Kirksey and Stephen Paea.","(13:12) DeMarco Murray rush up the middle for 4 yards to the Ten45. Tackled by Danny Shelton.","(13:42) Marcus Mariota pass to the right to Delanie Walker for 21 yards to the Ten41.","(13:51) Britton Colquitt punts for 65 yards to Ten0. Touchback.","(13:57) Cody Kessler incomplete pass to the middle intended for Ricardo Louis.","(14:03) Cody Kessler incomplete pass to the left intended for Terrelle Pryor Sr. defensed by Jason McCourty.","(14:45) Cody Kessler sacked at Cle35 for a loss of 5 yards by Avery Williamson.","(15:00) Marcus Mariota pass intended for Kendall Wright INTERCEPTED by Tramon Williams. No return. Tackled by Kendall Wright.","(0:43) Derrick Henry rush up the middle for 4 yards to the Cle49. Tackled by Christian Kirksey and Emmanuel Ogbah.","(1:13) Derrick Henry rush to the left for 3 yards to the Ten47. Tackled by Tracy Howard.","(1:21) Britton Colquitt punts for 47 yards to Ten44. No return.","(2:04) Duke Johnson Jr. rush up the middle for 6 yards to the Cle9. Tackled by Karl Klug and Rashad Johnson.","(2:24) Penalty: Delay of Game on Cleveland (Cody Kessler) -2 yards.","(2:54) Penalty: False Start on Cleveland (Andrew Hawkins) -5 yards.","(3:36) Cody Kessler pass to the left to Terrelle Pryor Sr. for 4 yards to the Cle10. Tackled by Jason McCourty.","(4:13) Isaiah Crowell rush up the middle for no gain to the Cle6. Tackled by Daimion Stafford.","(4:22) Brett Kern punts for 46 yards to Cle6. No return.","(5:04) Marcus Mariota pass to the left to Derrick Henry for 8 yards to the Ten48. Tackled by Demario Davis.","(5:41) Marcus Mariota rush to the right for 2 yards to the Ten40. Tackled by Demario Davis.","(6:26) Marcus Mariota sacked at Ten38 for a loss of 4 yards by Emmanuel Ogbah.","(7:11) DeMarco Murray rush to the right for 7 yards to the Ten42. Tackled by Demario Davis and Corey Lemonier.","(7:50) DeMarco Murray rush to the left for 8 yards to the Ten35. Tackled by Tracy Howard.","(8:01) Britton Colquitt punts for 52 yards to Ten19. Marc Mariani return for 8 yards to Ten27. Tackled by Tracy Howard.","(8:47) Cody Kessler pass to the middle to Duke Johnson Jr. for 13 yards to the Cle29. Tackled by Brice McCain and Avery Williamson.","(8:51) Cody Kessler incomplete pass to the right intended for Ricardo Louis defensed by Jurrell Casey.","(9:33) Cody Kessler sacked at Cle16 for a loss of 9 yards by Brian Orakpo.","(9:33) Ryan Succop kicks off to the endzone. Touchback.","(9:33) Ryan Succop extra point is good.","(9:36) DeMarco Murray rush to the left for 3 yards for a TOUCHDOWN.","(10:21) Marcus Mariota rush to the right for 7 yards to the Cle3. Tackled by Briean Boddy-Calhoun.","(10:59) Marcus Mariota rush to the right for 7 yards to the Cle10. Tackled by Demario Davis.","(11:39) Tajae Sharpe rush up the middle for 1 yard to the Cle17. Tackled by Briean Boddy-Calhoun.","(12:07) Marcus Mariota pass to the left to Rishard Matthews for 43 yards to the Cle18.","(12:33) Marcus Mariota pass to the right to Phillip Supernaw for 17 yards to the Cle46. Tackled by Briean Boddy-Calhoun. Penalty: Unnecessary Roughness on Tennessee (Delanie Walker) -15 yards.","(13:09) DeMarco Murray rush to the left for 7 yards to the Ten37. Tackled by Tracy Howard and Emmanuel Ogbah.","(13:21) Britton Colquitt punts for 54 yards to Ten20. Marc Mariani return for 10 yards to Ten30. Tackled by Tank Carder.","(13:25) Cody Kessler incomplete pass to the left intended for Gary Barnidge.","(14:07) Isaiah Crowell rush to the left for 2 yards to the Cle26. Tackled by Karl Klug and Avery Williamson.","(14:40) Isaiah Crowell rush up the middle for 11 yards to the Cle24. Tackled by Sean Spence.","(15:00) Penalty: Face Mask on Cleveland (Cameron Erving) -12 yards.","(15:00) Ryan Succop kicks off to the endzone. Touchback.","(0:02) 58 yard field goal attempt by Ryan Succop is NO GOOD. Holder: Brett Kern.","(0:07) Marcus Mariota pass to the left to Kendall Wright for 7 yards to the Cle40.","(0:13) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(0:20) Marcus Mariota pass to the left to Rishard Matthews for 16 yards to the Cle47. Tackled by Tramon Williams.","(0:25) Penalty: Offside on Cleveland (Tyrone Holmes) 5 yards.","(0:29) Marcus Mariota incomplete pass to the right intended for DeMarco Murray.","(0:35) Penalty: Holding on Tennessee (Josh Kline) -10 yards.","(0:40) Marcus Mariota pass to the right to Kendall Wright for 17 yards to the Ten42.","(0:40) Cody Parkey kicks off to the endzone. Touchback.","(0:40) Cody Parkey extra point is good.","(0:47) Cody Kessler pass to the right to Terrelle Pryor Sr. for 7 yards for a TOUCHDOWN.","(0:47) Cleveland Browns timeout.","(1:25) Cody Kessler pass to the left to Terrelle Pryor Sr. for 4 yards to the Ten7. Tackled by Jason McCourty.","(1:47) Cody Kessler pass to the right to Gary Barnidge for 13 yards to the Ten11. Tackled by Avery Williamson.","(1:54) Cody Kessler pass to the left to Duke Johnson Jr. for 7 yards to the Ten24. Tackled by Da'Norris Searcy.","(2:00) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr. defensed by Perrish Cox.","(2:00) Two Minute Warning.","(2:26) Cody Kessler pass to the right to Ricardo Louis for 42 yards to the Ten31. Tackled by Perrish Cox.","(2:58) Cody Kessler pass to the right to Ricardo Louis for 10 yards to the Cle27. Tackled by Perrish Cox.","(3:24) Penalty: False Start on Cleveland (Ricardo Louis) -5 yards.","(4:05) Cody Kessler pass to the right to Isaiah Crowell for 11 yards to the Cle22. Tackled by Kevin Byard.","(4:29) Duke Johnson Jr. rush up the middle for 5 yards to the Cle11. Tackled by Wesley Woodyard.","(4:39) Brett Kern punts for 52 yards to Cle11. No return. Penalty: Holding on Cleveland (Tracy Howard) -5 yards.","(5:17) Marcus Mariota pass to the right to Derrick Henry for 12 yards to the Ten37. Tackled by Tramon Williams and Briean Boddy-Calhoun.","(5:53) DeMarco Murray rush to the left for 5 yards to the Ten25. Tackled by Gabe Wright.","(6:33) Marcus Mariota sacked at Ten20 for a loss of 10 yards by Danny Shelton.","(6:49) Britton Colquitt punts for 45 yards to Ten44. Marc Mariani return for 1 yard to Ten45. Tackled by Tank Carder. Penalty: Illegal Block on Tennessee (Antonio Andrews) -15 yards.","(6:55) Cody Kessler incomplete pass to the left intended for Gary Barnidge defensed by Jason McCourty.","(7:38) Isaiah Crowell rush to the left for 3 yards to the Cle11. Tackled by Avery Williamson.","(7:45) Cody Kessler incomplete pass to the left intended for Andrew Hawkins.","(7:52) Brett Kern punts for 29 yards to Cle8. No return.","(7:59) Marcus Mariota incomplete pass to the right intended for Delanie Walker.","(8:03) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe defensed by Demario Davis.","(8:43) DeMarco Murray rush up the middle for 3 yards to the Cle37. Tackled by Danny Shelton.","(9:14) Penalty: Illegal Shift on Tennessee -5 yards.","(10:01) DeMarco Murray rush up the middle for 16 yards to the Cle35. Tackled by Ibraheim Campbell.","(10:11) Britton Colquitt punts for 44 yards to Ten45. Marc Mariani return for 4 yards to Ten49. Tackled by Jordan Poyer.","(10:19) Penalty: Face Mask on Cleveland (Christian Kirksey) -10 yards.","(10:27) Cody Kessler incomplete pass to the right intended for Ricardo Louis defensed by Perrish Cox.","(11:09) Isaiah Crowell rush to the left for 1 yard to the Cle21. Tackled by Brian Orakpo.","(11:45) Terrelle Pryor Sr. pass to the right to Ricardo Louis for 1 yard to the Cle20. Tackled by Perrish Cox.","(11:51) Ryan Succop kicks off to the Cle0. George Atkinson III return for 19 yards to Cle19. Tackled by Nate Palmer.","(11:51) Ryan Succop extra point is good.","(12:02) Marcus Mariota pass to the left to Kendall Wright for 48 yards for a TOUCHDOWN.","(12:46) Marcus Mariota pass to the right to Phillip Supernaw for 8 yards to the Cle48. Tackled by Briean Boddy-Calhoun.","(13:26) DeMarco Murray rush to the right for 2 yards to the Ten44. Tackled by Jamie Meder.","(14:07) Marcus Mariota rush up the middle for 1 yard to the Ten42. Tackled by Demario Davis.","(14:19) Britton Colquitt punts for 49 yards to Ten34. Marc Mariani return for 7 yards to Ten41. Tackled by Joe Schobert and Dominique Alexander.","(15:00) Cody Kessler sacked at Cle17 for a loss of 10 yards by Jurrell Casey.","(0:16) Isaiah Crowell rush to the right for 1 yard to the Cle27. Tackled by David Bass.","(0:39) Cody Kessler pass to the right to Terrelle Pryor Sr. for 4 yards to the Cle26. Tackled by Perrish Cox.","(0:52) Brett Kern punts for 51 yards to Cle16. Duke Johnson Jr. return for 6 yards to Cle22. Tackled by Antonio Andrews.","(0:55) Marcus Mariota incomplete pass to the left intended for DeMarco Murray.","(1:28) Marcus Mariota pass to the left to Kendall Wright for 7 yards to the Ten33. Tackled by Jamar Taylor.","(2:08) DeMarco Murray rush to the left for 1 yard to the Ten26. Tackled by Danny Shelton.","(2:08) Cody Parkey kicks off to the endzone. Touchback.","(2:12) Cody Parkey 37 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(2:55) Isaiah Crowell rush to the left for a loss of 5 yards to the Ten18. Tackled by Karl Klug.","(3:32) Cody Kessler pass to the right to Isaiah Crowell for 9 yards to the Ten13. Tackled by Avery Williamson.","(4:12) Isaiah Crowell rush up the middle for no gain to the Ten22. Tackled by Kevin Byard.","(4:38) Cody Kessler pass to the right to Terrelle Pryor Sr. for 12 yards to the Ten22. Tackled by Perrish Cox.","(5:18) Terrelle Pryor Sr. rush to the right for 3 yards to the Ten34. Tackled by Kevin Dodd.","(5:24) Penalty: Pass Interference on Tennessee (Jason McCourty) 39 yards.","(6:05) Cody Kessler pass to the left to Andrew Hawkins for 10 yards to the Cle24. Tackled by Wesley Woodyard.","(6:42) Cody Kessler pass to the left to Duke Johnson Jr. for 8 yards to the Cle14. Tackled by Jason McCourty and Avery Williamson.","(7:01) Penalty: Illegal Formation on Cleveland (Austin Pasztor) -5 yards.","(7:18) Brett Kern punts for 47 yards to Cle21. Duke Johnson Jr. - no return. Tackled by Jalston Fowler. Penalty: Illegal Block on Cleveland (Jamar Taylor) -10 yards.","(7:24) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe defensed by Jamar Taylor.","(8:06) DeMarco Murray rush to the left for no gain to the Ten32. Tackled by Ibraheim Campbell.","(8:47) Marcus Mariota rush to the right for 7 yards to the Ten32. Tackled by Briean Boddy-Calhoun.","(8:47) Cody Parkey kicks off to the endzone. Touchback.","(8:52) Cody Parkey 45 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(8:57) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr. defensed by Perrish Cox.","(9:31) Cody Kessler pass to the left to Ricardo Louis for 5 yards to the Ten27. Tackled by Jason McCourty.","(9:56) Cody Kessler sacked at Ten32 for no gain by Wesley Woodyard.","(10:37) Cody Kessler pass to the left to Gary Barnidge for 43 yards to the Ten32. Tackled by Da'Norris Searcy.","(10:37) Ryan Succop kicks off to the endzone. Touchback.","(10:37) Ryan Succop extra point is good.","(10:42) Marcus Mariota pass to the left to Rishard Matthews for 11 yards for a TOUCHDOWN.","(11:23) DeMarco Murray rush to the left for no gain to the Cle11. Tackled by Jamie Meder and Demario Davis.","(11:52) DeMarco Murray rush to the left for a loss of 3 yards to the Cle11. Tackled by Christian Kirksey.","(12:19) Penalty: Illegal Use of Hands on Cleveland (Cam Johnson) 5 yards.","(12:19) Tennessee Titans timeout.","(12:55) Marcus Mariota pass to the left to Kendall Wright for 26 yards to the Cle13. Tackled by Jordan Poyer.","(13:40) DeMarco Murray rush to the right for a loss of 3 yards to the Cle39. Tackled by Demario Davis.","(14:18) DeMarco Murray rush to the left for 3 yards to the Cle36. Tackled by Danny Shelton.","(14:22) Penalty: Illegal Formation on Tennessee -5 yards.","(15:00) Marcus Mariota rush to the left for 41 yards to the Cle34. Tackled by Jordan Poyer.","(15:00) Cody Parkey kicks off to the endzone. Touchback."]