["(0:49) Matthew Stafford rush up the middle for a loss of 2 yards to the Det43.","(1:01) Matthew Stafford rush up the middle for no gain to the Det45.","(1:09) Case Keenum pass intended for Lance Kendricks INTERCEPTED by Rafael Bush. No return.","(1:29) Case Keenum pass to the right to Brian Quick for 4 yards to the LA29. Tackled by Rafael Bush.","(1:29) Sam Martin kicks off to the endzone. Touchback.","(1:33) Matt Prater 34 yard field goal attempt is GOOD. Holder: Sam Martin.","(1:33) Detroit Lions timeout.","(1:33) Los Angeles Rams timeout.","(1:47) Matthew Stafford pass to the left to Golden Tate for 12 yards to the LA17. Tackled by Lamarcus Joyner.","(1:47) Los Angeles Rams timeout.","(1:54) Matthew Stafford pass to the right to Golden Tate for 2 yards to the LA29. Tackled by Lamarcus Joyner.","(1:54) Los Angeles Rams timeout.","(2:00) Matthew Stafford sacked at LA31 for a loss of 5 yards by Aaron Donald.","(2:00) Two Minute Warning.","(2:19) Zach Zenner rush to the right for 8 yards to the LA26. Tackled by Cam Thomas.","(3:02) Zach Zenner rush up the middle for 7 yards to the LA34. Tackled by Troy Hill and Alec Ogletree.","(3:46) Matthew Stafford pass to the left to Anquan Boldin for 11 yards to the LA41. Tackled by E.J. Gaines.","(4:30) Zach Zenner rush to the left for 2 yards to the Det48. Tackled by Mark Barron.","(5:06) Matthew Stafford pass to the left to Anquan Boldin for 7 yards to the Det46. Tackled by Lamarcus Joyner.","(5:13) Johnny Hekker punts for 40 yards to Det35. Andre Roberts return for 4 yards to Det39. Tackled by Chase Reynolds.","(5:13) Penalty: False Start on Los Angeles (Cody Davis) -5 yards.","(5:17) Case Keenum incomplete pass to the right intended for Kenny Britt defensed by Darius Slay.","(5:59) Todd Gurley rush up the middle for 5 yards to the LA30. Tackled by Tahir Whitehead.","(6:02) Case Keenum incomplete pass to the right intended for Lance Kendricks defensed by Devin Taylor.","(6:02) Sam Martin kicks off to the endzone. Touchback.","(6:02) Matt Prater extra point is good.","(6:09) Matthew Stafford pass to the left to Golden Tate for 23 yards for a TOUCHDOWN.","(6:57) Zach Zenner rush to the right for a loss of 3 yards to the LA23. Tackled by Lamarcus Joyner and T.J. McDonald.","(7:45) Matthew Stafford rush to the left for 5 yards to the LA20. Tackled by Alec Ogletree.","(8:24) Matthew Stafford pass to the right to Clay Harbor for 3 yards to the LA25. Tackled by Mark Barron.","(9:08) Marvin Jones Jr. rush to the right for 3 yards to the LA28. Tackled by Alec Ogletree and T.J. McDonald.","(9:13) Penalty: Delay of Game on Detroit (Matthew Stafford) -5 yards. Penalty: Pass Interference on Los Angeles (Maurice Alexander) 17 yards.","(10:16) Justin Forsett rush up the middle for 3 yards to the LA43. Tackled by Aaron Donald.","(10:22) Matthew Stafford incomplete pass to the left intended for Justin Forsett.","(11:03) Matthew Stafford pass to the left to Golden Tate for 13 yards to the LA46. Tackled by Lamarcus Joyner.","(11:50) Justin Forsett rush to the right for no gain to the Det41. Tackled by Aaron Donald.","(12:37) Zach Zenner rush to the left for 19 yards to the Det41. Tackled by Lamarcus Joyner and Mark Barron.","(13:04) Matthew Stafford pass to the left to Andre Roberts for 11 yards to the Det32. Tackled by E.J. Gaines. Penalty: Holding on Detroit (Travis Swanson) -10 yards.","(13:58) Matthew Stafford incomplete pass to the left intended for Golden Tate. Penalty: Offside on Los Angeles (Dominique Easley) 5 yards.","(14:05) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(14:09) Greg Zuerlein kicks off to the Det-1. Andre Roberts return for 17 yards to Det16. Tackled by Mark Barron.","(14:09) Greg Zuerlein extra point is good.","(14:16) Case Keenum pass to the right to Kenny Britt for 9 yards for a TOUCHDOWN.","(15:00) Todd Gurley rush to the left for no gain to the Det9. Tackled by Anthony Zettel.","(0:24) Todd Gurley rush to the left for 8 yards to the Det9. Tackled by Anthony Zettel.","(1:00) Case Keenum pass to the middle to Tavon Austin for 12 yards to the Det17. Tackled by Nevin Lawson.","(1:48) Case Keenum pass to the right to Brian Quick for 19 yards to the Det29. Tackled by Glover Quin.","(2:27) Benny Cunningham rush to the right for 8 yards to the Det48. Tackled by Khyri Thornton.","(3:03) Case Keenum pass to the right to Kenny Britt for 6 yards to the LA44. Tackled by Quandre Diggs.","(3:47) Todd Gurley rush to the left for 3 yards to the LA38. Tackled by Kerry Hyder.","(4:19) Case Keenum pass to the right to Lance Kendricks for 2 yards to the LA35. Tackled by Tahir Whitehead.","(4:56) Case Keenum pass to the left to Brian Quick for 13 yards to the LA33. Tackled by Glover Quin.","(5:07) Sam Martin punts for 56 yards to LA18. Tavon Austin return for 2 yards to LA20. Tackled by Thurston Armbrister.","(5:15) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by Lamarcus Joyner.","(5:59) Matthew Stafford pass to the left to Zach Zenner for 4 yards to the Det26. Tackled by Lamarcus Joyner and Alec Ogletree.","(6:33) Zach Zenner rush up the middle for a loss of 3 yards to the Det22. Tackled by Aaron Donald.","(6:33) Greg Zuerlein kicks off to the endzone. Touchback.","(6:33) Greg Zuerlein extra point is good.","(6:39) Case Keenum pass to the left to Lance Kendricks for 15 yards for a TOUCHDOWN.","(7:17) Todd Gurley rush up the middle for no gain to the Det15. Tackled by Anthony Zettel.","(7:45) Case Keenum pass to the left to Todd Gurley for 5 yards to the Det15. Tackled by Kyle Van Noy.","(8:28) Case Keenum rush to the left for 4 yards to the Det20. Tackled by Kyle Van Noy.","(9:17) Case Keenum pass to the right to Lance Kendricks for 4 yards to the Det24. Tackled by Thurston Armbrister.","(9:50) Los Angeles Rams timeout.","(9:50) Case Keenum pass to the left to Kenny Britt for 47 yards to the Det28. Tackled by Johnson Bademosi.","(9:50) Sam Martin kicks off to the endzone. Touchback.","(9:50) Matt Prater extra point is good.","(9:52) Matthew Stafford pass to the left to Anquan Boldin for 4 yards for a TOUCHDOWN.","(10:35) Zach Zenner rush to the right for a loss of 3 yards to the LA4. Tackled by Alec Ogletree.","(10:57) Matthew Stafford pass to the left to Golden Tate for 61 yards to the LA1. Tackled by Troy Hill.","(11:41) Matthew Stafford rush to the right for 4 yards to the Det38. Tackled by E.J. Gaines.","(12:07) Justin Forsett rush to the right for a loss of 6 yards to the Det34. Tackled by Josh Forrest.","(12:14) Johnny Hekker punts for 54 yards to Det40. No return.","(12:48) Benny Cunningham rush to the right for 1 yard to the LA6. Tackled by Armonty Bryant and Tahir Whitehead.","(13:08) Penalty: False Start on Los Angeles (Greg Robinson) -5 yards.","(13:31) Penalty: False Start on Los Angeles (Tavon Austin) -5 yards.","(14:13) Case Keenum pass to the left to Lance Kendricks for 6 yards to the LA15. Tackled by Tahir Whitehead.","(14:53) Todd Gurley rush up the middle for a loss of 1 yard to the LA9. Tackled by Kerry Hyder.","(15:00) Sam Martin kicks off to the LA-2. Benny Cunningham return for 22 yards to LA20. Tackled by Quandre Diggs. Penalty: Holding on Los Angeles (Eugene Sims) -10 yards.","(0:04) Todd Gurley rush up the middle for a loss of 1 yard to the Det2. Tackled by Tyrunn Walker and Stefan Charles.","(0:04) Los Angeles Rams timeout.","(0:45) Case Keenum pass to the right to Kenny Britt for 6 yards to the Det1. Tackled by Glover Quin and Rafael Bush.","(0:45) Detroit Lions timeout.","(0:49) Case Keenum pass to the right to Todd Gurley for 8 yards to the Det7. Tackled by Tahir Whitehead.","(0:49) Detroit Lions timeout.","(0:52) Tavon Austin rush to the right for a loss of 6 yards to the Det15. Tackled by Kerry Hyder.","(0:57) Penalty: Unnecessary Roughness on Detroit (Glover Quin) 10 yards.","(0:57) Detroit Lions timeout.","(1:06) Case Keenum sacked at Det19 for a loss of 10 yards by Devin Taylor. FUMBLE, recovered by LA (Case Keenum).","(1:09) Penalty: Pass Interference on Detroit (Nevin Lawson) 22 yards.","(1:20) Case Keenum pass to the left to Kenny Britt for 43 yards to the Det31. Tackled by Darius Slay.","(1:26) Penalty: Holding on Los Angeles (Greg Robinson) -10 yards.","(1:56) Case Keenum pass to the middle to Lance Kendricks for 7 yards to the LA36. Tackled by Rafael Bush.","(2:00) Case Keenum pass to the right to Benny Cunningham for 5 yards to the LA29. Tackled by Nevin Lawson.","(2:00) Two Minute Warning.","(2:32) Tavon Austin rush to the right for no gain to the LA24. Tackled by A'Shawn Robinson.","(3:03) Todd Gurley rush to the right for 6 yards to the LA24. Tackled by Devin Taylor.","(3:07) Sam Martin kicks off to the LA1. Benny Cunningham return for 17 yards to LA18. Tackled by Thurston Armbrister.","(3:07) Matt Prater extra point is good.","(3:12) Matthew Stafford pass to the right to Andre Roberts for 2 yards for a TOUCHDOWN.","(3:12) Matthew Stafford incomplete pass to the left intended for Anquan Boldin.","(3:19) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(3:58) Matthew Stafford pass to the middle to Anquan Boldin for 2 yards to the LA2. Tackled by Matt Longacre.","(4:40) Matthew Stafford pass to the right to Anquan Boldin for 15 yards to the LA4. Tackled by T.J. McDonald and Alec Ogletree.","(5:25) Zach Zenner rush to the left for 7 yards to the LA19. Tackled by Lamarcus Joyner.","(6:04) Matthew Stafford pass to the right to Anquan Boldin for 6 yards to the LA26. Tackled by E.J. Gaines and Mark Barron.","(6:49) Zach Zenner rush up the middle for 6 yards to the LA32. Tackled by E.J. Gaines.","(7:34) Matthew Stafford pass to the left to Golden Tate for 8 yards to the LA38. Tackled by Troy Hill and Mark Barron.","(8:20) Matthew Stafford pass to the left to Zach Zenner for 15 yards to the LA46. Tackled by Troy Hill.","(9:00) Matthew Stafford pass to the left to Marvin Jones Jr. for 3 yards to the Det39. Tackled by William Hayes.","(9:23) Penalty: False Start on Detroit (Graham Glasgow) -5 yards.","(10:00) Golden Tate rush to the left for 3 yards to the Det41. Tackled by Troy Hill.","(10:25) Matthew Stafford pass to the left to Golden Tate for 12 yards to the Det38. Tackled by Troy Hill.","(11:01) Zach Zenner rush to the left for 1 yard to the Det26. Tackled by Troy Hill.","(11:01) Greg Zuerlein kicks off to the endzone. Touchback.","(11:01) Greg Zuerlein extra point is good.","(11:03) Case Keenum rush to the right for 1 yard for a TOUCHDOWN.","(11:42) Case Keenum pass to the left to Todd Gurley for 13 yards to the Det1. Tackled by Tahir Whitehead.","(11:42) Los Angeles Rams timeout.","(12:19) Tavon Austin rush to the right for 8 yards to the Det14. Tackled by Khyri Thornton.","(12:58) Case Keenum pass to the middle to Bradley Marquez for 13 yards to the Det22. Tackled by Tavon Wilson and Tahir Whitehead.","(13:41) Todd Gurley rush up the middle for 6 yards to the Det35. Tackled by Anthony Zettel.","(14:20) Case Keenum rush to the right for 2 yards to the Det41. Tackled by Kyle Van Noy.","(14:57) Case Keenum pass to the right to Benny Cunningham for 9 yards to the Det43. Tackled by Kyle Van Noy.","(15:00) Case Keenum incomplete pass to the right intended for Tavon Austin.","(0:39) Case Keenum pass to the right to Brian Quick for 16 yards to the LA48. Tackled by Quandre Diggs.","(1:19) Todd Gurley rush to the left for 3 yards to the LA32. Tackled by Thurston Armbrister.","(1:52) Case Keenum pass to the left to Todd Gurley for 13 yards to the LA29. Tackled by Tahir Whitehead.","(1:59) Sam Martin punts for 48 yards to LA16. No return.","(2:34) Zach Zenner rush to the right for a loss of 2 yards to the Det36. Tackled by Josh Forrest.","(2:38) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(3:26) Justin Forsett rush up the middle for 9 yards to the Det38. Tackled by T.J. McDonald and Troy Hill.","(3:55) Penalty: Holding on Los Angeles (Ethan Westbrooks) 5 yards.","(4:19) Penalty: False Start on Detroit (Taylor Decker) -5 yards.","(4:38) Justin Forsett rush to the left for a loss of 1 yard to the Det29. Tackled by Alec Ogletree.","(5:09) Matthew Stafford pass to the right to Anquan Boldin for 7 yards to the Det30. Tackled by Lamarcus Joyner.","(5:09) Penalty: False Start on Detroit (Corey Robinson) -5 yards.","(5:15) Greg Zuerlein kicks off to the Det1. Andre Roberts return for 27 yards to Det28. Tackled by Josh Forrest.","(5:15) Greg Zuerlein extra point is good.","(5:24) Case Keenum pass to the right to Kenny Britt for 20 yards for a TOUCHDOWN.","(5:56) Case Keenum pass to the right to Kenny Britt for 5 yards to the Det20. Tackled by Darius Slay.","(6:33) Todd Gurley rush up the middle for 2 yards to the Det25. Tackled by Kyle Van Noy.","(7:12) Case Keenum pass to the middle to Brian Quick for 9 yards to the Det27. Tackled by Quandre Diggs.","(7:16) Case Keenum incomplete pass to the right intended for Lance Kendricks defensed by A'Shawn Robinson.","(8:01) Todd Gurley rush to the right for 7 yards to the Det36. Tackled by Tavon Wilson.","(8:47) Todd Gurley rush up the middle for 5 yards to the Det43. Tackled by Tahir Whitehead.","(9:24) Case Keenum pass to the left to Tavon Austin for 15 yards to the Det48. Tackled by Glover Quin.","(10:09) Case Keenum pass to the right to Tavon Austin for a loss of 3 yards to the LA37. Tackled by Quandre Diggs.","(10:44) Todd Gurley rush to the left for 15 yards to the LA40. Tackled by Tavon Wilson.","(10:44) Sam Martin kicks off to the endzone. Touchback.","(10:44) Matt Prater extra point is good.","(10:47) Matthew Stafford pass to the left to Marvin Jones Jr. for 7 yards for a TOUCHDOWN.","(11:36) Matthew Stafford pass to the right to Golden Tate for 34 yards to the LA7. Tackled by Maurice Alexander.","(12:18) Matthew Stafford pass to the middle to Anquan Boldin for 8 yards to the LA41. Tackled by Alec Ogletree.","(13:02) Zach Zenner rush to the right for 2 yards to the LA49. Tackled by Mark Barron.","(13:46) Matthew Stafford rush up the middle for 7 yards to the Det49. Tackled by Alec Ogletree.","(14:18) Zach Zenner rush up the middle for 2 yards to the Det42. Tackled by Michael Brockers.","(14:22) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr. defensed by Michael Brockers.","(15:00) Zach Zenner rush up the middle for 15 yards to the Det40. Tackled by Lamarcus Joyner.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback."]