["(0:05) Cam Newton pass to the right to Kelvin Benjamin for 5 yards to the Car30. Lateral to Corey Brown for 5 yards to the Car35. Tackled by Nate Stupar. FUMBLE, recovered by NO (Craig Robertson) and returned for 5 yards. Tackled by Fozzy Whittaker.","(0:11) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by B.W. Webb.","(0:11) Wil Lutz kicks off to the endzone. Touchback.","(0:16) Wil Lutz 52 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(0:16) Carolina Panthers timeout.","(0:26) Drew Brees pass to the left to Brandin Cooks for 6 yards to the Car34. Tackled by Zack Sanchez and Charles Johnson.","(0:29) Drew Brees incomplete pass to the middle intended for Willie Snead defensed by Shaq Thompson.","(0:52) Drew Brees pass to the right to Coby Fleener for 3 yards to the Car40. Tackled by Thomas Davis.","(0:52) Carolina Panthers timeout.","(0:57) Drew Brees pass to the right to Travaris Cadet for 4 yards to the Car43. Tackled by Luke Kuechly.","(1:22) Drew Brees pass to the left to Travaris Cadet for 7 yards to the Car47. Tackled by Thomas Davis.","(1:29) Drew Brees pass to the left to Michael Thomas for 7 yards to the NO46. Tackled by Tre Boston.","(1:54) Drew Brees pass to the left to Coby Fleener for 4 yards to the NO39. Tackled by Shaq Thompson.","(2:00) Drew Brees pass to the right to Travaris Cadet for 9 yards to the NO35. Tackled by Teddy Williams.","(2:00) Two Minute Warning.","(2:18) Drew Brees pass to the right to Willie Snead for 6 yards to the NO26. Tackled by Thomas Davis and Kawann Short.","(2:58) Drew Brees sacked at NO20 for a loss of 5 yards by Charles Johnson and Mario Addison.","(2:58) Graham Gano kicks off to the endzone. Touchback.","(2:58) Cam Newton 2 pt conversion pass to Devin Funchess is GOOD.","(3:04) Cam Newton rush to the right for 2 yards for a TOUCHDOWN.","(3:10) Penalty: Pass Interference on New Orleans (Brian Dixon) 33 yards.","(3:52) Mike Tolbert rush to the left for 6 yards to the NO35. Tackled by Jairus Byrd and Craig Robertson.","(4:35) Mike Tolbert rush to the left for 4 yards to the NO41. Tackled by Vonn Bell.","(4:57) Cam Newton pass to the middle to Greg Olsen for 13 yards to the NO45. Tackled by Kenny Vaccaro and Nate Stupar.","(5:32) Cam Newton pass to the middle to Kelvin Benjamin for 6 yards to the Car42. Tackled by Craig Robertson.","(6:00) Cam Newton pass to the right to Kelvin Benjamin for 14 yards to the Car36. Tackled by Vonn Bell.","(6:02) Wil Lutz kicks off to the Car9. Ted Ginn Jr. return for 13 yards to Car22. Tackled by Roman Harper.","(6:02) Wil Lutz extra point is good.","(6:02) New Orleans Saints timeout.","(6:02) Drew Brees pass to the left to Josh Hill for 8 yards for a TOUCHDOWN. Penalty: Roughing Passer on Carolina (Kawann Short) 15 yards.","(6:49) Mark Ingram rush to the right for 2 yards to the Car8. Tackled by Luke Kuechly.","(7:16) Mark Ingram rush to the right for 5 yards to the Car10. Tackled by Kurt Coleman and Shaq Thompson.","(7:49) Drew Brees pass to the left to Brandin Cooks for 49 yards to the Car15. Tackled by Kurt Coleman.","(7:56) Drew Brees incomplete pass to the left intended for Brandon Coleman.","(8:29) Drew Brees pass to the right to Willie Snead for 4 yards to the NO36. Tackled by Teddy Williams.","(9:07) Mark Ingram rush to the left for 2 yards to the NO32. Tackled by Shaq Thompson.","(9:38) Drew Brees pass to the right to Mark Ingram for 5 yards to the NO30. Tackled by Charles Johnson.","(9:38) Graham Gano kicks off to the endzone. Touchback.","(9:38) Graham Gano extra point is NO GOOD.","(9:43) Jonathan Stewart rush to the left for 1 yard for a TOUCHDOWN.","(10:13) Jonathan Stewart rush to the left for 2 yards to the NO1. Tackled by David Onyemata.","(10:44) Cam Newton pass to the right to Kelvin Benjamin for 16 yards to the NO3. Tackled by Brian Dixon.","(10:49) Cam Newton incomplete pass to the right intended for Ed Dickson defensed by B.W. Webb.","(11:29) Fozzy Whittaker rush to the right for a loss of 1 yard to the NO19. Tackled by Cameron Jordan.","(12:04) Cam Newton pass to the left to Devin Funchess for 11 yards to the NO18. Tackled by Ken Crawley.","(12:09) Cam Newton incomplete pass to the left intended for Jonathan Stewart.","(12:49) Ted Ginn Jr. rush to the left for 1 yard to the NO29. Tackled by Kasim Edebali.","(13:29) Cam Newton pass to the right to Kelvin Benjamin for 20 yards to the NO30. Tackled by B.W. Webb.","(13:41) Drew Brees pass intended for Brandin Cooks INTERCEPTED by Teddy Williams and returned for 19 yards. Tackled by Willie Snead.","(14:17) Drew Brees pass to the right to Michael Thomas for 11 yards to the NO35. Tackled by Luke Kuechly and Shaq Thompson.","(14:45) Drew Brees pass to the left to Brandin Cooks for 11 yards to the NO24. Tackled by Zack Sanchez.","(14:49) Graham Gano kicks off to the NO0. Travaris Cadet return for 13 yards to NO13. Tackled by David Mayo.","(14:49) Graham Gano extra point is good. Penalty: Leverage on New Orleans (Cameron Jordan) 15 yards.","(14:53) Jonathan Stewart rush to the left for 2 yards for a TOUCHDOWN.","(15:00) Penalty: Pass Interference on New Orleans (Sterling Moore) 33 yards.","(0:21) Cam Newton pass to the left to Ed Dickson for 15 yards to the NO35. Tackled by Ken Crawley and Vonn Bell.","(0:53) Jonathan Stewart rush to the right for no gain to the Car50. Tackled by David Onyemata.","(1:07) Thomas Morstead punts for 54 yards to Car39. Ted Ginn Jr. return for 11 yards to Car50. Tackled by Daniel Lasco.","(1:41) Mark Ingram rush to the left for 2 yards to the NO7. Tackled by Kony Ealy.","(2:04) Penalty: Illegal Plyr Downfld on New Orleans (Tony Hills) -5 yards.","(2:07) Drew Brees incomplete pass to the left intended for Willie Snead.","(2:07) Penalty: False Start on New Orleans (Tony Hills) -5 yards.","(2:12) Drew Brees incomplete pass to the middle intended for Josh Hill.","(2:18) Andy Lee punts for 40 yards to NO15. No return.","(2:23) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(3:05) Jonathan Stewart rush to the right for 2 yards to the Car45. Tackled by Craig Robertson and Kenny Vaccaro.","(3:34) Cam Newton pass to the right to Ted Ginn Jr. for 2 yards to the Car43. Tackled by B.W. Webb.","(4:09) Jonathan Stewart rush to the right for 7 yards to the Car41. Tackled by Craig Robertson and Nick Fairley.","(4:49) Cam Newton pass to the right to Greg Olsen for 19 yards to the Car34. Tackled by Vonn Bell.","(4:56) Penalty: Pass Interference on Carolina (Ted Ginn Jr.) -10 yards.","(4:56) Wil Lutz kicks off to the endzone. Touchback.","(4:56) Wil Lutz extra point is good.","(5:04) Drew Brees pass to the middle to Coby Fleener for 50 yards for a TOUCHDOWN.","(5:07) Drew Brees incomplete pass to the middle intended for Mark Ingram.","(5:43) Mark Ingram rush to the right for a loss of 4 yards to the NO50. Tackled by Kawann Short.","(6:19) Drew Brees pass to the left to Michael Thomas for 23 yards to the Car46. Tackled by Kurt Coleman.","(6:49) Mark Ingram rush to the left for 6 yards to the NO31. Tackled by Thomas Davis.","(6:49) Graham Gano kicks off to the endzone. Touchback.","(6:49) Graham Gano extra point is good.","(6:56) Cam Newton pass to the left to Ed Dickson for 1 yard for a TOUCHDOWN.","(7:01) Penalty: Pass Interference on New Orleans (Kenny Vaccaro) 16 yards.","(7:05) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(7:46) Jonathan Stewart rush to the right for 2 yards to the NO17. Tackled by Cameron Jordan.","(7:52) Cam Newton incomplete pass to the right intended for Greg Olsen.","(8:15) Penalty: Too Many Men on Field on New Orleans 5 yards.","(8:46) Cam Newton pass to the left to Kelvin Benjamin for 7 yards to the NO24. Tackled by Ken Crawley.","(8:53) Cam Newton incomplete pass to the middle intended for Kelvin Benjamin.","(9:19) Cam Newton pass to the left to Greg Olsen for 11 yards to the NO31. Tackled by Ken Crawley.","(9:54) Cam Newton pass to the left to Fozzy Whittaker for 4 yards to the NO42. Tackled by David Onyemata.","(10:15) Jonathan Stewart rush to the right for 1 yard to the NO36. Tackled by John Jenkins. Penalty: Holding on Carolina (Chris Scott) -10 yards.","(10:36) Jonathan Stewart rush to the right for 6 yards to the NO37. Tackled by Craig Robertson and Kenny Vaccaro.","(11:12) Jonathan Stewart rush to the left for 6 yards to the NO43. Tackled by John Jenkins.","(11:46) Jonathan Stewart rush to the right for 11 yards to the NO49. Tackled by Vonn Bell and Craig Robertson.","(11:56) Thomas Morstead punts for 48 yards to Car36. Ted Ginn Jr. return for 4 yards to Car40. Tackled by Jake Lampman.","(12:02) Drew Brees incomplete pass to the right intended for Tommylee Lewis.","(12:40) Mark Ingram rush to the left for 2 yards to the NO16. Tackled by Kurt Coleman.","(13:22) Brandin Cooks rush to the right for 2 yards to the NO14. Tackled by Zack Sanchez.","(13:34) Andy Lee punts for 54 yards to NO8. Tommylee Lewis return for 4 yards to NO12. Tackled by Michael Griffin.","(13:45) Cam Newton incomplete pass to the right.","(14:22) Jonathan Stewart rush to the left for 2 yards to the Car38. Tackled by Nate Stupar.","(14:30) Cam Newton incomplete pass to the left intended for Ted Ginn Jr. defensed by Ken Crawley.","(14:58) Cam Newton pass to the right to Ted Ginn Jr. for 11 yards to the Car36. Tackled by Vonn Bell.","(15:00) Cam Newton incomplete pass to the right intended for Ted Ginn Jr. defensed by Cameron Jordan.","(15:00) Wil Lutz kicks off to the endzone. Touchback.","(0:10) Cam Newton rush up the middle for a loss of 1 yard to the Car24.","(0:10) Wil Lutz kicks off to the endzone. Touchback.","(0:15) Wil Lutz 33 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(0:18) Drew Brees incomplete pass to the middle intended for Coby Fleener.","(0:18) Drew Brees incomplete pass to the middle.","(0:32) Drew Brees pass to the left to Brandin Cooks for 6 yards to the Car15. Tackled by Kony Ealy.","(0:38) Drew Brees pass to the right to Willie Snead for 21 yards to the Car21. Tackled by Teddy Williams.","(0:38) New Orleans Saints timeout.","(0:48) Drew Brees pass to the left to Coby Fleener for 5 yards to the Car42. Tackled by Luke Kuechly.","(1:15) Drew Brees pass to the right to Michael Thomas for 28 yards to the Car47. Tackled by Teddy Williams.","(1:15) Graham Gano kicks off to the endzone. Touchback.","(1:15) Graham Gano extra point is good.","(1:19) Cam Newton pass to the right to Devin Funchess for 17 yards for a TOUCHDOWN.","(1:19) Carolina Panthers timeout.","(1:26) Cam Newton incomplete pass to the right intended for Corey Brown.","(1:52) Cam Newton pass to the right to Corey Brown for 18 yards to the NO17. Tackled by Kenny Vaccaro.","(2:00) Cam Newton pass to the left to Greg Olsen for 16 yards to the NO35. Tackled by Ken Crawley.","(2:00) Two Minute Warning.","(2:24) Cam Newton pass to the left to Kelvin Benjamin for 12 yards to the Car49. Tackled by Kenny Vaccaro.","(2:37) Thomas Morstead punts for 48 yards to Car33. Ted Ginn Jr. return for 4 yards to Car37. Tackled by Jake Lampman.","(2:37) Carolina Panthers timeout.","(2:48) Mark Ingram rush to the right for 6 yards to the NO19. Tackled by Teddy Williams and Kurt Coleman.","(2:53) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(2:53) Penalty: False Start on New Orleans (Andrus Peat) -5 yards.","(2:57) Drew Brees incomplete pass to the left intended for Travaris Cadet.","(3:02) Graham Gano kicks off to the NO2. Tim Hightower return for 16 yards to NO18. Tackled by David Mayo.","(3:07) Graham Gano 42 yard field goal attempt is GOOD. Holder: Andy Lee.","(3:12) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by B.W. Webb.","(3:16) Cam Newton incomplete pass to the right intended for Ted Ginn Jr. defensed by B.W. Webb.","(3:23) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(3:46) Cam Newton pass to the right to Ted Ginn Jr. for 18 yards to the NO24. Tackled by Sterling Moore.","(4:11) Cam Newton pass to the right to Greg Olsen for 15 yards to the NO42. Tackled by Craig Robertson.","(4:16) 53 yard field goal attempt by Wil Lutz is NO GOOD. Holder: Thomas Morstead.","(4:16) New Orleans Saints timeout.","(4:57) Mark Ingram rush to the left for no gain to the Car35. Tackled by Kyle Love.","(5:29) Drew Brees pass to the left to Daniel Lasco for 4 yards to the Car35. Tackled by Mario Addison.","(6:08) Daniel Lasco rush to the left for 5 yards to the Car39. Tackled by Luke Kuechly and Thomas Davis.","(6:44) Drew Brees pass to the left to Josh Hill for 15 yards to the Car44. Tackled by Luke Kuechly and Daryl Worley.","(7:16) Daniel Lasco rush to the right for no gain to the NO41. Tackled by Kawann Short.","(7:54) Drew Brees pass to the middle to Willie Snead for 16 yards to the NO41. Tackled by Kony Ealy.","(7:58) Drew Brees incomplete pass to the right intended for Daniel Lasco.","(8:24) Penalty: False Start on New Orleans (Michael Thomas) -4 yards.","(8:59) Drew Brees pass to the right to Tommylee Lewis for 9 yards to the NO29. Tackled by Teddy Williams.","(9:04) Cam Newton pass intended for Devin Funchess INTERCEPTED by Sterling Moore. No return. Touchback.","(9:04) New Orleans Saints timeout.","(9:44) Cam Newton pass to the right to Corey Brown for 10 yards to the NO10. Tackled by Craig Robertson.","(10:19) Jonathan Stewart rush to the right for 4 yards to the NO20. Tackled by Tyeler Davison and Craig Robertson.","(10:52) Cam Newton pass to the left to Ted Ginn Jr. for 8 yards to the NO24. Tackled by Jairus Byrd.","(11:27) Cam Newton pass to the right to Kelvin Benjamin for 6 yards to the NO32. Tackled by Kenny Vaccaro and Craig Robertson.","(11:34) Cam Newton incomplete pass to the middle intended for Kelvin Benjamin defensed by Ken Crawley.","(12:12) Jonathan Stewart rush to the left for 4 yards to the NO38. Tackled by Craig Robertson.","(12:38) Penalty: Encroachment on New Orleans (John Jenkins) 5 yards.","(13:11) Mike Tolbert rush to the right for 2 yards to the NO47. Tackled by Cameron Jordan and Kenny Vaccaro.","(13:47) Jonathan Stewart rush to the right for 26 yards to the NO49. Tackled by Vonn Bell and Sterling Moore.","(13:47) Wil Lutz kicks off to the endzone. Touchback.","(13:47) Wil Lutz extra point is good.","(13:52) Drew Brees pass to the right to Michael Thomas for 9 yards for a TOUCHDOWN.","(14:30) Mark Ingram rush to the left for 11 yards to the Car9. Tackled by Tre Boston.","(15:00) Drew Brees pass to the right to Brandin Cooks for 4 yards to the Car20. Tackled by Shaq Thompson.","(0:35) Mark Ingram rush to the left for 5 yards to the Car24. Tackled by Luke Kuechly.","(0:52) Andy Lee punts for 61 yards to NO12. Tommylee Lewis return for 59 yards to Car29. Tackled by Andy Lee.","(0:57) Cam Newton incomplete pass to the right intended for Fozzy Whittaker.","(1:43) Cam Newton sacked at Car27 for a loss of 11 yards by Darryl Tapp and Nick Fairley.","(2:24) Jonathan Stewart rush to the left for 2 yards to the Car38. Tackled by Nate Stupar and Darryl Tapp.","(2:31) Wil Lutz kicks off to the Car1. Ted Ginn Jr. return for 35 yards to Car36. Tackled by Michael Mauti.","(2:31) Wil Lutz extra point is good.","(2:43) Drew Brees pass to the right to Brandin Cooks for 87 yards for a TOUCHDOWN.","(3:24) Drew Brees pass to the left to Brandon Coleman for 6 yards to the NO13. Tackled by Luke Kuechly.","(3:28) Drew Brees incomplete pass to the left intended for Willie Snead.","(3:36) Andy Lee punts for 48 yards to NO7. No return.","(3:40) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by Jairus Byrd.","(3:47) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(4:12) Ted Ginn Jr. rush to the right for 5 yards to the Car45. Tackled by Nate Stupar.","(4:24) Thomas Morstead punts for 61 yards to Car27. Ted Ginn Jr. return for 13 yards to Car40. Tackled by Jake Lampman.","(4:36) Drew Brees pass to the left to Travaris Cadet for 7 yards to the NO12. Tackled by Daryl Worley.","(4:41) Drew Brees incomplete pass to the right intended for Josh Hill.","(5:15) Mark Ingram rush to the right for 1 yard to the NO5. Tackled by Kurt Coleman.","(5:22) Andy Lee punts for 39 yards to NO4. No return.","(5:59) Cam Newton sacked at NO43 for a loss of 8 yards by Kasim Edebali.","(6:35) Jonathan Stewart rush to the left for 3 yards to the NO35. Tackled by Nick Fairley and Jairus Byrd.","(6:42) Cam Newton incomplete pass to the left intended for Corey Brown.","(7:07) Cam Newton pass to the right to Greg Olsen for 20 yards to the NO38. Tackled by Sterling Moore.","(7:38) Jonathan Stewart rush to the right for 1 yard to the Car42. Tackled by Cameron Jordan and Tyeler Davison.","(7:49) Cam Newton pass to the right to Ted Ginn Jr. for 15 yards to the Car41.","(8:21) Cam Newton pass to the left to Ed Dickson for 7 yards to the Car26. Tackled by Craig Robertson and Nate Stupar.","(8:50) Jonathan Stewart rush to the left for 3 yards to the Car19. Tackled by Kasim Edebali.","(8:55) Wil Lutz kicks off to the Car-2. Ted Ginn Jr. return for 18 yards to Car16. Tackled by Daniel Lasco.","(8:55) Wil Lutz extra point is good.","(8:59) Coby Fleener rush to the right for 2 yards for a TOUCHDOWN.","(9:44) Mark Ingram rush to the left for 1 yard to the Car2. Tackled by Zack Sanchez and Thomas Davis.","(10:10) Travaris Cadet rush to the left for 3 yards to the Car3. Tackled by Kyle Love.","(10:47) Drew Brees pass to the right to Coby Fleener for 5 yards to the Car6. Tackled by Shaq Thompson.","(11:04) Penalty: Roughing Passer on Carolina (Kyle Love) 11 yards.","(11:09) Drew Brees incomplete pass to the middle intended for Josh Hill.","(11:41) Mark Ingram rush to the right for 4 yards to the Car22. Tackled by Zack Sanchez and Luke Kuechly.","(12:15) Drew Brees pass to the left to Tommylee Lewis for 15 yards to the Car26. Tackled by Thomas Davis.","(12:47) Drew Brees pass to the left to Coby Fleener for 7 yards to the Car41. Tackled by Luke Kuechly.","(12:55) Penalty: Offside on Carolina (Charles Johnson) 5 yards.","(13:30) Mark Ingram rush to the right for 3 yards to the NO47. Tackled by Thomas Davis and Luke Kuechly.","(13:58) Drew Brees pass to the left to Mark Ingram for 4 yards to the NO44. Tackled by Shaq Thompson.","(14:33) Mark Ingram rush to the right for 5 yards to the NO40. Tackled by Kurt Coleman.","(15:00) Drew Brees pass to the left to Brandin Cooks for 10 yards to the NO35. Tackled by Shaq Thompson.","(15:00) Graham Gano kicks off to the endzone. Touchback."]