["(0:04) Ryan Tannehill rush up the middle for a loss of 1 yard to the Pit49.","(0:11) Ben Roethlisberger pass to the right to Antonio Brown for 5 yards to the Pit49. Tackled by Spencer Paysinger.","(0:16) Ben Roethlisberger incomplete pass to the right intended for Jesse James.","(0:21) Ben Roethlisberger incomplete pass to the left intended for Le'Veon Bell.","(0:50) Ben Roethlisberger pass to the left to Le'Veon Bell for 4 yards to the Pit44. Tackled by Spencer Paysinger.","(0:50) Andrew Franks kicks off to the endzone. Touchback. Penalty: Unnecessary Roughness on Miami (Kenyan Drake) 15 yards.","(0:50) Andrew Franks extra point is good.","(1:01) Jay Ajayi rush to the right for 62 yards for a TOUCHDOWN.","(1:02) Chris Boswell onside kickoff to the Mia38. Onside kick recovered by receiving team by Jarvis Landry.","(1:02) Chris Boswell extra point is good. Penalty: Leverage on Miami (Jordan Phillips) 15 yards.","(1:08) Ben Roethlisberger pass to the left to Cobi Hamilton for 23 yards for a TOUCHDOWN.","(1:44) Ben Roethlisberger pass to the right to Antonio Brown for 6 yards to the Mia23. Tackled by Byron Maxwell.","(1:52) Ben Roethlisberger pass to the left to Le'Veon Bell for 18 yards to the Mia29. Tackled by Reshad Jones.","(1:59) Ben Roethlisberger incomplete pass to the right intended for Darrius Heyward-Bey defensed by Byron Maxwell.","(1:59) Two Minute Warning.","(2:03) Ben Roethlisberger incomplete pass to the left intended for Eli Rogers.","(2:16) Ben Roethlisberger pass to the left to Eli Rogers for 15 yards to the Mia47. Tackled by Chimdi Chekwa.","(2:42) Ben Roethlisberger pass to the right to Eli Rogers for 6 yards to the Pit38. Tackled by Byron Maxwell.","(3:15) Ben Roethlisberger pass to the left to Le'Veon Bell for 13 yards to the Pit32. Tackled by Michael Thomas.","(3:48) Ben Roethlisberger pass to the left to Eli Rogers for 3 yards to the Pit19. Tackled by Bobby McCain.","(4:20) Ben Roethlisberger pass to the left to Cobi Hamilton for 13 yards to the Pit16. Tackled by Chimdi Chekwa.","(4:29) Matt Darr punts for 34 yards to Pit2. No return.","(5:14) Ryan Tannehill pass to the right to Jarvis Landry for 2 yards to the Pit36. Tackled by Lawrence Timmons.","(5:19) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry defensed by Arthur Moats.","(5:56) Damien Williams rush to the left for no gain to the Pit38. Tackled by Arthur Moats.","(5:56) Pittsburgh Steelers timeout.","(6:28) Jay Ajayi rush to the right for 13 yards to the Pit38. Tackled by Ross Cockrell.","(7:09) Jay Ajayi rush to the right for a loss of 1 yard to the Mia49. Tackled by Daniel McCullers and Robert Golden.","(7:57) Ryan Tannehill pass to the right to MarQueis Gray for 19 yards to the Mia50. Tackled by Tyler Matakevich.","(8:32) Damien Williams rush up the middle for 2 yards to the Mia31. Tackled by Javon Hargrave and Tyler Matakevich.","(9:27) Jay Ajayi rush to the right for 7 yards to the Mia29. Tackled by Tyler Matakevich.","(9:49) Ryan Tannehill pass to the middle to Jarvis Landry for 5 yards to the Mia22. Tackled by Tyler Matakevich.","(10:26) Jay Ajayi rush to the left for 6 yards to the Mia17. Tackled by Tyler Matakevich.","(11:01) Jay Ajayi rush to the left for 2 yards to the Mia11. Tackled by Tyler Matakevich.","(11:09) Jordan Berry punts for 41 yards to Mia9. No return.","(11:13) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown defensed by Byron Maxwell.","(11:19) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown defensed by Byron Maxwell.","(11:24) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates.","(12:10) Ben Roethlisberger pass to the right to Le'Veon Bell for 10 yards to the Pit50. Tackled by Byron Maxwell.","(12:15) 50 yard field goal attempt by Andrew Franks is NO GOOD. Holder: Matt Darr.","(12:59) Ryan Tannehill pass to the middle to Arian Foster for 5 yards to the Pit31. Tackled by Tyler Matakevich.","(13:41) Damien Williams rush to the right for no gain to the Pit36. Tackled by Robert Golden.","(14:26) Ryan Tannehill rush to the left for 4 yards to the Pit36. Tackled by Jarvis Jones.","(15:00) Jay Ajayi rush up the middle for 3 yards to the Pit40. Tackled by Stephon Tuitt.","(0:26) Ryan Tannehill pass to the right to MarQueis Gray for 9 yards to the Pit43. Tackled by Robert Golden and Tyler Matakevich.","(0:39) Jordan Berry punts for 49 yards to Mia33. Jakeem Grant return for 15 yards to Mia48. Tackled by Tyler Matakevich.","(0:48) Ben Roethlisberger incomplete pass to the middle intended for Darrius Heyward-Bey defensed by Byron Maxwell.","(1:27) Ben Roethlisberger pass to the middle to Jesse James for 5 yards to the Pit18. Tackled by Kiko Alonso.","(1:34) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates.","(1:39) Andrew Franks kicks off to the Pit-1. Justin Gilbert return for 14 yards to Pit13. Tackled by Michael Thomas.","(1:39) Andrew Franks extra point is good.","(1:45) Jay Ajayi rush to the right for 1 yard for a TOUCHDOWN.","(2:14) Jay Ajayi rush up the middle for 4 yards to the Pit1. Tackled by James Harrison.","(2:14) Miami Dolphins timeout.","(2:56) Ryan Tannehill pass to the right to DeVante Parker for 11 yards to the Pit5. Tackled by Ross Cockrell.","(3:41) Jay Ajayi rush to the left for no gain to the Pit16. Tackled by Stephon Tuitt.","(4:26) Ryan Tannehill pass to the right to Jay Ajayi for 3 yards to the Pit16. Tackled by Robert Golden and Vince Williams.","(5:10) Jay Ajayi rush to the right for 33 yards to the Pit19. Tackled by Mike Mitchell.","(5:20) Ben Roethlisberger pass intended for Sammie Coates INTERCEPTED by Isa Abdul-Quddus and returned for 7 yards. Tackled by Jesse James.","(6:02) DeAngelo Williams rush up the middle for 7 yards to the Pit45. Tackled by Jason Jones.","(6:27) Penalty: Holding on Pittsburgh (David DeCastro) -10 yards.","(6:58) Le'Veon Bell rush to the right for 1 yard to the Pit48. Tackled by Isa Abdul-Quddus.","(7:40) Ben Roethlisberger pass to the left to Antonio Brown for 16 yards to the Pit47. Tackled by Reshad Jones.","(8:15) Ben Roethlisberger pass to the left to Eli Rogers for 11 yards to the Pit31. Tackled by Reshad Jones.","(8:57) Le'Veon Bell rush to the left for 1 yard to the Pit20. Tackled by Andre Branch.","(9:01) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(9:26) Andrew Franks 24 yard field goal attempt is BLOCKED by Daniel McCullers.","(9:49) Arian Foster rush up the middle for a loss of 1 yard to the Pit6. Tackled by Vince Williams.","(10:37) Ryan Tannehill pass to the middle to Jarvis Landry for 10 yards to the Pit5. Tackled by Robert Golden.","(11:21) Damien Williams rush to the left for a loss of 1 yard to the Pit15. Tackled by Anthony Chickillo.","(12:03) Damien Williams rush up the middle for 10 yards to the Pit14. Tackled by Anthony Chickillo.","(12:05) Ryan Tannehill incomplete pass to the right intended for Dominique Jones.","(12:34) Jay Ajayi rush to the left for 20 yards to the Pit39. Tackled by Mike Mitchell. Penalty: Unnecessary Roughness on Pittsburgh (Mike Mitchell) 15 yards.","(13:16) Jay Ajayi rush up the middle for 3 yards to the Mia41. Tackled by Jarvis Jones.","(13:39) Ryan Tannehill pass to the right to Jarvis Landry for 5 yards to the Mia38. Tackled by William Gay.","(14:22) Ryan Tannehill pass to the right to Jarvis Landry for 8 yards to the Mia33. Tackled by Ross Cockrell.","(15:00) Jay Ajayi rush to the left for no gain to the Mia25. Tackled by Stephon Tuitt.","(15:00) Chris Boswell kicks off to the endzone. Touchback.","(0:15) Landry Jones rush up the middle for a loss of 1 yard to the Pit11.","(0:21) Andrew Franks kicks off to the Pit-1. Justin Gilbert return for 23 yards to Pit22. Tackled by Mike Hull. Penalty: Illegal Block on Pittsburgh (Steven Johnson) -10 yards.","(0:21) Andrew Franks extra point is good.","(0:21) Damien Williams rush up the middle for 1 yard for a TOUCHDOWN. Penalty: Unsports. Conduct on Miami (Jay Ajayi) -15 yards.","(0:25) Miami Dolphins timeout.","(0:34) Arian Foster rush to the left for 1 yard to the Pit1. Tackled by Lawrence Timmons.","(1:09) Ryan Tannehill pass to the left to Jarvis Landry for 39 yards to the Pit2. Tackled by Artie Burns.","(1:45) Arian Foster rush to the right for 3 yards to the Pit41. Tackled by Lawrence Timmons.","(1:49) Ryan Tannehill incomplete pass to the right intended for DeVante Parker defensed by Ross Cockrell.","(1:55) Ryan Tannehill pass to the right to Arian Foster for 7 yards to the Pit44. Tackled by Lawrence Timmons.","(2:00) Ryan Tannehill pass to the left to DeVante Parker for 6 yards to the Mia49. Tackled by Artie Burns.","(2:00) Two Minute Warning.","(2:15) Jay Ajayi rush to the left for no gain to the Mia43. Tackled by Javon Hargrave.","(2:47) Jay Ajayi rush to the left for 14 yards to the Mia43. Tackled by Vince Williams and Robert Golden.","(2:57) Jordan Berry punts for 25 yards to Mia29. No return.","(3:07) Landry Jones incomplete pass to the right intended for David Johnson.","(3:49) Le'Veon Bell rush to the right for 6 yards to the Pit46. Tackled by Neville Hewitt.","(4:37) Le'Veon Bell rush to the right for 8 yards to the Pit40. Tackled by Ndamukong Suh and Reshad Jones.","(4:52) Penalty: False Start on Pittsburgh (Alejandro Villanueva) -5 yards.","(5:23) Le'Veon Bell rush to the right for 12 yards to the Pit37. Tackled by Kiko Alonso and Byron Maxwell.","(5:23) Andrew Franks kicks off to the endzone. Touchback.","(5:33) Andrew Franks 30 yard field goal attempt is GOOD. Holder: Matt Darr.","(6:15) Ryan Tannehill pass to the left to Damien Williams for 5 yards to the Pit12. Tackled by Robert Golden.","(7:02) Ryan Tannehill pass to the left to Damien Williams for no gain to the Pit17. Tackled by Vince Williams.","(7:47) Penalty: Holding on Miami (Ja'Wuan James) -10 yards.","(8:06) Jay Ajayi rush to the left for 6 yards to the Pit7. Tackled by Lawrence Timmons.","(8:18) Ben Roethlisberger pass intended for Sammie Coates INTERCEPTED by Reshad Jones and returned for 17 yards. Tackled by Jesse James.","(8:18) Andrew Franks kicks off to the endzone. Touchback.","(8:21) Andrew Franks 23 yard field goal attempt is GOOD. Holder: Matt Darr.","(8:26) Ryan Tannehill incomplete pass to the right intended for Dion Sims defensed by Ross Cockrell.","(9:14) Ryan Tannehill pass to the right to Kenny Stills for 7 yards to the Pit4. Tackled by Vince Williams.","(9:49) Jay Ajayi rush to the right for a loss of 5 yards to the Pit11. Tackled by James Harrison.","(9:55) Penalty: Illegal Formation on Miami (Ja'Wuan James) -5 yards.","(10:45) Ryan Tannehill pass to the left to MarQueis Gray for 53 yards to the Pit1. Tackled by William Gay.","(11:32) Ryan Tannehill pass to the right to Dion Sims for 12 yards to the Mia46. Tackled by William Gay.","(11:52) Penalty: False Start on Miami (Jay Ajayi) -5 yards.","(12:33) Jay Ajayi rush to the right for 7 yards to the Mia39. Tackled by Arthur Moats.","(13:08) Ryan Tannehill pass to the right to DeVante Parker for 3 yards to the Mia32. Tackled by William Gay.","(13:42) Ryan Tannehill pass to the left to DeVante Parker for 7 yards to the Mia29. Tackled by Artie Burns.","(14:19) Jay Ajayi rush to the left for 2 yards to the Mia22. Tackled by Vince Williams.","(15:00) Jay Ajayi rush to the right for 1 yard to the Mia20. Tackled by James Harrison and Javon Hargrave.","(0:26) Ryan Tannehill pass to the left to Dominique Jones for 8 yards to the Mia19. Tackled by James Harrison.","(0:45) Jordan Berry punts for 27 yards to Mia11. No return.","(1:07) Ben Roethlisberger sacked at Mia38 for a loss of 9 yards by Cameron Wake and Andre Branch.","(1:11) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown.","(1:40) Ben Roethlisberger incomplete pass to the left intended for Xavier Grimble.","(2:00) Ben Roethlisberger pass to the right to Antonio Brown for 12 yards to the Mia29. Tackled by Byron Maxwell.","(2:37) Antonio Brown rush to the right for 6 yards to the Mia41. Tackled by Cameron Wake.","(3:20) Le'Veon Bell rush up the middle for 13 yards to the Mia47. Tackled by Isa Abdul-Quddus.","(3:20) Pittsburgh Steelers timeout.","(4:13) DeAngelo Williams rush up the middle for 1 yard to the Pit40. Tackled by Mario Williams.","(4:48) Ben Roethlisberger pass to the left to Jesse James for 8 yards to the Pit39. Tackled by Tony Lippett and Neville Hewitt.","(4:56) Matt Darr punts for 43 yards to Pit31. No return.","(5:01) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry.","(5:01) Pittsburgh Steelers timeout.","(5:09) Ryan Tannehill incomplete pass to the right intended for Kenny Stills defensed by William Gay.","(5:39) Jay Ajayi rush up the middle for 1 yard to the Mia26. Tackled by Anthony Chickillo.","(5:39) Chris Boswell kicks off to the endzone. Touchback.","(5:39) Ben Roethlisberger 2 pt conversion pass to Le'Veon Bell is GOOD.","(5:52) Darrius Heyward-Bey rush to the left for 60 yards for a TOUCHDOWN.","(6:15) Ben Roethlisberger sacked at Pit25 for a loss of 11 yards by Andre Branch. Penalty: Unnecessary Roughness on Miami (Jason Jones) 15 yards.","(6:57) Ben Roethlisberger pass to the left to Le'Veon Bell for 4 yards to the Pit36. Tackled by Andre Branch.","(7:19) Le'Veon Bell rush to the right for 3 yards to the Pit42. Tackled by Kiko Alonso. Penalty: Holding on Pittsburgh (Jesse James) -10 yards.","(8:01) Le'Veon Bell rush to the right for 3 yards to the Pit39. Tackled by Neville Hewitt and Kiko Alonso.","(8:34) Ben Roethlisberger pass to the left to Xavier Grimble for 11 yards to the Pit36. Tackled by Tony Lippett.","(8:34) Andrew Franks kicks off to the endzone. Touchback.","(8:38) Andrew Franks 30 yard field goal attempt is GOOD. Holder: Matt Darr.","(8:42) Ryan Tannehill incomplete pass to the right intended for Jay Ajayi.","(9:29) Ryan Tannehill pass to the right to DeVante Parker for 1 yard to the Pit12. Tackled by Ross Cockrell.","(10:08) Jay Ajayi rush to the left for 3 yards to the Pit13. Tackled by Stephon Tuitt.","(10:42) Jay Ajayi rush to the left for 10 yards to the Pit16. Tackled by Artie Burns.","(10:49) Ryan Tannehill incomplete pass to the middle intended for DeVante Parker.","(11:26) Jay Ajayi rush to the left for 12 yards to the Pit26. Tackled by Artie Burns.","(11:48) Ryan Tannehill pass to the left to Jarvis Landry for 22 yards to the Mia47. Tackled by Mike Mitchell. Penalty: Unnecessary Roughness on Pittsburgh (Mike Mitchell) 15 yards.","(12:13) Ryan Tannehill pass to the right to Kenny Stills for 5 yards to the Mia40. Tackled by Ross Cockrell. Penalty: Unsports. Conduct on Miami (Ja'Wuan James) -15 yards.","(12:22) Jordan Berry punts for 38 yards to Mia24. Jarvis Landry return for 11 yards to Mia35. Tackled by Steven Johnson.","(12:27) Ben Roethlisberger incomplete pass to the left intended for Xavier Grimble defensed by Jason Jones.","(13:09) DeAngelo Williams rush to the left for 2 yards to the Pit38. Tackled by Reshad Jones.","(13:47) Le'Veon Bell rush to the left for 2 yards to the Pit36. Tackled by Ndamukong Suh.","(14:20) Ben Roethlisberger pass to the left to Le'Veon Bell for 6 yards to the Pit34. Tackled by Bobby McCain and Kiko Alonso.","(14:55) Le'Veon Bell rush to the left for 4 yards to the Pit28. Tackled by Kiko Alonso.","(15:00) Andrew Franks kicks off to the Pit4. Fitzgerald Toussaint return for 20 yards to Pit24. Tackled by Mike Hull."]