["(0:07) Joe Flacco incomplete pass to the right intended for Dennis Pitta defensed by Dominique Rodgers-Cromartie.","(0:07) Penalty: Delay of Game on Baltimore (Joe Flacco) -5 yards.","(0:11) Joe Flacco incomplete pass to the right intended for Mike Wallace defensed by Dominique Rodgers-Cromartie.","(0:15) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(0:15) New York Giants timeout.","(0:22) Penalty: Roughing Passer on New York (Owamagbe Odighizuwa) 15 yards.","(0:27) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(0:32) Joe Flacco incomplete pass to the right intended for Kyle Juszczyk defensed by Jason Pierre-Paul.","(0:32) Baltimore Ravens timeout.","(0:37) Joe Flacco pass to the middle to Breshad Perriman for 5 yards to the NYG39. Tackled by Leon Hall.","(0:58) Joe Flacco pass to the middle to Mike Wallace for 11 yards to the NYG44. Tackled by Landon Collins.","(1:19) Joe Flacco pass to the right to Kamar Aiken for 13 yards to the Bal45. Tackled by Keenan Robinson.","(1:24) Josh Brown kicks off to the Bal6. Chris Moore return for 26 yards to Bal32. Tackled by Kerry Wynn.","(1:24) Josh Brown extra point is good.","(1:24) Eli Manning pass to the right to Odell Beckham Jr. for 66 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on New York (Odell Beckham Jr.) -15 yards.","(1:43) Eli Manning pass to the right to Larry Donnell for 3 yards to the NYG34. Tackled by Tavon Young.","(2:00) Eli Manning pass to the right to Larry Donnell for 6 yards to the NYG31. Tackled by Kendrick Lewis.","(2:00) Two Minute Warning.","(2:04) Eli Manning incomplete pass to the middle intended for Bobby Rainey.","(2:04) Justin Tucker kicks off to the endzone. Touchback.","(2:04) Justin Tucker extra point is good.","(2:08) Terrance West rush to the left for 2 yards for a TOUCHDOWN.","(2:08) Baltimore Ravens timeout.","(2:11) Joe Flacco incomplete pass to the right intended for Terrance West.","(2:14) Joe Flacco pass to the right to Mike Wallace for 6 yards to the NYG2. Tackled by Dominique Rodgers-Cromartie.","(2:23) Penalty: Pass Interference on New York (Dominique Rodgers-Cromartie) 30 yards.","(3:09) Joe Flacco pass to the right to Kyle Juszczyk for no gain to the NYG38. Tackled by Devon Kennard.","(3:47) Terrance West rush to the left for 6 yards to the NYG38. Tackled by Keenan Robinson.","(4:24) Joe Flacco pass to the right to Kamar Aiken for 22 yards to the NYG44. Tackled by Landon Collins.","(5:07) Joe Flacco pass to the left to Kyle Juszczyk for 2 yards to the Bal34. Tackled by Janoris Jenkins and Jonathan Casillas.","(5:07) Baltimore Ravens timeout.","(5:49) Joe Flacco pass to the left to Terrance West for 7 yards to the Bal32. Tackled by Jonathan Casillas.","(5:54) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(5:54) Josh Brown kicks off to the endzone. Touchback.","(6:04) Josh Brown 31 yard field goal attempt is GOOD. Holder: Brad Wing.","(6:42) Eli Manning pass to the right to Odell Beckham Jr. for 12 yards to the Bal14. Tackled by Lardarius Webb.","(7:16) Eli Manning sacked at Bal26 for a loss of 6 yards by Terrell Suggs.","(7:46) Bobby Rainey rush to the left for no gain to the Bal20. Tackled by Terrell Suggs and Timmy Jernigan.","(8:13) Eli Manning pass to the right to Larry Donnell for 13 yards to the Bal20. Tackled by Zachary Orr and Eric Weddle.","(8:48) Bobby Rainey rush to the right for a loss of 1 yard to the Bal33. Tackled by Michael Pierce and Za'Darius Smith.","(9:14) Eli Manning pass to the left to Odell Beckham Jr. for 43 yards to the Bal32. Tackled by Lardarius Webb.","(9:14) Justin Tucker kicks off to the endzone. Touchback.","(9:19) Justin Tucker 35 yard field goal attempt is GOOD. Holder: Sam Koch.","(9:25) Joe Flacco incomplete pass to the right intended for Kyle Juszczyk.","(9:31) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(10:09) Terrance West rush to the left for 1 yard to the NYG17. Tackled by Devon Kennard and Damon Harrison.","(10:48) Terrance West rush to the left for 12 yards to the NYG18. Tackled by Jason Pierre-Paul and Andrew Adams.","(10:56) Penalty: Pass Interference on New York (Trevin Wade) 42 yards.","(11:37) Terrance West rush to the left for 1 yard to the Bal28. Tackled by Jonathan Casillas and Damon Harrison.","(11:42) Joe Flacco incomplete pass to the left intended for Dennis Pitta defensed by Kelvin Sheppard.","(11:50) Brad Wing punts for 53 yards to Bal27. No return.","(12:24) Eli Manning pass to the right to Larry Donnell for no gain to the NYG20. Tackled by Eric Weddle and Zachary Orr.","(12:30) Eli Manning incomplete pass to the left intended for Victor Cruz.","(13:12) Rashad Jennings rush to the left for 1 yard to the NYG20. Tackled by Albert McClellan and Zachary Orr.","(13:46) Eli Manning pass to the left to Rashad Jennings for 9 yards to the NYG19. Tackled by Albert McClellan.","(14:24) Eli Manning pass to the right to Rashad Jennings for 7 yards to the NYG10. Tackled by Zachary Orr and Albert McClellan.","(14:55) Rashad Jennings rush to the right for 1 yard to the NYG3. Tackled by Brandon Williams and Zachary Orr.","(15:00) Terrance West rush to the left for a loss of 1 yard to the NYG2. Tackled by Jonathan Casillas.","(0:38) Terrance West rush to the left for no gain to the NYG1. Tackled by Janoris Jenkins and Jonathan Casillas.","(1:19) Joe Flacco rush up the middle for no gain to the NYG1. Tackled by Romeo Okwara and Robert Thomas.","(1:57) Terrance West rush to the right for 2 yards to the NYG1. Tackled by Devon Kennard and Landon Collins.","(2:10) Joe Flacco pass to the right to Mike Wallace for 70 yards to the NYG5. Tackled by Janoris Jenkins. Penalty: Face Mask on New York (Janoris Jenkins) 2 yards.","(2:10) Josh Brown kicks off to the endzone. Touchback.","(2:10) Josh Brown extra point is good. Penalty: Unnecessary Roughness on Baltimore (Lawrence Guy) 15 yards.","(2:22) Eli Manning pass to the right to Odell Beckham Jr. for 75 yards for a TOUCHDOWN.","(2:22) Justin Tucker kicks off to the endzone. Touchback.","(2:32) Justin Tucker 39 yard field goal attempt is GOOD. Holder: Sam Koch.","(3:09) Joe Flacco pass to the right to Dennis Pitta for 4 yards to the NYG21. Tackled by Coty Sensabaugh and Trevin Wade.","(3:51) Joe Flacco pass to the left to Dennis Pitta for 11 yards to the NYG25. Tackled by Andrew Adams and Jonathan Casillas.","(4:29) Terrance West rush to the right for 1 yard to the NYG36. Tackled by Damon Harrison and Jonathan Casillas.","(4:36) Penalty: Holding on Baltimore (Terrance West) -10 yards.","(4:49) Eli Manning pass intended for Sterling Shepard INTERCEPTED by Tavon Young and returned for 16 yards. Tackled by Will Tye.","(5:23) Paul Perkins rush to the right for 4 yards to the NYG20. Tackled by Matt Judon.","(5:51) Eli Manning pass to the middle to Will Tye for 5 yards to the NYG16. Tackled by Albert McClellan.","(6:03) Sam Koch punts for 55 yards to NYG5. Dwayne Harris return for 6 yards to NYG11. Tackled by Marqueston Huff.","(6:33) Joe Flacco pass to the left to Kamar Aiken for 17 yards to the Bal40. Tackled by Trevin Wade.","(7:16) Joe Flacco pass to the right to Kenneth Dixon for 1 yard to the Bal23. Tackled by Landon Collins.","(7:33) Penalty: False Start on Baltimore (Alex Lewis) -5 yards.","(7:51) Penalty: Holding on Baltimore (Alex Lewis) -10 yards.","(7:57) Joe Flacco incomplete pass to the left intended for Breshad Perriman defensed by Janoris Jenkins.","(8:33) Terrance West rush up the middle for 3 yards to the Bal37. Tackled by Jonathan Casillas and Olivier Vernon.","(9:13) Terrance West rush to the right for no gain to the Bal34. Tackled by Landon Collins.","(9:48) Joe Flacco pass to the right to Terrance West for 9 yards to the Bal34. Tackled by Janoris Jenkins.","(9:48) Josh Brown kicks off to the endzone. Touchback.","(9:50) Josh Brown 21 yard field goal attempt is GOOD. Holder: Brad Wing.","(9:56) Eli Manning incomplete pass to the left intended for Roger Lewis defensed by Shareece Wright.","(10:03) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(10:44) Rashad Jennings rush to the right for a loss of 2 yards to the Bal3. Tackled by Terrell Suggs and Michael Pierce.","(10:50) Penalty: Pass Interference on Baltimore (Will Davis) 1 yards.","(11:18) Eli Manning pass to the left to Victor Cruz for 17 yards to the Bal2. Tackled by Shareece Wright.","(11:36) Bobby Rainey rush to the right for 4 yards to the Bal19. Tackled by Zachary Orr.","(12:00) Eli Manning pass to the right to Larry Donnell for 4 yards to the Bal23. Tackled by Anthony Levine Sr. and Will Davis.","(12:29) Eli Manning pass to the right to Sterling Shepard for 10 yards to the Bal27. Tackled by Tavon Young.","(13:00) Rashad Jennings rush up the middle for 2 yards to the Bal37. Tackled by Zachary Orr and Timmy Jernigan.","(13:29) Eli Manning pass to the left to Sterling Shepard for 1 yard to the Bal39. Tackled by Shareece Wright.","(13:54) Eli Manning pass to the right to Odell Beckham Jr. for 4 yards to the Bal40. Tackled by Will Davis.","(14:11) Eli Manning pass to the right to Odell Beckham Jr. for 11 yards to the Bal44. Tackled by Zachary Orr.","(14:14) Penalty: Pass Interference on Baltimore (Tavon Young) 7 yards.","(14:18) Eli Manning incomplete pass to the left intended for Larry Donnell.","(14:36) Eli Manning pass to the left to Sterling Shepard for 10 yards to the NYG38. Tackled by Tavon Young.","(15:00) Rashad Jennings rush to the right for 3 yards to the NYG28. Tackled by Za'Darius Smith.","(15:00) Justin Tucker kicks off to the endzone. Touchback.","(0:08) Eli Manning pass intended for Sterling Shepard INTERCEPTED by Will Davis. No return. Tackled by Sterling Shepard.","(0:08) Baltimore Ravens timeout.","(0:09) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(0:29) Eli Manning pass to the middle to Paul Perkins for 11 yards to the Bal45. Tackled by Anthony Levine Sr. and Will Davis.","(0:46) Eli Manning pass to the right to Paul Perkins for 5 yards to the NYG44. Tackled by Zachary Orr.","(1:01) Paul Perkins rush to the left for 6 yards to the NYG39. Tackled by Albert McClellan and Anthony Levine Sr..","(1:09) Sam Koch punts for 34 yards to NYG23. Dwayne Harris - no return. Tackled by Darren Waller. Penalty: Illegal Block on Baltimore (Marqueston Huff) 10 yards.","(1:09) New York Giants timeout.","(1:22) Joe Flacco sacked at Bal43 for a loss of 10 yards by Landon Collins.","(1:22) New York Giants timeout.","(1:27) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(1:32) Joe Flacco incomplete pass to the right intended for Breshad Perriman defensed by Janoris Jenkins.","(2:00) Joe Flacco pass to the right to Terrance West for 12 yards to the NYG47. Tackled by Landon Collins.","(2:00) Two Minute Warning.","(2:05) Terrance West rush up the middle for 5 yards to the Bal41. Tackled by Jay Bromley and Kelvin Sheppard.","(2:28) Joe Flacco pass to the right to Dennis Pitta for 11 yards to the Bal36. Tackled by Kelvin Sheppard.","(2:28) Josh Brown kicks off to the endzone. Touchback.","(2:28) Josh Brown extra point is good.","(2:30) Eli Manning pass to the right to Roger Lewis for 24 yards for a TOUCHDOWN.","(3:18) Bobby Rainey rush to the left for 6 yards to the Bal24. Tackled by Terrell Suggs.","(3:24) Eli Manning incomplete pass to the left intended for Victor Cruz.","(3:49) Eli Manning pass to the left to Victor Cruz for 10 yards to the Bal30. Tackled by Jimmy Smith.","(3:57) Eli Manning incomplete pass to the right intended for Roger Lewis.","(4:01) Eli Manning incomplete pass to the middle intended for Sterling Shepard.","(4:28) Rashad Jennings rush to the right for 5 yards to the Bal40. Tackled by Zachary Orr and Matt Judon.","(4:51) Eli Manning pass to the middle to Will Tye for 10 yards to the Bal45. Tackled by Eric Weddle and Will Davis.","(5:12) Eli Manning pass to the left to Rashad Jennings for 1 yard to the NYG45. Tackled by Jimmy Smith and Lawrence Guy.","(5:36) Eli Manning pass to the left to Victor Cruz for 4 yards to the NYG44. Tackled by Jimmy Smith.","(6:17) Rashad Jennings rush to the left for 1 yard to the NYG40. Tackled by Zachary Orr and Michael Pierce.","(6:40) Eli Manning pass to the left to Larry Donnell for 8 yards to the NYG39. Tackled by Albert McClellan.","(6:49) Penalty: Offside on Baltimore (Terrell Suggs) 5 yards.","(7:08) Eli Manning pass to the left to Odell Beckham Jr. for 6 yards to the NYG26. Tackled by Jimmy Smith.","(7:21) Sam Koch punts for 60 yards to NYG15. Dwayne Harris return for 5 yards to NYG20. Tackled by Patrick Onwuasor and Morgan Cox.","(7:25) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(7:25) New York Giants timeout.","(7:34) Joe Flacco incomplete pass to the right intended for Kamar Aiken.","(8:09) Terrance West rush up the middle for a loss of 1 yard to the Bal25. Tackled by Johnathan Hankins and Jason Pierre-Paul.","(8:20) Brad Wing punts for 47 yards to Bal26. No return.","(8:54) Bobby Rainey rush to the left for no gain to the NYG27. Tackled by Brandon Williams and Eric Weddle.","(9:28) Eli Manning pass to the left to Bobby Rainey for 9 yards to the NYG27. Tackled by Albert McClellan.","(9:30) Eli Manning incomplete pass to the right intended for Victor Cruz.","(9:58) Eli Manning pass to the middle to Bobby Rainey for 7 yards to the NYG18. Tackled by Albert McClellan and Matt Judon.","(10:29) Bobby Rainey rush to the left for 4 yards to the NYG11. Tackled by Brandon Williams and Zachary Orr.","(10:36) Sam Koch punts for 45 yards to NYG7. No return.","(10:41) Joe Flacco incomplete pass to the right intended for Kamar Aiken.","(11:02) Penalty: Delay of Game on Baltimore (Joe Flacco) -5 yards.","(11:47) Joe Flacco pass to the right to Dennis Pitta for a loss of 3 yards to the NYG47. Tackled by Jay Bromley.","(12:10) Penalty: Holding on Baltimore (Crockett Gillmore) -10 yards.","(12:48) Terrance West rush to the right for 1 yard to the NYG34. Tackled by Olivier Vernon.","(13:28) Kenneth Dixon rush to the right for 4 yards to the NYG35. Tackled by Johnathan Hankins.","(14:04) Kenneth Dixon rush to the left for 7 yards to the NYG39. Tackled by Jason Pierre-Paul and Landon Collins.","(14:42) Terrance West rush to the left for 33 yards to the NYG46. Tackled by Janoris Jenkins and Andrew Adams.","(14:48) Joe Flacco incomplete pass to the middle intended for Crockett Gillmore.","(15:00) Penalty: Offside on New York (Jerell Adams) 5 yards.","(0:26) Joe Flacco pass to the right to Kyle Juszczyk for 5 yards to the Bal16. Tackled by Dominique Rodgers-Cromartie.","(1:06) Joe Flacco sacked at Bal11 for a loss of 4 yards by Johnathan Hankins.","(1:42) Terrance West rush to the left for 7 yards to the Bal15. Tackled by Jonathan Casillas and Johnathan Hankins.","(1:53) Brad Wing punts for 57 yards to Bal16. No return. Penalty: Holding on Baltimore (Matt Judon) -8 yards.","(2:31) Eli Manning pass to the right to Sterling Shepard for 4 yards to the NYG27. Tackled by Eric Weddle.","(3:15) Eli Manning pass to the left to Rashad Jennings for 3 yards to the NYG23. Tackled by Jimmy Smith and Albert McClellan.","(3:45) Rashad Jennings rush to the right for 2 yards to the NYG20. Tackled by Terrell Suggs and Matt Judon.","(3:51) Sam Koch punts for 45 yards to NYG8. No return. Penalty: Holding on Baltimore (Morgan Cox) 10 yards.","(3:58) Joe Flacco incomplete pass to the middle intended for Kenneth Dixon defensed by Jason Pierre-Paul.","(4:24) Penalty: Illegal Formation on Baltimore -5 yards.","(4:32) Joe Flacco incomplete pass to the right intended for Terrance West.","(4:40) Joe Flacco incomplete pass to the left intended for Breshad Perriman.","(5:13) Joe Flacco pass to the right to Mike Wallace for 10 yards to the NYG48. Tackled by Jonathan Casillas.","(5:49) Terrance West rush to the right for 4 yards to the Bal42. Tackled by Devon Kennard and Jay Bromley.","(6:00) Brad Wing punts for 48 yards to Bal25. Lardarius Webb return for 3 yards to Bal28. Tackled by Bobby Rainey. Penalty: Illegal Use of Hands on New York (Zak DeOssie) 10 yards.","(6:05) Eli Manning incomplete pass to the right intended for Sterling Shepard.","(6:11) Eli Manning incomplete pass to the left intended for Victor Cruz.","(6:42) Rashad Jennings rush to the left for 2 yards to the NYG27. Tackled by Zachary Orr and Eric Weddle.","(6:42) Justin Tucker kicks off to the endzone. Touchback.","(6:42) Justin Tucker extra point is good.","(6:47) Terrance West rush to the left for 1 yard for a TOUCHDOWN.","(7:32) Joe Flacco pass to the right to Dennis Pitta for 5 yards to the NYG1. Tackled by Dominique Rodgers-Cromartie and Jonathan Casillas.","(8:08) Joe Flacco pass to the left to Kamar Aiken for 12 yards to the NYG6. Tackled by Andrew Adams.","(8:46) Terrance West rush up the middle for 5 yards to the NYG18. Tackled by Keenan Robinson.","(9:27) Terrance West rush to the left for a loss of 1 yard to the NYG23. Tackled by Landon Collins and Devon Kennard.","(10:03) Joe Flacco pass to the middle to Terrance West for 8 yards to the NYG22. Tackled by Devon Kennard.","(10:10) Eli Manning pass to the right to Odell Beckham Jr. for 5 yards to the NYG30. Tackled by Eric Weddle. FUMBLE, recovered by Bal (Zachary Orr). Tackled by Justin Pugh.","(10:10) Justin Tucker kicks off to the endzone. Touchback.","(10:15) Justin Tucker 23 yard field goal attempt is GOOD. Holder: Sam Koch.","(10:58) Joe Flacco pass to the middle to Dennis Pitta for 8 yards to the NYG5. Tackled by Landon Collins.","(11:34) Joe Flacco pass to the right to Breshad Perriman for 2 yards to the NYG13. Tackled by Dominique Rodgers-Cromartie.","(11:34) Penalty: False Start on Baltimore (John Urschel) -5 yards.","(11:41) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(12:25) Joe Flacco pass to the left to Kyle Juszczyk for 18 yards to the NYG10. Tackled by Landon Collins.","(13:04) Terrance West rush to the left for a loss of 1 yard to the NYG28. Tackled by Johnathan Hankins and Damon Harrison.","(13:37) Terrance West rush to the left for 6 yards to the NYG27. Tackled by Landon Collins.","(14:15) Joe Flacco pass to the middle to Breshad Perriman for 41 yards to the NYG33. Tackled by Dominique Rodgers-Cromartie.","(14:57) Terrance West rush to the right for 1 yard to the Bal26. Tackled by Dominique Rodgers-Cromartie.","(15:00) Joe Flacco incomplete pass to the right intended for Mike Wallace defensed by Dominique Rodgers-Cromartie.","(15:00) Josh Brown kicks off to the endzone. Touchback."]