["(0:31) EJ Manuel rush up the middle for a loss of 1 yard to the Buf21.","(1:13) EJ Manuel rush to the right for 4 yards to the Buf22. Tackled by Tank Carradine.","(2:00) Jonathan Williams rush to the left for 6 yards to the Buf18. Tackled by Michael Wilhoite.","(2:00) Two Minute Warning.","(2:34) Jonathan Williams rush to the left for 1 yard to the Buf12. Tackled by Mike Purcell and DeForest Buckner.","(2:41) Colin Kaepernick incomplete pass to the right intended for Torrey Smith defensed by Ronald Darby.","(2:50) Colin Kaepernick incomplete pass to the left intended for Quinton Patton defensed by Duke Williams.","(3:33) Shaun Draughn rush up the middle for 2 yards to the Buf10. Tackled by Ramon Humber.","(3:37) Colin Kaepernick incomplete pass to the right intended for Mike Davis.","(3:44) Colin Kaepernick pass to the right to Rod Streater for 16 yards to the Buf12. Tackled by Preston Brown.","(4:21) Colin Kaepernick sacked at Buf28 for a loss of 7 yards by Adolphus Washington.","(4:28) Colin Kaepernick pass to the right to Mike Davis for 6 yards to the Buf21. Tackled by Ramon Humber.","(4:37) Jonathan Williams rush to the left for 4 yards to the Buf24. Tackled by Mike Purcell. FUMBLE, recovered by SF (Nick Bellore).","(4:45) Bradley Pinion punts for 57 yards to Buf0. Touchback.","(4:50) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley.","(5:29) Colin Kaepernick pass to the left to Vance McDonald for 6 yards to the SF43. Tackled by Zach Brown.","(5:34) Colin Kaepernick incomplete pass to the left intended for Mike Davis.","(5:40) Dan Carpenter kicks off to the SF17. Jeremy Kerley return for 20 yards to SF37. Tackled by Nickell Robey-Coleman.","(5:40) Dan Carpenter extra point is good.","(5:47) Mike Gillislee rush to the left for 44 yards for a TOUCHDOWN.","(6:27) Mike Gillislee rush to the left for 4 yards to the SF43. Tackled by Michael Wilhoite.","(6:38) Penalty: Offside on San Francisco 5 yards.","(6:43) EJ Manuel incomplete pass to the middle intended for Justin Hunter.","(6:57) Penalty: Offside on San Francisco (Eli Harold) 5 yards.","(7:39) Jonathan Williams rush to the left for 3 yards to the Buf42. Tackled by DeForest Buckner and Eli Harold.","(7:44) EJ Manuel incomplete pass to the right intended for Jerome Felton.","(8:24) Jonathan Williams rush to the right for 7 yards to the Buf39. Tackled by Nick Bellore and Eli Harold.","(9:05) Reggie Bush rush to the left for 5 yards to the Buf32. Tackled by Ahmad Brooks.","(9:18) Bradley Pinion punts for 48 yards to Buf34. Brandon Tate return for 3 yards to Buf37. Tackled by Aaron Burbridge. Penalty: Illegal Block on Buffalo (Lerentee McCray) -10 yards.","(9:28) Colin Kaepernick incomplete pass to the left.","(10:10) Colin Kaepernick sacked at SF18 for a loss of 12 yards by Lorenzo Alexander. FUMBLE, recovered by SF (Joshua Garnett).","(10:32) Mike Davis rush up the middle for 5 yards to the SF30. Tackled by Leger Douzable and Kyle Williams.","(10:32) Dan Carpenter kicks off to the endzone. Touchback.","(10:32) Dan Carpenter extra point is good.","(10:36) Tyrod Taylor pass to the left to Robert Woods for 5 yards for a TOUCHDOWN.","(10:37) Buffalo Bills timeout.","(10:43) Penalty: Pass Interference on San Francisco (Eric Reid) 22 yards.","(10:43) Dan Carpenter kicks off to the SF7. Keshawn Martin return for 20 yards to SF27. Tackled by Nickell Robey-Coleman. FUMBLE, recovered by Buf (Jonathan Meeks).","(10:43) Dan Carpenter extra point is good.","(10:59) LeSean McCoy rush to the right for 18 yards for a TOUCHDOWN.","(11:37) Tyrod Taylor rush to the left for 21 yards to the SF18. Tackled by Antoine Bethea.","(12:04) Mike Gillislee rush up the middle for 5 yards to the SF39. Tackled by DeForest Buckner.","(12:41) Tyrod Taylor rush up the middle for 8 yards to the SF44. Tackled by Eric Reid.","(13:09) LeSean McCoy rush up the middle for 7 yards to the Buf48. Tackled by Michael Wilhoite.","(13:34) Tyrod Taylor pass to the left to Charles Clay for 14 yards to the Buf41.","(14:11) LeSean McCoy rush to the left for 7 yards to the Buf27. Tackled by Nick Bellore.","(14:48) LeSean McCoy rush to the right for a loss of 5 yards to the Buf20. Tackled by Arik Armstead.","(14:48) Bradley Pinion kicks off to the endzone. Touchback.","(14:53) Phil Dawson 47 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(15:00) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(0:21) Carlos Hyde rush to the left for 2 yards to the Buf29. Tackled by Zach Brown.","(0:28) Colin Kaepernick incomplete pass to the middle intended for Torrey Smith.","(0:28) San Francisco 49ers timeout.","(1:14) Colin Kaepernick rush to the left for 8 yards to the Buf31. Tackled by Corey Graham.","(1:40) Carlos Hyde rush up the middle for 3 yards to the Buf39. Tackled by Corbin Bryant and Brandon Spikes.","(1:58) Colin Kaepernick pass to the right to Vance McDonald for 19 yards to the SF43. Tackled by Ronald Darby. Penalty: Face Mask on Buffalo (Aaron Williams) 15 yards.","(2:34) Colin Kaepernick sacked at SF24 for a loss of 1 yard by Zach Brown.","(2:34) Dan Carpenter kicks off to the endzone. Touchback.","(2:34) Dan Carpenter extra point is good.","(2:40) Tyrod Taylor pass to the left to Justin Hunter for 30 yards for a TOUCHDOWN.","(3:13) Tyrod Taylor pass to the right to Nick O'Leary for 23 yards to the SF30. Tackled by Antoine Bethea.","(3:48) LeSean McCoy rush to the right for a loss of 5 yards to the Buf47. Tackled by Nick Bellore.","(4:29) LeSean McCoy rush to the right for 12 yards to the SF48. Tackled by Tramaine Brock.","(4:35) Mike Davis rush up the middle for no gain to the Buf40. Tackled by Preston Brown and Lerentee McCray.","(5:05) Mike Davis rush to the right for no gain to the Buf40. Tackled by Preston Brown and Zach Brown.","(5:19) Mike Davis rush to the left for 7 yards to the Buf40. Tackled by Stephon Gilmore.","(5:47) Carlos Hyde rush up the middle for 2 yards to the Buf47. Tackled by Leger Douzable.","(6:16) Colin Kaepernick rush to the right for 29 yards to the Buf49. Tackled by Stephon Gilmore.","(6:47) Carlos Hyde rush up the middle for 2 yards to the SF22. Tackled by Jerry Hughes.","(6:51) Colin Kaepernick incomplete pass to the left intended for Quinton Patton defensed by Stephon Gilmore.","(6:58) Colton Schmidt punts for 49 yards to SF0. Touchback.","(7:02) Tyrod Taylor incomplete pass to the right intended for Robert Woods defensed by Tramaine Brock.","(7:09) Tyrod Taylor incomplete pass to the right.","(7:43) Tyrod Taylor pass to the left to Marquise Goodwin for 6 yards to the SF49. Tackled by Tramaine Brock.","(7:54) Bradley Pinion punts for 47 yards to Buf32. Brandon Tate return for 13 yards to Buf45. Tackled by Shayne Skov.","(7:59) Colin Kaepernick incomplete pass to the middle intended for Jeremy Kerley defensed by Nickell Robey-Coleman.","(8:07) Colin Kaepernick incomplete pass to the right intended for Quinton Patton.","(8:36) Colin Kaepernick pass to the middle to Jeremy Kerley for 5 yards to the SF21. Tackled by Aaron Williams.","(9:13) Colin Kaepernick rush up the middle for 10 yards to the SF16. Tackled by Stephon Gilmore and Zach Brown.","(9:45) Mike Davis rush up the middle for 1 yard to the SF6. Tackled by Jerry Hughes and Preston Brown.","(9:54) Colton Schmidt punts for 49 yards to SF5. No return.","(9:59) Tyrod Taylor incomplete pass to the left intended for Justin Hunter defensed by Keith Reaser.","(10:42) Tyrod Taylor sacked at Buf46 for no gain by DeForest Buckner.","(11:10) Tyrod Taylor rush to the right for 3 yards to the Buf46. Tackled by Keith Reaser.","(11:15) Penalty: Illegal Contact on San Francisco (Nick Bellore) 5 yards.","(11:56) LeSean McCoy rush to the right for a loss of 4 yards to the Buf38. Tackled by Tramaine Brock. FUMBLE, recovered by Buf (LeSean McCoy).","(12:29) LeSean McCoy rush to the left for 4 yards to the Buf42. Tackled by Quinton Dial and DeForest Buckner.","(12:40) Bradley Pinion punts for 30 yards to Buf38. No return.","(12:46) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(12:46) Penalty: False Start on San Francisco (Trenton Brown) -5 yards.","(12:50) Colin Kaepernick incomplete pass to the right intended for Torrey Smith.","(13:08) Carlos Hyde rush to the right for 6 yards to the SF37. Tackled by Preston Brown and Corey Graham.","(13:21) Colton Schmidt punts for 54 yards to SF19. Jeremy Kerley return for 12 yards to SF31. Tackled by Mike Gillislee.","(13:59) Tyrod Taylor pass to the left to Marquise Goodwin for 16 yards to the Buf27. Tackled by Rashard Robinson.","(14:04) Tyrod Taylor incomplete pass to the left intended for Charles Clay.","(14:22) Penalty: Illegal Block on Buffalo (Richie Incognito) -10 yards.","(15:00) Reggie Bush rush to the left for 1 yard to the Buf21. Tackled by Nick Bellore and Michael Wilhoite.","(15:00) Penalty: Illegal Substitution on Buffalo -5 yards.","(15:00) Bradley Pinion kicks off to the endzone. Touchback.","(0:15) Colin Kaepernick rush up the middle for a loss of 1 yard to the SF18.","(0:21) Dan Carpenter kicks off to the SF2. Keshawn Martin return for 17 yards to SF19. Tackled by Kevon Seymour.","(0:25) Dan Carpenter 40 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(0:32) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(0:32) Buffalo Bills timeout.","(0:38) Tyrod Taylor pass to the middle to LeSean McCoy for 2 yards to the SF22. Tackled by Nick Bellore.","(0:47) Tyrod Taylor sacked at SF24 for no gain by DeForest Buckner.","(1:22) Robert Woods rush to the left for 6 yards to the SF24. Tackled by Eric Reid.","(1:29) Tyrod Taylor rush to the left for 18 yards to the SF20. Tackled by Rashard Robinson. Penalty: Holding on Buffalo (Robert Woods) -10 yards.","(2:00) Tyrod Taylor rush to the right for 10 yards to the SF38. Tackled by Nick Bellore.","(2:00) Two Minute Warning.","(2:38) Mike Gillislee rush to the left for 4 yards to the SF48. Tackled by Nick Bellore.","(3:10) LeSean McCoy rush to the left for 22 yards to the Buf48. Tackled by Rashard Robinson.","(3:15) Tyrod Taylor incomplete pass to the left intended for LeSean McCoy.","(3:38) Penalty: Pass Interference on Buffalo (Marquise Goodwin) -10 yards.","(3:43) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(4:31) Tyrod Taylor pass to the right to Robert Woods for 6 yards to the Buf36. Tackled by Eli Harold.","(5:15) Tyrod Taylor pass to the left to Charles Clay for 5 yards to the Buf30. Tackled by Michael Wilhoite and DeForest Buckner.","(5:54) LeSean McCoy rush to the right for no gain to the Buf25. Tackled by Nick Bellore.","(5:54) Bradley Pinion kicks off to the endzone. Touchback.","(5:59) Phil Dawson 48 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(6:03) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley defensed by Lorenzo Alexander.","(6:42) Carlos Hyde rush to the left for a loss of 2 yards to the Buf30. Tackled by Lorenzo Alexander and Zach Brown.","(7:09) Colin Kaepernick pass to the right to Torrey Smith for 8 yards to the Buf28. Tackled by Ronald Darby.","(7:50) Carlos Hyde rush to the right for 15 yards to the Buf36. Tackled by Aaron Williams and Preston Brown.","(8:24) Colin Kaepernick pass to the middle to Quinton Patton for 11 yards to the SF49. Tackled by Corey Graham.","(9:02) Colin Kaepernick pass to the left to Quinton Patton for 13 yards to the SF38. Tackled by Aaron Williams.","(9:42) Colin Kaepernick rush to the left for 11 yards to the SF25. Tackled by Zach Brown.","(10:11) Carlos Hyde rush to the left for 3 yards to the SF14. Tackled by Jerel Worthy and Corey Graham.","(10:18) Dan Carpenter kicks off to the SF-2. Torrey Smith return for 13 yards to SF11. Tackled by Nickell Robey-Coleman.","(10:18) Dan Carpenter extra point is good.","(10:24) LeSean McCoy rush to the left for 12 yards for a TOUCHDOWN.","(11:07) Tyrod Taylor pass to the left to Nick O'Leary for 6 yards to the SF12. Tackled by Eric Reid.","(11:50) Mike Gillislee rush up the middle for 2 yards to the SF18. Tackled by DeForest Buckner and Nick Bellore.","(12:17) Mike Gillislee rush up the middle for 2 yards to the SF20. Tackled by DeForest Buckner and Quinton Dial.","(12:41) Tyrod Taylor rush to the left for 7 yards to the SF22. Tackled by Eric Reid.","(13:23) LeSean McCoy rush up the middle for 38 yards to the SF29. Tackled by Eric Reid.","(13:56) Tyrod Taylor pass to the middle to Charles Clay for 8 yards to the Buf33. Tackled by Nick Bellore.","(13:56) Bradley Pinion kicks off to the endzone. Touchback.","(13:56) Phil Dawson extra point is good.","(14:07) Colin Kaepernick pass to the right to Torrey Smith for 53 yards for a TOUCHDOWN.","(14:32) Carlos Hyde rush to the left for 11 yards to the SF47. Tackled by Kyle Williams.","(15:00) Carlos Hyde rush to the left for 4 yards to the SF36. Tackled by Corey Graham.","(0:14) Colin Kaepernick rush to the right for 7 yards to the SF32. Tackled by Preston Brown.","(0:14) Dan Carpenter kicks off to the endzone. Touchback.","(0:14) Dan Carpenter extra point is good.","(0:18) LeSean McCoy rush to the right for 4 yards for a TOUCHDOWN.","(0:46) LeSean McCoy rush up the middle for 3 yards to the SF4. Tackled by Nick Bellore and Ahmad Brooks.","(1:21) Tyrod Taylor pass to the left to Charles Clay for 5 yards to the SF7. Tackled by Keith Reaser.","(2:07) Tyrod Taylor sacked at SF12 for no gain by Arik Armstead.","(2:33) LeSean McCoy rush to the left for 5 yards to the SF12. Tackled by Nick Bellore.","(3:11) Tyrod Taylor pass to the left to Robert Woods for 7 yards to the SF17. Tackled by Michael Wilhoite.","(3:46) LeSean McCoy rush to the right for 3 yards to the SF24. Tackled by Antoine Bethea.","(4:23) Tyrod Taylor pass to the right to Robert Woods for 18 yards to the SF27. Tackled by Antoine Bethea.","(4:56) EJ Manuel rush to the left for 8 yards to the SF45. Tackled by Rashard Robinson and Ahmad Brooks.","(5:25) LeSean McCoy rush to the left for 2 yards to the Buf47. Tackled by Tramaine Brock.","(5:43) Tyrod Taylor pass to the right to Charles Clay for 20 yards to the Buf45. Tackled by Eric Reid.","(5:43) Bradley Pinion kicks off to the endzone. Touchback.","(5:47) Phil Dawson 33 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(6:27) Colin Kaepernick pass to the left to Quinton Patton for 11 yards to the Buf15. Tackled by Preston Brown.","(6:27) San Francisco 49ers timeout.","(7:12) Colin Kaepernick rush to the left for a loss of 3 yards to the Buf26. Tackled by Zach Brown.","(7:54) Carlos Hyde rush up the middle for 1 yard to the Buf23. Tackled by Jerry Hughes.","(8:20) Penalty: Holding on San Francisco (Joshua Garnett) -10 yards.","(8:50) Colin Kaepernick pass to the right to Torrey Smith for 15 yards to the Buf14. Tackled by Ronald Darby.","(9:31) Carlos Hyde rush up the middle for a loss of 1 yard to the Buf29. Tackled by Kyle Williams and Corey Graham.","(9:36) Colin Kaepernick incomplete pass to the left intended for Shaun Draughn.","(9:41) Tyrod Taylor rush to the right for a loss of 8 yards to the Buf28. Tackled by Arik Armstead. FUMBLE, recovered by SF (DeForest Buckner).","(10:15) Tyrod Taylor pass to the right to Robert Woods for 8 yards to the Buf36. Tackled by Rashard Robinson.","(10:57) LeSean McCoy rush to the left for 16 yards to the Buf28. Tackled by Ahmad Brooks.","(11:05) Penalty: Face Mask on Buffalo (LeSean McCoy) -11 yards.","(11:11) Tyrod Taylor incomplete pass to the right.","(11:48) Tyrod Taylor rush to the right for 9 yards to the Buf23. Tackled by Keith Reaser.","(12:24) LeSean McCoy rush to the left for 1 yard to the Buf14. Tackled by Michael Wilhoite and Eric Reid.","(12:30) Tyrod Taylor incomplete pass to the right intended for Charles Clay.","(12:37) Bradley Pinion punts for 27 yards to Buf13. No return.","(13:17) Carlos Hyde rush up the middle for 1 yard to the Buf40. Tackled by Leger Douzable and Jerry Hughes.","(13:24) Colin Kaepernick incomplete pass to the right intended for Torrey Smith.","(13:52) Colin Kaepernick pass to the right to Jeremy Kerley for 7 yards to the Buf41. Tackled by Nickell Robey-Coleman.","(14:05) Colin Kaepernick pass to the middle to Quinton Patton for 17 yards to the Buf48.","(14:28) Colin Kaepernick rush to the left for 5 yards to the SF35. Tackled by Corey Graham.","(15:00) Carlos Hyde rush up the middle for 5 yards to the SF30. Tackled by Corey Graham.","(15:00) Dan Carpenter kicks off to the endzone. Touchback."]