["(0:07) Trevor Siemian incomplete pass to the right intended for Jordan Taylor defensed by Dexter McCoil.","(0:15) Trevor Siemian sacked at SD45 for no gain by Tourek Williams.","(0:22) Trevor Siemian incomplete pass to the left intended for C.J. Anderson.","(0:26) Trevor Siemian pass to the left to Virgil Green for 9 yards to the SD45.","(0:27) Brandon McManus onside kickoff to the Den46. Onside kick recovered by kicking team by Jordan Taylor.","(0:32) Brandon McManus 46 yard field goal attempt is GOOD. Holder: Riley Dixon.","(0:57) Trevor Siemian pass to the right to John Phillips for 10 yards to the SD28. Tackled by Casey Hayward and Jatavis Brown.","(1:01) Trevor Siemian incomplete pass to the left intended for Jordan Norwood.","(1:07) Trevor Siemian incomplete pass to the left intended for Jordan Taylor defensed by Steve Williams.","(1:14) Trevor Siemian pass to the right to Virgil Green for 6 yards to the SD38. Tackled by Casey Hayward and Craig Mager.","(1:20) Trevor Siemian incomplete pass to the left defensed by Corey Liuget.","(1:39) Trevor Siemian pass to the left to Bennie Fowler for 7 yards to the SD44. Tackled by Jatavis Brown.","(2:00) Trevor Siemian pass to the middle to C.J. Anderson for 11 yards to the Den49. Tackled by Melvin Ingram.","(2:00) Two Minute Warning.","(2:18) Trevor Siemian pass to the middle to C.J. Anderson for 7 yards to the Den38. Tackled by Jatavis Brown and Melvin Ingram.","(2:41) Trevor Siemian pass to the right to Demaryius Thomas for 8 yards to the Den31. Tackled by Craig Mager.","(3:03) Trevor Siemian pass to the middle to C.J. Anderson for 7 yards to the Den23. Tackled by Melvin Ingram.","(3:14) Drew Kaser punts for 47 yards to Den15. Aqib Talib return for 1 yard to Den16. Tackled by Darrell Stuckey.","(3:14) Denver Broncos timeout.","(3:20) Melvin Gordon rush up the middle for no gain to the SD38. Tackled by Corey Nelson and Todd Davis.","(3:25) Penalty: Offside on Denver (Derek Wolfe) 5 yards.","(3:25) Denver Broncos timeout.","(3:31) Melvin Gordon rush to the left for 6 yards to the SD33. Tackled by Darian Stewart.","(3:31) Denver Broncos timeout.","(3:35) Melvin Gordon rush up the middle for a loss of 2 yards to the SD27. Tackled by Aqib Talib.","(3:43) Trevor Siemian pass to the left to Demaryius Thomas for 11 yards to the SD29. Tackled by Jatavis Brown. FUMBLE, recovered by SD (Craig Mager).","(4:13) Trevor Siemian sacked at SD40 for a loss of 10 yards by Jatavis Brown.","(4:24) Penalty: Holding on Denver (Russell Okung) -10 yards.","(4:50) C.J. Anderson rush up the middle for 11 yards to the SD20. Tackled by Jatavis Brown and Korey Toomer.","(4:57) Trevor Siemian pass to the right to John Phillips for 16 yards to the SD31. Tackled by Casey Hayward.","(5:03) Trevor Siemian incomplete pass to the left intended for Bennie Fowler.","(5:23) Trevor Siemian pass to the left to Bennie Fowler for 10 yards to the SD47. Tackled by Steve Williams.","(5:45) Trevor Siemian pass to the left to Emmanuel Sanders for 6 yards to the Den43. Tackled by Steve Williams.","(6:00) Drew Kaser punts for 59 yards to Den27. Jordan Norwood return for 10 yards to Den37. Tackled by Trevor Williams.","(6:46) Philip Rivers sacked at SD14 for a loss of 12 yards by Jared Crick and Shane Ray.","(7:30) Melvin Gordon rush to the right for no gain to the SD26. Tackled by Jared Crick.","(8:08) Melvin Gordon rush up the middle for 1 yard to the SD26. Tackled by T.J. Ward.","(8:08) Riley Dixon kicks off to the endzone. Touchback.","(8:08) Brandon McManus extra point is good.","(8:13) Trevor Siemian pass to the right to Bennie Fowler for 5 yards for a TOUCHDOWN.","(8:17) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas defensed by Craig Mager.","(8:22) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas defensed by Casey Hayward.","(8:22) San Diego Chargers timeout.","(8:50) C.J. Anderson rush to the right for 7 yards to the SD5. Tackled by Korey Toomer.","(9:10) C.J. Anderson rush up the middle for 9 yards to the SD12. Tackled by Jatavis Brown and Korey Toomer.","(9:15) Trevor Siemian incomplete pass to the right intended for Jordan Norwood defensed by Craig Mager.","(9:43) Trevor Siemian pass to the left to Emmanuel Sanders for 20 yards to the SD21. Tackled by Dwight Lowery and Adrian Phillips.","(10:07) Penalty: False Start on Denver (Donald Stephenson) -5 yards.","(10:38) Trevor Siemian pass to the left to Jordan Norwood for 11 yards to the SD36. Tackled by Jerry Attaochu and Adrian Phillips.","(10:45) Trevor Siemian incomplete pass to the right.","(11:10) Penalty: Holding on Denver (Michael Schofield) -10 yards.","(11:33) Trevor Siemian pass to the right to Emmanuel Sanders for 8 yards to the SD37. Tackled by Jatavis Brown.","(11:57) Trevor Siemian pass to the middle to Virgil Green for 6 yards to the SD45. Tackled by Korey Toomer.","(11:59) Riley Dixon kicks off to the SD46. Kenny Wiggins - no return. FUMBLE, recovered by Den (Shiloh Keo). Tackled by Joshua Perry.","(12:04) Penalty: Holding on Denver (Russell Okung) -3 yards. Safety.","(12:14) Drew Kaser punts for 35 yards to Den3. No return.","(12:57) Kenneth Farrow rush up the middle for 6 yards to the Den38. Tackled by Todd Davis.","(13:39) Kenneth Farrow rush up the middle for a loss of 1 yard to the Den44. Tackled by Darian Stewart.","(14:17) Melvin Gordon rush up the middle for 1 yard to the Den43. Tackled by Von Miller.","(15:00) Melvin Gordon rush to the left for 2 yards to the Den44. Tackled by Billy Winn.","(0:09) Melvin Gordon rush up the middle for 8 yards to the Den46. Tackled by Brandon Marshall.","(0:14) 56 yard field goal attempt by Brandon McManus is NO GOOD. Holder: Riley Dixon.","(0:21) Trevor Siemian incomplete pass to the right.","(0:56) Trevor Siemian pass to the right to Devontae Booker for 2 yards to the SD38. Tackled by Casey Hayward.","(1:29) Penalty: Holding on Denver (Matt Paradis) -10 yards.","(1:58) Trevor Siemian pass to the left to Jordan Norwood for 7 yards to the SD30. Tackled by Dwight Lowery.","(2:32) Devontae Booker rush to the left for 16 yards to the SD37. Tackled by Dwight Lowery and Adrian Phillips.","(2:56) Trevor Siemian pass to the left to Devontae Booker for 5 yards to the Den47. Tackled by Jatavis Brown.","(3:31) Devontae Booker rush to the left for 17 yards to the Den42. Tackled by Adrian Phillips.","(3:31) Josh Lambo kicks off to the endzone. Touchback.","(3:35) Josh Lambo 32 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(4:07) Philip Rivers pass to the left to Tyrell Williams for 6 yards to the Den14. Tackled by Chris Harris Jr..","(4:13) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(4:18) Philip Rivers incomplete pass to the right intended for Antonio Gates.","(4:25) Penalty: Pass Interference on Denver (Aqib Talib) 15 yards.","(4:30) Philip Rivers incomplete pass to the left intended for Melvin Gordon.","(5:14) Melvin Gordon rush up the middle for 4 yards to the Den35. Tackled by Von Miller and Todd Davis.","(5:40) Penalty: Illegal Formation on San Diego (Sean McGrath) -5 yards.","(6:17) Philip Rivers pass to the middle to Hunter Henry for 15 yards to the Den49. Tackled by Darian Stewart. Penalty: Roughing Passer on Denver (Derek Wolfe) 15 yards.","(6:22) Philip Rivers incomplete pass to the left intended for Hunter Henry.","(6:34) Riley Dixon punts for 42 yards to SD28. Dexter McCluster return for 8 yards to SD36. Tackled by Corey Nelson.","(7:04) Trevor Siemian pass to the right to John Phillips for 5 yards to the Den30. Tackled by Korey Toomer.","(7:09) Trevor Siemian incomplete pass to the middle intended for Demaryius Thomas.","(7:15) Trevor Siemian incomplete pass to the right intended for Bennie Fowler.","(7:15) Josh Lambo kicks off to the endzone. Touchback.","(7:19) Josh Lambo 31 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(7:59) Philip Rivers pass to the right to Dexter McCluster for 5 yards to the Den13. Tackled by Will Parks.","(8:40) Melvin Gordon rush to the right for no gain to the Den18. Tackled by Von Miller.","(9:15) Melvin Gordon rush to the right for 2 yards to the Den18. Tackled by Aqib Talib.","(9:27) Trevor Siemian pass to the right to Jordan Taylor for 1 yard to the Den37. Tackled by Korey Toomer. FUMBLE, recovered by SD (Korey Toomer) and returned for 2 yards. Tackled by Donald Stephenson. Penalty: Unnecessary Roughness on Denver (Donald Stephenson) 15 yards.","(9:31) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas.","(9:58) Devontae Booker rush up the middle for 5 yards to the Den36. Tackled by Jatavis Brown.","(10:35) Trevor Siemian pass to the right to Demaryius Thomas for 7 yards to the Den31. Tackled by Brandon Mebane.","(10:41) Josh Lambo kicks off to the Den-3. Jordan Norwood return for 27 yards to Den24. Tackled by Kyle Emanuel.","(10:44) Josh Lambo 21 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(10:50) Philip Rivers incomplete pass to the right intended for Griff Whalen defensed by Kayvon Webster.","(11:20) Melvin Gordon rush to the right for a loss of 1 yard to the Den3. Tackled by Brandon Marshall.","(12:00) Philip Rivers pass to the left to Tyrell Williams for 4 yards to the Den2. Tackled by Chris Harris Jr..","(12:51) Melvin Gordon rush to the left for 48 yards to the Den6. Tackled by Chris Harris Jr. and Darian Stewart.","(13:03) Riley Dixon punts for 42 yards to SD42. Dexter McCluster return for 4 yards to SD46. Tackled by Kayvon Webster.","(13:10) Trevor Siemian incomplete pass to the left intended for Virgil Green.","(13:31) Penalty: False Start on Denver (Donald Stephenson) -5 yards.","(14:13) Trevor Siemian pass to the left to Demaryius Thomas for 6 yards to the Den21. Tackled by Casey Hayward.","(14:55) C.J. Anderson rush to the right for a loss of 2 yards to the Den15. Tackled by Melvin Ingram and Kyle Emanuel.","(15:00) Josh Lambo kicks off to the Den-2. Jordan Norwood return for 19 yards to Den17. Tackled by Joshua Perry and Derek Watt.","(0:45) Devontae Booker rush to the right for 5 yards to the Den18. Tackled by Melvin Ingram.","(0:45) San Diego Chargers timeout.","(0:50) C.J. Anderson rush up the middle for 5 yards to the Den13. Tackled by Jatavis Brown and Corey Liuget.","(0:50) San Diego Chargers timeout.","(0:57) C.J. Anderson rush up the middle for 3 yards to the Den8. Tackled by Denzel Perryman and Dwight Lowery.","(1:05) Penalty: Holding on Denver (Max Garcia) -5 yards.","(1:12) Drew Kaser punts for 36 yards to Den10. No return.","(1:17) Philip Rivers incomplete pass to the middle intended for Antonio Gates.","(2:00) Melvin Gordon rush to the right for 2 yards to the Den46. Tackled by Chris Harris Jr. and Derek Wolfe.","(2:00) Two Minute Warning.","(2:17) Melvin Gordon rush to the left for 3 yards to the Den48. Tackled by Shane Ray.","(2:28) Riley Dixon punts for 42 yards to SD33. Dexter McCluster return for 16 yards to SD49. Tackled by Casey Kreiter.","(3:15) Trevor Siemian pass to the left to C.J. Anderson for 9 yards to the Den25. Tackled by Jatavis Brown and Craig Mager.","(3:19) Trevor Siemian incomplete pass to the middle intended for Bennie Fowler.","(3:28) Trevor Siemian incomplete pass to the right intended for Bennie Fowler.","(3:43) Drew Kaser punts for 60 yards to Den10. Jordan Norwood return for 6 yards to Den16. Tackled by Korey Toomer.","(4:14) Philip Rivers pass to the right to Travis Benjamin for 3 yards to the SD30. Tackled by Aqib Talib.","(4:55) Philip Rivers pass to the left to Hunter Henry for 4 yards to the SD27. Tackled by T.J. Ward.","(5:35) Melvin Gordon rush up the middle for 1 yard to the SD23. Tackled by Von Miller.","(5:40) Brandon McManus kicks off to the SD10. Griff Whalen return for 12 yards to SD22. Tackled by Will Parks.","(5:44) Brandon McManus 29 yard field goal attempt is GOOD. Holder: Riley Dixon.","(6:27) Trevor Siemian rush up the middle for 1 yard to the SD11. Tackled by Joey Bosa.","(7:11) Trevor Siemian pass to the right to Demaryius Thomas for 3 yards to the SD12. Tackled by Melvin Ingram.","(7:48) C.J. Anderson rush to the right for a loss of 4 yards to the SD15. Tackled by Denzel Perryman.","(7:59) Riley Dixon punts for 47 yards to SD11. Travis Benjamin - no return. FUMBLE, recovered by Den (Will Parks).","(8:04) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(8:08) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(8:40) Devontae Booker rush to the right for 3 yards to the Den42. Tackled by Brandon Mebane.","(9:16) Trevor Siemian pass to the left to Jordan Norwood for 9 yards to the Den39. Tackled by Craig Mager.","(9:59) Trevor Siemian pass to the right to Jordan Norwood for 3 yards to the Den30. Tackled by Casey Hayward.","(10:35) C.J. Anderson rush to the left for 2 yards to the Den27. Tackled by Caraun Reid.","(10:35) Josh Lambo kicks off to the endzone. Touchback.","(10:35) Josh Lambo 37 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(10:59) Philip Rivers sacked at Den19 for no gain by Von Miller.","(11:05) Philip Rivers incomplete pass to the right intended for Hunter Henry.","(11:11) Philip Rivers incomplete pass to the right intended for Melvin Gordon.","(12:05) Melvin Gordon rush up the middle for 1 yard to the Den19. Tackled by Von Miller.","(12:45) Philip Rivers pass to the right to Dexter McCluster for 10 yards to the Den20. Tackled by Brandon Marshall.","(12:51) Philip Rivers incomplete pass to the left intended for Travis Benjamin defensed by Bradley Roby.","(13:36) Melvin Gordon rush to the right for a loss of 1 yard to the Den30. Tackled by Sylvester Williams.","(14:20) Philip Rivers pass to the right to Hunter Henry for 12 yards to the Den29. Tackled by T.J. Ward and Sylvester Williams.","(15:00) Melvin Gordon rush up the middle for 1 yard to the Den41. Tackled by Derek Wolfe and Jared Crick.","(0:34) Philip Rivers pass to the left to Travis Benjamin for 6 yards to the Den42. Tackled by Bradley Roby.","(1:16) Melvin Gordon rush to the left for 7 yards to the Den48. Tackled by Brandon Marshall.","(1:58) Melvin Gordon rush to the left for a loss of 2 yards to the SD45. Tackled by Shaquil Barrett.","(2:37) Philip Rivers pass to the right to Hunter Henry for 20 yards to the SD47. Tackled by T.J. Ward.","(2:37) San Diego Chargers timeout.","(3:24) Melvin Gordon rush up the middle for 2 yards to the SD27. Tackled by Jared Crick.","(4:07) Philip Rivers pass to the right to Derek Watt for 8 yards to the SD25. Tackled by T.J. Ward and Todd Davis.","(4:49) Melvin Gordon rush to the left for 3 yards to the SD17. Tackled by Shane Ray and Brandon Marshall.","(4:56) Penalty: Offside on Denver (Von Miller) 5 yards.","(5:38) Melvin Gordon rush to the right for 3 yards to the SD9. Tackled by Derek Wolfe and Jared Crick.","(5:48) Riley Dixon punts for 48 yards to SD6. No return.","(6:25) Trevor Siemian pass to the left to Jordan Norwood for 9 yards to the Den46. Tackled by Denzel Perryman.","(6:33) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(7:09) C.J. Anderson rush to the right for no gain to the Den37. Tackled by Jatavis Brown.","(7:44) C.J. Anderson rush to the right for 6 yards to the Den37. Tackled by Jatavis Brown.","(8:00) Trevor Siemian pass to the right to Emmanuel Sanders for 6 yards to the Den31. Tackled by Steve Williams.","(8:00) Josh Lambo kicks off to the endzone. Touchback.","(8:00) Josh Lambo extra point is good.","(8:06) Philip Rivers pass to the left to Hunter Henry for 5 yards for a TOUCHDOWN.","(8:46) Melvin Gordon rush to the right for no gain to the Den5. Tackled by T.J. Ward.","(9:23) Philip Rivers pass to the right to Hunter Henry for 27 yards to the Den5. Tackled by Darian Stewart.","(9:52) Philip Rivers pass to the right to Dontrelle Inman for 11 yards to the Den32. Tackled by Chris Harris Jr..","(10:24) Penalty: Pass Interference on San Diego (Hunter Henry) -10 yards.","(10:52) Penalty: Illegal Shift on San Diego (Dontrelle Inman) -5 yards.","(11:32) Philip Rivers pass to the right to Antonio Gates for 10 yards to the Den28. Tackled by T.J. Ward.","(11:38) Philip Rivers incomplete pass to the left intended for Travis Benjamin defensed by Bradley Roby.","(12:22) Melvin Gordon rush to the left for 2 yards to the Den38. Tackled by Billy Winn.","(12:56) Philip Rivers pass to the left to Tyrell Williams for 18 yards to the Den40.","(13:36) Melvin Gordon rush up the middle for 3 yards to the SD42. Tackled by Brandon Marshall and Sylvester Williams.","(14:21) Philip Rivers pass to the right to Antonio Gates for 6 yards to the SD39. Tackled by Darian Stewart.","(14:56) Philip Rivers pass to the left to Travis Benjamin for 8 yards to the SD33. Tackled by Chris Harris Jr..","(15:00) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(15:00) Brandon McManus kicks off to the endzone. Touchback."]