["(0:34) Drew Stanton rush up the middle for a loss of 1 yard to the NYJ24.","(1:15) Stepfan Taylor rush up the middle for 12 yards to the NYJ23. Tackled by Jordan Jenkins.","(2:00) Stepfan Taylor rush up the middle for 2 yards to the NYJ35. Tackled by Sheldon Richardson.","(2:00) Two Minute Warning.","(2:11) Andre Ellington rush up the middle for no gain to the NYJ37. Tackled by Leonard Williams.","(3:00) Andre Ellington rush up the middle for 13 yards to the NYJ37. Tackled by Marcus Gilchrist.","(3:39) Drew Stanton pass to the middle to Jaron Brown for 12 yards to the Ari50. Tackled by Marcus Gilchrist.","(4:20) Andre Ellington rush up the middle for no gain to the Ari38. Tackled by Erin Henderson.","(4:27) Geno Smith pass intended for Charone Peake INTERCEPTED by Tyrann Mathieu and returned for 4 yards.","(4:27) New York Jets timeout.","(5:16) Geno Smith sacked at Ari47 for a loss of 8 yards by Alex Okafor. FUMBLE, recovered by NYJ (Ben Ijalana).","(5:20) Geno Smith incomplete pass to the middle intended for Charone Peake defensed by Tyrann Mathieu.","(5:51) Geno Smith pass to the right to Robby Anderson for 7 yards to the Ari39. Tackled by D.J. Swearinger.","(6:18) Bilal Powell rush up the middle for 3 yards to the Ari46. Tackled by Kevin Minter.","(6:45) Geno Smith pass to the left to Bilal Powell for 3 yards to the Ari49. Tackled by Deone Bucannon.","(7:15) Geno Smith rush up the middle for 2 yards to the NYJ48. Tackled by Tyrann Mathieu.","(7:43) Geno Smith pass to the right to Charone Peake for 4 yards to the NYJ46. Tackled by Tyrann Mathieu.","(8:20) Geno Smith pass to the middle to Quincy Enunwa for 17 yards to the NYJ42. Tackled by Tony Jefferson.","(8:20) Chandler Catanzaro kicks off to the endzone. Touchback.","(8:20) Chandler Catanzaro extra point is good.","(8:27) Carson Palmer pass to the right to Michael Floyd for 9 yards for a TOUCHDOWN.","(9:05) J.J. Nelson rush to the left for 9 yards to the NYJ9. Tackled by Darryl Roberts.","(9:43) David Johnson rush up the middle for 2 yards to the NYJ18. Tackled by Steve McLendon.","(10:26) Carson Palmer pass to the right to John Brown for 13 yards to the NYJ20. Tackled by Darryl Roberts.","(10:30) Carson Palmer incomplete pass to the left intended for Jermaine Gresham.","(10:36) Carson Palmer incomplete pass to the right intended for David Johnson.","(10:36) New York Jets timeout.","(11:09) Carson Palmer pass to the right to John Brown for 13 yards to the NYJ33.","(11:55) David Johnson rush up the middle for 2 yards to the NYJ46. Tackled by Muhammad Wilkerson.","(12:29) Carson Palmer pass to the right to John Brown for 12 yards to the NYJ48.","(12:58) Carson Palmer pass to the right to John Brown for 9 yards to the Ari40. Tackled by Buster Skrine.","(13:42) David Johnson rush up the middle for 7 yards to the Ari31. Tackled by Calvin Pryor.","(14:20) Carson Palmer rush up the middle for no gain to the Ari26. FUMBLE, recovered by Ari (Carson Palmer).","(15:00) Carson Palmer pass to the left to Larry Fitzgerald for 11 yards to the Ari26. Tackled by Calvin Pryor.","(0:46) David Johnson rush up the middle for 4 yards to the Ari15. Tackled by Jordan Jenkins.","(0:56) Ryan Fitzpatrick pass intended for Brandon Marshall INTERCEPTED by D.J. Swearinger and returned for 12 yards. Tackled by Robby Anderson.","(1:40) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 13 yards to the Ari14. Tackled by Tony Jefferson.","(1:46) Ryan Fitzpatrick incomplete pass to the right intended for Jalin Marshall.","(1:51) Penalty: Holding on New York (Brian Winters) -10 yards.","(2:21) Ryan Fitzpatrick pass to the middle to Jalin Marshall for 11 yards to the Ari17. Tackled by Tyrann Mathieu.","(2:25) Ryan Fitzpatrick incomplete pass to the right intended for Jalin Marshall defensed by Deone Bucannon.","(2:32) Penalty: Delay of Game on Arizona (Tyrann Mathieu) 5 yards.","(2:32) Ryan Fitzpatrick incomplete pass to the middle intended for Charone Peake defensed by D.J. Swearinger.","(3:06) Bilal Powell rush up the middle for 5 yards to the Ari33. Tackled by Corey Peters.","(3:31) Ryan Fitzpatrick pass to the left to Robby Anderson for 7 yards to the Ari38. Tackled by Tharold Simon.","(4:02) Ryan Fitzpatrick pass to the right to Charone Peake for 14 yards to the Ari45. Tackled by Tyrann Mathieu.","(4:07) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa defensed by Frostee Rucker.","(4:44) Ryan Fitzpatrick pass to the left to Robby Anderson for 4 yards to the NYJ41. Tackled by Tharold Simon.","(5:24) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 12 yards to the NYJ37. Tackled by Kevin Minter.","(5:24) Chandler Catanzaro kicks off to the endzone. Touchback.","(5:24) Chandler Catanzaro extra point is good.","(5:28) David Johnson rush up the middle for 2 yards for a TOUCHDOWN.","(6:06) David Johnson rush up the middle for 1 yard to the NYJ2. Tackled by Erin Henderson and Steve McLendon.","(6:48) David Johnson rush up the middle for 5 yards to the NYJ3. Tackled by Rontez Miles and Marcus Gilchrist.","(7:26) Carson Palmer pass to the right to John Brown for 7 yards to the NYJ8. Tackled by Marcus Williams.","(8:00) Carson Palmer pass to the left to David Johnson for 8 yards to the NYJ15. Tackled by Bruce Carter.","(8:37) Andre Ellington rush to the left for 7 yards to the NYJ23. Tackled by Erin Henderson.","(9:12) Andre Ellington rush to the right for 5 yards to the NYJ30. Tackled by Erin Henderson.","(9:29) Penalty: False Start on Arizona (D.J. Humphries) -5 yards.","(9:49) Carson Palmer pass to the left to Michael Floyd for 13 yards to the NYJ30.","(10:13) Penalty: Illegal Shift on Arizona -5 yards.","(10:51) David Johnson rush up the middle for 6 yards to the NYJ38. Tackled by Erin Henderson.","(11:34) Carson Palmer pass to the right to Jaron Brown for 7 yards to the NYJ44. Tackled by Darrelle Revis.","(12:11) David Johnson rush up the middle for no gain to the Ari49. Tackled by Calvin Pryor.","(12:29) David Johnson rush up the middle for 14 yards to the NYJ41. Tackled by Sheldon Richardson. Penalty: Illegal Block on Arizona (Michael Floyd) -10 yards.","(12:33) Penalty: Pass Interference on New York (Darryl Roberts) 14 yards.","(12:38) Carson Palmer incomplete pass to the left intended for David Johnson.","(13:01) David Johnson rush up the middle for a loss of 1 yard to the Ari31. Tackled by Leonard Williams.","(13:10) Lachlan Edwards punts for 38 yards to Ari31. Patrick Peterson return for 1 yard to Ari32. Tackled by Juston Burris.","(13:38) Ryan Fitzpatrick pass to the right to Bilal Powell for 5 yards to the NYJ31. Tackled by Deone Bucannon.","(14:24) Matt Forte rush to the left for a loss of 2 yards to the NYJ26. Tackled by Corey Peters.","(15:00) Matt Forte rush to the right for 3 yards to the NYJ28. Tackled by D.J. Swearinger.","(15:00) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:04) Carson Palmer rush up the middle for a loss of 1 yard to the Ari6.","(0:14) Lachlan Edwards punts for 37 yards to Ari7. No return.","(0:19) Ryan Fitzpatrick incomplete pass to the right intended for Charone Peake.","(0:19) New York Jets timeout.","(0:24) Ryan Fitzpatrick incomplete pass to the left intended for Robby Anderson.","(0:24) Penalty: False Start on New York (Ryan Fitzpatrick) -5 yards.","(0:28) Ryan Fitzpatrick incomplete pass to the right intended for Bilal Powell defensed by Robert Nkemdiche.","(0:49) Ryan Fitzpatrick pass to the left to Charone Peake for 11 yards to the Ari39. Tackled by Tyrann Mathieu.","(0:49) New York Jets timeout.","(0:58) Ryan Fitzpatrick pass to the right to Brandon Marshall for 23 yards to the NYJ50. Tackled by Patrick Peterson.","(1:23) Ryan Fitzpatrick pass to the right to Charone Peake for 7 yards to the NYJ27. Tackled by Tharold Simon.","(1:30) Ryan Quigley punts for 42 yards to NYJ20. No return.","(1:30) New York Jets timeout.","(1:45) Carson Palmer pass to the right to David Johnson for 9 yards to the Ari38. Tackled by Darron Lee and Erin Henderson.","(1:50) Carson Palmer incomplete pass to the right intended for John Brown.","(1:55) Carson Palmer incomplete pass to the left intended for John Brown.","(2:00) Carson Palmer pass to the right to Jermaine Gresham for 14 yards to the Ari29. Tackled by Bruce Carter.","(2:00) Two Minute Warning.","(2:18) Carson Palmer pass to the right to Jaron Brown for 10 yards to the Ari15. Tackled by Marcus Williams.","(2:41) Penalty: Holding on Arizona (Larry Fitzgerald) -5 yards.","(2:49) Lachlan Edwards punts for 49 yards to Ari20. No return. Penalty: Holding on Arizona (Justin Bethel) -10 yards.","(2:55) Ryan Fitzpatrick incomplete pass to the left intended for Matt Forte.","(3:40) Matt Forte rush to the left for 8 yards to the NYJ31. Tackled by Corey Peters.","(4:06) Matt Forte rush to the right for 1 yard to the NYJ23. Tackled by Chandler Jones and Deone Bucannon.","(4:15) Ryan Quigley punts for 36 yards to NYJ22. No return.","(4:51) Carson Palmer pass to the left to David Johnson for 10 yards to the Ari42. Tackled by Sheldon Richardson.","(5:34) David Johnson rush up the middle for a loss of 5 yards to the Ari32. Tackled by Bruce Carter.","(5:39) Carson Palmer incomplete pass to the right intended for Ifeanyi Momah.","(5:46) Lachlan Edwards punts for 37 yards to Ari37. No return.","(5:52) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa.","(6:36) Matt Forte rush to the right for 1 yard to the NYJ26. Tackled by Markus Golden.","(6:43) Ryan Fitzpatrick incomplete pass to the left intended for Robby Anderson defensed by Marcus Cooper.","(6:43) Chandler Catanzaro kicks off to the endzone. Touchback.","(6:43) Chandler Catanzaro extra point is good.","(6:46) David Johnson rush up the middle for 2 yards for a TOUCHDOWN.","(6:49) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald defensed by Muhammad Wilkerson.","(7:38) David Johnson rush up the middle for 2 yards to the NYJ2. Tackled by Sheldon Richardson.","(8:12) Carson Palmer pass to the left to Larry Fitzgerald for 5 yards to the NYJ4. Tackled by Marcus Williams. FUMBLE, recovered by Ari.","(8:53) David Johnson rush up the middle for 4 yards to the NYJ9. Tackled by Jarvis Jenkins.","(9:33) Carson Palmer pass to the left to Larry Fitzgerald for 12 yards to the NYJ13. Tackled by Darrelle Revis.","(9:38) Penalty: Pass Interference on New York (Buster Skrine) 19 yards.","(10:15) Carson Palmer pass to the left to J.J. Nelson for 5 yards to the NYJ44. Tackled by Buster Skrine.","(10:46) J.J. Nelson rush to the left for 14 yards to the NYJ49. Tackled by Sheldon Richardson.","(11:24) Carson Palmer pass to the left to J.J. Nelson for 11 yards to the Ari37. Tackled by Buster Skrine.","(11:24) Arizona Cardinals timeout.","(11:30) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald.","(12:06) David Johnson rush to the left for 1 yard to the Ari26. Tackled by Leonard Williams.","(12:06) Nick Folk kicks off to the endzone. Touchback.","(12:12) Nick Folk 39 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(12:36) Ryan Fitzpatrick pass to the right to Charone Peake for 7 yards to the Ari21. Tackled by Tharold Simon.","(12:43) Ryan Fitzpatrick incomplete pass to the left intended for Matt Forte.","(13:06) Penalty: Holding on New York (Ryan Clady) -10 yards.","(13:43) Ryan Fitzpatrick pass to the left to Robby Anderson for 6 yards to the Ari18. Tackled by D.J. Swearinger.","(14:09) Ryan Fitzpatrick pass to the left to Brandon Marshall for 36 yards to the Ari24. Tackled by Marcus Cooper.","(14:09) Penalty: Encroachment on Arizona (Corey Peters) 5 yards.","(14:15) Penalty: Pass Interference on Arizona (Patrick Peterson) 9 yards.","(15:00) Matt Forte rush up the middle for 3 yards to the NYJ26. Tackled by Deone Bucannon.","(0:17) Matt Forte rush up the middle for 2 yards to the NYJ23. Tackled by Josh Mauro.","(0:26) Ryan Quigley punts for 41 yards to NYJ21. No return.","(0:31) Carson Palmer incomplete pass to the left intended for Jaron Brown defensed by Buster Skrine.","(1:13) Carson Palmer pass to the left to Jaron Brown for 6 yards to the Ari38. Tackled by Buster Skrine.","(1:50) David Johnson rush up the middle for no gain to the Ari32. Tackled by Sheldon Richardson.","(2:03) Lachlan Edwards punts for 49 yards to Ari35. John Brown return for a loss of 3 yards to Ari32. Tackled by Charone Peake.","(2:08) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(2:50) Bilal Powell rush to the left for 2 yards to the NYJ16. Tackled by Kevin Minter and Chandler Jones.","(3:30) Ryan Fitzpatrick rush up the middle for 2 yards to the NYJ14. Tackled by Rodney Gunter.","(3:37) Ryan Quigley punts for 34 yards to NYJ12. No return.","(4:05) Carson Palmer pass to the right to Larry Fitzgerald for no gain to the NYJ46. Tackled by Calvin Pryor.","(4:49) David Johnson rush to the left for 1 yard to the NYJ46. Tackled by Leonard Williams and Erin Henderson.","(4:54) Carson Palmer incomplete pass to the middle intended for Larry Fitzgerald.","(4:59) Penalty: Holding on New York (Buster Skrine) 5 yards.","(5:08) Penalty: Offside on New York (Sheldon Richardson) 5 yards.","(5:14) Penalty: Holding on New York (Darrelle Revis) 5 yards.","(5:56) David Johnson rush to the left for 1 yard to the Ari38. Tackled by Steve McLendon.","(6:36) David Johnson rush to the right for 2 yards to the Ari37. Tackled by Jordan Jenkins.","(7:18) Carson Palmer pass to the left to Larry Fitzgerald for 11 yards to the Ari35. Tackled by Buster Skrine.","(7:30) Lachlan Edwards punts for 49 yards to Ari18. John Brown return for 6 yards to Ari24. Tackled by Bruce Carter.","(7:36) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(8:16) Matt Forte rush up the middle for 7 yards to the NYJ33. Tackled by D.J. Swearinger.","(8:21) Ryan Fitzpatrick incomplete pass to the left intended for Charone Peake.","(8:47) Penalty: False Start on New York (Kellen Davis) -5 yards.","(9:13) Penalty: False Start on New York (Brent Qvale) -5 yards.","(9:51) Ryan Fitzpatrick pass to the left to Brandon Marshall for 11 yards to the NYJ36. Tackled by Tyrann Mathieu.","(9:51) Chandler Catanzaro kicks off to the endzone. Touchback.","(9:51) Chandler Catanzaro extra point is good.","(10:03) David Johnson rush to the left for 58 yards for a TOUCHDOWN.","(10:12) Lachlan Edwards punts for 36 yards to NYJ48. No return. Penalty: Illegal Block on Arizona (Brittan Golden) -10 yards.","(10:49) Ryan Fitzpatrick pass to the left to Bilal Powell for 4 yards to the NYJ12. Tackled by Markus Golden.","(11:33) Ryan Fitzpatrick pass to the left to Matt Forte for 3 yards to the NYJ8. Tackled by Deone Bucannon.","(12:12) Matt Forte rush up the middle for a loss of 4 yards to the NYJ5. Tackled by Josh Mauro.","(12:22) Ryan Quigley punts for 47 yards to NYJ9. No return.","(12:28) Carson Palmer incomplete pass to the left intended for David Johnson.","(13:10) Carson Palmer pass to the right to Larry Fitzgerald for 10 yards to the Ari44. Tackled by Darrelle Revis.","(13:52) Carson Palmer rush up the middle for no gain to the Ari36. FUMBLE, recovered by Ari (Carson Palmer).","(14:26) David Johnson rush to the right for 3 yards to the Ari36. Tackled by Darron Lee and Leonard Williams.","(15:00) Carson Palmer pass to the right to Darren Fells for 8 yards to the Ari33. Tackled by Calvin Pryor.","(15:00) Nick Folk kicks off to the endzone. Touchback."]