["(0:29) Kirk Cousins rush up the middle for a loss of 1 yard to the Phi23.","(0:29) Penalty: Delay of Game on Washington (Kirk Cousins) -5 yards.","(1:27) Matt Jones rush to the left for 57 yards to the Phi17. Tackled by Rodney McLeod.","(1:27) Philadelphia Eagles timeout.","(1:34) Matt Jones rush to the right for 1 yard to the Was26. Tackled by Destiny Vaeao and Beau Allen.","(1:34) Philadelphia Eagles timeout.","(1:38) Matt Jones rush up the middle for 2 yards to the Was25. Tackled by Mychal Kendricks.","(1:44) Donnie Jones punts for 37 yards to Was23. No return.","(1:44) Philadelphia Eagles timeout.","(1:58) Carson Wentz sacked at Phi40 for a loss of 9 yards by Trent Murphy and Preston Smith.","(1:58) Two Minute Warning.","(2:06) Carson Wentz sacked at Phi49 for a loss of 9 yards by Ricky Jean Francois.","(2:41) Carson Wentz pass to the right to Darren Sproles for 4 yards to the Was42. Tackled by Mason Foster.","(3:13) Carson Wentz pass to the middle to Nelson Agholor for 18 yards to the Was46. Tackled by Bashaud Breeland.","(3:48) Darren Sproles rush to the right for 1 yard to the Phi36. Tackled by Ryan Kerrigan.","(3:54) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(4:00) Penalty: Illegal Use of Hands on Washington (Bashaud Breeland) 5 yards.","(4:05) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham defensed by Will Compton.","(4:17) Tress Way punts for 58 yards to Phi16. Darren Sproles return for 14 yards to Phi30. Tackled by Martrell Spaight and Will Compton.","(4:25) Kirk Cousins incomplete pass to the right.","(4:30) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(5:14) Rob Kelley rush to the left for 2 yards to the Was26. Tackled by Jordan Hicks and Nigel Bradham.","(5:20) Caleb Sturgis kicks off to the Was2. Chris Thompson return for 22 yards to Was24. Tackled by Rodney McLeod.","(5:25) Caleb Sturgis 28 yard field goal attempt is GOOD. Holder: Donnie Jones.","(5:29) Carson Wentz incomplete pass to the left intended for Zach Ertz.","(5:51) Penalty: False Start on Philadelphia (Brandon Brooks) -5 yards.","(6:34) Carson Wentz pass to the left to Nelson Agholor for 4 yards to the Was5. Tackled by Mason Foster.","(6:57) Darren Sproles rush to the left for 2 yards to the Was9. Tackled by Bashaud Breeland.","(7:26) Darren Sproles rush to the left for 11 yards to the Was11. Tackled by Kendall Fuller and Will Blackmon.","(7:57) Carson Wentz pass to the right to Zach Ertz for 22 yards to the Was22. Tackled by Will Compton.","(8:30) Carson Wentz pass to the right to Dorial Green-Beckham for 23 yards to the Was44. Tackled by Donte Whitner and Bashaud Breeland.","(9:01) Penalty: Holding on Philadelphia (Jason Kelce) -10 yards.","(9:37) Ryan Mathews rush up the middle for 22 yards to the Phi43. Tackled by Donte Whitner and Mason Foster.","(9:43) Dustin Hopkins kicks off to the Phi-4. Josh Huff return for 25 yards to Phi21. Tackled by Martrell Spaight and Josh Evans.","(9:48) Dustin Hopkins 50 yard field goal attempt is GOOD. Holder: Tress Way.","(9:53) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(9:59) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(10:41) Matt Jones rush to the left for a loss of 3 yards to the Phi32. Tackled by Jordan Hicks and Vinny Curry.","(10:41) Washington Redskins timeout.","(10:48) Penalty: Offside on Philadelphia (Rodney McLeod) 5 yards.","(11:32) Chris Thompson rush to the right for 6 yards to the Phi34. Tackled by Jalen Mills.","(12:10) Kirk Cousins pass to the left to Vernon Davis for 37 yards to the Phi40. Tackled by Rodney McLeod.","(12:52) Matt Jones rush to the left for 13 yards to the Was23. Tackled by Rodney McLeod and Nolan Carroll.","(12:56) Caleb Sturgis kicks off to the Was-2. Chris Thompson return for 12 yards to Was10. Tackled by Chris Maragos.","(13:01) Caleb Sturgis 38 yard field goal attempt is GOOD. Holder: Donnie Jones.","(13:39) Kenjon Barner rush up the middle for no gain to the Was20. Tackled by Preston Smith.","(13:44) Carson Wentz incomplete pass to the left intended for Zach Ertz defensed by Ziggy Hood.","(14:18) Kenjon Barner rush up the middle for 6 yards to the Was20. Tackled by Donte Whitner.","(14:55) Carson Wentz pass to the right to Jordan Matthews for 54 yards to the Was26. Tackled by Will Blackmon.","(14:55) Penalty: False Start on Philadelphia (Jason Peters) -5 yards.","(15:00) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(0:34) Ryan Mathews rush up the middle for 1 yard to the Phi25. Tackled by Ricky Jean Francois and Trent Murphy.","(1:10) Ryan Mathews rush to the left for 9 yards to the Phi24. Tackled by Mason Foster.","(1:46) Ryan Mathews rush to the right for 5 yards to the Phi15. Tackled by Matt Ioannidis and Will Compton.","(1:57) Tress Way punts for 50 yards to Phi7. Darren Sproles return for 3 yards to Phi10. Tackled by Houston Bates.","(2:04) Kirk Cousins incomplete pass to the right.","(2:32) Kirk Cousins pass to the middle to Chris Thompson for 13 yards to the Was43. Tackled by Jordan Hicks and Nolan Carroll.","(3:11) Matt Jones rush up the middle for 5 yards to the Was30. Tackled by Connor Barwin and Nigel Bradham.","(3:16) Penalty: Holding on Washington (Vernon Davis) -10 yards.","(3:58) Kirk Cousins pass to the middle to Pierre Garcon for 20 yards to the Was35. Tackled by Rodney McLeod.","(4:10) Donnie Jones punts for 47 yards to Was14. Jamison Crowder return for 1 yard to Was15. Tackled by Josh Huff and Chris Maragos.","(4:50) Carson Wentz pass to the right to Wendell Smallwood for 14 yards to the Phi39. Tackled by Will Blackmon and Terence Garvin.","(5:23) Penalty: Illegal Block on Philadelphia (Wendell Smallwood) -10 yards.","(5:27) Carson Wentz incomplete pass to the right intended for Wendell Smallwood.","(6:07) Wendell Smallwood rush to the right for a loss of 1 yard to the Phi35. Tackled by Chris Baker.","(6:45) Carson Wentz rush to the left for 3 yards to the Phi36. Tackled by Chris Baker and Will Compton.","(7:25) Carson Wentz pass to the middle to Nelson Agholor for 12 yards to the Phi33. Tackled by Josh Norman and Will Blackmon.","(8:02) Penalty: Holding on Philadelphia (Jason Kelce) -10 yards.","(8:40) Darren Sproles rush up the middle for 6 yards to the Phi31. Tackled by Duke Ihenacho.","(8:40) Dustin Hopkins kicks off to the endzone. Touchback.","(8:44) Dustin Hopkins 32 yard field goal attempt is GOOD. Holder: Tress Way.","(8:49) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(8:56) Kirk Cousins incomplete pass to the middle intended for DeSean Jackson defensed by Malcolm Jenkins.","(9:34) Matt Jones rush to the left for a loss of 1 yard to the Phi14. Tackled by Jordan Hicks and Malcolm Jenkins.","(10:01) Kirk Cousins pass to the right to Pierre Garcon for 2 yards to the Phi27. Tackled by Ron Brooks and Destiny Vaeao. Penalty: Face Mask on Philadelphia (Ron Brooks) 14 yards.","(10:31) Penalty: Illegal Block on Washington (Jamison Crowder) -10 yards.","(11:14) Matt Jones rush to the left for 16 yards to the Phi19. Tackled by Rodney McLeod and Nigel Bradham.","(11:51) Chris Thompson rush to the left for 8 yards to the Phi35. Tackled by Rodney McLeod.","(12:38) Kirk Cousins pass to the right to Chris Thompson for 10 yards to the Phi43. Tackled by Malcolm Jenkins and Jalen Mills.","(13:19) Chris Thompson rush to the left for 2 yards to the Was47. Tackled by Mychal Kendricks.","(14:06) Kirk Cousins pass to the middle to Pierre Garcon for 22 yards to the Was45. Tackled by Jalen Mills.","(14:12) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(14:53) Matt Jones rush to the left for a loss of 3 yards to the Was23. Tackled by Beau Allen.","(14:53) Penalty: Encroachment on Philadelphia (Fletcher Cox) 5 yards.","(15:00) Caleb Sturgis kicks off to the Was3. Will Blackmon return for 18 yards to Was21. Tackled by Ron Brooks and Mychal Kendricks.","(0:06) Carson Wentz rush up the middle for a loss of 1 yard to the Phi24.","(0:06) Dustin Hopkins kicks off to the endzone. Touchback.","(0:06) Dustin Hopkins extra point is good.","(0:10) Matt Jones rush to the left for 1 yard for a TOUCHDOWN.","(0:10) Philadelphia Eagles timeout.","(0:10) Washington Redskins timeout.","(0:16) Chris Thompson rush to the right for 1 yard to the Phi1. Tackled by Beau Allen and Nolan Carroll.","(0:20) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(0:25) Penalty: Roughing Passer on Philadelphia (Fletcher Cox) 2 yards.","(0:30) Kirk Cousins incomplete pass to the right intended for Pierre Garcon defensed by Jalen Mills.","(0:34) Kirk Cousins incomplete pass to the right intended for Vernon Davis.","(1:03) Kirk Cousins pass to the right to Pierre Garcon for 15 yards to the Phi4. Tackled by Rodney McLeod and Jordan Hicks.","(1:03) Washington Redskins timeout.","(1:27) Kirk Cousins pass to the middle to Pierre Garcon for 13 yards to the Phi19. Tackled by Rodney McLeod.","(1:33) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(2:00) Chris Thompson rush to the left for 5 yards to the Phi32. Tackled by Jordan Hicks.","(2:00) Two Minute Warning.","(2:26) Rob Kelley rush to the right for 6 yards to the Phi37. Tackled by Malcolm Jenkins and Jalen Mills.","(3:00) Matt Jones rush to the left for 6 yards to the Phi43. Tackled by Brandon Graham and Jordan Hicks.","(3:41) Matt Jones rush to the left for 22 yards to the Phi49. Tackled by Rodney McLeod.","(3:55) Matt Jones rush to the left for 4 yards to the Was29. Tackled by Nigel Bradham.","(3:55) Caleb Sturgis kicks off to the endzone. Touchback.","(3:55) Caleb Sturgis extra point is good.","(4:07) Kirk Cousins pass intended for Vernon Davis INTERCEPTED by Malcolm Jenkins and returned for 64 yards for a TOUCHDOWN.","(4:57) Kirk Cousins pass to the left to Jamison Crowder for 21 yards to the Phi38. Tackled by Malcolm Jenkins.","(6:07) Jamison Crowder rush to the left for a loss of 9 yards to the Was41. Tackled by Mychal Kendricks.","(6:13) Penalty: Pass Interference on Philadelphia (Nolan Carroll) 23 yards.","(6:55) Kirk Cousins pass to the left to Chris Thompson for 6 yards to the Was27. Tackled by Nolan Carroll and Nigel Bradham.","(7:37) Chris Thompson rush to the right for 1 yard to the Was21. Tackled by Nigel Bradham and Ron Brooks.","(7:37) Penalty: False Start on Washington (Pierre Garcon) -5 yards.","(7:37) Caleb Sturgis kicks off to the endzone. Touchback.","(7:37) Caleb Sturgis extra point is good.","(7:48) Dustin Hopkins kicks off to the Phi14. Wendell Smallwood return for 86 yards for a TOUCHDOWN.","(7:48) Dustin Hopkins extra point is good.","(7:48) Kirk Cousins pass to the middle to Vernon Davis for 13 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Washington (Vernon Davis) -15 yards.","(8:33) Rob Kelley rush to the right for 1 yard to the Phi13. Tackled by Malcolm Jenkins.","(9:14) Kirk Cousins pass to the right to DeSean Jackson for 4 yards to the Phi14. Tackled by Jalen Mills.","(9:58) Chris Thompson rush to the left for 10 yards to the Phi18. Tackled by Malcolm Jenkins and Nigel Bradham.","(10:36) Rob Kelley rush to the right for 5 yards to the Phi28. Tackled by Ron Brooks and Connor Barwin.","(11:05) Rob Kelley rush up the middle for 45 yards to the Phi33. Tackled by Rodney McLeod.","(11:54) Kirk Cousins rush to the left for 9 yards to the Was22. Tackled by Vinny Curry.","(12:37) Kirk Cousins pass to the right to Pierre Garcon for 5 yards to the Was13. Tackled by Nolan Carroll and Ron Brooks.","(13:19) Matt Jones rush to the right for a loss of 2 yards to the Was8. Tackled by Nigel Bradham and Connor Barwin.","(13:26) Donnie Jones punts for 50 yards to Was10. No return.","(13:33) Carson Wentz incomplete pass to the right intended for Nelson Agholor.","(14:20) Carson Wentz sacked at Phi40 for a loss of 6 yards by Ryan Kerrigan.","(15:00) Carson Wentz pass to the left to Trey Burton for 7 yards to the Phi46. Tackled by Kendall Fuller.","(0:13) Carson Wentz pass to the right to Jordan Matthews for 9 yards to the Phi39. Tackled by Will Blackmon and Josh Norman.","(0:51) Ryan Mathews rush to the right for 5 yards to the Phi30. Tackled by Will Compton and Bashaud Breeland.","(0:51) Dustin Hopkins kicks off to the endzone. Touchback.","(0:51) Dustin Hopkins extra point is good.","(0:57) Kirk Cousins pass to the left to Jamison Crowder for 16 yards for a TOUCHDOWN.","(1:44) Matt Jones rush to the right for 15 yards to the Phi16. Tackled by Rodney McLeod.","(2:22) Kirk Cousins pass to the right to DeSean Jackson for 35 yards to the Phi31. Tackled by Rodney McLeod.","(2:22) Penalty: Encroachment on Philadelphia (Destiny Vaeao) 5 yards.","(2:31) Donnie Jones punts for 36 yards to Was14. No return. Penalty: Illegal Block on Philadelphia (Marcus Smith) 15 yards.","(2:36) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(3:18) Ryan Mathews rush to the right for 4 yards to the Phi50. Tackled by Duke Ihenacho and Cullen Jenkins.","(3:24) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(3:44) Penalty: Offside on Washington (Trent Murphy) 5 yards.","(4:28) Wendell Smallwood rush to the right for 2 yards to the Phi41. Tackled by Cullen Jenkins.","(5:08) Ryan Mathews rush to the right for 4 yards to the Phi39. Tackled by Donte Whitner.","(5:18) Tress Way punts for 48 yards to Phi21. Darren Sproles return for 14 yards to Phi35. Tackled by Martrell Spaight.","(6:08) Kirk Cousins pass to the right to Jamison Crowder for 15 yards to the Was31. Tackled by Nigel Bradham.","(6:49) Chris Thompson rush up the middle for 3 yards to the Was16. Tackled by Bennie Logan and Connor Barwin.","(6:55) Kirk Cousins incomplete pass to the left intended for Jamison Crowder defensed by Nigel Bradham.","(7:00) Penalty: Holding on Washington (Morgan Moses) -10 yards.","(7:13) Donnie Jones punts for 55 yards to Was25. Jamison Crowder return for 8 yards to Was33. Tackled by Kamu Grugier-Hill. Penalty: Illegal Block on Washington (Martrell Spaight) -10 yards.","(7:20) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(8:02) Ryan Mathews rush to the left for no gain to the Phi20. Tackled by Ziggy Hood and Will Compton.","(8:07) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(8:15) Tress Way punts for 55 yards to Phi0. Touchback.","(8:20) Kirk Cousins incomplete pass to the left intended for Ryan Grant.","(8:59) Kirk Cousins pass to the right to DeSean Jackson for 6 yards to the Was45. Tackled by Jalen Mills.","(9:40) Matt Jones rush to the right for 2 yards to the Was39. Tackled by Nigel Bradham.","(9:47) Penalty: Holding on Philadelphia (Jalen Mills) 5 yards.","(10:29) Kirk Cousins pass to the right to DeSean Jackson for 10 yards to the Was32. Tackled by Jalen Mills.","(11:12) Chris Thompson rush to the left for 1 yard to the Was22. Tackled by Brandon Graham.","(11:17) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(11:26) Donnie Jones punts for 41 yards to Was17. Jamison Crowder return for 4 yards to Was21. Tackled by Josh Huff.","(11:57) Carson Wentz pass to the middle to Jordan Matthews for 12 yards to the Phi42. Tackled by Mason Foster and Kendall Fuller.","(12:40) Carson Wentz sacked at Phi30 for a loss of 6 yards by Ryan Kerrigan.","(13:22) Wendell Smallwood rush to the left for a loss of 2 yards to the Phi36. Tackled by Duke Ihenacho and Ricky Jean Francois.","(13:56) Wendell Smallwood rush to the left for 7 yards to the Phi38. Tackled by Will Compton.","(14:32) Ryan Mathews rush to the left for 10 yards to the Phi31. Tackled by Quinton Dunbar.","(15:00) Carson Wentz sacked at Phi21 for a loss of 4 yards by Will Blackmon and Ryan Kerrigan.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback."]