["(0:08) Russell Wilson rush up the middle for a loss of 1 yard to the Atl29.","(0:48) Russell Wilson rush up the middle for a loss of 2 yards to the Atl28.","(1:30) Russell Wilson rush up the middle for a loss of 1 yard to the Atl26.","(1:39) Matt Ryan incomplete pass to the middle intended for Julio Jones defensed by Richard Sherman.","(1:47) Matt Ryan incomplete pass to the left intended for Mohamed Sanu defensed by Deshawn Shead.","(1:51) Matt Ryan incomplete pass to the left intended for Mohamed Sanu defensed by Earl Thomas.","(1:57) Matt Ryan incomplete pass to the right intended for Mohamed Sanu.","(1:57) Steven Hauschka kicks off to the endzone. Touchback.","(1:57) Two Minute Warning.","(2:02) Steven Hauschka 44 yard field goal attempt is GOOD. Holder: Jon Ryan.","(2:07) Russell Wilson incomplete pass to the right intended for Tyler Lockett defensed by Robert Alford.","(2:07) Atlanta Falcons timeout.","(2:13) Christine Michael rush to the right for 5 yards to the Atl26. Tackled by Tyson Jackson and Ra'Shede Hageman.","(2:57) Tyler Lockett rush to the left for 2 yards to the Atl31. Tackled by Keanu Neal.","(3:40) Russell Wilson pass to the right to Alex Collins for 9 yards to the Atl33. Tackled by Vic Beasley Jr..","(3:45) Russell Wilson pass to the right to Doug Baldwin for 8 yards to the Atl42. Tackled by Desmond Trufant.","(3:48) Russell Wilson incomplete pass to the left intended for Jimmy Graham defensed by Keanu Neal.","(3:57) Matt Ryan pass intended for Julio Jones INTERCEPTED by Earl Thomas defensed by Richard Sherman and returned for 5 yards. Tackled by Alex Mack.","(4:05) Matt Ryan pass to the right to Devonta Freeman for 11 yards to the Atl39. Tackled by Earl Thomas.","(4:43) Matt Ryan pass to the right to Patrick DiMarco for 3 yards to the Atl28. Tackled by Bobby Wagner.","(4:43) Steven Hauschka kicks off to the endzone. Touchback.","(4:43) Steven Hauschka extra point is BLOCKED.","(4:47) Christine Michael rush to the right for 1 yard for a TOUCHDOWN.","(5:23) Christine Michael rush to the right for 2 yards to the Atl1. Tackled by Grady Jarrett and Deion Jones.","(5:27) Penalty: Pass Interference on Atlanta (Robert Alford) 17 yards.","(6:04) Russell Wilson rush up the middle for 6 yards to the Atl20. Tackled by Deion Jones.","(6:27) Russell Wilson pass to the right to Doug Baldwin for 11 yards to the Atl26. Tackled by Brian Poole.","(7:02) Russell Wilson pass to the right to Tyler Lockett for 10 yards to the Atl37. Tackled by Brian Poole.","(7:02) Atlanta Falcons timeout.","(7:09) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(7:45) Christine Michael rush up the middle for 4 yards to the Atl47. Tackled by Deion Jones and Vic Beasley Jr..","(7:59) Russell Wilson pass to the right to Jermaine Kearse for 12 yards to the Sea49.","(8:34) Russell Wilson pass to the right to Jermaine Kearse for 7 yards to the Sea37. Tackled by Robert Alford.","(8:46) Matt Bosher punts for 45 yards to Sea25. Tyler Lockett return for 15 yards to Sea40. Tackled by Eric Weems and LaRoy Reynolds. Penalty: Illegal Block on Seattle (Kevin Pierre-Louis) -10 yards.","(9:28) Matt Ryan sacked at Atl30 for a loss of 13 yards by Cassius Marsh.","(10:08) Tevin Coleman rush to the right for 3 yards to the Atl43. Tackled by Tony McDaniel.","(10:45) Tevin Coleman rush to the left for 2 yards to the Atl40. Tackled by Kelcie McCray and Bobby Wagner.","(11:27) Matt Ryan pass to the right to Levine Toilolo for 18 yards to the Atl38. Tackled by Bobby Wagner and Kevin Pierre-Louis.","(11:30) 29 yard field goal attempt by Steven Hauschka is NO GOOD. Holder: Jon Ryan.","(11:34) Russell Wilson incomplete pass to the middle intended for Jermaine Kearse.","(11:34) Seattle Seahawks timeout.","(11:37) Russell Wilson incomplete pass to the left intended for C.J. Spiller.","(12:17) Christine Michael rush to the left for no gain to the Atl10. Tackled by Grady Jarrett and Ricardo Allen.","(12:46) Russell Wilson pass to the left to Jimmy Graham for 18 yards to the Atl10. Tackled by Kemal Ishmael.","(13:27) Russell Wilson pass to the left to Luke Willson for 9 yards to the Atl28. Tackled by LaRoy Reynolds and Ra'Shede Hageman.","(14:01) Russell Wilson pass to the left to Tanner McEvoy for 17 yards to the Atl37. Tackled by Keanu Neal.","(14:42) Christine Michael rush to the right for 9 yards to the Sea46. Tackled by LaRoy Reynolds and Ricardo Allen.","(15:00) Russell Wilson pass to the left to Christine Michael for 9 yards to the Sea37. Tackled by Keanu Neal.","(0:12) Russell Wilson rush to the left for 2 yards to the Sea28. Tackled by Adrian Clayborn.","(0:17) Matt Bosher kicks off to the Sea2. Tyler Lockett return for 24 yards to Sea26. Tackled by Robenson Therezie and Dashon Goldson.","(0:17) Matt Bryant extra point is good.","(0:26) Matt Ryan pass to the left to Levine Toilolo for 46 yards for a TOUCHDOWN.","(1:01) Devonta Freeman rush to the left for 5 yards to the Sea46. Tackled by Bobby Wagner and Tony McDaniel.","(1:40) Matt Ryan pass to the right to Aldrick Robinson for 8 yards to the Atl49. Tackled by Earl Thomas and Deshawn Shead.","(1:40) Seattle Seahawks timeout.","(1:57) Matt Ryan pass to the right to Julio Jones for 24 yards to the Atl41.","(2:39) Matt Ryan pass to the left to Justin Hardy for 11 yards to the Atl17. Tackled by Deshawn Shead.","(3:20) Matt Ryan pass to the left to Jacob Tamme for 4 yards to the Atl6. Tackled by K.J. Wright.","(3:44) Penalty: Holding on Atlanta (Jake Matthews) -1 yards.","(3:51) Jon Ryan punts for 42 yards to Atl3. No return.","(4:18) Christine Michael rush to the left for no gain to the Atl45. Tackled by LaRoy Reynolds and Grady Jarrett.","(4:54) Russell Wilson pass to the middle to Jimmy Graham for 9 yards to the Atl45. Tackled by LaRoy Reynolds and Kemal Ishmael.","(4:59) Russell Wilson incomplete pass to the right intended for Jimmy Graham.","(5:23) Russell Wilson pass to the right to Doug Baldwin for 3 yards to the Sea31. Tackled by Kemal Ishmael and Desmond Trufant. Penalty: Face Mask on Atlanta (LaRoy Reynolds) 15 yards.","(5:28) Russell Wilson incomplete pass to the right intended for Doug Baldwin defensed by Vic Beasley Jr..","(6:05) Russell Wilson pass to the left to C.J. Spiller for 8 yards to the Sea28. Tackled by Kemal Ishmael.","(6:11) Matt Bosher kicks off to the Sea3. Tyler Lockett return for 17 yards to Sea20. Tackled by Deion Jones and Justin Hardy.","(6:11) Matt Bryant extra point is good.","(6:16) Matt Ryan pass to the left to Mohamed Sanu for 10 yards for a TOUCHDOWN.","(6:20) Matt Ryan incomplete pass to the right intended for Devonta Freeman.","(7:07) Devonta Freeman rush to the right for 18 yards to the Sea10. Tackled by Bobby Wagner.","(7:44) Matt Ryan pass to the right to Justin Hardy for 10 yards to the Sea28.","(7:48) Matt Ryan incomplete pass to the left intended for Mohamed Sanu defensed by Deshawn Shead.","(8:33) Tevin Coleman rush to the right for 1 yard to the Sea38. Tackled by K.J. Wright and Bobby Wagner.","(9:06) Matt Ryan pass to the left to Julio Jones for 16 yards to the Sea39. Tackled by Bobby Wagner and Richard Sherman.","(9:34) Matt Ryan pass to the left to Julio Jones for 24 yards to the Atl45. Tackled by Kelcie McCray.","(9:44) Jon Ryan punts for 58 yards to Atl10. Eric Weems return for 11 yards to Atl21. Tackled by Kevin Pierre-Louis.","(9:51) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(10:28) Christine Michael rush to the left for 2 yards to the Sea32. Tackled by LaRoy Reynolds and Philip Wheeler.","(10:56) Russell Wilson pass to the right to Tyler Lockett for 5 yards to the Sea30. Tackled by Keanu Neal and Kemal Ishmael.","(11:01) Matt Bosher kicks off to the Sea1. C.J. Spiller return for 24 yards to Sea25. Tackled by Eric Weems and Justin Hardy.","(11:01) Matt Bryant extra point is good.","(11:07) Matt Ryan pass to the left to Julio Jones for 36 yards for a TOUCHDOWN.","(11:15) Matt Ryan incomplete pass to the right intended for Aldrick Robinson.","(11:50) Matt Ryan pass to the right to Julio Jones for 15 yards to the Sea36. Tackled by Jeremy Lane.","(12:19) Matt Ryan pass to the right to Justin Hardy for 9 yards to the Atl49. Tackled by Jeremy Lane and Earl Thomas.","(12:25) Matt Ryan incomplete pass to the left.","(12:58) Devonta Freeman rush to the left for 4 yards to the Atl40. Tackled by Bobby Wagner and K.J. Wright.","(13:39) Devonta Freeman rush to the right for 2 yards to the Atl36. Tackled by Bobby Wagner and Michael Bennett.","(14:23) Devonta Freeman rush to the left for 2 yards to the Atl34. Tackled by K.J. Wright and Michael Bennett.","(15:00) Matt Ryan pass to the left to Mohamed Sanu for 7 yards to the Atl32. Tackled by Deshawn Shead.","(15:00) Steven Hauschka kicks off to the endzone. Touchback.","(0:28) Matt Ryan pass to the right to Tevin Coleman for 7 yards to the Atl27. Tackled by Deshawn Shead.","(0:34) Penalty: Holding on Atlanta (Levine Toilolo) -10 yards.","(0:38) Penalty: Offside on Seattle (Cassius Marsh) 5 yards.","(0:38) Atlanta Falcons timeout.","(0:42) Matt Ryan incomplete pass to the right intended for Taylor Gabriel defensed by Deshawn Shead.","(0:42) Steven Hauschka kicks off to the endzone. Touchback.","(0:46) Steven Hauschka 42 yard field goal attempt is GOOD. Holder: Jon Ryan.","(0:52) Russell Wilson incomplete pass to the right.","(0:57) Russell Wilson incomplete pass to the left intended for C.J. Spiller.","(1:29) C.J. Spiller rush to the left for a loss of 3 yards to the Atl23. Tackled by LaRoy Reynolds and Brian Poole.","(1:58) Russell Wilson pass to the right to Jimmy Graham for 25 yards to the Atl20. Tackled by Ricardo Allen and Keanu Neal.","(1:58) Two Minute Warning.","(2:09) Matt Bosher punts for 39 yards to Sea46. Tyler Lockett return for 4 yards to Sea50. Tackled by C.J. Goodwin. Penalty: Illegal Return OOB on Atlanta (Taylor Gabriel) 5 yards.","(2:52) Devonta Freeman rush to the left for 1 yard to the Atl15. Tackled by Richard Sherman and K.J. Wright.","(3:39) Matt Ryan pass to the left to Devonta Freeman for a loss of 5 yards to the Atl14. Tackled by Cassius Marsh and Kelcie McCray.","(3:39) Atlanta Falcons timeout.","(4:26) Devonta Freeman rush to the right for a loss of 1 yard to the Atl19. Tackled by Michael Bennett.","(4:26) Penalty: False Start on Atlanta (Ryan Schraeder) -5 yards.","(4:32) Steven Hauschka kicks off to the Atl-3. Eric Weems return for 28 yards to Atl25. Tackled by Steven Terrell and Brandon Williams.","(4:32) Steven Hauschka extra point is good.","(4:36) Alex Collins rush to the right for 2 yards for a TOUCHDOWN.","(5:20) Russell Wilson pass to the middle to C.J. Spiller for 24 yards to the Atl2. Tackled by Kemal Ishmael and Ricardo Allen.","(5:49) Christine Michael rush to the left for 2 yards to the Atl26. Tackled by Keanu Neal. FUMBLE, recovered by Sea (Christine Michael).","(6:18) Russell Wilson pass to the right to Doug Baldwin for 9 yards to the Atl28. Tackled by Ricardo Allen and Keanu Neal.","(6:40) Russell Wilson pass to the left to Jimmy Graham for 13 yards to the Atl37. Tackled by De'Vondre Campbell.","(7:22) Christine Michael rush to the left for 1 yard to the Sea50. Tackled by De'Vondre Campbell and Tyson Jackson.","(7:22) Atlanta Falcons timeout.","(7:53) Russell Wilson pass to the right to Christine Michael for 8 yards to the Sea49. Tackled by De'Vondre Campbell.","(8:30) Russell Wilson pass to the right to Jimmy Graham for 16 yards to the Sea41. Tackled by Deion Jones and Ricardo Allen.","(8:38) Matt Bosher kicks off to the Sea3. Tyler Lockett return for 22 yards to Sea25. Tackled by Deion Jones and Desmond Trufant.","(8:42) Matt Bryant 33 yard field goal attempt is GOOD. Holder: Matt Bosher.","(8:45) Matt Ryan incomplete pass to the left intended for Jacob Tamme.","(8:50) Matt Ryan incomplete pass to the left intended for Levine Toilolo.","(8:54) Matt Ryan incomplete pass to the left intended for Devonta Freeman.","(9:40) Matt Ryan pass to the left to Julio Jones for 14 yards to the Sea15. Tackled by Richard Sherman.","(10:00) Matt Ryan pass to the left to Julio Jones for 10 yards to the Sea29.","(10:29) Devonta Freeman rush to the right for 3 yards to the Sea39. Tackled by Michael Bennett.","(11:07) Matt Ryan rush up the middle for 2 yards to the Sea42. Tackled by Bobby Wagner and Jarran Reed.","(11:07) Seattle Seahawks timeout.","(11:32) Tevin Coleman rush to the right for no gain to the Sea44. Tackled by Bobby Wagner and Cliff Avril.","(12:14) Matt Ryan pass to the right to Mohamed Sanu for 5 yards to the Sea44. Tackled by Deshawn Shead.","(12:43) Tevin Coleman rush up the middle for 4 yards to the Sea49. Tackled by Jarran Reed and Kevin Pierre-Louis.","(13:15) Matt Ryan pass to the right to Mohamed Sanu for 14 yards to the Atl47. Tackled by Deshawn Shead.","(13:28) Jon Ryan punts for 45 yards to Atl33. No return.","(13:32) Russell Wilson incomplete pass to the left intended for Jimmy Graham.","(14:16) Christine Michael rush to the left for 1 yard to the Sea22. Tackled by Kemal Ishmael.","(14:50) Christine Michael rush up the middle for 2 yards to the Sea21. Tackled by Keanu Neal and Tyson Jackson.","(15:00) Matt Bosher punts for 44 yards to Sea17. Tyler Lockett return for 2 yards to Sea19. Tackled by Eric Weems and Levine Toilolo.","(0:17) Matt Ryan pass to the left to Devonta Freeman for 4 yards to the Atl39. Tackled by Michael Bennett.","(0:58) Matt Ryan sacked at Atl35 for no gain by Jarran Reed.","(1:40) Matt Ryan sacked at Atl35 for a loss of 7 yards by Cliff Avril.","(1:54) Devonta Freeman rush to the left for 6 yards to the Atl27. Tackled by K.J. Wright and Bobby Wagner. Penalty: Face Mask on Seattle (K.J. Wright) 15 yards.","(2:02) Steven Hauschka kicks off to the Atl3. Eric Weems return for 18 yards to Atl21. Tackled by DeAndre Elliott and Earl Thomas.","(2:02) Steven Hauschka extra point is good.","(2:07) Christine Michael rush to the right for 9 yards for a TOUCHDOWN.","(2:13) Matt Ryan sacked at Atl9 for a loss of 5 yards by Cliff Avril. FUMBLE, recovered by Sea (Tony McDaniel). Tackled by Chris Chester.","(2:56) Matt Ryan pass to the right to Levine Toilolo for 5 yards to the Atl14. Tackled by Bobby Wagner and K.J. Wright.","(2:59) Matt Ryan incomplete pass to the right intended for Tevin Coleman.","(3:01) Jon Ryan punts for 40 yards to Atl17. No return. Penalty: Holding on Atlanta (Brian Poole) -8 yards.","(3:56) Russell Wilson pass to the left to C.J. Spiller for 6 yards to the Sea43. Tackled by Brooks Reed. FUMBLE, recovered by Sea (C.J. Spiller).","(4:43) Russell Wilson sacked at Sea37 for a loss of 9 yards by Desmond Trufant. FUMBLE, recovered by Sea (Mark Glowinski).","(5:27) Christine Michael rush to the left for 1 yard to the Sea46. Tackled by Grady Jarrett and Tyson Jackson.","(6:08) Christine Michael rush to the right for 21 yards to the Sea45. Tackled by Robert Alford.","(6:35) Russell Wilson rush to the left for 3 yards to the Sea24. Tackled by Vic Beasley Jr..","(6:38) Russell Wilson incomplete pass to the right intended for C.J. Spiller.","(6:59) Penalty: Offside on Atlanta (Vic Beasley Jr.) 5 yards.","(7:39) Russell Wilson pass to the right to Christine Michael for 2 yards to the Sea16. Tackled by Ra'Shede Hageman and Grady Jarrett.","(7:46) Matt Bosher punts for 37 yards to Sea14. No return.","(7:51) Matt Ryan incomplete pass to the middle intended for Mohamed Sanu defensed by Earl Thomas.","(8:33) Devonta Freeman rush up the middle for a loss of 2 yards to the Atl49. Tackled by Bobby Wagner.","(9:04) Devonta Freeman rush to the left for 1 yard to the Sea49. Tackled by Cliff Avril and Garrison Smith.","(9:40) Matt Ryan pass to the left to Mohamed Sanu for 11 yards to the Atl50. Tackled by Deshawn Shead.","(10:16) Matt Ryan pass to the left to Taylor Gabriel for 6 yards to the Atl39. Tackled by Richard Sherman.","(10:51) Matt Ryan pass to the middle to Jacob Tamme for 12 yards to the Atl33. Tackled by Deshawn Shead.","(11:29) Devonta Freeman rush to the left for 1 yard to the Atl21. Tackled by Ahtyba Rubin and Tony McDaniel.","(11:38) Jon Ryan punts for 45 yards to Atl0. Touchback.","(12:11) Christine Michael rush to the right for a loss of 4 yards to the Atl45. Tackled by Derrick Shelby.","(12:45) Christine Michael rush to the left for 3 yards to the Atl41. Tackled by Keanu Neal and Grady Jarrett.","(13:21) Christine Michael rush to the left for 5 yards to the Atl44. Tackled by Keanu Neal and Grady Jarrett.","(13:45) Russell Wilson pass to the right to Jermaine Kearse for 16 yards to the Atl49. Tackled by Desmond Trufant and Brian Poole.","(14:25) Russell Wilson pass to the left to Tyler Lockett for 8 yards to the Sea35. Tackled by Kemal Ishmael.","(14:54) Russell Wilson pass to the left to Jimmy Graham for 8 yards to the Sea27. Tackled by Robert Alford.","(15:00) Matt Bosher kicks off to the Sea-3. Tyler Lockett return for 22 yards to Sea19. Tackled by C.J. Goodwin and Justin Hardy."]