["(0:30) Ezekiel Elliott rush up the middle for 3 yards to the GB38. Tackled by Blake Martinez.","(0:30) Dallas Cowboys timeout.","(1:15) Ezekiel Elliott rush up the middle for 1 yard to the GB41. Tackled by Datone Jones.","(2:00) Ezekiel Elliott rush to the right for 3 yards to the GB42. Tackled by Jayrone Elliott and Blake Martinez.","(2:00) Two Minute Warning.","(2:29) Ezekiel Elliott rush to the left for 5 yards to the GB45. Tackled by Jake Ryan and Jayrone Elliott.","(2:29) Ty Montgomery rush up the middle for 2 yards to the GB50. Tackled by David Irving. FUMBLE, recovered by Dal (Ryan Davis). Tackled by Jason Spriggs.","(3:12) Aaron Rodgers sacked at GB48 for no gain by David Irving. FUMBLE, recovered by GB (Jason Spriggs).","(3:34) Aaron Rodgers pass to the right to Randall Cobb for 8 yards to the GB48. Tackled by Sean Lee.","(3:41) Dan Bailey kicks off to the GB0. Ty Montgomery return for 40 yards to GB40. Tackled by Anthony Brown.","(3:45) Dan Bailey 32 yard field goal attempt is GOOD. Holder: Chris Jones.","(3:45) Green Bay Packers timeout.","(3:50) Alfred Morris rush to the right for no gain to the GB14. Tackled by Nick Perry and Blake Martinez.","(4:31) Alfred Morris rush to the left for 1 yard to the GB14. Tackled by Letroy Guion.","(4:31) Green Bay Packers timeout.","(4:40) Ezekiel Elliott rush to the right for 6 yards to the GB15. Tackled by Ha Ha Clinton-Dix.","(4:40) Green Bay Packers timeout.","(4:54) Ezekiel Elliott rush to the left for 29 yards to the GB21. Tackled by Nick Perry.","(5:27) Dak Prescott pass to the right to Jason Witten for 7 yards to the Dal50. Tackled by Morgan Burnett.","(5:27) Dallas Cowboys timeout.","(6:12) Ezekiel Elliott rush to the right for no gain to the Dal43. Tackled by Datone Jones.","(6:51) Ezekiel Elliott rush up the middle for 5 yards to the Dal43. Tackled by Jake Ryan and Blake Martinez.","(6:53) Mason Crosby onside kickoff to the Dal38. Onside kick recovered by receiving team by Jason Witten.","(6:53) Mason Crosby extra point is good. Penalty: Leverage on Dallas (David Irving) 15 yards.","(6:57) Aaron Rodgers pass to the right to Randall Cobb for 6 yards for a TOUCHDOWN.","(7:25) Aaron Rodgers pass to the left to Ty Montgomery for 5 yards to the Dal6. Tackled by Byron Jones.","(7:56) Aaron Rodgers pass to the right to Jordy Nelson for 25 yards to the Dal11. Tackled by Jeff Heath.","(8:26) Aaron Rodgers pass to the right to Jordy Nelson for 12 yards to the Dal36. Tackled by Anthony Brown.","(8:58) Eddie Lacy rush to the left for no gain to the Dal48. Tackled by Tyrone Crawford.","(9:27) Aaron Rodgers pass to the right to Jordy Nelson for 9 yards to the Dal48. Tackled by Anthony Brown.","(9:55) Eddie Lacy rush to the right for 2 yards to the GB43. Tackled by Sean Lee.","(10:05) Aaron Rodgers pass to the right to Richard Rodgers for 3 yards to the GB41. Tackled by Barry Church.","(10:26) Aaron Rodgers pass to the right to Randall Cobb for 13 yards to the GB38. Tackled by Barry Church.","(10:26) Dan Bailey kicks off to the endzone. Touchback.","(10:26) Dan Bailey extra point is good.","(10:31) Dak Prescott pass to the right to Cole Beasley for 4 yards for a TOUCHDOWN.","(11:12) Dak Prescott pass to the middle to Jason Witten for 13 yards to the GB4. Tackled by Ha Ha Clinton-Dix and Morgan Burnett.","(11:50) Ezekiel Elliott rush to the right for a loss of 3 yards to the GB17. Tackled by Mike Pennel.","(12:27) Ezekiel Elliott rush to the right for 12 yards to the GB14. Tackled by Blake Martinez.","(12:50) Penalty: Illegal Use of Hands on Green Bay (Datone Jones) 5 yards.","(13:34) Dak Prescott pass to the right to Lucky Whitehead for 35 yards to the GB31. Tackled by Morgan Burnett.","(14:14) Dak Prescott pass to the left to Cole Beasley for 3 yards to the Dal34. Tackled by Demetri Goodson.","(14:48) Ezekiel Elliott rush to the right for 6 yards to the Dal31. Tackled by Ha Ha Clinton-Dix.","(14:48) Mason Crosby kicks off to the endzone. Touchback.","(14:51) Mason Crosby 34 yard field goal attempt is GOOD. Holder: Jacob Schum.","(14:55) Aaron Rodgers incomplete pass to the right intended for Ty Montgomery defensed by David Irving.","(15:00) Aaron Rodgers incomplete pass to the left intended for Randall Cobb.","(0:20) Eddie Lacy rush to the right for no gain to the Dal16. Tackled by David Irving and Cedric Thornton.","(0:26) Dak Prescott pass intended for Jason Witten INTERCEPTED by Morgan Burnett. No return. Tackled by Jason Witten.","(0:33) Dak Prescott incomplete pass to the left intended for Brice Butler.","(1:10) Ezekiel Elliott rush to the right for 2 yards to the Dal6. Tackled by Mike Pennel.","(1:18) Aaron Rodgers rush up the middle for a loss of 3 yards to the Dal4. Tackled by David Irving. FUMBLE, recovered by Dal (David Irving). Tackled by Bryan Bulaga.","(1:54) Aaron Rodgers pass to the right to Ty Montgomery for 14 yards to the Dal1. Tackled by J.J. Wilcox.","(2:28) Aaron Rodgers pass to the right to Jeff Janis for 6 yards to the Dal15. Tackled by Justin Durant.","(2:57) Aaron Rodgers pass to the left to Jeff Janis for 8 yards to the Dal21. Tackled by Sean Lee.","(3:44) Eddie Lacy rush to the left for 2 yards to the Dal29. Tackled by J.J. Wilcox.","(3:48) Aaron Rodgers incomplete pass to the right intended for Ty Montgomery.","(4:27) Aaron Rodgers pass to the right to Ty Montgomery for 15 yards to the Dal31. Tackled by Anthony Brown. FUMBLE, recovered by GB.","(4:58) Aaron Rodgers pass to the right to Ty Montgomery for 12 yards to the Dal46. Tackled by Anthony Brown.","(5:24) Ty Montgomery rush to the left for 6 yards to the GB42. Tackled by Sean Lee and Barry Church.","(5:50) Aaron Rodgers pass to the right to Davante Adams for 12 yards to the GB36. Tackled by Anthony Brown.","(6:32) Eddie Lacy rush to the right for a loss of 2 yards to the GB24. Tackled by Terrell McClain.","(6:58) Aaron Rodgers rush to the left for 1 yard to the GB26. Tackled by Sean Lee.","(6:58) Dan Bailey kicks off to the endzone. Touchback.","(7:02) Dan Bailey 22 yard field goal attempt is GOOD. Holder: Chris Jones.","(7:05) Dak Prescott incomplete pass to the right intended for Brice Butler.","(7:44) Ezekiel Elliott rush to the right for no gain to the GB4. Tackled by Datone Jones.","(8:23) Ezekiel Elliott rush to the left for 1 yard to the GB4. Tackled by Morgan Burnett.","(8:55) Dak Prescott pass to the left to Cole Beasley for 19 yards to the GB5. Tackled by Demetri Goodson.","(9:36) Ezekiel Elliott rush to the right for 2 yards to the GB24. Tackled by Blake Martinez.","(10:03) Ezekiel Elliott rush to the right for 25 yards to the GB26. Tackled by Ladarius Gunter.","(10:12) Aaron Rodgers pass intended for Randall Cobb INTERCEPTED by Barry Church and returned for 14 yards. Tackled by Lane Taylor.","(10:50) Eddie Lacy rush to the left for 2 yards to the Dal46. Tackled by Brandon Carr.","(11:33) Aaron Rodgers pass to the left to Ty Montgomery for 9 yards to the Dal48. Tackled by Jeff Heath.","(12:13) Aaron Rodgers pass to the right to Aaron Ripkowski for 2 yards to the GB43. Tackled by Justin Durant.","(12:58) Eddie Lacy rush to the right for 5 yards to the GB41. Tackled by Sean Lee and Jack Crawford.","(13:30) Eddie Lacy rush to the right for 2 yards to the GB36. Tackled by Damien Wilson.","(14:15) Eddie Lacy rush to the right for 5 yards to the GB34. Tackled by Anthony Hitchens.","(14:59) Eddie Lacy rush to the right for 4 yards to the GB29. Tackled by Damien Wilson.","(15:00) Dan Bailey kicks off to the endzone. Touchback.","(0:01) Aaron Rodgers pass to the right to Ty Montgomery for 15 yards to the Dal14. Tackled by Sean Lee.","(0:08) Aaron Rodgers pass to the left to Randall Cobb for 14 yards to the Dal29.","(0:15) Aaron Rodgers pass to the right to Ty Montgomery for 7 yards to the Dal43. Tackled by Anthony Brown.","(0:15) Green Bay Packers timeout.","(0:22) Aaron Rodgers pass to the right to Ty Montgomery for 13 yards to the GB50. Tackled by Anthony Brown.","(0:27) Aaron Rodgers pass to the right to Richard Rodgers for 12 yards to the GB37. Tackled by Barry Church.","(0:27) Dan Bailey kicks off to the endzone. Touchback.","(0:27) Dan Bailey extra point is good.","(0:31) Dak Prescott pass to the right to Brice Butler for 20 yards for a TOUCHDOWN.","(0:40) Dak Prescott pass to the right to Terrance Williams for 42 yards to the GB20. Tackled by Micah Hyde.","(0:45) Lucky Whitehead rush to the left for 26 yards to the Dal38. Tackled by Ha Ha Clinton-Dix.","(0:45) Green Bay Packers timeout.","(0:57) Ezekiel Elliott rush to the right for 5 yards to the Dal12. Tackled by Morgan Burnett and Jake Ryan.","(0:57) Green Bay Packers timeout.","(1:00) Ezekiel Elliott rush to the right for 4 yards to the Dal7. Tackled by Jake Ryan.","(1:11) Jacob Schum punts for 47 yards to Dal2. No return.","(1:18) Aaron Rodgers incomplete pass to the left intended for Randall Cobb.","(1:28) Penalty: Too Many Men on Field on Dallas (Jack Crawford) 5 yards.","(1:35) Aaron Rodgers pass to the right to Ty Montgomery for no gain to the GB46. Tackled by J.J. Wilcox.","(1:39) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(1:51) Chris Jones punts for 41 yards to GB21. Trevor Davis return for 25 yards to GB46. Tackled by Keith Smith.","(1:59) Dak Prescott incomplete pass to the right intended for Terrance Williams.","(1:59) Two Minute Warning.","(2:04) Dak Prescott incomplete pass to the middle intended for Jason Witten defensed by Morgan Burnett.","(2:09) Dak Prescott incomplete pass to the left intended for Ezekiel Elliott.","(2:15) Aaron Rodgers incomplete pass to the left intended for Randall Cobb defensed by Byron Jones.","(2:19) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Morris Claiborne.","(2:42) Penalty: Delay of Game on Dallas (Justin Durant) 5 yards.","(3:08) Aaron Rodgers pass to the right to Eddie Lacy for 6 yards to the Dal43. Tackled by Maliek Collins and Sean Lee.","(3:51) Aaron Rodgers pass to the left to Randall Cobb for a loss of 6 yards to the Dal49. Tackled by Anthony Brown.","(4:37) Aaron Rodgers pass to the middle to Davante Adams for 22 yards to the Dal43. Tackled by Brandon Carr.","(5:19) Eddie Lacy rush to the right for no gain to the GB35. Tackled by Terrell McClain.","(6:01) Eddie Lacy rush to the right for 10 yards to the GB35. Tackled by J.J. Wilcox.","(6:01) Dan Bailey kicks off to the endzone. Touchback.","(6:05) Dan Bailey 44 yard field goal attempt is GOOD. Holder: Chris Jones.","(6:50) Dak Prescott pass to the right to Ezekiel Elliott for 2 yards to the GB26. Tackled by Ladarius Gunter.","(7:28) Ezekiel Elliott rush up the middle for 6 yards to the GB28. Tackled by Nick Perry.","(8:07) Dak Prescott sacked at GB34 for a loss of 10 yards. FUMBLE, recovered by Dal (Zack Martin).","(8:11) Penalty: Pass Interference on Green Bay (Demetri Goodson) 7 yards.","(8:11) Dallas Cowboys timeout.","(8:44) Dak Prescott pass to the middle to Cole Beasley for 15 yards to the GB21. Tackled by Kentrell Brice. Penalty: Illegal Block on Dallas (Brice Butler) -10 yards.","(8:49) Dak Prescott incomplete pass to the right intended for Jason Witten.","(9:31) Ezekiel Elliott rush to the right for 2 yards to the GB36. Tackled by Blake Martinez.","(10:11) Ezekiel Elliott rush to the left for 14 yards to the GB38. Tackled by Micah Hyde and Ha Ha Clinton-Dix.","(10:44) Ezekiel Elliott rush up the middle for 6 yards to the Dal48. Tackled by Clay Matthews.","(11:01) Dak Prescott pass to the right to Terrance Williams for 8 yards to the Dal42. Tackled by Damarious Randall.","(11:40) Ezekiel Elliott rush to the right for 4 yards to the Dal34. Tackled by Morgan Burnett.","(12:11) Ezekiel Elliott rush to the left for 1 yard to the Dal25. Tackled by Clay Matthews. Penalty: Holding on Green Bay (Letroy Guion) 5 yards.","(12:16) Mason Crosby kicks off to the Dal3. Lucky Whitehead return for 21 yards to Dal24. Tackled by Kyler Fackrell.","(12:19) Mason Crosby 43 yard field goal attempt is GOOD. Holder: Jacob Schum.","(12:59) Aaron Rodgers pass to the left to Jordy Nelson for 4 yards to the Dal25. Tackled by Sean Lee and Anthony Brown.","(13:44) Eddie Lacy rush to the right for 4 yards to the Dal29. Tackled by Sean Lee.","(13:48) Aaron Rodgers incomplete pass to the middle intended for Richard Rodgers.","(14:19) Penalty: Face Mask on Dallas (Justin Durant) 15 yards.","(14:24) Aaron Rodgers incomplete pass to the right intended for Jared Abbrederis.","(15:00) Ty Montgomery rush to the left for a loss of 2 yards to the Dal48. Tackled by Ryan Davis and Jack Crawford.","(0:16) Aaron Rodgers pass to the left to Randall Cobb for 17 yards to the Dal46. Tackled by Brandon Carr.","(0:55) Aaron Rodgers pass to the right to Justin Perillo for 4 yards to the GB37. Tackled by Morris Claiborne.","(1:24) Eddie Lacy rush to the left for 3 yards to the GB33. Tackled by Anthony Hitchens and Brandon Carr.","(1:32) Dak Prescott sacked at GB24 for a loss of 4 yards by Julius Peppers. FUMBLE, recovered by GB (Joe Thomas) and returned for 6 yards. Tackled by Tyron Smith.","(2:14) Alfred Morris rush up the middle for 1 yard to the GB20. Tackled by Blake Martinez and Nick Perry.","(2:17) Dak Prescott incomplete pass to the middle intended for Ezekiel Elliott.","(2:17) Dallas Cowboys timeout.","(2:54) Dak Prescott pass to the left to Terrance Williams for 15 yards to the GB21. Tackled by Damarious Randall.","(3:04) Aaron Rodgers pass to the right to Jordy Nelson for 18 yards to the GB32. Tackled by Barry Church. FUMBLE, recovered by Dal (Morris Claiborne). Tackled by Richard Rodgers.","(3:12) Chris Jones punts for 42 yards to GB14. No return.","(3:53) Dak Prescott pass to the left to Jason Witten for 8 yards to the Dal44. Tackled by Morgan Burnett and Joe Thomas.","(3:58) Dak Prescott incomplete pass to the right intended for Jason Witten.","(4:33) Ezekiel Elliott rush to the left for 1 yard to the Dal36. Tackled by Mike Daniels and Jake Ryan.","(5:11) Dak Prescott pass to the right to Terrance Williams for 10 yards to the Dal35. Tackled by Ha Ha Clinton-Dix.","(5:11) Mason Crosby kicks off to the endzone. Touchback.","(5:14) Mason Crosby 37 yard field goal attempt is GOOD. Holder: Jacob Schum.","(6:10) Aaron Ripkowski rush to the right for no gain to the Dal19. Tackled by Anthony Hitchens and Cedric Thornton.","(6:47) Aaron Rodgers pass to the left to Ty Montgomery for 8 yards to the Dal19. Tackled by Byron Jones.","(7:21) Aaron Rodgers pass to the left to Randall Cobb for 1 yard to the Dal27. Tackled by Anthony Brown and Brandon Carr.","(8:02) Eddie Lacy rush to the right for 25 yards to the Dal28. Tackled by Damien Wilson.","(8:06) Penalty: Illegal Use of Hands on Dallas (Morris Claiborne) 5 yards.","(8:10) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(8:10) Dallas Cowboys timeout.","(8:37) Aaron Rodgers rush to the right for 9 yards to the GB37. Tackled by Sean Lee. Penalty: Illegal Contact on Dallas (Barry Church) 5 yards.","(9:13) Eddie Lacy rush to the left for 2 yards to the GB28. Tackled by Terrell McClain.","(9:54) Eddie Lacy rush to the right for 1 yard to the GB26. Tackled by Sean Lee.","(10:03) Dan Bailey kicks off to the GB1. Ty Montgomery return for 24 yards to GB25. Tackled by Keith Smith.","(10:03) Dan Bailey extra point is good.","(10:08) Dak Prescott pass to the right to Cole Beasley for 1 yard for a TOUCHDOWN.","(11:05) Penalty: Too Many Men on Field on Green Bay (Kyler Fackrell) 1 yards.","(11:05) Dak Prescott rush to the left for 6 yards to the GB2. Tackled by Ha Ha Clinton-Dix.","(11:48) Dak Prescott pass to the left to Cole Beasley for 16 yards to the GB8. Tackled by Morgan Burnett and Ladarius Gunter.","(12:27) Ezekiel Elliott rush up the middle for 4 yards to the GB24. Tackled by Nick Perry.","(13:00) Dak Prescott pass to the right to Ezekiel Elliott for 15 yards to the GB28. Tackled by Morgan Burnett.","(13:35) Ezekiel Elliott rush to the left for 11 yards to the GB43. Tackled by Morgan Burnett.","(14:10) Dak Prescott pass to the left to Jason Witten for 14 yards to the Dal46. Tackled by Micah Hyde.","(14:24) Penalty: Offside on Green Bay (Clay Matthews) 5 yards.","(15:00) Ezekiel Elliott rush up the middle for 2 yards to the Dal27. Tackled by Letroy Guion.","(15:00) Mason Crosby kicks off to the endzone. Touchback."]