["(0:38) Alex Smith rush up the middle for a loss of 1 yard to the Oak10.","(1:16) Alex Smith rush up the middle for a loss of 1 yard to the Oak9.","(2:00) Spencer Ware rush up the middle for 5 yards to the Oak8. Tackled by Denico Autry.","(2:00) Two Minute Warning.","(2:07) Spencer Ware rush to the right for 1 yard to the Oak13. Tackled by Malcolm Smith and Justin Ellis.","(2:50) Spencer Ware rush to the right for 7 yards to the Oak14. Tackled by David Amerson and Malcolm Smith.","(2:57) Derek Carr sacked at Oak21 for a loss of 4 yards by Dee Ford.","(3:03) Derek Carr rush to the right for 2 yards to the Oak25. Tackled by Dee Ford.","(3:09) Derek Carr pass to the right to Clive Walford for 5 yards to the Oak23. Tackled by Daniel Sorensen.","(3:26) Derek Carr pass to the right to Jalen Richard for a loss of 1 yard to the Oak18. Tackled by Derrick Johnson.","(3:32) Penalty: Holding on Oakland (Donald Penn) -10 yards.","(3:43) Dustin Colquitt punts for 46 yards to Oak20. TJ Carrie return for 9 yards to Oak29. Tackled by James O'Shaughnessy.","(3:43) Oakland Raiders timeout.","(3:49) Charcandrick West rush up the middle for 4 yards to the KC34. Tackled by Keith McGill and Jihad Ward.","(3:51) Penalty: False Start on Kansas City (Mitchell Schwartz) -5 yards.","(4:34) Spencer Ware rush to the left for 4 yards to the KC35. Tackled by Khalil Mack.","(5:11) Spencer Ware rush to the left for 4 yards to the KC31. Tackled by Denico Autry.","(5:50) Alex Smith pass to the middle to Travis Kelce for 9 yards to the KC27. Tackled by Karl Joseph.","(6:32) Spencer Ware rush to the left for 4 yards to the KC18. Tackled by Bruce Irvin.","(7:14) Spencer Ware rush to the right for 2 yards to the KC14. Tackled by Bruce Irvin.","(7:22) Derek Carr sacked at KC20 for no gain by Dee Ford. FUMBLE, recovered by KC (Tamba Hali). Tackled by DeAndre Washington.","(7:27) Derek Carr incomplete pass to the right intended for Michael Crabtree defensed by Ron Parker.","(8:06) Derek Carr pass to the right to Mychal Rivera for 16 yards to the KC20. Tackled by Marcus Peters.","(8:11) Derek Carr incomplete pass to the left intended for Amari Cooper defensed by D.J. White.","(8:44) Derek Carr rush to the right for 6 yards to the KC36.","(9:00) DeAndre Washington rush to the left for 8 yards to the KC42. Tackled by Daniel Sorensen.","(9:30) Derek Carr pass to the left to Amari Cooper for 12 yards to the Oak50. Tackled by Steven Nelson and D.J. White.","(9:51) Derek Carr pass to the right to Seth Roberts for 13 yards to the Oak38. Tackled by Ron Parker.","(9:51) Cairo Santos kicks off to the endzone. Touchback.","(9:56) Cairo Santos 44 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(10:42) Charcandrick West rush to the right for 8 yards to the Oak26. Tackled by David Amerson.","(10:47) Alex Smith incomplete pass to the right intended for Demetrius Harris.","(11:22) Spencer Ware rush to the right for a loss of 2 yards to the Oak34. Tackled by Khalil Mack and Dan Williams.","(11:57) Alex Smith pass to the right to Demetrius Harris for 11 yards to the Oak32. Tackled by Karl Joseph.","(12:43) Spencer Ware rush to the right for 4 yards to the Oak43. Tackled by Denico Autry.","(13:19) Spencer Ware rush to the left for 3 yards to the Oak47. Tackled by Perry Riley Jr. and Dan Williams.","(13:50) Spencer Ware rush to the left for 9 yards to the KC50. Tackled by Shilique Calhoun.","(14:25) Spencer Ware rush to the left for 2 yards to the KC41. Tackled by Justin Ellis.","(15:00) Spencer Ware rush to the left for 8 yards to the KC39. Tackled by Reggie Nelson.","(0:23) Spencer Ware rush to the right for 9 yards to the KC31. Tackled by Malcolm Smith.","(0:36) Marquette King punts for 52 yards to KC22. No return.","(0:41) Derek Carr incomplete pass to the left intended for Amari Cooper.","(0:48) Derek Carr incomplete pass to the right intended for Seth Roberts defensed by Justin March.","(1:26) Derek Carr pass to the left to Michael Crabtree for 5 yards to the Oak26. Tackled by D.J. White.","(2:04) DeAndre Washington rush to the left for 6 yards to the Oak21. Tackled by Ron Parker and Chris Jones.","(2:43) DeAndre Washington rush up the middle for 7 yards to the Oak15. Tackled by Frank Zombo.","(2:50) Dustin Colquitt punts for 36 yards to Oak8. No return.","(2:56) Alex Smith incomplete pass to the right intended for Chris Conley.","(3:37) Alex Smith pass to the middle to De'Anthony Thomas for 6 yards to the Oak44. Tackled by Bruce Irvin.","(4:15) Jamaal Charles rush to the right for a loss of 3 yards to the KC50. Tackled by Malcolm Smith.","(4:53) Alex Smith pass to the right to Jamaal Charles for 16 yards to the Oak47. Tackled by Cory James.","(5:33) Alex Smith pass to the left to Tyreek Hill for 12 yards to the KC37. Tackled by Sean Smith.","(6:10) Jamaal Charles rush to the left for 1 yard to the KC25. Tackled by Karl Joseph.","(6:18) Marquette King punts for 49 yards to KC24. No return.","(6:22) Derek Carr incomplete pass to the right intended for Jalen Richard.","(7:06) Derek Carr pass to the right to Jalen Richard for 6 yards to the Oak27. Tackled by Tamba Hali.","(7:42) Jalen Richard rush to the left for no gain to the Oak21. Tackled by Derrick Johnson.","(7:48) Cairo Santos kicks off to the Oak4. Jalen Richard return for 17 yards to Oak21. Tackled by Anthony Sherman.","(7:51) Cairo Santos 22 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(8:34) Alex Smith pass to the right to Jamaal Charles for a loss of 2 yards to the Oak4. Tackled by David Amerson and Khalil Mack.","(9:14) Alex Smith pass to the right to Spencer Ware for 2 yards to the Oak2. Tackled by Karl Joseph.","(9:14) Kansas City Chiefs timeout.","(9:52) Spencer Ware rush up the middle for 2 yards to the Oak4. Tackled by Darius Latham.","(10:35) Alex Smith pass to the left to Spencer Ware for 30 yards to the Oak6. Tackled by Cory James.","(10:53) Marquette King punts for 58 yards to KC9. Tyreek Hill return for 50 yards to Oak41. Tackled by Brynden Trawick. Penalty: Illegal Formation on Oakland 5 yards.","(10:58) Derek Carr incomplete pass to the right intended for DeAndre Washington.","(11:33) DeAndre Washington rush to the left for 8 yards to the Oak33. Tackled by Ron Parker.","(11:37) Derek Carr incomplete pass to the left intended for Amari Cooper.","(11:37) Cairo Santos kicks off to the endzone. Touchback.","(11:37) Cairo Santos extra point is good.","(11:41) Dontari Poe rush to the right for 1 yard for a TOUCHDOWN.","(12:23) Jamaal Charles rush up the middle for 2 yards to the Oak1. Tackled by Khalil Mack.","(12:30) Jeremy Maclin incomplete pass to the right.","(13:20) Spencer Ware rush to the left for 45 yards to the Oak3. Tackled by Reggie Nelson.","(13:50) Alex Smith pass to the left to Chris Conley for 7 yards to the Oak48.","(14:25) Alex Smith pass to the right to Jeremy Maclin for 7 yards to the KC45. Tackled by David Amerson.","(15:00) Alex Smith pass to the right to Chris Conley for 13 yards to the KC38. Tackled by Cory James.","(15:00) Sebastian Janikowski kicks off to the endzone. Touchback.","(0:01) Sebastian Janikowski 46 yard field goal attempt is GOOD. Holder: Marquette King.","(0:02) Derek Carr incomplete pass to the middle.","(0:14) Derek Carr pass to the middle to Clive Walford for 20 yards to the KC28. Tackled by Ron Parker.","(0:18) Derek Carr pass to the left to Amari Cooper for 15 yards to the KC48.","(0:18) Oakland Raiders timeout.","(0:25) Derek Carr pass to the left to Amari Cooper for 9 yards to the Oak37. Tackled by Derrick Johnson.","(0:28) 38 yard field goal attempt by Cairo Santos is NO GOOD. Holder: Dustin Colquitt.","(0:28) Oakland Raiders timeout.","(0:45) Spencer Ware rush to the right for a loss of 2 yards to the Oak20. Tackled by Stacy McGee.","(1:22) Alex Smith pass to the right to Chris Conley for 6 yards to the Oak18. Tackled by David Amerson and Cory James.","(2:00) Jamaal Charles rush to the left for 3 yards to the Oak24. Tackled by Karl Joseph.","(2:00) Two Minute Warning.","(2:44) Alex Smith pass to the right to Jeremy Maclin for 38 yards to the Oak27. Tackled by David Amerson.","(3:14) Spencer Ware rush up the middle for 3 yards to the KC35. Tackled by Cory James.","(3:19) Derek Carr incomplete pass to the left intended for Seth Roberts.","(3:24) Derek Carr incomplete pass to the right intended for Seth Roberts.","(4:05) Jalen Richard rush up the middle for a loss of 3 yards to the KC32. Tackled by Chris Jones.","(4:44) Derek Carr pass to the right to Andre Holmes for 8 yards to the KC29. Tackled by Steven Nelson.","(4:57) Kansas City Chiefs timeout.","(5:03) Derek Carr pass to the left to Amari Cooper for 24 yards to the KC37. Tackled by D.J. White.","(5:50) Derek Carr pass to the right to Seth Roberts for a loss of 3 yards to the Oak39. Tackled by Derrick Johnson and Marcus Peters.","(6:27) Jalen Richard rush to the left for 6 yards to the Oak42. Tackled by Steven Nelson and Derrick Johnson.","(7:05) Derek Carr pass to the left to Amari Cooper for 12 yards to the Oak36. Tackled by D.J. White.","(7:11) Cairo Santos kicks off to the Oak5. Jalen Richard return for 19 yards to Oak24. Tackled by Anthony Sherman.","(7:11) Cairo Santos extra point is NO GOOD.","(7:15) Jamaal Charles rush to the left for 4 yards for a TOUCHDOWN.","(7:54) Alex Smith pass to the right to Albert Wilson for 26 yards to the Oak4. Tackled by Khalil Mack.","(8:32) Jamaal Charles rush up the middle for 2 yards to the Oak30. Tackled by Shilique Calhoun.","(9:11) Jamaal Charles rush to the right for 17 yards to the Oak32. Tackled by Perry Riley Jr..","(9:53) Alex Smith pass to the right to Tyreek Hill for 8 yards to the Oak49. Tackled by Karl Joseph.","(10:29) Jamaal Charles rush to the left for 1 yard to the KC43. Tackled by Khalil Mack.","(10:34) 52 yard field goal attempt by Sebastian Janikowski is NO GOOD. Holder: Marquette King.","(11:20) Derek Carr pass to the middle to Amari Cooper for 13 yards to the KC34. Tackled by Daniel Sorensen.","(12:00) Jalen Richard rush to the right for 4 yards to the KC48. Tackled by Derrick Johnson.","(12:37) Derek Carr rush up the middle for no gain to the KC48. FUMBLE, recovered by Oak (DeAndre Washington).","(13:05) Penalty: Holding on Oakland (Kelechi Osemele) -10 yards.","(13:46) Derek Carr pass to the left to Michael Crabtree for 5 yards to the KC38. Tackled by Phillip Gaines.","(14:24) Derek Carr pass to the right to Amari Cooper for 3 yards to the KC43. Tackled by Allen Bailey.","(15:00) DeAndre Washington rush to the left for 5 yards to the KC46. Tackled by Derrick Johnson.","(0:52) Derek Carr pass to the right to Seth Roberts for 19 yards to the Oak49. Tackled by Ron Parker and Dee Ford.","(1:32) DeAndre Washington rush up the middle for 1 yard to the Oak30. Tackled by Frank Zombo.","(2:08) DeAndre Washington rush up the middle for 7 yards to the Oak29. Tackled by Daniel Sorensen.","(2:16) Cairo Santos kicks off to the Oak0. Jalen Richard return for 22 yards to Oak22. Tackled by Daniel Sorensen and Albert Wilson.","(2:16) Cairo Santos extra point is good.","(2:19) Spencer Ware rush up the middle for 2 yards for a TOUCHDOWN.","(3:02) Jamaal Charles rush up the middle for 6 yards to the Oak2. Tackled by Reggie Nelson and Karl Joseph.","(3:40) Charcandrick West rush to the right for 7 yards to the Oak8. Tackled by Karl Joseph.","(4:25) Alex Smith pass to the right to De'Anthony Thomas for 8 yards to the Oak15. Tackled by DJ Hayden.","(5:06) Alex Smith pass to the middle to Travis Kelce for 2 yards to the Oak23. Tackled by Cory James.","(5:06) Oakland Raiders timeout.","(5:10) Alex Smith incomplete pass to the right intended for Anthony Sherman.","(5:52) Spencer Ware rush up the middle for 2 yards to the Oak25. Tackled by Bruce Irvin.","(6:31) Spencer Ware rush up the middle for 2 yards to the Oak27. Tackled by Cory James.","(7:09) Spencer Ware rush to the left for 7 yards to the Oak29. Tackled by Sean Smith and Karl Joseph.","(7:43) Alex Smith pass to the right to Travis Kelce for 21 yards to the Oak36. Tackled by David Amerson and Reggie Nelson.","(7:51) Derek Carr pass intended for Michael Crabtree INTERCEPTED by Marcus Peters. No return.","(8:28) DeAndre Washington rush to the left for 5 yards to the Oak29. Tackled by Eric Berry.","(8:39) Penalty: Offside on Kansas City (Frank Zombo) 5 yards.","(8:39) Dustin Colquitt punts for 40 yards to Oak15. TJ Carrie return for 4 yards to Oak19. Tackled by Tyreek Hill.","(9:17) Alex Smith rush up the middle for 1 yard to the KC45. Tackled by Denico Autry.","(10:02) Alex Smith sacked at KC44 for a loss of 1 yard by Khalil Mack.","(10:40) Spencer Ware rush to the right for no gain to the KC45. Tackled by Stacy McGee.","(11:16) Spencer Ware rush to the left for 10 yards to the KC45. Tackled by Perry Riley Jr..","(11:50) Alex Smith pass to the right to Jeremy Maclin for 4 yards to the KC35. Tackled by Sean Smith.","(11:58) Sebastian Janikowski kicks off to the KC1. Tyreek Hill return for 30 yards to KC31. Tackled by Shilique Calhoun.","(11:58) Sebastian Janikowski extra point is good.","(12:02) Derek Carr pass to the middle to Andre Holmes for 3 yards for a TOUCHDOWN.","(12:02) Kansas City Chiefs timeout.","(12:08) Derek Carr incomplete pass to the left intended for Mychal Rivera.","(12:45) DeAndre Washington rush to the left for 1 yard to the KC3. Tackled by Daniel Sorensen.","(13:15) Derek Carr pass to the left to Amari Cooper for 11 yards to the KC4. Tackled by Phillip Gaines and Derrick Johnson.","(13:43) Derek Carr pass to the middle to Amari Cooper for 19 yards to the KC15. Tackled by Derrick Johnson and Eric Berry.","(14:23) DeAndre Washington rush to the left for 1 yard to the KC34. Tackled by Jaye Howard.","(14:51) Derek Carr pass to the left to Amari Cooper for 11 yards to the KC35.","(15:00) Cairo Santos kicks off to the Oak4. Jalen Richard return for 50 yards to KC46. Tackled by Cairo Santos."]