["(0:21) Rex Burkhead rush up the middle for 12 yards to the Cin43. Tackled by Chris Long and Patrick Chung.","(0:51) Rex Burkhead rush up the middle for 4 yards to the Cin31. Tackled by Anthony Johnson.","(0:57) Stephen Gostkowski kicks off to the Cin1. Alex Erickson return for 26 yards to Cin27. Tackled by Jordan Richards and Jonathan Jones.","(0:57) Stephen Gostkowski extra point is good.","(0:57) LeGarrette Blount rush up the middle for 1 yard for a TOUCHDOWN. Penalty: Unnecessary Roughness on New England (LeGarrette Blount) -15 yards.","(1:40) Tom Brady rush up the middle for no gain to the Cin1. Tackled by Rey Maualuga.","(2:00) LeGarrette Blount rush to the left for 4 yards to the Cin1. Tackled by George Iloka.","(2:00) Two Minute Warning.","(2:15) LeGarrette Blount rush up the middle for 2 yards to the Cin5. Tackled by Geno Atkins and Pat Sims.","(2:15) New England Patriots timeout.","(2:22) Tom Brady pass to the left to Julian Edelman for 13 yards to the Cin15. Tackled by Dre Kirkpatrick. Penalty: Face Mask on Cincinnati (Dre Kirkpatrick) 8 yards.","(3:04) James White rush up the middle for 2 yards to the Cin28. Tackled by Rey Maualuga and Karlos Dansby.","(3:04) Cincinnati Bengals timeout.","(3:10) LeGarrette Blount rush to the left for 3 yards to the Cin30. Tackled by Karlos Dansby and Michael Johnson.","(3:10) Cincinnati Bengals timeout.","(3:25) LeGarrette Blount rush up the middle for 9 yards to the Cin33. Tackled by Shawn Williams.","(3:32) Julian Edelman rush to the left for 8 yards to the Cin42.","(3:43) Kevin Huber punts for 45 yards to NE27. Julian Edelman return for 23 yards to NE50. Tackled by Clayton Fejedelem.","(4:23) Andy Dalton sacked at Cin28 for a loss of 9 yards by Jabaal Sheard and Dont'a Hightower.","(4:28) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(5:04) Giovani Bernard rush to the right for a loss of 3 yards to the Cin37. Tackled by Alan Branch.","(5:37) Giovani Bernard rush to the left for 11 yards to the Cin40. Tackled by Devin McCourty.","(6:04) Andy Dalton pass to the left to A.J. Green for 9 yards to the Cin29.","(6:04) Penalty: False Start on Cincinnati (C.J. Uzomah) -5 yards.","(6:04) Stephen Gostkowski kicks off to the endzone. Touchback.","(6:08) Stephen Gostkowski 31 yard field goal attempt is GOOD. Holder: Ryan Allen.","(6:13) Tom Brady incomplete pass to the left intended for Rob Gronkowski.","(6:56) Tom Brady pass to the left to Martellus Bennett for 5 yards to the Cin13. Tackled by Karlos Dansby and Shawn Williams.","(7:41) Tom Brady pass to the left to James White for 5 yards to the Cin18. Tackled by Derron Smith.","(8:14) Tom Brady pass to the middle to Rob Gronkowski for 12 yards to the Cin8. Tackled by Josh Shaw. Penalty: Taunting on New England (Rob Gronkowski) -15 yards.","(8:46) Tom Brady pass to the middle to Rob Gronkowski for 29 yards to the Cin20. Tackled by Adam Jones.","(9:15) LeGarrette Blount rush to the right for a loss of 2 yards to the Cin49. Tackled by Michael Johnson.","(9:15) Cincinnati Bengals timeout.","(9:23) Penalty: Holding on Cincinnati (Adam Jones) 5 yards.","(9:45) Penalty: False Start on New England (Rob Gronkowski) -5 yards.","(10:22) James White rush to the left for 1 yard to the Cin47. Tackled by Adam Jones and Vontaze Burfict.","(10:48) James White rush to the left for 2 yards to the Cin48. Tackled by Geno Atkins.","(11:22) Tom Brady pass to the left to Danny Amendola for 17 yards to the NE50. Tackled by Shawn Williams.","(12:06) Tom Brady pass to the left to Julian Edelman for 3 yards to the NE33. Tackled by Josh Shaw.","(12:34) Tom Brady pass to the right to Martellus Bennett for 5 yards to the NE30. Tackled by Josh Shaw and Vontaze Burfict.","(12:34) Mike Nugent kicks off to the endzone. Touchback.","(12:37) Mike Nugent 25 yard field goal attempt is GOOD. Holder: Kevin Huber.","(12:42) Andy Dalton incomplete pass to the left intended for A.J. Green defensed by Eric Rowe.","(13:27) Jeremy Hill rush to the right for no gain to the NE7. Tackled by Rob Ninkovich.","(13:52) Jeremy Hill rush up the middle for 8 yards to the NE7. Tackled by Dont'a Hightower and Patrick Chung.","(14:28) Andy Dalton pass to the right to Tyler Boyd for 30 yards to the NE15. Tackled by Logan Ryan.","(15:00) Jeremy Hill rush to the left for 1 yard to the NE45. Tackled by Elandon Roberts and Dont'a Hightower.","(0:24) Jeremy Hill rush to the left for 3 yards to the NE46. Tackled by Logan Ryan.","(0:59) Andy Dalton pass to the left to James Wright for 1 yard to the NE49. Tackled by Eric Rowe.","(1:41) Giovani Bernard rush to the left for 8 yards to the Cin50. Tackled by Dont'a Hightower and Patrick Chung.","(1:52) Andy Dalton incomplete pass to the left intended for Brandon LaFell defensed by Malcolm Butler.","(2:21) Andy Dalton pass to the left to Tyler Kroft for 13 yards to the Cin42. Tackled by Patrick Chung.","(2:58) Giovani Bernard rush to the left for 4 yards to the Cin29. Tackled by Woodrow Hamilton and Trey Flowers.","(2:58) Stephen Gostkowski kicks off to the endzone. Touchback.","(2:58) Stephen Gostkowski extra point is NO GOOD.","(3:02) Tom Brady pass to the right to James White for 4 yards for a TOUCHDOWN.","(3:13) Tom Brady incomplete pass to the left intended for Julian Edelman.","(3:49) Tom Brady pass to the right to Martellus Bennett for 11 yards to the Cin4. Tackled by Vontaze Burfict and Shawn Williams.","(4:33) Tom Brady pass to the right to Rob Gronkowski for 38 yards to the Cin15. Tackled by Shawn Williams and Dre Kirkpatrick.","(4:44) Kevin Huber punts for 37 yards to NE38. Julian Edelman return for 9 yards to NE47. Tackled by Vincent Rey and Tyler Kroft.","(4:51) Andy Dalton incomplete pass to the right intended for Giovani Bernard.","(4:56) Andy Dalton incomplete pass to the left intended for C.J. Uzomah.","(5:00) Andy Dalton incomplete pass to the right intended for A.J. Green.","(5:00) Stephen Gostkowski kicks off to the endzone. Touchback.","(5:00) Stephen Gostkowski extra point is good.","(5:04) Tom Brady pass to the right to Rob Gronkowski for 4 yards for a TOUCHDOWN.","(5:26) Tom Brady pass to the right to Rob Gronkowski for 38 yards to the Cin4. Tackled by Josh Shaw.","(6:03) LeGarrette Blount rush to the right for a loss of 1 yard to the Cin42. Tackled by Geno Atkins.","(6:29) Tom Brady pass to the right to Martellus Bennett for 3 yards to the Cin41. Tackled by Josh Shaw.","(6:59) Tom Brady pass to the right to Martellus Bennett for 24 yards to the Cin44. Tackled by George Iloka and Karlos Dansby.","(7:05) Kevin Huber kicks off to the NE16. Julian Edelman return for 16 yards to NE32. Tackled by Josh Shaw.","(7:11) Andy Dalton sacked at Cin0 for a loss of 8 yards by Dont'a Hightower. Safety.","(7:40) Penalty: Holding on Cincinnati (Cedric Ogbuehi) -8 yards.","(8:11) Jeremy Hill rush to the left for no gain to the Cin16. Tackled by Trey Flowers.","(8:22) Ryan Allen punts for 52 yards to Cin5. Alex Erickson return for 11 yards to Cin16. Tackled by Nate Ebner and Joe Cardona.","(8:59) Tom Brady pass to the right to Danny Amendola for 13 yards to the NE43. Tackled by Dre Kirkpatrick.","(9:41) Tom Brady sacked at NE30 for a loss of 5 yards by Michael Johnson.","(10:02) Penalty: False Start on New England (Julian Edelman) -5 yards.","(10:30) LeGarrette Blount rush to the left for a loss of 2 yards to the NE40. Tackled by Karlos Dansby.","(11:07) Tom Brady pass to the right to LeGarrette Blount for 16 yards to the NE42. Tackled by Adam Jones and Karlos Dansby.","(11:14) Mike Nugent kicks off to the NE-4. D.J. Foster return for 30 yards to NE26. Tackled by Clayton Fejedelem and Vincent Rey.","(11:14) Mike Nugent extra point is good.","(11:19) Andy Dalton pass to the left to Brandon LaFell for 5 yards for a TOUCHDOWN.","(11:48) Andy Dalton pass to the right to Giovani Bernard for 3 yards to the NE5. Tackled by Dont'a Hightower.","(12:27) Giovani Bernard rush to the right for 2 yards to the NE8. Tackled by Dont'a Hightower and Jabaal Sheard.","(12:58) Andy Dalton pass to the right to Tyler Boyd for 27 yards to the NE10. Tackled by Malcolm Butler and Devin McCourty.","(13:20) Andy Dalton pass to the left to A.J. Green for 23 yards to the NE37. Tackled by Duron Harmon.","(13:23) Andy Dalton incomplete pass to the right intended for Brandon LaFell defensed by Malcolm Butler.","(13:56) Giovani Bernard rush to the left for 5 yards to the Cin40. Tackled by Devin McCourty.","(14:24) Andy Dalton rush to the left for 15 yards to the Cin35. Tackled by Logan Ryan.","(14:56) Giovani Bernard rush to the left for no gain to the Cin20. Tackled by Malcom Brown.","(15:00) Stephen Gostkowski kicks off to the Cin5. Rex Burkhead return for 15 yards to Cin20. Tackled by Nate Ebner.","(0:07) Kevin Huber punts for 52 yards to NE23. Julian Edelman return for 17 yards to NE40. Tackled by Nick Vigil.","(0:15) Andy Dalton incomplete pass to the left intended for Tyler Boyd defensed by Malcolm Butler.","(0:55) Giovani Bernard rush to the right for no gain to the Cin25. Tackled by Barkevious Mingo.","(1:01) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Devin McCourty.","(1:01) Stephen Gostkowski kicks off to the endzone. Touchback.","(1:01) Stephen Gostkowski extra point is good.","(1:06) Tom Brady pass to the right to James White for 15 yards for a TOUCHDOWN.","(1:16) Tom Brady pass to the middle to Chris Hogan for 39 yards to the Cin15. Tackled by Shawn Williams.","(1:20) Tom Brady pass to the left to James White for 5 yards to the NE46.","(1:42) Tom Brady pass to the right to James White for 7 yards to the NE41. Tackled by Vontaze Burfict.","(2:00) Tom Brady pass to the right to Julian Edelman for 8 yards to the NE34. Tackled by Vontaze Burfict and Karlos Dansby.","(2:00) Two Minute Warning.","(2:25) LeGarrette Blount rush to the right for 4 yards to the NE26. Tackled by Vontaze Burfict.","(2:31) Penalty: Illegal Contact on Cincinnati (Dre Kirkpatrick) 5 yards.","(3:06) Tom Brady sacked at NE17 for a loss of 8 yards by Vontaze Burfict.","(3:10) Tom Brady incomplete pass to the middle intended for Julian Edelman.","(3:10) Mike Nugent kicks off to the endzone. Touchback.","(3:10) Mike Nugent extra point is good.","(3:15) Andy Dalton rush to the left for 2 yards for a TOUCHDOWN.","(3:51) Andy Dalton pass to the left to A.J. Green for 14 yards to the NE2. Tackled by Duron Harmon.","(4:26) Andy Dalton pass to the right to Tyler Boyd for 14 yards to the NE16. Tackled by Rob Ninkovich.","(5:03) Jeremy Hill rush up the middle for 4 yards to the NE30. Tackled by Alan Branch.","(5:28) Andy Dalton pass to the left to A.J. Green for 22 yards to the NE34. Tackled by Logan Ryan.","(6:07) Jeremy Hill rush to the right for a loss of 4 yards to the Cin44. Tackled by Chris Long.","(6:36) Jeremy Hill rush to the left for 8 yards to the Cin48. Tackled by Devin McCourty.","(6:47) Ryan Allen punts for 44 yards to Cin39. Alex Erickson return for 1 yard to Cin40. Tackled by Brandon King.","(7:17) James White rush to the left for 2 yards to the NE17. Tackled by Josh Shaw.","(8:02) Tom Brady sacked at NE15 for a loss of 5 yards by Pat Sims.","(8:36) LeGarrette Blount rush to the right for 3 yards to the NE20. Tackled by Josh Shaw.","(9:05) LeGarrette Blount rush up the middle for 15 yards to the NE17. Tackled by Shawn Williams.","(9:11) Giovani Bernard rush to the left for no gain to the NE1. Tackled by Anthony Johnson and Alan Branch.","(9:15) Andy Dalton incomplete pass to the left intended for A.J. Green defensed by Malcolm Butler.","(9:55) Giovani Bernard rush to the left for no gain to the NE1. Tackled by Elandon Roberts and Malcom Brown.","(10:31) Giovani Bernard rush up the middle for 5 yards to the NE1. Tackled by Devin McCourty.","(11:13) Andy Dalton pass to the right to Giovani Bernard for 32 yards to the NE6. Tackled by Barkevious Mingo.","(11:54) Andy Dalton pass to the right to A.J. Green for 16 yards to the NE38. Tackled by Logan Ryan.","(12:03) Penalty: Holding on Cincinnati (Jeremy Hill) -10 yards.","(12:36) Jeremy Hill rush up the middle for 1 yard to the NE44. Tackled by Alan Branch.","(12:52) Penalty: False Start on Cincinnati (C.J. Uzomah) -5 yards.","(13:23) Jeremy Hill rush to the right for 7 yards to the NE40. Tackled by Patrick Chung.","(13:50) Jeremy Hill rush to the left for 5 yards to the NE47. Tackled by Alan Branch and Dont'a Hightower.","(14:19) Andy Dalton pass to the right to C.J. Uzomah for 6 yards to the Cin48. Tackled by Devin McCourty.","(15:00) Jeremy Hill rush up the middle for 3 yards to the Cin42. Tackled by Alan Branch and Malcom Brown.","(0:34) Andy Dalton pass to the left to Jeremy Hill for 3 yards to the Cin39. Tackled by Dont'a Hightower.","(0:38) Penalty: Illegal Use of Hands on New England (Logan Ryan) 5 yards.","(1:20) Andy Dalton pass to the right to Tyler Kroft for 6 yards to the Cin31. Tackled by Elandon Roberts and Rob Ninkovich.","(2:03) Jeremy Hill rush up the middle for 2 yards to the Cin25. Tackled by Malcom Brown and Dont'a Hightower.","(2:33) Andy Dalton pass to the left to Giovani Bernard for 7 yards to the Cin23. Tackled by Elandon Roberts and Dont'a Hightower.","(2:57) Giovani Bernard rush to the left for 6 yards to the Cin16. Tackled by Devin McCourty.","(3:03) Ryan Allen punts for 37 yards to Cin10. No return.","(3:13) Tom Brady incomplete pass to the right intended for Rob Gronkowski.","(3:51) Tom Brady pass to the right to LeGarrette Blount for 4 yards to the Cin47. Tackled by Josh Shaw.","(4:30) LeGarrette Blount rush to the left for 4 yards to the NE49. Tackled by Margus Hunt.","(5:00) Penalty: Holding on New England (Chris Hogan) -10 yards.","(5:38) James White rush up the middle for 3 yards to the Cin45. Tackled by Pat Sims and Vincent Rey.","(6:04) Tom Brady pass to the left to Rob Gronkowski for 9 yards to the Cin48. Tackled by George Iloka.","(6:35) Tom Brady pass to the left to James White for 3 yards to the NE43. Tackled by Vontaze Burfict.","(6:57) James White rush to the right for 7 yards to the NE40. Tackled by Vincent Rey.","(7:18) Tom Brady pass to the left to Julian Edelman for 6 yards to the NE33. Tackled by Dre Kirkpatrick.","(7:34) Tom Brady pass to the right to James White for 7 yards to the NE27. Tackled by Dre Kirkpatrick.","(7:46) Kevin Huber punts for 30 yards to NE20. No return.","(8:28) Andy Dalton pass to the right to Brandon LaFell for 8 yards to the Cin50. Tackled by Malcolm Butler.","(9:11) Giovani Bernard rush to the right for a loss of 2 yards to the Cin42. Tackled by Rob Ninkovich and Dont'a Hightower.","(9:52) Andy Dalton pass to the middle to Giovani Bernard for 3 yards to the Cin44. Tackled by Elandon Roberts.","(10:19) Andy Dalton pass to the right to Tyler Boyd for 8 yards to the Cin41. Tackled by Duron Harmon.","(10:50) Giovani Bernard rush to the right for 6 yards to the Cin33. Tackled by Chris Long and Dont'a Hightower.","(11:30) Giovani Bernard rush up the middle for 7 yards to the Cin27. Tackled by Elandon Roberts and Malcom Brown.","(12:01) Andy Dalton pass to the left to A.J. Green for 4 yards to the Cin20. Tackled by Malcolm Butler.","(12:06) Stephen Gostkowski kicks off to the Cin0. Alex Erickson return for 16 yards to Cin16. Tackled by Brandon King.","(12:11) Stephen Gostkowski 46 yard field goal attempt is GOOD. Holder: Ryan Allen.","(12:16) Tom Brady incomplete pass to the right intended for James White.","(12:16) Cincinnati Bengals timeout.","(12:49) Tom Brady rush to the right for 2 yards to the Cin28.","(13:26) James White rush to the left for 2 yards to the Cin30. Tackled by Margus Hunt.","(13:56) Tom Brady pass to the left to Rob Gronkowski for 32 yards to the Cin32. Tackled by Karlos Dansby and Shawn Williams.","(14:32) Tom Brady pass to the left to James White for 1 yard to the NE36. Tackled by Domata Peko.","(15:00) Tom Brady incomplete pass to the right intended for Julian Edelman.","(15:00) LeGarrette Blount rush to the left for 10 yards to the NE35. Tackled by Shawn Williams.","(15:00) Mike Nugent kicks off to the endzone. Touchback."]