["(8:13) Nick Novak 33 yard field goal attempt is GOOD. Holder: Shane Lechler.","(8:58) Brock Osweiler rush to the right for a loss of 3 yards to the Ind15.","(8:58) Houston Texans timeout.","(9:44) Brock Osweiler pass to the left to Jaelen Strong for 36 yards to the Ind12. Tackled by Rashaan Melvin.","(10:21) Lamar Miller rush up the middle for no gain to the Ind48. Tackled by Darryl Morris.","(10:51) Lamar Miller rush to the right for 10 yards to the Ind48. Tackled by Josh McNary.","(11:30) Brock Osweiler pass to the left to C.J. Fiedorowicz for 9 yards to the Hou42. Tackled by Clayton Geathers.","(11:42) Pat McAfee punts for 41 yards to Hou16. Tyler Ervin return for 17 yards to Hou33. Tackled by Josh McNary and Matthias Farley.","(11:54) Penalty: Too Many Men on Field on Houston 5 yards.","(12:37) Andrew Luck sacked at Ind38 for a loss of 9 yards by Benardrick McKinney.","(12:37) Indianapolis Colts timeout.","(13:24) Andrew Luck pass to the left to T.Y. Hilton for 7 yards to the Ind47. Tackled by Kevin Johnson.","(13:33) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(14:14) Frank Gore rush to the right for 7 yards to the Ind40. Tackled by Brian Cushing and Benardrick McKinney.","(14:54) Andrew Luck pass to the left to Erik Swoope for 7 yards to the Ind33. Tackled by Benardrick McKinney and Andre Hal.","(15:00) Nick Novak kicks off to the Ind3. Josh Ferguson return for 23 yards to Ind26. Tackled by Jay Prosch.","(0:15) Brock Osweiler rush up the middle for a loss of 1 yard to the Hou15.","(0:23) Pat McAfee punts for 32 yards to Hou16. No return.","(0:27) Andrew Luck incomplete pass to the middle intended for T.Y. Hilton.","(0:31) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(0:31) Indianapolis Colts timeout.","(0:38) Andrew Luck rush up the middle for 2 yards to the Hou48. Tackled by Whitney Mercilus and Benardrick McKinney.","(0:38) Indianapolis Colts timeout.","(0:49) Andrew Luck pass to the left to Chester Rogers for 18 yards to the Ind50. Tackled by A.J. Bouye.","(0:49) Nick Novak kicks off to the Ind22. Austin Blythe return for 10 yards to Ind32. Tackled by K.J. Dillon.","(0:49) Nick Novak extra point is good.","(0:54) Brock Osweiler pass to the right to C.J. Fiedorowicz for 26 yards for a TOUCHDOWN.","(1:22) Brock Osweiler pass to the right to C.J. Fiedorowicz for 11 yards to the Ind26. Tackled by T.J. Green.","(1:50) Brock Osweiler pass to the left to Lamar Miller for 16 yards to the Ind37. Tackled by D'Qwell Jackson.","(2:00) Pat McAfee punts for 49 yards to Hou41. Tyler Ervin return for 6 yards to Hou47. Tackled by Edwin Jackson.","(2:00) Two Minute Warning.","(2:22) Frank Gore rush to the left for a loss of 1 yard to the Ind10. Tackled by Whitney Mercilus.","(2:22) Houston Texans timeout.","(2:28) Andrew Luck sacked at Ind11 for a loss of 7 yards by Andre Hal.","(2:28) Penalty: False Start on Indianapolis (Erik Swoope) -5 yards.","(2:28) Houston Texans timeout.","(2:32) Frank Gore rush to the right for 2 yards to the Ind23. Tackled by John Simon.","(2:37) Nick Novak kicks off to the Ind16. T.Y. Hilton return for 5 yards to Ind21. Tackled by Robert Nelson Jr..","(2:37) Nick Novak extra point is good.","(2:47) Brock Osweiler pass to the middle to Lamar Miller for 10 yards for a TOUCHDOWN.","(2:51) Brock Osweiler incomplete pass to the right intended for Braxton Miller.","(3:20) Brock Osweiler pass to the left to Braxton Miller for 3 yards to the Ind10. Tackled by Darius Butler.","(3:57) Brock Osweiler pass to the right to DeAndre Hopkins for 12 yards to the Ind13. Tackled by Mike Adams.","(4:23) Brock Osweiler pass to the right to DeAndre Hopkins for 6 yards to the Ind25. Tackled by Vontae Davis.","(4:23) Brock Osweiler pass to the right to DeAndre Hopkins for 9 yards to the Ind31. Tackled by Vontae Davis.","(4:56) Brock Osweiler pass to the right to DeAndre Hopkins for 10 yards to the Ind40. Tackled by Darius Butler.","(4:56) Houston Texans timeout.","(5:37) Lamar Miller rush to the left for 1 yard to the Hou50. Tackled by Rashaan Melvin.","(5:43) Brock Osweiler incomplete pass to the left intended for Ryan Griffin.","(6:09) Lamar Miller rush to the right for 5 yards to the Hou49. Tackled by David Parry.","(6:33) Brock Osweiler pass to the right to Ryan Griffin for 8 yards to the Hou44. Tackled by Clayton Geathers.","(7:04) Brock Osweiler pass to the right to Ryan Griffin for 11 yards to the Hou36. Tackled by T.J. Green and Darius Butler.","(7:04) Pat McAfee kicks off to the endzone. Touchback.","(7:12) Adam Vinatieri 36 yard field goal attempt is GOOD. Holder: Pat McAfee.","(7:12) Andrew Luck incomplete pass to the left intended for Erik Swoope.","(8:00) Robert Turbin rush up the middle for 2 yards to the Hou18. Tackled by Brian Cushing.","(8:43) Robert Turbin rush to the left for 1 yard to the Hou20. Tackled by Kevin Johnson.","(9:28) Frank Gore rush to the left for 10 yards to the Hou21. Tackled by Andre Hal and Corey Moore.","(10:13) Frank Gore rush up the middle for 4 yards to the Hou31. Tackled by Benardrick McKinney and Brian Cushing.","(10:52) Andrew Luck pass to the left to Erik Swoope for 35 yards to the Hou35. Tackled by Kevin Johnson.","(11:33) Frank Gore rush to the left for 6 yards to the Ind30. Tackled by Jadeveon Clowney.","(12:14) Frank Gore rush to the right for 8 yards to the Ind24. Tackled by D.J. Reader.","(12:21) Andrew Luck incomplete pass to the middle intended for Phillip Dorsett.","(12:33) Shane Lechler punts for 52 yards to Ind10. Chester Rogers return for 6 yards to Ind16. Tackled by Tyler Ervin.","(13:01) Brock Osweiler pass to the left to C.J. Fiedorowicz for 13 yards to the Hou38. Tackled by Clayton Geathers.","(13:37) Alfred Blue rush to the right for a loss of 1 yard to the Hou25. Tackled by Erik Walden.","(13:51) Penalty: Holding on Houston (Duane Brown) -10 yards.","(13:57) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(14:32) Lamar Miller rush to the left for 16 yards to the Hou36. Tackled by Mike Adams and Erik Walden.","(14:53) Lamar Miller rush to the left for 5 yards to the Hou30. Tackled by Mike Adams. Penalty: Holding on Houston (Keith Mumphery) -10 yards.","(14:53) Pat McAfee kicks off to the endzone. Touchback.","(14:53) Adam Vinatieri extra point is good.","(15:00) Andrew Luck rush to the left for 14 yards for a TOUCHDOWN.","(0:18) Frank Gore rush to the right for 6 yards to the Hou14. Tackled by Christian Covington.","(0:30) Brock Osweiler pass intended for DeAndre Hopkins INTERCEPTED by Vontae Davis. No return. Tackled by DeAndre Hopkins.","(0:47) Lamar Miller rush to the right for 5 yards to the Hou18. Tackled by Mike Adams. Penalty: Holding on Houston (DeAndre Hopkins) -9 yards.","(0:53) Andrew Luck sacked at Hou13 for a loss of 5 yards by Whitney Mercilus.","(0:53) Indianapolis Colts timeout.","(1:39) Andrew Luck rush to the right for no gain to the Hou8. Tackled by John Simon and Whitney Mercilus.","(2:04) Andrew Luck pass to the right to Chester Rogers for 3 yards to the Hou8. Tackled by Johnathan Joseph and Brian Cushing.","(2:47) Andrew Luck pass to the left to Phillip Dorsett for 6 yards to the Hou11. Tackled by Kevin Johnson.","(3:19) Penalty: Face Mask on Houston (Whitney Mercilus) 15 yards.","(4:00) Frank Gore rush to the right for 1 yard to the Hou32. Tackled by Jadeveon Clowney.","(4:25) Frank Gore rush to the left for 6 yards to the Hou33. Tackled by Benardrick McKinney and Kevin Johnson.","(5:03) Andrew Luck pass to the left to Jack Doyle for 19 yards to the Hou39. Tackled by Brian Cushing.","(5:45) Andrew Luck pass to the right to Robert Turbin for 12 yards to the Ind42. Tackled by John Simon.","(6:24) Frank Gore rush to the right for 4 yards to the Ind30. Tackled by Kevin Johnson.","(6:59) Frank Gore rush to the right for 2 yards to the Ind26. Tackled by Jadeveon Clowney.","(7:06) Nick Novak kicks off to the Ind3. Jordan Todman return for 21 yards to Ind24. Tackled by Max Bullough.","(7:06) Nick Novak extra point is NO GOOD.","(7:09) Lamar Miller rush up the middle for 1 yard for a TOUCHDOWN.","(7:14) Penalty: Pass Interference on Indianapolis (Vontae Davis) 2 yards.","(7:56) Lamar Miller rush to the right for 4 yards to the Ind3. Tackled by Arthur Jones.","(8:33) Brock Osweiler pass to the right to Lamar Miller for 3 yards to the Ind7. Tackled by T.J. Green.","(9:00) Brock Osweiler pass to the left to DeAndre Hopkins for 9 yards to the Ind10. Tackled by Josh McNary and Robert Mathis.","(9:36) Brock Osweiler pass to the left to DeAndre Hopkins for 9 yards to the Ind19.","(10:15) Brock Osweiler pass to the left to Tyler Ervin for 4 yards to the Ind28. Tackled by Clayton Geathers.","(10:55) Lamar Miller rush up the middle for 1 yard to the Ind32. Tackled by Kendall Langford.","(11:29) Lamar Miller rush to the left for 12 yards to the Ind33. Tackled by Josh McNary.","(11:50) Alfred Blue rush up the middle for 14 yards to the Ind45. Tackled by Mike Adams.","(12:19) Lamar Miller rush to the left for 23 yards to the Hou41. Tackled by Clayton Geathers.","(12:33) Pat McAfee punts for 61 yards to Hou18. No return.","(13:11) Andrew Luck pass to the left to Robert Turbin for 2 yards to the Ind21. Tackled by A.J. Bouye.","(13:55) Andrew Luck pass to the left to Frank Gore for 2 yards to the Ind19. Tackled by Kevin Johnson.","(14:17) Penalty: Holding on Indianapolis (Denzelle Good) -10 yards.","(14:54) Andrew Luck pass to the right to Jack Doyle for 6 yards to the Ind27. Tackled by Brian Cushing and John Simon.","(15:00) Nick Novak kicks off to the Ind0. Quan Bray return for 21 yards to Ind21. Tackled by Max Bullough.","(0:14) Lamar Miller rush to the right for 1 yard to the Hou21. Tackled by D'Qwell Jackson.","(0:19) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(0:19) Houston Texans timeout.","(0:26) Brock Osweiler pass to the middle to Ryan Griffin for 12 yards to the Hou20. Tackled by D'Qwell Jackson and Darius Butler.","(0:32) Brock Osweiler incomplete pass to the left intended for Ryan Griffin.","(0:37) Andrew Luck pass intended for T.Y. Hilton INTERCEPTED by Robert Nelson Jr.. No return. Tackled by T.Y. Hilton.","(1:05) Andrew Luck pass to the left to Chester Rogers for 6 yards to the Hou32. Tackled by Kevin Johnson.","(1:29) Andrew Luck rush up the middle for 24 yards to the Hou38. Tackled by A.J. Bouye.","(1:51) Andrew Luck pass to the left to Phillip Dorsett for 6 yards to the Ind38. Tackled by Charles James.","(1:51) Penalty: Offside on Houston (Whitney Mercilus) 5 yards.","(1:57) Nick Novak kicks off to the Ind-2. Quan Bray return for 29 yards to Ind27. Tackled by Robert Nelson Jr..","(2:00) Nick Novak 27 yard field goal attempt is GOOD. Holder: Shane Lechler.","(2:00) Two Minute Warning.","(2:26) Brock Osweiler pass to the left to C.J. Fiedorowicz for 4 yards to the Ind9. Tackled by Darius Butler.","(3:08) Lamar Miller rush to the right for 2 yards to the Ind13. Tackled by David Parry.","(3:08) Indianapolis Colts timeout.","(3:15) Brock Osweiler incomplete pass to the right intended for Braxton Miller.","(4:00) Brock Osweiler pass to the left to DeAndre Hopkins for 7 yards to the Ind15. Tackled by Vontae Davis.","(4:08) Brock Osweiler incomplete pass to the left intended for Tyler Ervin.","(4:43) Lamar Miller rush up the middle for 5 yards to the Ind22. Tackled by Clayton Geathers.","(5:20) Brock Osweiler pass to the left to C.J. Fiedorowicz for 22 yards to the Ind27. Tackled by Vontae Davis and Mike Adams.","(5:52) Lamar Miller rush to the left for 19 yards to the Ind49. Tackled by T.J. Green.","(6:29) Lamar Miller rush to the right for 2 yards to the Hou32. Tackled by D'Qwell Jackson and David Parry.","(6:55) Brock Osweiler pass to the right to DeAndre Hopkins for 5 yards to the Hou30. Tackled by Rashaan Melvin.","(6:55) Pat McAfee kicks off to the endzone. Touchback.","(6:58) Adam Vinatieri 37 yard field goal attempt is GOOD. Holder: Pat McAfee.","(7:40) Andrew Luck rush up the middle for 5 yards to the Hou19. Tackled by Whitney Mercilus.","(7:47) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(8:30) Frank Gore rush to the right for no gain to the Hou24. Tackled by Corey Moore.","(9:11) Andrew Luck pass to the right to T.Y. Hilton for 11 yards to the Hou24. Tackled by Charles James.","(9:56) Andrew Luck pass to the left to Robert Turbin for a loss of 1 yard to the Hou35. Tackled by Kevin Johnson.","(10:03) Andrew Luck incomplete pass to the left intended for Phillip Dorsett.","(10:45) Frank Gore rush to the right for 22 yards to the Hou34. Tackled by Whitney Mercilus.","(11:27) Frank Gore rush to the right for 6 yards to the Ind44. Tackled by John Simon.","(12:07) Andrew Luck pass to the left to T.Y. Hilton for 31 yards to the Ind38. Tackled by Kevin Johnson.","(12:15) Shane Lechler punts for 40 yards to Ind7. No return.","(12:22) Brock Osweiler incomplete pass to the right intended for Lamar Miller.","(13:01) Lamar Miller rush to the right for 7 yards to the Ind47. Tackled by Mike Adams and Rashaan Melvin.","(13:06) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(13:22) Penalty: False Start on Houston (Oday Aboushi) -5 yards.","(14:01) Brock Osweiler pass to the right to Braxton Miller for 10 yards to the Ind49. Tackled by Rashaan Melvin.","(14:23) Lamar Miller rush up the middle for 2 yards to the Hou41. Tackled by Henry Anderson.","(14:55) Lamar Miller rush to the left for 14 yards to the Hou39. Tackled by D'Qwell Jackson and Mike Adams.","(14:55) Pat McAfee kicks off to the endzone. Touchback.","(14:55) Adam Vinatieri extra point is good.","(15:00) Andrew Luck pass to the right to Jack Doyle for 22 yards for a TOUCHDOWN.","(0:23) Penalty: Holding on Indianapolis (Ryan Kelly) -10 yards.","(1:03) Frank Gore rush to the right for 3 yards to the Hou12. Tackled by John Simon.","(1:37) Frank Gore rush up the middle for 4 yards to the Hou15. Tackled by Benardrick McKinney.","(2:16) Andrew Luck pass to the right to Jack Doyle for 6 yards to the Hou19. Tackled by Johnathan Joseph and Benardrick McKinney.","(2:59) Frank Gore rush to the right for 1 yard to the Hou25. Tackled by Johnathan Joseph.","(3:24) Andrew Luck pass to the right to Chester Rogers for 36 yards to the Hou26. Tackled by Corey Moore.","(3:47) Penalty: Illegal Plyr Downfld on Indianapolis (Jack Mewhort) -5 yards.","(4:28) Andrew Luck rush up the middle for 3 yards to the Ind43. Tackled by John Simon and D.J. Reader.","(4:36) Shane Lechler punts for 31 yards to Ind40. No return.","(4:42) Brock Osweiler incomplete pass to the left intended for Jaelen Strong.","(5:22) Brock Osweiler pass to the left to DeAndre Hopkins for 4 yards to the Hou29. Tackled by Vontae Davis.","(5:56) Lamar Miller rush to the right for no gain to the Hou25. Tackled by D'Qwell Jackson and Josh McNary.","(5:56) Pat McAfee kicks off to the endzone. Touchback.","(5:59) Adam Vinatieri 41 yard field goal attempt is GOOD. Holder: Pat McAfee.","(6:02) Penalty: Illegal Formation on Indianapolis (Hassan Ridgeway) -5 yards.","(6:06) Andrew Luck incomplete pass to the middle intended for Phillip Dorsett defensed by Kevin Johnson.","(6:44) Robert Turbin rush to the right for a loss of 1 yard to the Hou18. Tackled by Brian Cushing and John Simon.","(7:16) Andrew Luck pass to the right to Robert Turbin for 9 yards to the Hou17. Tackled by Benardrick McKinney.","(8:01) Frank Gore rush to the right for 5 yards to the Hou26. Tackled by Andre Hal.","(8:41) Frank Gore rush to the right for 9 yards to the Hou31. Tackled by Benardrick McKinney and A.J. Bouye.","(9:24) Andrew Luck rush to the right for 5 yards to the Hou40. Tackled by John Simon and Benardrick McKinney.","(10:03) Frank Gore rush to the right for 5 yards to the Hou45. Tackled by Benardrick McKinney.","(10:12) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(10:20) Shane Lechler punts for 38 yards to Hou50. No return.","(10:26) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(11:06) Lamar Miller rush to the left for 1 yard to the Hou12. Tackled by Kendall Langford.","(11:40) Lamar Miller rush to the left for 1 yard to the Hou11. Tackled by Akeem Ayers and Kendall Langford.","(11:48) Pat McAfee punts for 44 yards to Hou10. No return.","(11:53) Andrew Luck incomplete pass to the right intended for Dwayne Allen defensed by Eddie Pleasant.","(11:53) Penalty: False Start on Indianapolis (Denzelle Good) -5 yards.","(11:53) Indianapolis Colts timeout.","(12:38) Frank Gore rush up the middle for a loss of 4 yards to the Hou49. Tackled by Corey Moore and Jadeveon Clowney.","(13:14) Andrew Luck pass to the left to Dwayne Allen for 9 yards to the Hou45. Tackled by Brian Cushing.","(13:24) Shane Lechler punts for 41 yards to Ind39. Quan Bray return for 7 yards to Ind46. Tackled by Charles James.","(14:05) Brock Osweiler sacked at Hou20 for a loss of 13 yards by Robert Mathis. FUMBLE, recovered by Hou (Chris Clark).","(14:10) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(14:17) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by Vontae Davis.","(14:53) Lamar Miller rush to the right for 12 yards to the Hou33. Tackled by Mike Adams.","(15:00) Pat McAfee kicks off to the Hou4. Braxton Miller return for 17 yards to Hou21. Tackled by Edwin Jackson."]