["(0:47) Blake Bortles rush to the left for a loss of 1 yard to the Jax50. Tackled by Sam Acho.","(0:47) Chicago Bears timeout.","(0:52) Chris Ivory rush to the right for 1 yard to the Chi49. Tackled by Jerrell Freeman.","(0:52) Chicago Bears timeout.","(0:57) Chris Ivory rush to the right for 2 yards to the Jax50. Tackled by Jerrell Freeman.","(1:03) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery defensed by Jalen Ramsey.","(1:19) Chicago Bears timeout.","(1:19) Brian Hoyer pass to the right to Cameron Meredith for 6 yards to the Jax48. Tackled by Aaron Colvin.","(1:24) Penalty: Holding on Chicago (Jordan Howard) -10 yards.","(1:28) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery.","(1:56) Brian Hoyer pass to the middle to Cameron Meredith for 4 yards to the Jax44. Tackled by Paul Posluszny.","(2:00) Brian Hoyer pass to the right to Jordan Howard for 7 yards to the Jax48. Tackled by Johnathan Cyprien.","(2:00) Two Minute Warning.","(2:16) Brian Hoyer pass to the middle to Alshon Jeffery for 3 yards to the Chi45. Tackled by Telvin Smith.","(2:24) Brian Hoyer pass to the left to Cameron Meredith for 18 yards to the Chi42. Tackled by Telvin Smith.","(2:49) Brian Hoyer pass to the right to Jordan Howard for a loss of 1 yard to the Chi24. Tackled by Aaron Colvin.","(2:49) Jason Myers kicks off to the endzone. Touchback.","(2:49) Jason Myers extra point is good.","(2:58) Blake Bortles pass to the right to Arrelious Benn for 51 yards for a TOUCHDOWN.","(3:03) Blake Bortles incomplete pass to the right intended for Allen Robinson.","(3:11) Blake Bortles pass to the right to Marqise Lee for 14 yards to the Jax49. Tackled by Harold Jones-Quartey.","(3:18) Blake Bortles pass to the left to Julius Thomas for 13 yards to the Jax35.","(3:25) Patrick O'Donnell punts for 50 yards to Jax22. No return.","(3:29) Brian Hoyer incomplete pass to the right intended for Zach Miller.","(4:13) Brian Hoyer rush up the middle for no gain to the Chi33. FUMBLE, recovered by Chi (Brian Hoyer).","(4:59) Ka'Deem Carey rush to the right for 8 yards to the Chi33. Tackled by Prince Amukamara.","(4:59) Jason Myers kicks off to the endzone. Touchback.","(5:03) Jason Myers 30 yard field goal attempt is GOOD. Holder: Brad Nortman.","(5:06) Blake Bortles incomplete pass to the right intended for Allen Hurns.","(5:13) Blake Bortles incomplete pass to the left intended for Allen Hurns.","(5:40) Blake Bortles pass to the right to Marqise Lee for 4 yards to the Chi12. Tackled by Bryce Callahan.","(6:07) Blake Bortles pass to the right to Marqise Lee for 12 yards to the Chi16. Tackled by Bryce Callahan.","(6:23) T.J. Yeldon rush to the right for 13 yards to the Chi13. Tackled by Adrian Amos. Penalty: Unnecessary Roughness on Jacksonville (Kelvin Beachum) -15 yards.","(6:46) Blake Bortles pass to the left to T.J. Yeldon for 5 yards to the Chi26. Tackled by Cre'von LeBlanc.","(7:12) Blake Bortles pass to the right to Julius Thomas for 15 yards to the Chi31. Tackled by Bryce Callahan.","(7:34) Blake Bortles pass to the right to Chris Ivory for 1 yard to the Jax39. Tackled by Jerrell Freeman. Penalty: Face Mask on Chicago (Danny Trevathan) 15 yards.","(8:01) Blake Bortles pass to the middle to Chris Ivory for 2 yards to the Jax38. Tackled by Jerrell Freeman.","(8:28) Blake Bortles pass to the right to Allen Hurns for 11 yards to the Jax36. Tackled by Bryce Callahan.","(8:28) Connor Barth kicks off to the endzone. Touchback.","(8:33) Connor Barth 32 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(9:16) Brian Hoyer sacked at Jax14 for a loss of 5 yards by Yannick Ngakoue.","(9:24) Brian Hoyer incomplete pass to the right intended for Jordan Howard.","(10:10) Jordan Howard rush to the left for 3 yards to the Jax9. Tackled by Dante Fowler Jr..","(10:49) Brian Hoyer pass to the right to Zach Miller for 9 yards to the Jax12. Tackled by Sen'Derrick Marks.","(11:34) Joshua Bellamy rush to the right for 7 yards to the Jax21. Tackled by Paul Posluszny.","(11:44) Blake Bortles sacked at Jax21 for no gain by Willie Young. FUMBLE, recovered by Chi (Akiem Hicks). Tackled by Patrick Omameh.","(12:15) Blake Bortles pass to the left to Allen Hurns for 5 yards to the Jax21. Tackled by Adrian Amos.","(12:23) Patrick O'Donnell punts for 43 yards to Jax16. No return.","(13:01) Brian Hoyer pass to the middle to Cameron Meredith for 5 yards to the Chi41. Tackled by Paul Posluszny.","(13:40) Brian Hoyer pass to the left to Cameron Meredith for no gain to the Chi36. Tackled by Aaron Colvin.","(14:17) Ka'Deem Carey rush to the left for no gain to the Chi36. Tackled by Sen'Derrick Marks.","(14:50) Brian Hoyer pass to the right to Zach Miller for 11 yards to the Chi36. Tackled by Tashaun Gipson.","(14:50) Jason Myers kicks off to the endzone. Touchback.","(14:50) Jason Myers extra point is good.","(14:53) Chris Ivory rush to the right for 1 yard for a TOUCHDOWN.","(15:00) Penalty: Holding on Chicago (Jacoby Glenn) 2 yards.","(0:45) Blake Bortles pass to the left to Allen Hurns for 29 yards to the Chi3. Tackled by Nick Kwiatkoski.","(0:53) Penalty: Roughing Passer on Chicago (Willie Young) 15 yards.","(0:57) Blake Bortles incomplete pass to the right intended for Allen Hurns defensed by Christian Jones.","(1:25) Blake Bortles rush to the right for 3 yards to the Chi47. Tackled by Danny Trevathan.","(1:53) Blake Bortles pass to the left to Allen Hurns for 25 yards to the Jax50. Tackled by Harold Jones-Quartey.","(1:53) Connor Barth kicks off to the endzone. Touchback.","(1:57) Connor Barth 24 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(2:02) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery.","(2:43) Brian Hoyer pass to the right to Zach Miller for no gain to the Jax6. Tackled by Paul Posluszny.","(3:18) Jordan Howard rush to the left for a loss of 1 yard to the Jax6. Tackled by Abry Jones.","(3:57) Ka'Deem Carey rush to the left for 16 yards to the Jax5. Tackled by Tashaun Gipson.","(4:02) Brian Hoyer incomplete pass to the left intended for Cameron Meredith.","(4:45) Jordan Howard rush to the left for 3 yards to the Jax21. Tackled by Telvin Smith.","(5:24) Jordan Howard rush to the right for 9 yards to the Jax24. Tackled by Prince Amukamara.","(6:07) Brian Hoyer pass to the left to Cameron Meredith for 36 yards to the Jax33. Tackled by Telvin Smith.","(6:16) Penalty: Holding on Chicago (Cody Whitehair) -10 yards.","(6:56) Brian Hoyer pass to the left to Eddie Royal for 17 yards to the Chi41. Tackled by Aaron Colvin.","(7:36) Jordan Howard rush to the right for 4 yards to the Chi24. Tackled by Roy Miller III.","(7:50) Brad Nortman punts for 59 yards to Chi20. No return.","(7:55) Blake Bortles incomplete pass to the right intended for Allen Hurns defensed by Tracy Porter.","(8:38) Blake Bortles pass to the left to Marqise Lee for 6 yards to the Jax21. Tackled by Bryce Callahan.","(9:16) Chris Ivory rush to the right for no gain to the Jax15. Tackled by Christian Jones.","(9:24) Patrick O'Donnell punts for 49 yards to Jax15. No return.","(9:24) Penalty: Offside on Jacksonville (Denard Robinson) 5 yards.","(9:29) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery.","(10:04) Ka'Deem Carey rush to the left for 3 yards to the Chi31. Tackled by Myles Jack.","(10:10) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery.","(10:23) Brad Nortman punts for 53 yards to Chi19. Eddie Royal return for 9 yards to Chi28. Tackled by Arrelious Benn.","(10:27) Blake Bortles incomplete pass to the middle intended for Allen Hurns.","(11:14) Chris Ivory rush to the right for 5 yards to the Jax28. Tackled by Danny Trevathan.","(11:56) Chris Ivory rush to the right for 2 yards to the Jax23. Tackled by Willie Young.","(12:05) Patrick O'Donnell punts for 50 yards to Jax18. Marqise Lee return for 3 yards to Jax21. Tackled by Joshua Bellamy.","(12:09) Brian Hoyer incomplete pass to the left intended for Ka'Deem Carey.","(12:47) Ka'Deem Carey rush to the left for 3 yards to the Chi32. Tackled by Jared Odrick.","(13:24) Ka'Deem Carey rush to the left for 4 yards to the Chi29. Tackled by Jared Odrick.","(13:51) Brian Hoyer pass to the left to Cameron Meredith for 16 yards to the Chi25. Tackled by Prince Amukamara.","(14:02) Brad Nortman punts for 58 yards to Chi19. Eddie Royal - no return. Tackled by Myles Jack. Penalty: Illegal Block on Chicago (Jacoby Glenn) -10 yards.","(14:06) Blake Bortles incomplete pass to the left intended for Julius Thomas.","(14:49) T.J. Yeldon rush to the right for 1 yard to the Jax23. Tackled by Mitch Unrein.","(14:54) Blake Bortles incomplete pass to the middle intended for Allen Robinson.","(15:00) Connor Barth kicks off to the Jax-4. Marqise Lee return for 26 yards to Jax22. Tackled by Joshua Bellamy.","(0:11) Blake Bortles rush up the middle for a loss of 1 yard to the Jax8.","(0:18) Patrick O'Donnell punts for 37 yards to Jax9. No return.","(0:22) Brian Hoyer incomplete pass to the right intended for Cameron Meredith.","(0:25) Brian Hoyer incomplete pass to the right intended for Eddie Royal.","(0:31) Brian Hoyer incomplete pass to the left intended for Cameron Meredith.","(0:36) Brian Hoyer pass to the right to Alshon Jeffery for 11 yards to the Jax46.","(0:40) Brian Hoyer incomplete pass to the left intended for Cameron Meredith defensed by Prince Amukamara.","(1:02) Brian Hoyer pass to the right to Alshon Jeffery for 17 yards to the Chi43. Tackled by Jalen Ramsey.","(1:43) Jordan Howard rush to the left for 4 yards to the Chi26. Tackled by Malik Jackson.","(1:47) Brian Hoyer incomplete pass to the right intended for Eddie Royal.","(1:55) Brad Nortman punts for 45 yards to Chi22. No return.","(1:55) Jacksonville Jaguars timeout.","(2:00) Blake Bortles incomplete pass to the middle intended for Allen Hurns defensed by Harold Jones-Quartey defensed by Danny Trevathan.","(2:00) Two Minute Warning.","(2:40) Blake Bortles sacked at Jax33 for a loss of 8 yards by Willie Young.","(3:13) T.J. Yeldon rush to the right for 2 yards to the Jax41. Tackled by Akiem Hicks.","(3:48) Blake Bortles pass to the right to Marqise Lee for 11 yards to the Jax39. Tackled by Bryce Callahan.","(3:52) Blake Bortles incomplete pass to the left intended for T.J. Yeldon.","(4:29) T.J. Yeldon rush to the left for 3 yards to the Jax28. Tackled by Adrian Amos.","(4:29) Connor Barth kicks off to the endzone. Touchback.","(4:29) Connor Barth extra point is good.","(4:32) Jordan Howard rush to the right for 1 yard for a TOUCHDOWN.","(5:11) Brian Hoyer pass to the right to Cameron Meredith for 16 yards to the Jax1. Tackled by Johnathan Cyprien and Paul Posluszny.","(5:14) Brian Hoyer incomplete pass to the right intended for Jordan Howard.","(5:55) Ka'Deem Carey rush to the right for 3 yards to the Jax17. Tackled by Tyson Alualu.","(6:31) Brian Hoyer pass to the left to Cameron Meredith for 5 yards to the Jax20. Tackled by Prince Amukamara.","(7:11) Ka'Deem Carey rush to the left for 7 yards to the Jax25. Tackled by Telvin Smith.","(7:17) Brian Hoyer incomplete pass to the left intended for Zach Miller.","(7:57) Brian Hoyer pass to the right to Alshon Jeffery for 26 yards to the Jax32. Tackled by Johnathan Cyprien.","(8:37) Jordan Howard rush to the right for 2 yards to the Chi42. Tackled by Malik Jackson.","(8:41) Brian Hoyer incomplete pass to the middle intended for Zach Miller.","(9:20) Brian Hoyer pass to the right to Zach Miller for 10 yards to the Chi40. Tackled by Tashaun Gipson.","(9:25) Brian Hoyer incomplete pass to the left intended for Zach Miller defensed by Johnathan Cyprien.","(10:03) Ka'Deem Carey rush to the left for 6 yards to the Chi30. Tackled by Paul Posluszny.","(10:52) Paul Lasike rush to the left for 1 yard to the Chi24. Tackled by Roy Miller III.","(10:52) Jacksonville Jaguars timeout.","(11:25) Brian Hoyer pass to the right to Alshon Jeffery for 6 yards to the Chi23. Tackled by Johnathan Cyprien.","(12:00) Jordan Howard rush to the right for 3 yards to the Chi17. Tackled by Jared Odrick and Johnathan Cyprien.","(12:11) Brad Nortman punts for 60 yards to Chi9. Eddie Royal return for 5 yards to Chi14. Tackled by Hayes Pullard III.","(12:16) Blake Bortles incomplete pass to the left intended for Julius Thomas defensed by Adrian Amos.","(13:03) Blake Bortles pass to the left to Allen Robinson for 15 yards to the Jax31. Tackled by Danny Trevathan.","(13:46) Chris Ivory rush to the left for 1 yard to the Jax16. Tackled by Sam Acho.","(14:12) Penalty: Holding on Jacksonville (Jermey Parnell) -10 yards.","(14:12) Connor Barth kicks off to the endzone. Touchback.","(14:17) Connor Barth 36 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(15:00) Brian Hoyer pass to the middle to Eddie Royal for 14 yards to the Jax18. Tackled by Paul Posluszny.","(15:00) Penalty: False Start on Chicago (Cameron Meredith) -5 yards.","(0:03) Jordan Howard rush to the right for a loss of 2 yards to the Jax27. Tackled by Malik Jackson.","(0:09) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery.","(0:43) Brian Hoyer pass to the left to Alshon Jeffery for 19 yards to the Jax25. Tackled by Jalen Ramsey.","(1:21) Brian Hoyer pass to the right to Cameron Meredith for a loss of 1 yard to the Jax44. Tackled by Paul Posluszny.","(1:53) Brian Hoyer pass to the left to Zach Miller for 6 yards to the Jax43. Tackled by Abry Jones.","(2:22) Penalty: False Start on Chicago (Logan Paulsen) -5 yards.","(2:58) Brian Hoyer pass to the left to Eddie Royal for 16 yards to the Jax44. Tackled by Aaron Colvin.","(3:34) Jordan Howard rush to the right for 3 yards to the Chi40. Tackled by Roy Miller III.","(4:09) Jordan Howard rush to the left for 5 yards to the Chi37. Tackled by Paul Posluszny.","(4:42) Brian Hoyer pass to the left to Cameron Meredith for 8 yards to the Chi32. Tackled by Johnathan Cyprien.","(4:54) Blake Bortles pass intended for Allen Robinson INTERCEPTED by Tracy Porter and returned for 25 yards. Tackled by A.J. Cann.","(4:54) Penalty: False Start on Jacksonville (Kelvin Beachum) -5 yards.","(4:57) Blake Bortles incomplete pass to the left intended for Marcedes Lewis.","(5:46) Chris Ivory rush to the right for 4 yards to the Chi1. Tackled by Will Sutton.","(5:51) Penalty: Pass Interference on Chicago (Jacoby Glenn) 13 yards.","(6:36) Chris Ivory rush to the left for 1 yard to the Chi18. Tackled by Jonathan Bullard.","(7:14) Blake Bortles pass to the right to Allen Hurns for 4 yards to the Chi19. Tackled by Jacoby Glenn.","(7:19) Penalty: Pass Interference on Chicago (Jerrell Freeman) 2 yards.","(8:04) Chris Ivory rush to the right for 6 yards to the Chi25. Tackled by Sam Acho.","(8:40) Chris Ivory rush to the right for 9 yards to the Chi31. Tackled by Harold Jones-Quartey.","(9:19) Blake Bortles pass to the left to Marqise Lee for 14 yards to the Chi40. Tackled by Danny Trevathan and Harold Jones-Quartey.","(9:48) Blake Bortles pass to the right to Allen Robinson for 16 yards to the Jax46.","(10:29) T.J. Yeldon rush to the left for 1 yard to the Jax30. Tackled by Christian Jones.","(11:04) T.J. Yeldon rush to the right for 1 yard to the Jax29. Tackled by Akiem Hicks.","(11:36) Blake Bortles pass to the right to Allen Robinson for 18 yards to the Jax28.","(11:46) Patrick O'Donnell punts for 32 yards to Jax10. No return.","(12:23) Brian Hoyer pass to the left to Eddie Royal for 7 yards to the Jax42. Tackled by Paul Posluszny.","(13:02) Jordan Howard rush to the right for 1 yard to the Jax49. Tackled by Tyson Alualu.","(13:32) Brian Hoyer pass to the right to Zach Miller for no gain to the Chi50. Tackled by Telvin Smith.","(13:57) Jordan Howard rush to the left for a loss of 1 yard to the Chi35. Tackled by Paul Posluszny. Penalty: Unnecessary Roughness on Jacksonville (Jared Odrick) 15 yards.","(14:32) Jordan Howard rush to the right for no gain to the Chi36. Tackled by Roy Miller III.","(15:00) Brian Hoyer pass to the right to Alshon Jeffery for 11 yards to the Chi36. Tackled by Telvin Smith.","(15:00) Jason Myers kicks off to the endzone. Touchback."]