["(0:40) Trevor Siemian rush up the middle for a loss of 1 yard to the NO48.","(1:21) Trevor Siemian rush up the middle for a loss of 1 yard to the NO47.","(1:22) Wil Lutz onside kickoff to the NO46. Onside kick recovered by receiving team by Demaryius Thomas.","(1:22) Wil Lutz extra point is BLOCKED. Return of blocked extra point by Will Parks for 2 pts.","(1:30) Drew Brees pass to the right to Brandin Cooks for 32 yards for a TOUCHDOWN.","(2:00) Drew Brees pass to the middle to Mark Ingram for 6 yards to the Den32. Tackled by Chris Harris Jr..","(2:00) Two Minute Warning.","(2:10) Mark Ingram rush to the left for 3 yards to the Den38. Tackled by Corey Nelson.","(2:39) Mark Ingram rush to the right for 5 yards to the Den41. Tackled by Corey Nelson and Will Parks.","(2:45) Drew Brees pass to the right to Brandin Cooks for 29 yards to the Den46. Tackled by Bradley Roby.","(2:50) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(2:50) Brandon McManus kicks off to the endzone. Touchback.","(2:55) Brandon McManus 37 yard field goal attempt is GOOD. Holder: Riley Dixon.","(3:00) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(3:00) New Orleans Saints timeout.","(3:04) Devontae Booker rush to the right for 2 yards to the NO18. Tackled by Vonn Bell.","(3:04) New Orleans Saints timeout.","(3:08) Devontae Booker rush to the right for no gain to the NO20. Tackled by Paul Kruger.","(3:15) Drew Brees pass to the right to Michael Thomas for 5 yards to the NO18. Tackled by Jared Crick. FUMBLE, recovered by Den (T.J. Ward). Tackled by Coby Fleener.","(3:20) Drew Brees incomplete pass to the right intended for Michael Thomas.","(3:23) Brandon McManus kicks off to the NO-1. Tim Hightower return for 14 yards to NO13. Tackled by Zaire Anderson.","(3:27) Brandon McManus 28 yard field goal attempt is GOOD. Holder: Riley Dixon.","(4:04) Trevor Siemian pass to the right to Devontae Booker for 2 yards to the NO10. Tackled by Ken Crawley.","(4:45) Devontae Booker rush to the right for a loss of 4 yards to the NO12. Tackled by Cameron Jordan.","(4:45) Penalty: Too Many Men on Field on New Orleans 5 yards.","(4:45) New Orleans Saints timeout.","(4:53) Kapri Bibbs rush to the left for 3 yards to the NO13. Tackled by Craig Robertson.","(5:23) Trevor Siemian pass to the right to Devontae Booker for 10 yards to the NO16. Tackled by Sterling Moore.","(6:01) Devontae Booker rush to the right for 2 yards to the NO26. Tackled by Kenny Vaccaro.","(6:39) Trevor Siemian pass to the left to Jordan Norwood for 9 yards to the NO28. Tackled by Sterling Moore.","(6:42) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders defensed by Sterling Moore.","(7:16) Kapri Bibbs rush to the right for 2 yards to the NO37. Tackled by Tyeler Davison.","(7:41) Trevor Siemian sacked at Den46 for a loss of 1 yard by Kenny Vaccaro. Penalty: Unnecessary Roughness on New Orleans (Kenny Vaccaro) 15 yards.","(7:54) Thomas Morstead punts for 50 yards to Den30. Jordan Norwood return for 17 yards to Den47. Tackled by Sam Barrington.","(8:31) Drew Brees sacked at NO20 for a loss of 10 yards by Shaquil Barrett.","(9:05) Tim Hightower rush to the left for 3 yards to the NO30. Tackled by Jared Crick.","(9:37) Tim Hightower rush to the left for 2 yards to the NO27. Tackled by Sylvester Williams.","(9:37) Brandon McManus kicks off to the endzone. Touchback.","(9:37) Brandon McManus extra point is good.","(9:41) Trevor Siemian pass to the left to Demaryius Thomas for 2 yards for a TOUCHDOWN.","(9:41) Denver Broncos timeout.","(10:13) Trevor Siemian pass to the left to Jordan Norwood for 1 yard to the NO2. Tackled by Delvin Breaux.","(10:47) Devontae Booker rush to the right for a loss of 1 yard to the NO3. Tackled by Cameron Jordan.","(11:28) Trevor Siemian pass to the left to Jordan Norwood for 8 yards to the NO2. Tackled by Delvin Breaux.","(12:06) Devontae Booker rush to the right for 2 yards to the NO10. Tackled by Nick Fairley.","(12:44) Trevor Siemian pass to the left to Emmanuel Sanders for 14 yards to the NO12. Tackled by Jairus Byrd.","(13:29) Trevor Siemian rush to the left for 1 yard to the NO26.","(13:42) Drew Brees pass to the middle to Michael Thomas for 12 yards to the Den48. Tackled by Bradley Roby. FUMBLE, recovered by Den (Darian Stewart) and returned for 28 yards. Tackled by Drew Brees.","(14:18) Mark Ingram rush to the left for 8 yards to the NO40. Tackled by Todd Davis.","(14:23) 42 yard field goal attempt by Brandon McManus is NO GOOD. Holder: Riley Dixon.","(14:57) Trevor Siemian sacked at NO24 for a loss of 6 yards by Craig Robertson.","(15:00) Trevor Siemian incomplete pass to the left intended for Virgil Green.","(0:06) Devontae Booker rush to the right for 1 yard to the NO18. Tackled by Dannell Ellerbe and Craig Robertson.","(0:42) Trevor Siemian pass to the left to Demaryius Thomas for 18 yards to the NO19. Tackled by Kenny Vaccaro.","(1:24) Trevor Siemian sacked at NO37 for a loss of 2 yards by Sheldon Rankins.","(2:03) Kapri Bibbs rush to the left for 4 yards to the NO35. Tackled by Delvin Breaux and Nate Stupar.","(2:39) Trevor Siemian pass to the middle to Andy Janovich for 9 yards to the NO39. Tackled by Paul Kruger.","(3:24) Devontae Booker rush to the right for 9 yards to the NO48. Tackled by Vonn Bell.","(3:59) Trevor Siemian pass to the left to Demaryius Thomas for 18 yards to the Den43. Tackled by Delvin Breaux.","(3:59) Wil Lutz kicks off to the endzone. Touchback.","(3:59) Wil Lutz extra point is good.","(4:05) Drew Brees pass to the right to Willie Snead for 5 yards for a TOUCHDOWN.","(4:43) Drew Brees pass to the right to Mark Ingram for 7 yards to the Den5. Tackled by Von Miller.","(5:17) Tim Hightower rush to the right for 3 yards to the Den12. Tackled by Adam Gotsis and Todd Davis.","(5:35) Drew Brees pass to the right to Tim Hightower for 23 yards to the Den15. Tackled by Von Miller.","(5:46) Trevor Siemian pass intended for Demaryius Thomas INTERCEPTED by Kenny Vaccaro and returned for 30 yards. Tackled by Russell Okung.","(5:50) Trevor Siemian incomplete pass to the middle intended for Virgil Green defensed by Vonn Bell.","(6:28) Kapri Bibbs rush to the left for 1 yard to the NO44. Tackled by Vonn Bell.","(7:00) Trevor Siemian pass to the left to A.J. Derby for 12 yards to the NO45. Tackled by Kenny Vaccaro.","(7:00) Denver Broncos timeout.","(7:04) Trevor Siemian incomplete pass to the right intended for Virgil Green defensed by Dannell Ellerbe.","(7:39) Devontae Booker rush to the right for 5 yards to the Den43. Tackled by Dannell Ellerbe and Nick Fairley.","(8:19) Trevor Siemian pass to the middle to Emmanuel Sanders for 13 yards to the Den38. Tackled by Jairus Byrd.","(8:23) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas.","(8:30) Trevor Siemian incomplete pass to the right.","(8:30) Wil Lutz kicks off to the endzone. Touchback.","(8:30) Wil Lutz extra point is good.","(8:35) Drew Brees pass to the left to Willie Snead for 3 yards for a TOUCHDOWN.","(9:22) Drew Brees pass to the left to Brandin Cooks for 37 yards to the Den3. Tackled by T.J. Ward.","(9:48) Drew Brees pass to the left to Travaris Cadet for 20 yards to the Den40. Tackled by Todd Davis.","(10:36) Mark Ingram rush to the left for 10 yards to the NO40. Tackled by T.J. Ward and Darian Stewart.","(11:10) Drew Brees pass to the left to Willie Snead for 14 yards to the NO30. Tackled by Kayvon Webster.","(11:47) Drew Brees rush to the right for 5 yards to the NO16. Tackled by Justin Simmons.","(12:20) Drew Brees pass to the right to Willie Snead for 1 yard to the NO11. Tackled by T.J. Ward.","(12:27) Riley Dixon punts for 41 yards to NO10. No return.","(13:10) Devontae Booker rush to the right for no gain to the Den49. Tackled by Craig Robertson.","(13:52) Devontae Booker rush to the left for no gain to the Den49. Tackled by Cameron Jordan.","(14:31) Devontae Booker rush to the left for 9 yards to the Den49. Tackled by Craig Robertson.","(15:00) Trevor Siemian pass to the right to Virgil Green for 15 yards to the Den40. Tackled by Craig Robertson.","(15:00) Wil Lutz kicks off to the endzone. Touchback.","(0:02) Wil Lutz 30 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(0:02) New Orleans Saints timeout.","(0:13) Drew Brees rush to the left for 4 yards to the Den12. Tackled by Lorenzo Doss.","(0:13) New Orleans Saints timeout.","(0:13) Drew Brees pass to the left to Travaris Cadet for 6 yards to the Den16. Tackled by Darian Stewart.","(0:19) Denver Broncos timeout.","(0:23) Drew Brees pass to the left to Michael Thomas for 16 yards to the Den22.","(0:29) Drew Brees pass to the left to Willie Snead for 24 yards to the Den38. Tackled by Darian Stewart.","(0:36) Trevor Siemian pass intended for Emmanuel Sanders INTERCEPTED by Sterling Moore and returned for 8 yards. Tackled by Max Garcia.","(1:07) Trevor Siemian pass to the right to Virgil Green for 9 yards to the NO31. Tackled by Dannell Ellerbe and Kenny Vaccaro.","(1:12) Trevor Siemian pass to the right to Demaryius Thomas for 1 yard to the NO40. Tackled by Kenny Vaccaro.","(1:18) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(1:18) New Orleans Saints timeout.","(1:30) Trevor Siemian pass to the right to Emmanuel Sanders for 9 yards to the NO41. Tackled by Sterling Moore.","(2:00) Kapri Bibbs rush to the left for 9 yards to the Den50. Tackled by Craig Robertson and Kenny Vaccaro.","(2:00) Two Minute Warning.","(2:11) Trevor Siemian rush to the left for 2 yards to the Den41. Tackled by Paul Kruger.","(2:52) Devontae Booker rush to the left for 7 yards to the Den39. Tackled by Dannell Ellerbe.","(3:27) Devontae Booker rush to the right for 2 yards to the Den32. Tackled by Cameron Jordan.","(3:36) Thomas Morstead punts for 38 yards to Den40. Jordan Norwood - no return. Tackled by Jake Lampman. Penalty: Illegal Block on Denver (Cody Latimer) -10 yards.","(4:09) Mark Ingram rush to the right for a loss of 1 yard to the NO22. Tackled by Von Miller.","(4:45) Drew Brees pass to the left to Michael Thomas for 7 yards to the NO23. Tackled by Chris Harris Jr..","(5:18) Tim Hightower rush to the left for 2 yards to the NO16. Tackled by Brandon Marshall.","(5:26) Riley Dixon punts for 38 yards to NO12. Jairus Byrd return for 2 yards to NO14. Tackled by Bennie Fowler.","(6:03) Trevor Siemian sacked at Den50 for a loss of 6 yards by Dannell Ellerbe.","(6:08) Trevor Siemian incomplete pass to the middle intended for Kapri Bibbs.","(6:47) Kapri Bibbs rush to the right for 1 yard to the NO44. Tackled by Cameron Jordan.","(7:27) Trevor Siemian pass to the left to Demaryius Thomas for 10 yards to the NO45. Tackled by Delvin Breaux.","(8:11) Trevor Siemian rush to the left for 1 yard to the Den45. Tackled by Nick Fairley.","(8:53) Trevor Siemian pass to the left to Emmanuel Sanders for 12 yards to the Den44. Tackled by Sterling Moore.","(9:25) Devontae Booker rush to the right for 3 yards to the Den32. Tackled by Dannell Ellerbe and Tyeler Davison.","(10:01) Trevor Siemian pass to the right to Demaryius Thomas for 17 yards to the Den29. Tackled by Jairus Byrd.","(10:37) Devontae Booker rush to the right for 1 yard to the Den12. Tackled by Darryl Tapp.","(10:42) Trevor Siemian incomplete pass to the left intended for Virgil Green.","(10:49) Thomas Morstead punts for 41 yards to Den10. No return.","(10:55) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(10:59) Drew Brees incomplete pass to the middle intended for Josh Hill.","(11:35) Tim Hightower rush to the left for 3 yards to the NO49. Tackled by Todd Davis.","(11:59) Drew Brees pass to the left to Tim Hightower for 11 yards to the NO46. Tackled by T.J. Ward.","(12:37) Mark Ingram rush to the left for 3 yards to the NO35. Tackled by Will Parks and Corey Nelson.","(13:12) Mark Ingram rush to the left for 4 yards to the NO32. Tackled by Sylvester Williams.","(13:42) Mark Ingram rush to the left for 3 yards to the NO28. Tackled by T.J. Ward and Jared Crick.","(13:42) Brandon McManus kicks off to the endzone. Touchback.","(13:48) Brandon McManus 50 yard field goal attempt is GOOD. Holder: Riley Dixon.","(14:12) Trevor Siemian pass to the left to Emmanuel Sanders for 6 yards to the NO32. Tackled by Kenny Vaccaro.","(14:47) Devontae Booker rush to the left for 1 yard to the NO38. Tackled by Sheldon Rankins.","(14:53) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(15:00) Drew Brees pass intended for Michael Thomas INTERCEPTED by Darian Stewart defensed by Bradley Roby and returned for 11 yards. Tackled by Mark Ingram.","(0:07) Riley Dixon punts for 45 yards to NO37. Brandin Cooks return for 2 yards to NO39. Tackled by Justin Simmons.","(0:46) Trevor Siemian sacked at Den18 for a loss of 4 yards by Cameron Jordan.","(0:54) Trevor Siemian incomplete pass to the right.","(1:27) Devontae Booker rush to the right for 1 yard to the Den22. Tackled by Cameron Jordan.","(1:58) Devontae Booker rush to the right for 5 yards to the Den21. Tackled by Kenny Vaccaro.","(2:28) Devontae Booker rush to the right for 9 yards to the Den16. Tackled by Cameron Jordan.","(2:34) Drew Brees pass intended for Travaris Cadet INTERCEPTED by Darian Stewart. No return.","(3:03) Mark Ingram rush to the right for 6 yards to the Den24. Tackled by Brandon Marshall.","(3:33) Tim Hightower rush to the right for 3 yards to the Den30. Tackled by Brandon Marshall.","(4:04) Drew Brees pass to the left to Coby Fleener for 18 yards to the Den33. Tackled by Von Miller.","(4:41) Drew Brees pass to the left to Brandon Coleman for 19 yards to the NO49. Tackled by Justin Simmons and T.J. Ward.","(5:13) Tim Hightower rush to the left for 2 yards to the NO30. Tackled by Jared Crick and Billy Winn.","(5:45) Tim Hightower rush to the left for 3 yards to the NO28. Tackled by Todd Davis.","(5:45) Brandon McManus kicks off to the endzone. Touchback.","(5:45) Brandon McManus extra point is good.","(5:51) Trevor Siemian pass to the right to Jordan Taylor for 14 yards for a TOUCHDOWN.","(6:37) Devontae Booker rush to the right for 11 yards to the NO14. Tackled by Sterling Moore.","(7:20) Trevor Siemian sacked at NO25 for a loss of 5 yards by Nick Fairley.","(8:00) Trevor Siemian rush to the left for 3 yards to the NO20. Tackled by Tyeler Davison.","(8:43) Trevor Siemian pass to the right to Demaryius Thomas for 7 yards to the NO23. Tackled by Delvin Breaux.","(8:43) Denver Broncos timeout.","(9:29) Devontae Booker rush to the right for 2 yards to the NO30. Tackled by Paul Kruger.","(10:02) Trevor Siemian pass to the right to Jordan Taylor for 18 yards to the NO32. Tackled by Vonn Bell.","(10:39) Kapri Bibbs rush to the right for 2 yards to the Den50. Tackled by Cameron Jordan and Craig Robertson.","(11:14) Trevor Siemian pass to the right to A.J. Derby for 10 yards to the Den48. Tackled by Vonn Bell.","(11:51) Devontae Booker rush to the left for 3 yards to the Den38. Tackled by Tyeler Davison.","(11:58) Trevor Siemian incomplete pass to the right intended for A.J. Derby defensed by Kenny Vaccaro.","(12:25) Trevor Siemian pass to the left to Demaryius Thomas for 14 yards to the Den35. Tackled by Vonn Bell.","(13:00) Devontae Booker rush to the left for 6 yards to the Den21. Tackled by Craig Robertson and Dannell Ellerbe.","(13:06) Thomas Morstead punts for 34 yards to Den15. No return.","(13:11) Drew Brees incomplete pass to the left intended for Willie Snead defensed by Chris Harris Jr..","(13:11) Penalty: False Start on New Orleans (Andrus Peat) -5 yards.","(13:16) Drew Brees incomplete pass to the right intended for Willie Snead defensed by Bradley Roby.","(13:55) Mark Ingram rush to the right for 4 yards to the Den44. Tackled by Todd Davis.","(14:25) Mark Ingram rush to the right for 5 yards to the Den48. Tackled by Billy Winn and Sylvester Williams.","(14:54) Drew Brees pass to the middle to Coby Fleener for 8 yards to the NO47. Tackled by Sylvester Williams.","(15:00) Brandon McManus kicks off to the NO8. Tim Hightower return for 31 yards to NO39. Tackled by Brandon McManus."]