["(0:27) Lamar Miller rush to the right for 2 yards to the Hou26. Tackled by Tyson Alualu.","(1:10) Lamar Miller rush up the middle for 1 yard to the Hou24. Tackled by Dan Skuta.","(1:10) Jacksonville Jaguars timeout.","(1:17) Lamar Miller rush to the right for no gain to the Hou23. Tackled by Malik Jackson.","(2:00) Brock Osweiler pass to the left to DeAndre Hopkins for 10 yards to the Hou23. Tackled by Jalen Ramsey.","(2:00) Two Minute Warning.","(2:08) Lamar Miller rush up the middle for 2 yards to the Hou13. Tackled by Dan Skuta.","(2:08) Jacksonville Jaguars timeout.","(2:12) Lamar Miller rush up the middle for 3 yards to the Hou11. Tackled by Tyson Alualu.","(2:17) Jason Myers kicks off to the Hou2. Tyler Ervin return for 6 yards to Hou8. Tackled by Myles Jack.","(2:17) Blake Bortles 2 pt conversion pass to Allen Robinson is GOOD.","(2:25) Blake Bortles pass to the left to Allen Robinson for 14 yards for a TOUCHDOWN.","(2:29) Blake Bortles incomplete pass to the right intended for Julius Thomas.","(2:32) Blake Bortles pass to the left to Ben Koyack for 14 yards to the Hou14.","(2:42) Penalty: Pass Interference on Houston (Kareem Jackson) 41 yards.","(2:46) Blake Bortles incomplete pass to the right intended for Allen Hurns defensed by Charles James.","(3:12) Blake Bortles pass to the right to Allen Hurns for 11 yards to the Jax31. Tackled by Johnathan Joseph. FUMBLE, recovered by Jax (Allen Hurns).","(3:16) Blake Bortles incomplete pass to the right intended for Allen Hurns defensed by John Simon.","(3:39) Blake Bortles pass to the right to Julius Thomas for 12 yards to the Jax20. Tackled by John Simon.","(3:42) Blake Bortles incomplete pass to the right intended for Allen Robinson.","(3:50) Shane Lechler punts for 40 yards to Jax8. No return.","(4:36) Brock Osweiler pass to the left to Akeem Hunt for 1 yard to the Jax48. Tackled by Johnathan Cyprien.","(4:40) Brock Osweiler pass to the right to DeAndre Hopkins for 7 yards to the Jax49. Tackled by Jalen Ramsey.","(5:21) Lamar Miller rush up the middle for 1 yard to the Hou44. Tackled by Telvin Smith.","(6:05) Lamar Miller rush to the left for 16 yards to the Hou43. Tackled by Jalen Ramsey.","(6:12) Brad Nortman punts for 27 yards to Hou27. No return.","(6:53) Blake Bortles sacked at Jax46 for a loss of 10 yards by John Simon.","(7:00) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(7:32) T.J. Yeldon rush up the middle for no gain to the Hou44. Tackled by Jadeveon Clowney.","(7:57) Blake Bortles pass to the left to Allen Robinson for 16 yards to the Hou44. Tackled by Kareem Jackson.","(8:04) Blake Bortles incomplete pass to the right intended for Marqise Lee defensed by Andre Hal.","(8:32) Blake Bortles pass to the right to Marqise Lee for 15 yards to the Jax40. Tackled by Johnathan Joseph.","(8:32) Nick Novak kicks off to the endzone. Touchback.","(8:38) Nick Novak 51 yard field goal attempt is GOOD. Holder: Shane Lechler.","(9:22) Akeem Hunt rush up the middle for 4 yards to the Jax33. Tackled by Tashaun Gipson.","(10:08) Brock Osweiler sacked at Jax37 for a loss of 7 yards by Aaron Colvin.","(10:50) Akeem Hunt rush to the right for 2 yards to the Jax30. Tackled by Paul Posluszny.","(11:34) Alfred Blue rush to the left for 12 yards to the Jax32. Tackled by Jared Odrick.","(12:16) Akeem Hunt rush to the left for 11 yards to the Jax44. Tackled by Telvin Smith.","(12:46) Alfred Blue rush to the right for 5 yards to the Hou45. Tackled by Dan Skuta.","(13:28) Alfred Blue rush to the left for 4 yards to the Hou40. Tackled by Paul Posluszny.","(14:11) Akeem Hunt rush to the left for 17 yards to the Hou36. Tackled by Johnathan Cyprien.","(14:16) Brock Osweiler incomplete pass to the middle intended for C.J. Fiedorowicz defensed by Telvin Smith.","(14:21) Penalty: Pass Interference on Houston (DeAndre Hopkins) -10 yards.","(14:56) Akeem Hunt rush up the middle for 4 yards to the Hou29. Tackled by Tyson Alualu.","(14:56) Jason Myers kicks off to the endzone. Touchback.","(15:00) Jason Myers 44 yard field goal attempt is GOOD. Holder: Brad Nortman.","(0:43) Blake Bortles pass to the right to Julius Thomas for 4 yards to the Hou26. Tackled by Eddie Pleasant.","(1:15) T.J. Yeldon rush up the middle for 5 yards to the Hou30. Tackled by Whitney Mercilus.","(1:21) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(1:21) Jacksonville Jaguars timeout.","(1:58) Blake Bortles pass to the right to Allen Robinson for 19 yards to the Hou35. Tackled by Johnathan Joseph.","(2:39) Chris Ivory rush to the right for no gain to the Jax46. Tackled by Christian Covington.","(3:07) Chris Ivory rush to the right for 3 yards to the Jax46. Tackled by Andre Hal.","(3:13) Penalty: Pass Interference on Houston (Kareem Jackson) 28 yards.","(3:34) Penalty: Holding on Jacksonville (Patrick Omameh) -10 yards.","(4:02) Chris Ivory rush up the middle for 4 yards to the Jax25. Tackled by Brian Cushing.","(4:07) Nick Novak kicks off to the Jax5. Arrelious Benn return for 16 yards to Jax21. Tackled by Robert Nelson Jr..","(4:07) Nick Novak extra point is good.","(4:12) Brock Osweiler pass to the right to Stephen Anderson for 7 yards for a TOUCHDOWN.","(4:29) Brad Nortman punts for 48 yards to Hou36. Tyler Ervin return for 57 yards to Jax7. Tackled by Peyton Thompson.","(5:10) Blake Bortles pass to the left to Marcedes Lewis for a loss of 4 yards to the Jax16. Tackled by Eddie Pleasant.","(5:14) Blake Bortles incomplete pass to the middle intended for Chris Ivory.","(6:01) Blake Bortles sacked at Jax20 for a loss of 8 yards by D.J. Reader.","(6:14) Shane Lechler punts for 51 yards to Jax16. Rashad Greene Sr. return for 12 yards to Jax28. Tackled by Stephen Anderson.","(6:50) Akeem Hunt rush up the middle for 3 yards to the Hou33. Tackled by Telvin Smith.","(7:31) Brock Osweiler pass to the left to C.J. Fiedorowicz for 5 yards to the Hou30. Tackled by Telvin Smith and Johnathan Cyprien.","(8:02) Akeem Hunt rush to the right for 2 yards to the Hou35. Tackled by Tashaun Gipson. Penalty: Holding on Houston (Chris Clark) -10 yards.","(8:10) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(8:38) Brock Osweiler rush to the right for 4 yards to the Hou33.","(9:13) Akeem Hunt rush to the left for 9 yards to the Hou29. Tackled by Tyson Alualu.","(9:20) Brad Nortman punts for 40 yards to Hou0. Touchback.","(10:05) Blake Bortles pass to the right to Julius Thomas for 2 yards to the Hou40. Tackled by Johnathan Joseph.","(10:41) Chris Ivory rush up the middle for 2 yards to the Hou42. Tackled by Benardrick McKinney.","(10:47) Blake Bortles incomplete pass to the middle intended for Allen Hurns.","(11:30) Blake Bortles pass to the left to T.J. Yeldon for 17 yards to the Hou44. Tackled by Charles James.","(12:13) Blake Bortles pass to the left to Allen Robinson for 6 yards to the Jax39. Tackled by Kareem Jackson.","(12:48) T.J. Yeldon rush up the middle for a loss of 1 yard to the Jax33. Tackled by Jadeveon Clowney.","(13:17) Blake Bortles pass to the left to Allen Robinson for 14 yards to the Jax34. Tackled by John Simon.","(13:49) T.J. Yeldon rush to the left for 7 yards to the Jax20. Tackled by Christian Covington.","(13:53) Blake Bortles incomplete pass to the right intended for Marcedes Lewis.","(14:03) Shane Lechler punts for 47 yards to Jax27. Rashad Greene Sr. - no return. Tackled by Tyler Ervin. Penalty: Unnecessary Roughness on Jacksonville (Davon House) -14 yards.","(14:10) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(14:55) Lamar Miller rush up the middle for 1 yard to the Hou26. Tackled by Malik Jackson.","(15:00) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(15:00) Jason Myers kicks off to the endzone. Touchback.","(0:04) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(0:07) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins defensed by Dan Skuta.","(0:12) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(0:17) Brock Osweiler incomplete pass to the right intended for Ryan Griffin.","(0:23) Brock Osweiler rush to the right for 8 yards to the Hou48. Tackled by Dante Fowler Jr.. Penalty: Unnecessary Roughness on Jacksonville (Dante Fowler Jr.) 15 yards.","(0:28) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by Yannick Ngakoue.","(0:34) Blake Bortles incomplete pass to the left intended for Julius Thomas.","(0:36) Blake Bortles incomplete pass to the left intended for Julius Thomas defensed by Quintin Demps.","(0:41) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(0:48) Blake Bortles pass to the left to T.J. Yeldon for 7 yards to the Hou40. Tackled by Jadeveon Clowney.","(0:57) Blake Bortles rush up the middle for 11 yards to the Hou47.","(1:02) Blake Bortles pass to the left to Julius Thomas for 2 yards to the Jax42. Tackled by Benardrick McKinney.","(1:06) Blake Bortles incomplete pass to the right intended for Julius Thomas.","(1:11) 50 yard field goal attempt by Nick Novak is NO GOOD. Holder: Shane Lechler.","(1:15) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(1:56) Alfred Blue rush up the middle for no gain to the Jax32. Tackled by Yannick Ngakoue.","(2:00) Brock Osweiler pass to the left to DeAndre Hopkins for 7 yards to the Jax32. Tackled by Jalen Ramsey.","(2:00) Two Minute Warning.","(2:08) Brock Osweiler pass to the left to Braxton Miller for 10 yards to the Jax39. Tackled by Prince Amukamara.","(2:22) Brock Osweiler pass to the right to DeAndre Hopkins for 16 yards to the Jax49. Tackled by Jalen Ramsey.","(3:00) Lamar Miller rush up the middle for a loss of 1 yard to the Hou35. Tackled by Paul Posluszny and Telvin Smith.","(3:05) Brock Osweiler incomplete pass to the middle intended for Akeem Hunt defensed by Malik Jackson.","(3:47) Brock Osweiler rush up the middle for 11 yards to the Hou36.","(4:34) Brock Osweiler pass to the right to Ryan Griffin for 1 yard to the Hou25. Tackled by Prince Amukamara.","(5:12) Lamar Miller rush up the middle for 2 yards to the Hou24. Tackled by Abry Jones.","(5:17) Jason Myers kicks off to the Hou5. Tyler Ervin return for 17 yards to Hou22. Tackled by Peyton Thompson.","(5:21) Jason Myers 54 yard field goal attempt is GOOD. Holder: Brad Nortman.","(5:25) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(6:16) Blake Bortles rush up the middle for no gain to the Hou32. FUMBLE, recovered by Jax (Chris Ivory).","(6:56) Chris Ivory rush up the middle for 2 yards to the Hou32. Tackled by John Simon.","(7:22) Blake Bortles pass to the right to Allen Robinson for 16 yards to the Hou34.","(7:57) Blake Bortles pass to the right to Allen Hurns for 2 yards to the Jax50. Tackled by Andre Hal.","(8:29) Blake Bortles pass to the left to Marqise Lee for 7 yards to the Jax48. Tackled by Kareem Jackson.","(9:00) Chris Ivory rush up the middle for 2 yards to the Jax41. Tackled by Benardrick McKinney.","(9:05) 49 yard field goal attempt by Nick Novak is NO GOOD. Holder: Shane Lechler.","(9:48) Brock Osweiler pass to the right to C.J. Fiedorowicz for 8 yards to the Jax31. Tackled by Paul Posluszny.","(9:53) Houston Texans timeout.","(10:36) Alfred Blue rush to the left for a loss of 3 yards to the Jax39. Tackled by Malik Jackson.","(10:41) Brock Osweiler incomplete pass to the left intended for Braxton Miller.","(11:17) Alfred Blue rush up the middle for 5 yards to the Jax36. Tackled by Dan Skuta.","(11:48) Brock Osweiler pass to the right to DeAndre Hopkins for 8 yards to the Jax41. Tackled by Jalen Ramsey.","(11:55) Blake Bortles rush up the middle for no gain to the Hou44. FUMBLE, recovered by Hou (Whitney Mercilus) and returned for 2 yards. Tackled by Blake Bortles.","(12:14) Blake Bortles pass to the left to Allen Robinson for 11 yards to the Hou44. Tackled by Kareem Jackson.","(12:39) Penalty: Holding on Jacksonville (Jermey Parnell) -10 yards.","(13:12) Blake Bortles pass to the right to Marqise Lee for 18 yards to the Hou45. Tackled by Andre Hal.","(13:52) Blake Bortles pass to the right to Julius Thomas for a loss of 1 yard to the Jax37. Tackled by Benardrick McKinney.","(14:28) T.J. Yeldon rush to the right for 6 yards to the Jax38. Tackled by Benardrick McKinney.","(15:00) T.J. Yeldon rush up the middle for 5 yards to the Jax32. Tackled by Christian Covington.","(0:16) T.J. Yeldon rush up the middle for 7 yards to the Jax27. Tackled by Jadeveon Clowney.","(0:19) Nick Novak kicks off to the Jax3. Marqise Lee return for 17 yards to Jax20. Tackled by Don Jones.","(0:19) Nick Novak extra point is good.","(0:24) Brock Osweiler pass to the right to Ryan Griffin for 1 yard for a TOUCHDOWN.","(0:57) Alfred Blue rush up the middle for no gain to the Jax1. Tackled by Abry Jones.","(1:49) Lamar Miller rush to the right for 45 yards to the Jax1. Tackled by Myles Jack.","(2:21) Lamar Miller rush up the middle for 4 yards to the Jax46. Tackled by Myles Jack.","(2:59) Brock Osweiler pass to the left to C.J. Fiedorowicz for 13 yards to the Hou50. Tackled by Paul Posluszny.","(3:40) Lamar Miller rush up the middle for 1 yard to the Hou37. Tackled by Malik Jackson.","(3:44) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(4:13) Lamar Miller rush up the middle for 3 yards to the Hou36. Tackled by Jarrod Wilson.","(4:39) Brock Osweiler pass to the right to Ryan Griffin for 5 yards to the Hou33. Tackled by Johnathan Cyprien.","(5:14) Lamar Miller rush up the middle for 3 yards to the Hou28. Tackled by Telvin Smith.","(5:14) Jason Myers kicks off to the endzone. Touchback.","(5:14) Jason Myers extra point is good.","(5:20) Blake Bortles pass to the right to Julius Thomas for 5 yards for a TOUCHDOWN.","(6:06) Blake Bortles pass to the right to Marcedes Lewis for 3 yards to the Hou5. Tackled by John Simon.","(6:43) Blake Bortles pass to the right to T.J. Yeldon for 3 yards to the Hou8. Tackled by Benardrick McKinney.","(7:21) Blake Bortles pass to the left to Ben Koyack for 15 yards to the Hou11. Tackled by Quintin Demps.","(7:21) Houston Texans timeout.","(7:51) Chris Ivory rush to the right for 13 yards to the Hou26. Tackled by Quintin Demps.","(8:27) Blake Bortles pass to the right to Marqise Lee for 10 yards to the Hou39. Tackled by Johnathan Joseph.","(9:03) Chris Ivory rush to the right for 4 yards to the Hou49. Tackled by Brian Cushing.","(9:11) Blake Bortles incomplete pass to the right intended for Allen Hurns defensed by Johnathan Joseph.","(9:45) Blake Bortles pass to the middle to Allen Robinson for 5 yards to the Jax47. Tackled by Quintin Demps.","(10:15) Marqise Lee rush to the right for 6 yards to the Jax42. Tackled by Kareem Jackson.","(10:48) Blake Bortles pass to the right to Chris Ivory for 2 yards to the Jax36. Tackled by Johnathan Joseph.","(11:26) Blake Bortles pass to the middle to Chris Ivory for 8 yards to the Jax34. Tackled by Benardrick McKinney and Whitney Mercilus.","(11:56) Chris Ivory rush up the middle for 1 yard to the Jax26. Tackled by D.J. Reader.","(11:57) Nick Novak kicks off to the endzone. Touchback.","(11:57) Nick Novak extra point is good.","(12:07) Blake Bortles pass intended for Allen Hurns INTERCEPTED by Kareem Jackson and returned for 42 yards for a TOUCHDOWN.","(12:46) T.J. Yeldon rush up the middle for 4 yards to the Jax40. Tackled by Brian Cushing.","(13:19) Blake Bortles pass to the right to Marcedes Lewis for no gain to the Jax36. Tackled by Quintin Demps.","(13:49) Blake Bortles pass to the right to Allen Robinson for 6 yards to the Jax36. Tackled by Johnathan Joseph.","(14:29) Blake Bortles pass to the left to Ben Koyack for 6 yards to the Jax30. Tackled by Kareem Jackson.","(15:00) T.J. Yeldon rush to the left for a loss of 1 yard to the Jax24. Tackled by Benardrick McKinney.","(15:00) Nick Novak kicks off to the endzone. Touchback."]