["(0:08) Russell Wilson rush up the middle for no gain to the Sea1. Tackled by Malcom Brown.","(0:08) New England Patriots timeout.","(0:11) Russell Wilson rush up the middle for no gain to the Sea1. Tackled by Dont'a Hightower.","(0:14) Tom Brady incomplete pass to the left intended for Rob Gronkowski.","(0:14) Penalty: Too Many Men on Field on Seattle 1 yards.","(0:14) New England Patriots timeout.","(0:19) Tom Brady rush up the middle for no gain to the Sea1. FUMBLE, recovered by NE (Tom Brady).","(0:19) New England Patriots timeout.","(0:37) LeGarrette Blount rush up the middle for no gain to the Sea1. Tackled by Kam Chancellor.","(0:37) Seattle Seahawks timeout.","(0:43) Tom Brady rush up the middle for 1 yard to the Sea1. Tackled by Jarran Reed and Tony McDaniel.","(1:29) Tom Brady pass to the left to Rob Gronkowski for 26 yards to the Sea2. Tackled by Deshawn Shead.","(2:00) LeGarrette Blount rush to the left for a loss of 4 yards to the Sea28. Tackled by Tony McDaniel.","(2:00) Two Minute Warning.","(2:33) Tom Brady pass to the right to Julian Edelman for 30 yards to the Sea24. Tackled by Earl Thomas and Richard Sherman.","(2:34) Penalty: False Start on New England (Malcolm Mitchell) -5 yards.","(3:06) James White rush up the middle for 2 yards to the Sea49. Tackled by Kam Chancellor and Frank Clark.","(3:38) Tom Brady pass to the right to Julian Edelman for 3 yards to the NE49. Tackled by Brock Coyle.","(4:18) Tom Brady pass to the right to Malcolm Mitchell for 13 yards to the NE46. Tackled by Brock Coyle and Richard Sherman.","(4:24) Tom Brady pass to the left to Martellus Bennett for 8 yards to the NE33. Tackled by K.J. Wright.","(4:24) Steven Hauschka kicks off to the endzone. Touchback.","(4:24) Russell Wilson 2 pt conversion pass is NO GOOD - intended for Doug Baldwin.","(4:30) Russell Wilson pass to the middle to Doug Baldwin for 15 yards for a TOUCHDOWN.","(5:20) C.J. Prosise rush to the left for 5 yards to the NE15. Tackled by Rob Ninkovich.","(5:58) Christine Michael rush up the middle for 2 yards to the NE20. Tackled by Rob Ninkovich.","(6:27) Russell Wilson pass to the left to Tyler Lockett for 12 yards to the NE22.","(7:14) Christine Michael rush to the right for 1 yard to the NE34. Tackled by Malcolm Butler.","(7:40) Russell Wilson pass to the left to C.J. Prosise for 7 yards to the NE35. Tackled by Dont'a Hightower.","(8:24) C.J. Prosise rush to the left for 6 yards to the NE42. Tackled by Devin McCourty and Dont'a Hightower.","(8:29) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(8:39) Tom Brady pass to the middle to Julian Edelman for 5 yards to the Sea38. Tackled by Kam Chancellor. FUMBLE, recovered by Sea (Richard Sherman) and returned for 14 yards. Tackled by Marcus Cannon.","(8:46) Tom Brady incomplete pass to the left intended for Chris Hogan.","(8:56) Steven Hauschka kicks off to the NE2. Cyrus Jones return for 43 yards to NE45. Tackled by Steven Hauschka. FUMBLE, recovered by NE (Nate Ebner).","(8:59) Steven Hauschka 23 yard field goal attempt is GOOD. Holder: Jon Ryan.","(9:03) Russell Wilson incomplete pass to the left intended for Tyler Lockett.","(9:03) Penalty: False Start on Seattle (Jimmy Graham) -4 yards.","(9:47) Seattle Seahawks timeout.","(9:47) C.J. Prosise rush to the right for no gain to the NE1. Tackled by Alan Branch and Elandon Roberts.","(10:26) C.J. Prosise rush to the right for 1 yard to the NE1. Tackled by Malcom Brown and Rob Ninkovich.","(11:09) Russell Wilson pass to the left to C.J. Prosise for 38 yards to the NE2. Tackled by Devin McCourty and Elandon Roberts.","(11:09) Seattle Seahawks timeout.","(11:45) C.J. Prosise rush to the left for 3 yards to the NE40. Tackled by Dont'a Hightower.","(12:20) Russell Wilson pass to the right to C.J. Prosise for 1 yard to the NE43. Tackled by Malcolm Butler.","(12:55) Russell Wilson pass to the left to Jimmy Graham for 19 yards to the NE44. Tackled by Logan Ryan.","(13:00) Stephen Gostkowski kicks off to the Sea5. Tyler Lockett return for 32 yards to Sea37. Tackled by Devin McCourty.","(13:05) Stephen Gostkowski 30 yard field goal attempt is GOOD. Holder: Ryan Allen.","(13:42) Tom Brady sacked at Sea12 for a loss of 5 yards by Frank Clark.","(14:22) Tom Brady rush to the right for 2 yards to the Sea7.","(15:00) LeGarrette Blount rush to the left for no gain to the Sea9. Tackled by Frank Clark and Jarran Reed.","(0:10) Tom Brady pass to the left to Julian Edelman for 33 yards to the Sea9. Tackled by Earl Thomas.","(0:15) Tom Brady incomplete pass to the left intended for Chris Hogan.","(0:33) Penalty: False Start on New England (Rob Gronkowski) -5 yards.","(0:52) Tom Brady incomplete pass to the left intended for Rob Gronkowski defensed by Ahtyba Rubin. Penalty: Holding on New England (Joe Thuney) -10 yards.","(1:34) LeGarrette Blount rush to the left for 3 yards to the Sea27. Tackled by Cliff Avril and Tony McDaniel.","(2:19) LeGarrette Blount rush to the right for 9 yards to the Sea30. Tackled by Earl Thomas and K.J. Wright.","(2:52) Tom Brady pass to the right to Martellus Bennett for 36 yards to the Sea39. Tackled by Earl Thomas.","(2:52) Steven Hauschka kicks off to the endzone. Touchback.","(2:57) Steven Hauschka 41 yard field goal attempt is GOOD. Holder: Jon Ryan.","(3:09) Russell Wilson incomplete pass to the right. Penalty: Intentional Grounding on Seattle (Russell Wilson) -10 yards.","(3:56) Russell Wilson sacked at NE13 for a loss of 8 yards by Trey Flowers.","(4:34) C.J. Prosise rush to the right for 2 yards to the NE5. Tackled by Malcolm Butler and Rob Ninkovich.","(5:03) Russell Wilson pass to the right to C.J. Prosise for 10 yards to the NE7. Tackled by Patrick Chung.","(5:44) C.J. Prosise rush to the right for 3 yards to the NE17. Tackled by Alan Branch and Malcom Brown.","(5:49) Penalty: Pass Interference on New England (Dont'a Hightower) 7 yards.","(6:33) C.J. Prosise rush up the middle for 3 yards to the NE27. Tackled by Dont'a Hightower and Logan Ryan.","(7:16) Russell Wilson pass to the right to Paul Richardson for 39 yards to the NE30. Tackled by Patrick Chung.","(7:52) Russell Wilson pass to the right to Doug Baldwin for 6 yards to the Sea31. Tackled by Malcolm Butler.","(7:52) Stephen Gostkowski kicks off to the endzone. Touchback.","(7:52) Stephen Gostkowski extra point is good.","(7:58) LeGarrette Blount rush to the left for 13 yards for a TOUCHDOWN.","(8:27) LeGarrette Blount rush to the left for 10 yards to the Sea13. Tackled by Earl Thomas.","(9:05) Tom Brady pass to the middle to Danny Amendola for 14 yards to the Sea23. Tackled by Earl Thomas.","(9:41) Tom Brady pass to the right to Martellus Bennett for 15 yards to the Sea37. Tackled by Kam Chancellor.","(10:26) Tom Brady sacked at NE48 for a loss of 7 yards by Jarran Reed and Damontre Moore.","(11:10) Tom Brady pass to the right to Julian Edelman for 17 yards to the Sea45. Tackled by Deshawn Shead.","(11:47) LeGarrette Blount rush to the right for a loss of 1 yard to the NE38. Tackled by Bobby Wagner and Tony McDaniel.","(12:21) LeGarrette Blount rush up the middle for 7 yards to the NE39. Tackled by Bobby Wagner and Ahtyba Rubin.","(12:25) James White rush to the right for 3 yards to the NE17. Tackled by Richard Sherman. Penalty: Roughing Passer on Seattle (Kam Chancellor) 15 yards.","(13:26) Tom Brady pass to the right to James White for 5 yards to the NE14. Tackled by Frank Clark.","(13:39) Jon Ryan punts for 54 yards to NE14. Cyrus Jones return for 4 yards to NE18. Tackled by Will Tukuafu and Nolan Frese. Penalty: Clipping on New England (Justin Coleman) -9 yards.","(13:46) Russell Wilson incomplete pass to the left intended for Doug Baldwin defensed by Dont'a Hightower.","(14:26) C.J. Prosise rush to the left for 3 yards to the Sea32. Tackled by Alan Branch.","(15:00) Russell Wilson pass to the right to Jimmy Graham for 4 yards to the Sea29. Tackled by Devin McCourty.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback.","(0:06) Steven Hauschka kicks off to the NE22. James Develin return for 6 yards to NE28. Tackled by Kelcie McCray.","(0:06) Steven Hauschka extra point is good.","(0:13) Russell Wilson pass to the right to Doug Baldwin for 18 yards for a TOUCHDOWN.","(0:31) Russell Wilson pass to the right to C.J. Prosise for 12 yards to the NE18. Tackled by Patrick Chung.","(0:31) Seattle Seahawks timeout.","(0:41) Russell Wilson pass to the right to Tyler Lockett for 24 yards to the NE30. Tackled by Malcolm Butler.","(0:41) Seattle Seahawks timeout.","(0:48) Russell Wilson rush to the left for 6 yards to the Sea46. Tackled by Dont'a Hightower.","(0:48) Seattle Seahawks timeout.","(0:55) Russell Wilson pass to the left to Jimmy Graham for 14 yards to the Sea40. Tackled by Dont'a Hightower.","(1:01) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(1:05) Russell Wilson pass to the left to C.J. Prosise for 1 yard to the Sea26. Tackled by Justin Coleman.","(1:05) Stephen Gostkowski kicks off to the endzone. Touchback.","(1:05) Stephen Gostkowski extra point is good.","(1:14) LeGarrette Blount rush to the right for 1 yard for a TOUCHDOWN.","(1:22) Penalty: Holding on Seattle (Cliff Avril) 1 yards.","(2:00) LeGarrette Blount rush to the right for 1 yard to the Sea2. Tackled by Kam Chancellor and Richard Sherman.","(2:00) Two Minute Warning.","(2:36) Tom Brady pass to the left to Martellus Bennett for 14 yards to the Sea3. Tackled by Deshawn Shead and K.J. Wright.","(3:14) Tom Brady pass to the right to Julian Edelman for 5 yards to the Sea17. Tackled by Richard Sherman and Earl Thomas.","(3:52) LeGarrette Blount rush to the left for 7 yards to the Sea22. Tackled by Bobby Wagner and Brock Coyle.","(4:17) Tom Brady pass to the left to Martellus Bennett for 16 yards to the Sea29. Tackled by Deshawn Shead.","(4:22) Tom Brady incomplete pass to the right intended for Rob Gronkowski defensed by Kam Chancellor.","(4:32) Tom Brady pass to the left to Julian Edelman for 6 yards to the NE40. Tackled by Richard Sherman. Penalty: Face Mask on Seattle (Richard Sherman) 15 yards.","(5:06) LeGarrette Blount rush to the left for 3 yards to the NE34. Tackled by K.J. Wright.","(5:36) Tom Brady rush up the middle for 3 yards to the NE31. Tackled by Sealver Siliga.","(6:04) Tom Brady pass to the left to Martellus Bennett for 9 yards to the NE28. Tackled by K.J. Wright.","(6:15) Jon Ryan punts for 51 yards to NE15. Cyrus Jones return for 4 yards to NE19. Tackled by Dewey McDonald and DeAndre Elliott.","(6:49) Russell Wilson sacked at Sea34 for a loss of 9 yards by Rob Ninkovich.","(7:00) Penalty: Offside on New England (Chris Long) 5 yards.","(7:48) Alex Collins rush up the middle for 2 yards to the Sea38. Tackled by Malcom Brown. FUMBLE, recovered by Sea (Alex Collins).","(7:56) Russell Wilson incomplete pass to the right intended for Jermaine Kearse defensed by Logan Ryan.","(8:30) C.J. Prosise rush to the right for 5 yards to the Sea36. Tackled by Vincent Valentine.","(9:04) C.J. Prosise rush to the right for 7 yards to the Sea31. Tackled by Devin McCourty.","(9:20) Tom Brady pass intended for Malcolm Mitchell INTERCEPTED by Deshawn Shead and returned for 2 yards. Tackled by Malcolm Mitchell.","(10:01) Tom Brady rush up the middle for 1 yard to the NE35. Tackled by Bobby Wagner.","(10:14) Tom Brady pass to the left to Rob Gronkowski for 8 yards to the NE34. Tackled by Earl Thomas.","(10:52) LeGarrette Blount rush up the middle for 1 yard to the NE26. Tackled by Tony McDaniel and Kam Chancellor.","(10:52) Steven Hauschka kicks off to the endzone. Touchback.","(10:52) Steven Hauschka extra point is BLOCKED.","(10:56) Russell Wilson pass to the left to Doug Baldwin for 6 yards for a TOUCHDOWN.","(11:00) Russell Wilson incomplete pass to the left intended for Paul Richardson.","(11:37) C.J. Prosise rush up the middle for 3 yards to the NE6. Tackled by Shea McClellin and Dont'a Hightower.","(11:55) Christine Michael rush to the left for 9 yards to the NE9. Tackled by Patrick Chung.","(12:34) Christine Michael rush to the left for 8 yards to the NE18. Tackled by Patrick Chung.","(13:13) C.J. Prosise rush to the right for 10 yards to the NE26. Tackled by Malcolm Butler.","(13:37) Penalty: False Start on Seattle (Jermaine Kearse) -5 yards.","(14:18) Russell Wilson pass to the left to Jermaine Kearse for 20 yards to the NE31. Tackled by Duron Harmon and Devin McCourty.","(14:28) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(15:00) C.J. Prosise rush to the left for 3 yards to the Sea49. Tackled by Vincent Valentine.","(0:02) Russell Wilson pass to the right to Jimmy Graham for 11 yards to the Sea46. Tackled by Logan Ryan.","(0:08) Ryan Allen punts for 36 yards to Sea36. Tyler Lockett return for a loss of 1 yard to Sea35. Tackled by Barkevious Mingo and Nate Ebner.","(0:16) Tom Brady incomplete pass to the left intended for Julian Edelman.","(1:00) LeGarrette Blount rush to the right for no gain to the NE28. Tackled by Sealver Siliga.","(1:33) Tom Brady pass to the left to James White for 3 yards to the NE28. Tackled by K.J. Wright.","(1:33) Steven Hauschka kicks off to the endzone. Touchback.","(1:37) Steven Hauschka 31 yard field goal attempt is GOOD. Holder: Jon Ryan.","(1:43) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(2:27) Christine Michael rush to the right for 2 yards to the NE13. Tackled by Malcolm Butler and Patrick Chung.","(2:59) Russell Wilson pass to the right to Jermaine Kearse for 6 yards to the NE15. Tackled by Malcolm Butler.","(3:37) Russell Wilson pass to the right to Doug Baldwin for 10 yards to the NE21.","(4:04) Russell Wilson pass to the left to C.J. Prosise for 18 yards to the NE31. Tackled by Duron Harmon.","(4:07) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(4:34) Russell Wilson pass to the right to Christine Michael for 4 yards to the NE49. Tackled by Dont'a Hightower.","(4:38) Penalty: Pass Interference on New England (Justin Coleman) 20 yards.","(5:21) Russell Wilson pass to the right to Paul Richardson for 13 yards to the Sea27. Tackled by Malcolm Butler.","(5:46) Russell Wilson sacked at Sea14 for a loss of 7 yards by Trey Flowers.","(5:56) Ryan Allen punts for 56 yards to Sea16. Tyler Lockett return for 5 yards to Sea21. Tackled by Joe Cardona and Matthew Slater.","(6:27) Tom Brady pass to the left to Martellus Bennett for 4 yards to the NE28. Tackled by Kam Chancellor.","(7:06) LeGarrette Blount rush up the middle for a loss of 1 yard to the NE24. Tackled by Frank Clark.","(7:10) Tom Brady incomplete pass to the right intended for Chris Hogan.","(7:10) Steven Hauschka kicks off to the endzone. Touchback.","(7:14) Steven Hauschka 27 yard field goal attempt is GOOD. Holder: Jon Ryan.","(7:23) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(8:05) C.J. Prosise rush to the left for no gain to the NE8. Tackled by Trey Flowers.","(8:41) C.J. Prosise rush up the middle for 6 yards to the NE8. Tackled by Elandon Roberts and Malcom Brown.","(9:02) Russell Wilson pass to the left to Doug Baldwin for 4 yards to the NE14. Tackled by Justin Coleman.","(9:43) C.J. Prosise rush up the middle for 6 yards to the NE18. Tackled by Dont'a Hightower and Rob Ninkovich.","(10:14) Russell Wilson pass to the right to Tyler Lockett for 36 yards to the NE24. Tackled by Devin McCourty.","(10:19) Russell Wilson incomplete pass to the middle intended for Jermaine Kearse.","(10:19) Stephen Gostkowski kicks off to the Sea3, out of bounds. No return.","(10:19) Stephen Gostkowski extra point is good.","(10:30) LeGarrette Blount rush up the middle for 1 yard for a TOUCHDOWN.","(10:35) Penalty: Pass Interference on Seattle (Kam Chancellor) 9 yards.","(11:17) LeGarrette Blount rush to the right for 2 yards to the Sea10. Tackled by Jarran Reed and Kam Chancellor.","(11:53) Tom Brady pass to the right to James White for 11 yards to the Sea12. Tackled by Richard Sherman.","(12:28) LeGarrette Blount rush up the middle for 5 yards to the Sea23. Tackled by Jarran Reed.","(13:06) LeGarrette Blount rush to the right for 7 yards to the Sea28. Tackled by K.J. Wright.","(13:46) Tom Brady pass to the right to Rob Gronkowski for 22 yards to the Sea35. Tackled by Bobby Wagner.","(13:53) Tom Brady incomplete pass to the left intended for Julian Edelman.","(14:34) LeGarrette Blount rush up the middle for 5 yards to the NE43. Tackled by Tony McDaniel and K.J. Wright.","(15:00) Tom Brady pass to the left to James White for 13 yards to the NE38. Tackled by Earl Thomas.","(15:00) Steven Hauschka kicks off to the endzone. Touchback."]
