["(0:00) Cairo Santos 37 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(0:03) Kansas City Chiefs timeout.","(0:13) Alex Smith rush to the right for no gain to the Car18. Tackled by Star Lotulelei.","(0:13) Kansas City Chiefs timeout.","(0:20) Spencer Ware rush to the left for 11 yards to the Car18. Tackled by Daryl Worley.","(0:29) Cam Newton pass to the right to Kelvin Benjamin for 14 yards to the Car34. Tackled by Marcus Peters. FUMBLE, recovered by KC (Marcus Peters) and returned for 10 yards. Tackled by Fozzy Whittaker. Penalty: Delay of Game on Kansas City (Marcus Peters) -5 yards.","(0:43) Dustin Colquitt punts for 53 yards to Car21. Ted Ginn Jr. return for 9 yards to Car30. Tackled by James Winchester. Penalty: Illegal Block on Carolina (David Mayo) -10 yards.","(0:43) Carolina Panthers timeout.","(0:48) Alex Smith pass to the middle to Tyreek Hill for 5 yards to the KC26. Tackled by Luke Kuechly.","(0:48) Carolina Panthers timeout.","(0:51) Alex Smith sacked at KC21 for a loss of 4 yards by Kawann Short.","(1:16) Alex Smith pass to the left to Tyreek Hill for a loss of 1 yard to the KC25. Tackled by Luke Kuechly. FUMBLE, recovered by KC.","(1:23) Penalty: Illegal Forward Pass on Kansas City (Alex Smith) -5 yards.","(1:47) Alex Smith pass to the right to Tyreek Hill for 11 yards to the KC31. Tackled by Star Lotulelei.","(1:56) Graham Gano punts for 54 yards to KC0. Touchback.","(2:00) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(2:00) Two Minute Warning.","(2:36) Fozzy Whittaker rush up the middle for a loss of 2 yards to the Car46. Tackled by Dee Ford.","(3:14) Cam Newton pass to the left to Ted Ginn Jr. for 7 yards to the Car48. Tackled by Steven Nelson.","(3:47) Fozzy Whittaker rush to the right for 7 yards to the Car41. Tackled by Ramik Wilson.","(4:25) Cam Newton pass to the left to Fozzy Whittaker for 9 yards to the Car34. Tackled by Dontari Poe.","(4:25) Cairo Santos kicks off to the endzone. Touchback.","(4:28) Cairo Santos 33 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(4:35) Alex Smith incomplete pass to the left intended for Travis Kelce.","(5:18) Charcandrick West rush to the right for 3 yards to the Car14. Tackled by Robert McClain.","(5:44) Alex Smith pass to the left to Spencer Ware for 5 yards to the Car17. Tackled by Luke Kuechly.","(6:29) Alex Smith pass to the left to Travis Kelce for 16 yards to the Car22. Tackled by Tre Boston.","(7:08) Spencer Ware rush to the left for 8 yards to the Car38. Tackled by Wes Horton.","(7:34) Alex Smith rush to the left for 3 yards to the Car46. Tackled by Daryl Worley.","(7:49) Graham Gano punts for 43 yards to KC30. Tyreek Hill return for 21 yards to Car49. Tackled by Graham Gano.","(7:56) Cam Newton incomplete pass to the right intended for Jonathan Stewart.","(8:34) Cam Newton pass to the right to Greg Olsen for 5 yards to the Car27. Tackled by Ramik Wilson.","(9:12) Cam Newton rush up the middle for 1 yard to the Car22. Tackled by Dee Ford and Dontari Poe.","(9:50) Cam Newton pass to the left to Kelvin Benjamin for 12 yards to the Car21. Tackled by Kenneth Acker.","(10:26) Jonathan Stewart rush up the middle for no gain to the Car9. Tackled by Rakeem Nunez-Roches and Derrick Johnson.","(10:32) Cairo Santos kicks off to the Car-1. Fozzy Whittaker return for 18 yards to Car17. Tackled by Demarcus Robinson. Penalty: Illegal Block on Carolina (Robert McClain) -8 yards.","(10:32) Alex Smith 2 pt conversion pass to Travis Kelce is GOOD.","(10:51) Cam Newton pass intended for Greg Olsen INTERCEPTED by Eric Berry and returned for 42 yards for a TOUCHDOWN.","(11:27) Cam Newton rush up the middle for 3 yards to the Car29. Tackled by Derrick Johnson and Tamba Hali.","(12:02) Jonathan Stewart rush up the middle for 1 yard to the Car26. Tackled by Tamba Hali and Derrick Johnson.","(12:02) Cairo Santos kicks off to the endzone. Touchback.","(12:07) Cairo Santos 36 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(12:11) Alex Smith incomplete pass to the left intended for Ross Travis.","(12:16) Alex Smith incomplete pass to the left intended for Chris Conley.","(12:20) Alex Smith incomplete pass to the right intended for Chris Conley.","(13:03) Alex Smith pass to the left to Tyreek Hill for 10 yards to the Car18. Tackled by Daryl Worley.","(13:41) Alex Smith pass to the right to Tyreek Hill for 14 yards to the Car28. Tackled by James Bradberry.","(14:07) Spencer Ware rush to the left for no gain to the Car42. Tackled by Kawann Short and Charles Johnson.","(14:31) Alex Smith pass to the middle to Travis Kelce for 10 yards to the Car42. Tackled by Daryl Worley.","(15:00) Spencer Ware rush up the middle for 1 yard to the KC48. Tackled by Wes Horton and Kawann Short.","(0:16) Alex Smith pass to the left to Tyreek Hill for 27 yards to the KC47. Tackled by Tre Boston.","(0:21) Alex Smith incomplete pass to the right intended for Tyreek Hill.","(0:30) Graham Gano punts for 40 yards to KC0. Touchback.","(1:07) Cam Newton sacked at KC40 for a loss of 12 yards by Chris Jones.","(1:49) Cam Newton sacked at KC28 for a loss of 7 yards by Dee Ford.","(2:23) Cam Newton rush to the right for a loss of 1 yard to the KC21. Tackled by Eric Berry.","(2:57) Cam Newton pass to the right to Devin Funchess for 11 yards to the KC20. Tackled by Marcus Peters.","(3:20) Cam Newton pass to the right to Ted Ginn Jr. for 14 yards to the KC31. Tackled by Ron Parker.","(3:50) Cam Newton pass to the left to Corey Brown for 3 yards to the KC45. Tackled by Steven Nelson.","(3:56) Cam Newton incomplete pass to the left intended for Kelvin Benjamin defensed by Marcus Peters.","(4:21) Cam Newton rush up the middle for 1 yard to the KC48. Tackled by Rakeem Nunez-Roches and Kendall Reyes.","(4:35) Cam Newton rush up the middle for 1 yard to the KC49. Tackled by Ramik Wilson.","(5:14) Cam Newton pass to the right to Kelvin Benjamin for 8 yards to the Car50. Tackled by Marcus Peters.","(5:18) Cam Newton incomplete pass to the middle intended for Ed Dickson.","(6:03) Cam Newton pass to the right to Greg Olsen for 4 yards to the Car42. Tackled by Eric Berry.","(6:45) Jonathan Stewart rush to the right for 3 yards to the Car38. Tackled by Rakeem Nunez-Roches.","(7:15) Jonathan Stewart rush to the right for 4 yards to the Car35. Tackled by Eric Berry and Rakeem Nunez-Roches.","(7:15) Carolina Panthers timeout.","(8:01) Cam Newton rush up the middle for 6 yards to the Car31. Tackled by Chris Jones.","(8:05) Cam Newton incomplete pass to the left intended for Kelvin Benjamin defensed by Steven Nelson.","(8:37) Cam Newton pass to the right to Ted Ginn Jr. for 10 yards to the Car25. Tackled by Steven Nelson and Marcus Peters.","(9:00) Penalty: Illegal Formation on Carolina (Ed Dickson) -5 yards.","(9:46) Cam Newton pass to the middle to Devin Funchess for 7 yards to the Car20. Tackled by Steven Nelson and Daniel Sorensen.","(10:25) Jonathan Stewart rush to the left for 4 yards to the Car13. Tackled by Kenneth Acker.","(10:29) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(10:37) Dustin Colquitt punts for 47 yards to Car9. No return.","(10:44) Alex Smith incomplete pass to the left intended for Tyreek Hill.","(11:29) Alex Smith rush to the right for 4 yards to the KC44. Tackled by Kurt Coleman.","(12:15) Alex Smith pass to the right to Charcandrick West for no gain to the KC40. Tackled by Thomas Davis.","(12:59) Spencer Ware rush to the left for 2 yards to the KC40. Tackled by Thomas Davis and Tre Boston.","(13:37) Alex Smith pass to the right to Tyreek Hill for 9 yards to the KC38. Tackled by Robert McClain and James Bradberry.","(13:40) Alex Smith incomplete pass to the left intended for Albert Wilson.","(14:23) Spencer Ware rush up the middle for 6 yards to the KC29. Tackled by Robert McClain.","(14:56) Alex Smith pass to the right to Albert Wilson for 6 yards to the KC23. Tackled by James Bradberry.","(15:00) Graham Gano kicks off to the KC-4. Knile Davis return for 21 yards to KC17. Tackled by Zack Sanchez.","(0:10) Cam Newton rush up the middle for a loss of 1 yard to the Car24.","(0:10) Cairo Santos kicks off to the endzone. Touchback.","(0:15) Cairo Santos 47 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(0:15) Kansas City Chiefs timeout.","(0:21) Alex Smith sacked at Car29 for a loss of 5 yards by Mario Addison.","(0:27) Alex Smith pass to the middle to Albert Wilson for 10 yards to the Car24. Tackled by Luke Kuechly.","(0:27) Kansas City Chiefs timeout.","(0:33) Alex Smith sacked at Car34 for a loss of 4 yards by Charles Johnson and Vernon Butler.","(0:33) Penalty: False Start on Kansas City (Laurent Duvernay-Tardif) -5 yards.","(0:39) Alex Smith pass to the left to Tyreek Hill for 5 yards to the Car25. Tackled by Daryl Worley.","(0:44) Alex Smith pass to the left to Charcandrick West for 5 yards to the Car30. Tackled by Thomas Davis.","(0:50) Spencer Ware rush to the left for 9 yards to the Car35. Tackled by James Bradberry.","(0:50) Kansas City Chiefs timeout.","(1:13) Alex Smith pass to the right to Albert Wilson for 4 yards to the Car44. Tackled by Tre Boston.","(1:21) Alex Smith incomplete pass to the right intended for Travis Kelce.","(1:26) Alex Smith pass to the left to Albert Wilson for 5 yards to the Car48. Tackled by Daryl Worley.","(1:30) Alex Smith pass to the right to Charcandrick West for no gain to the KC32. Tackled by Thomas Davis. Penalty: Unnecessary Roughness on Carolina (Thomas Davis) 15 yards.","(1:52) Penalty: False Start on Kansas City (Mitchell Schwartz) -5 yards.","(1:52) Alex Smith pass to the right to Chris Conley for 12 yards to the KC37. Tackled by Charles Johnson and James Bradberry.","(1:52) Graham Gano kicks off to the endzone. Touchback.","(1:52) Graham Gano extra point is good.","(2:00) Cam Newton pass to the left to Devin Funchess for 38 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:30) Cam Newton pass to the left to Kelvin Benjamin for 7 yards to the KC38. Tackled by Kenneth Acker.","(3:31) Penalty: Offside on Kansas City (Dee Ford) 5 yards.","(3:31) Jonathan Stewart rush to the left for no gain to the Car50. Tackled by Ron Parker.","(3:34) Cam Newton incomplete pass to the left intended for Greg Olsen.","(4:17) Cam Newton pass to the left to Kelvin Benjamin for 18 yards to the Car50. Tackled by Steven Nelson.","(4:54) Jonathan Stewart rush to the left for 5 yards to the Car32. Tackled by Frank Zombo and Ramik Wilson.","(5:28) Cam Newton pass to the right to Greg Olsen for 14 yards to the Car27. Tackled by Eric Berry.","(5:35) Dustin Colquitt punts for 39 yards to Car13. No return.","(5:46) Alex Smith incomplete pass to the right intended for Albert Wilson defensed by Luke Kuechly.","(6:17) Alex Smith pass to the left to Ross Travis for 5 yards to the KC48. Tackled by Thomas Davis.","(6:17) Penalty: False Start on Kansas City (Eric Fisher) -5 yards.","(6:22) Alex Smith incomplete pass to the right intended for Travis Kelce.","(7:03) Spencer Ware rush to the right for 4 yards to the KC48. Tackled by James Bradberry.","(7:48) Spencer Ware rush to the right for 3 yards to the KC44. Tackled by Paul Soliai and Charles Johnson.","(8:27) Alex Smith pass to the right to Tyreek Hill for a loss of 1 yard to the KC41. Tackled by Robert McClain.","(8:32) Penalty: Offside on Carolina (Paul Soliai) 5 yards.","(9:05) Tyreek Hill rush to the right for 12 yards to the KC37. Tackled by Thomas Davis.","(9:05) Graham Gano kicks off to the endzone. Touchback.","(9:05) Graham Gano extra point is good.","(9:12) Cam Newton rush up the middle for 4 yards for a TOUCHDOWN.","(9:47) Cam Newton pass to the left to Kelvin Benjamin for 11 yards to the KC4. Tackled by Kenneth Acker.","(10:25) Cam Newton pass to the right to Ed Dickson for 26 yards to the KC15. Tackled by Ron Parker.","(10:25) Carolina Panthers timeout.","(10:58) Penalty: Holding on Carolina (Andrew Norwell) -10 yards.","(11:03) Cam Newton incomplete pass to the right intended for Ted Ginn Jr. defensed by Marcus Peters defensed by Dee Ford.","(11:36) Cam Newton pass to the left to Kelvin Benjamin for 14 yards to the KC31. Tackled by Phillip Gaines.","(12:15) Cam Newton rush up the middle for no gain to the KC45. Tackled by Derrick Johnson and Frank Zombo.","(12:37) Jonathan Stewart rush to the left for 5 yards to the KC45. Tackled by Derrick Johnson.","(12:59) Jonathan Stewart rush up the middle for 6 yards to the Car50. Tackled by Dontari Poe and Kendall Reyes.","(13:29) Jonathan Stewart rush to the left for 10 yards to the Car44. Tackled by Frank Zombo.","(13:35) Penalty: Holding on Kansas City (Marcus Peters) 5 yards.","(14:15) Mike Tolbert rush to the right for no gain to the Car29. Tackled by Chris Jones.","(14:49) Cam Newton rush to the right for 9 yards to the Car29. Tackled by Phillip Gaines.","(15:00) Dustin Colquitt punts for 64 yards to Car0. Touchback.","(0:16) Alex Smith pass to the right to Spencer Ware for 5 yards to the KC36. Tackled by Luke Kuechly.","(0:58) Spencer Ware rush to the left for 3 yards to the KC31. Tackled by Luke Kuechly.","(1:31) Spencer Ware rush to the right for 1 yard to the KC28. Tackled by James Bradberry.","(1:43) Graham Gano punts for 43 yards to KC27. Tyreek Hill - no return. FUMBLE, recovered by KC (Tyreek Hill).","(1:50) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by Marcus Peters.","(2:35) Cam Newton pass to the left to Ted Ginn Jr. for a loss of 1 yard to the Car30. Tackled by Steven Nelson.","(2:42) Cam Newton incomplete pass to the right intended for Ted Ginn Jr. defensed by Marcus Peters.","(3:15) Penalty: Holding on Kansas City (Phillip Gaines) 5 yards.","(3:54) Jonathan Stewart rush up the middle for no gain to the Car26. Tackled by Eric Berry.","(4:00) Cam Newton incomplete pass to the middle intended for Greg Olsen defensed by Eric Berry.","(4:09) Dustin Colquitt punts for 42 yards to Car26. No return.","(4:15) Alex Smith incomplete pass to the left intended for Albert Wilson.","(4:59) Charcandrick West rush up the middle for 2 yards to the KC32. Tackled by Kurt Coleman and Wes Horton.","(5:38) Alex Smith pass to the left to Travis Kelce for 5 yards to the KC30. Tackled by Robert McClain.","(5:51) Andy Lee punts for 43 yards to KC19. Tyreek Hill return for 6 yards to KC25. Tackled by Robert McClain and David Mayo.","(6:36) Cam Newton pass to the left to Greg Olsen for 8 yards to the Car38. Tackled by Eric Berry.","(6:41) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(7:17) Ted Ginn Jr. rush to the left for 1 yard to the Car30. Tackled by Eric Berry.","(7:32) Alex Smith pass intended for Tyreek Hill INTERCEPTED by Tre Boston and returned for 22 yards. Tackled by Mitch Morse and Tyreek Hill.","(8:10) Alex Smith rush to the left for 6 yards to the KC50. Tackled by Charles Johnson.","(8:14) Alex Smith incomplete pass to the right intended for Demetrius Harris.","(9:13) Penalty: False Start on Kansas City (Mitchell Schwartz) -5 yards.","(9:13) Spencer Ware rush to the left for 12 yards to the KC49. Tackled by Kurt Coleman and Daryl Worley.","(9:46) Spencer Ware rush to the right for 1 yard to the KC37. Tackled by Thomas Davis and Luke Kuechly.","(10:13) Alex Smith pass to the right to Tyreek Hill for 10 yards to the KC36. Tackled by James Bradberry.","(10:49) Alex Smith pass to the left to Spencer Ware for 1 yard to the KC26. Tackled by Luke Kuechly.","(10:49) Graham Gano kicks off to the endzone. Touchback.","(10:52) Graham Gano 42 yard field goal attempt is GOOD. Holder: Andy Lee.","(11:02) Cam Newton incomplete pass to the right intended for Fozzy Whittaker.","(11:44) Cam Newton rush to the right for 3 yards to the KC24. Tackled by Marcus Peters.","(12:24) Jonathan Stewart rush to the right for no gain to the KC27. Tackled by Frank Zombo and Dontari Poe.","(12:54) Cam Newton pass to the right to Ted Ginn Jr. for 14 yards to the KC27. Tackled by Marcus Peters.","(12:58) Cam Newton incomplete pass to the right intended for Ted Ginn Jr. defensed by Dontari Poe.","(13:32) Cam Newton rush to the left for 28 yards to the KC41. Tackled by Ron Parker.","(14:13) Cam Newton pass to the right to Greg Olsen for 8 yards to the Car31. Tackled by Eric Berry.","(14:52) Jonathan Stewart rush to the right for 1 yard to the Car23. Tackled by Eric Berry and Ramik Wilson.","(15:00) Cairo Santos kicks off to the Car-1. Fozzy Whittaker return for 23 yards to Car22. Tackled by D.J. Alexander and James O'Shaughnessy."]