["(0:02) Ben Roethlisberger pass to the left to Antonio Brown for 44 yards to the Dal20. Tackled by Byron Jones.","(0:02) Pittsburgh Steelers timeout.","(0:09) Ben Roethlisberger pass to the middle to Antonio Brown for 11 yards to the Pit36. Tackled by Anthony Brown.","(0:09) Dan Bailey kicks off to the endzone. Touchback.","(0:09) Dak Prescott 2 pt conversion pass is NO GOOD - intended for Dez Bryant.","(0:09) Dallas Cowboys timeout.","(0:15) Ezekiel Elliott rush up the middle for 32 yards for a TOUCHDOWN.","(0:23) Dak Prescott pass to the right to Jason Witten for 5 yards to the Pit47. Tackled by Ross Cockrell. Penalty: Face Mask on Pittsburgh (Sean Davis) 15 yards.","(0:23) Dallas Cowboys timeout.","(0:31) Dak Prescott pass to the right to Jason Witten for 13 yards to the Dal48. Tackled by Ryan Shazier and Stephon Tuitt.","(0:31) Dallas Cowboys timeout.","(0:37) Dak Prescott pass to the right to Cole Beasley for 10 yards to the Dal35. Tackled by William Gay.","(0:42) Dak Prescott incomplete pass to the right intended for Jason Witten.","(0:42) Chris Boswell kicks off to the endzone. Touchback.","(0:42) Ben Roethlisberger 2 pt conversion pass is NO GOOD - intended for Antonio Brown.","(0:43) Ben Roethlisberger pass to the right to Antonio Brown for 15 yards for a TOUCHDOWN.","(1:04) Ben Roethlisberger pass to the right to Jesse James for 24 yards to the Dal15. Tackled by Jeff Heath.","(1:04) Pittsburgh Steelers timeout.","(1:13) Ben Roethlisberger pass to the right to Le'Veon Bell for 23 yards to the Dal39. Tackled by Jeff Heath and J.J. Wilcox.","(1:34) Ben Roethlisberger pass to the middle to Ladarius Green for 10 yards to the Pit38. Tackled by Byron Jones.","(1:55) Ben Roethlisberger pass to the right to Antonio Brown for 3 yards to the Pit28. Tackled by Leon McFadden and Sean Lee.","(1:55) Dan Bailey kicks off to the endzone. Touchback.","(1:55) Dak Prescott 2 pt conversion pass is NO GOOD - intended for Dez Bryant.","(2:00) Ezekiel Elliott rush to the right for 14 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:50) Dak Prescott pass to the right to Jason Witten for 14 yards to the Pit14. Tackled by Ross Cockrell and Sean Davis.","(3:33) Ezekiel Elliott rush to the left for a loss of 6 yards to the Pit28. Tackled by Ryan Shazier.","(4:07) Dak Prescott pass to the middle to Cole Beasley for 8 yards to the Pit22. Tackled by Lawrence Timmons.","(4:49) Ezekiel Elliott rush up the middle for 2 yards to the Pit30. Tackled by Daniel McCullers and James Harrison.","(5:16) Dak Prescott pass to the right to Jason Witten for 9 yards to the Pit32. Tackled by Ross Cockrell.","(5:56) Dak Prescott pass to the right to Cole Beasley for no gain to the Pit41. Tackled by Sean Davis.","(6:40) Dak Prescott pass to the left to Ezekiel Elliott for 12 yards to the Pit41. Tackled by Ryan Shazier and William Gay.","(7:19) Ezekiel Elliott rush up the middle for 2 yards to the Dal47. Tackled by Lawrence Timmons and James Harrison.","(7:50) Dak Prescott pass to the right to Lucky Whitehead for 5 yards to the Dal30. Tackled by Arthur Moats. Penalty: Unnecessary Roughness on Pittsburgh (Ross Cockrell) 15 yards.","(7:51) Chris Boswell kicks off to the endzone. Touchback.","(7:51) Ben Roethlisberger 2 pt conversion pass is NO GOOD - intended for Fitzgerald Toussaint.","(7:56) Le'Veon Bell rush to the right for 1 yard for a TOUCHDOWN.","(8:39) Ben Roethlisberger pass to the left to Jesse James for 10 yards to the Dal1. Tackled by Justin Durant.","(9:15) Ben Roethlisberger pass to the right to Antonio Brown for 20 yards to the Dal11. Tackled by Byron Jones.","(9:48) Ben Roethlisberger pass to the left to Antonio Brown for 2 yards to the Dal31. Tackled by Brandon Carr.","(10:22) Ben Roethlisberger pass to the right to Antonio Brown for 12 yards to the Dal33. Tackled by Byron Jones.","(10:56) Le'Veon Bell rush to the left for 1 yard to the Dal45. Tackled by Justin Durant.","(11:09) Chris Jones punts for 48 yards to Pit32. Antonio Brown return for 22 yards to Dal46. Tackled by Chris Jones.","(11:53) Ezekiel Elliott rush to the left for no gain to the Dal20. Tackled by Sean Davis and Lawrence Timmons.","(12:37) Dak Prescott pass to the left to Jason Witten for 7 yards to the Dal20. Tackled by Lawrence Timmons.","(13:13) Ezekiel Elliott rush to the right for 2 yards to the Dal13. Tackled by James Harrison and Artie Burns.","(13:17) Jordan Berry punts for 46 yards to Dal11. No return.","(13:39) Ben Roethlisberger pass to the left to Le'Veon Bell for 6 yards to the Pit43. Tackled by Byron Jones and J.J. Wilcox.","(14:18) Ben Roethlisberger pass to the middle to Ladarius Green for 11 yards to the Pit37. Tackled by Sean Lee.","(15:00) Antonio Brown rush up the middle for a loss of 10 yards to the Pit26. Tackled by Demarcus Lawrence.","(0:08) Le'Veon Bell rush to the right for 2 yards to the Pit36. Tackled by Byron Jones.","(0:50) Ben Roethlisberger pass to the right to Le'Veon Bell for 6 yards to the Pit34. Tackled by Damien Wilson.","(1:35) Ben Roethlisberger pass to the right to Le'Veon Bell for 3 yards to the Pit28. Tackled by Terrell McClain and Sean Lee.","(1:35) Dan Bailey kicks off to the endzone. Touchback.","(1:35) Dan Bailey extra point is good.","(1:43) Dak Prescott pass to the left to Dez Bryant for 50 yards for a TOUCHDOWN.","(2:10) Penalty: Holding on Dallas (Ronald Leary) -10 yards.","(2:46) Alfred Morris rush up the middle for 2 yards to the Pit40. Tackled by Cameron Heyward.","(3:23) Ezekiel Elliott rush to the left for 7 yards to the Pit42. Tackled by Stephon Tuitt and Ryan Shazier.","(3:41) Jordan Berry punts for 57 yards to Dal12. Lucky Whitehead return for 39 yards to Pit49. Tackled by Roosevelt Nix.","(4:12) Ben Roethlisberger sacked at Pit31 for a loss of 8 yards by Demarcus Lawrence.","(4:54) Le'Veon Bell rush to the left for 3 yards to the Pit39. Tackled by Anthony Hitchens and J.J. Wilcox.","(5:27) Le'Veon Bell rush to the left for 4 yards to the Pit36. Tackled by Sean Lee.","(5:35) Dan Bailey kicks off to the Pit-1. Fitzgerald Toussaint return for 33 yards to Pit32.","(5:39) Dan Bailey 46 yard field goal attempt is GOOD. Holder: Chris Jones.","(6:22) Dak Prescott sacked at Pit28 for a loss of 12 yards by Stephon Tuitt.","(7:08) Dak Prescott pass to the left to Dez Bryant for 5 yards to the Pit16. Tackled by Artie Burns.","(7:12) Dak Prescott incomplete pass to the right intended for Cole Beasley.","(7:50) Dak Prescott pass to the left to Dez Bryant for 12 yards to the Pit21. Tackled by Artie Burns.","(7:50) Pittsburgh Steelers timeout.","(8:32) Alfred Morris rush up the middle for 3 yards to the Pit33. Tackled by James Harrison and Ryan Shazier.","(8:37) Dak Prescott incomplete pass to the middle intended for Dez Bryant.","(9:14) Ezekiel Elliott rush to the right for 6 yards to the Pit36. Tackled by Daniel McCullers and Mike Mitchell.","(9:59) Ezekiel Elliott rush up the middle for 3 yards to the Pit42. Tackled by Ross Cockrell and Mike Mitchell.","(10:39) Ezekiel Elliott rush up the middle for 6 yards to the Pit45. Tackled by Mike Mitchell and Ryan Shazier.","(11:15) Dak Prescott pass to the right to Jason Witten for 11 yards to the Dal49. Tackled by Ryan Shazier.","(11:55) Ezekiel Elliott rush to the right for 3 yards to the Dal38. Tackled by Lawrence Timmons.","(12:38) Ezekiel Elliott rush to the left for 3 yards to the Dal35. Tackled by Javon Hargrave and Cameron Heyward.","(13:05) Ezekiel Elliott rush up the middle for 6 yards to the Dal32. Tackled by Ross Cockrell and Lawrence Timmons.","(13:10) Chris Boswell kicks off to the Dal-4. Lucky Whitehead return for 30 yards to Dal26. Tackled by Tyler Matakevich and Vince Williams.","(13:14) Chris Boswell 25 yard field goal attempt is GOOD. Holder: Jordan Berry.","(13:17) Ben Roethlisberger incomplete pass to the middle intended for Antonio Brown.","(13:21) Ben Roethlisberger incomplete pass to the right intended for Eli Rogers.","(13:24) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown.","(13:29) Penalty: Pass Interference on Dallas (Anthony Brown) 28 yards.","(13:37) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown.","(14:16) Ben Roethlisberger rush up the middle for 1 yard to the Dal35. Tackled by Sean Lee.","(15:00) Ben Roethlisberger pass to the left to Cobi Hamilton for 39 yards to the Dal36. Tackled by Brandon Carr.","(15:00) Dan Bailey kicks off to the endzone. Touchback.","(0:02) 55 yard field goal attempt by Chris Boswell is NO GOOD. Holder: Jordan Berry.","(0:02) Pittsburgh Steelers timeout. Penalty: Holding on Dallas (Orlando Scandrick) 5 yards.","(0:13) Ben Roethlisberger pass to the left to Ladarius Green for 9 yards to the Dal42. Tackled by Byron Jones.","(0:20) Ben Roethlisberger pass to the right to Le'Veon Bell for 13 yards to the Pit49. Tackled by Anthony Brown.","(0:27) Chris Jones punts for 48 yards to Pit36. No return.","(0:33) Dak Prescott incomplete pass to the right intended for Cole Beasley defensed by Ross Cockrell.","(0:39) Dak Prescott incomplete pass to the right intended for Lance Dunbar.","(0:45) Dak Prescott incomplete pass to the right intended for Cole Beasley defensed by William Gay.","(0:51) Jordan Berry punts for 27 yards to Dal16. No return.","(0:52) Dallas Cowboys timeout.","(1:04) Ben Roethlisberger pass to the left to Le'Veon Bell for a loss of 3 yards to the Dal43. Tackled by Sean Lee and Tyrone Crawford.","(1:10) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(1:16) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates.","(1:43) Ben Roethlisberger pass to the left to Antonio Brown for 9 yards to the Dal40. Tackled by Orlando Scandrick.","(2:00) Ben Roethlisberger pass to the middle to Eli Rogers for 4 yards to the Dal49. Tackled by Orlando Scandrick.","(2:00) Two Minute Warning.","(2:10) Ben Roethlisberger pass to the left to Le'Veon Bell for 15 yards to the Pit47. Tackled by Orlando Scandrick.","(2:41) Ben Roethlisberger pass to the middle to Eli Rogers for 13 yards to the Pit32. Tackled by Orlando Scandrick.","(3:10) Le'Veon Bell rush to the right for 1 yard to the Pit19. Tackled by Sean Lee.","(3:17) Chris Jones punts for 49 yards to Pit18. No return.","(3:22) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(4:03) Ezekiel Elliott rush to the left for no gain to the Dal33. Tackled by James Harrison.","(4:43) Dak Prescott pass to the left to Cole Beasley for 8 yards to the Dal33. Tackled by Robert Golden.","(4:43) Chris Boswell kicks off to the endzone. Touchback.","(4:47) Chris Boswell 39 yard field goal attempt is GOOD. Holder: Jordan Berry.","(5:26) Ben Roethlisberger pass to the left to Xavier Grimble for 5 yards to the Dal21. Tackled by J.J. Wilcox.","(6:09) Le'Veon Bell rush to the left for a loss of 1 yard to the Dal26. Tackled by Sean Lee.","(6:13) Ben Roethlisberger incomplete pass to the middle intended for Ladarius Green.","(7:00) Ben Roethlisberger pass to the right to Antonio Brown for 13 yards to the Dal25. Tackled by Anthony Brown.","(7:38) Ben Roethlisberger pass to the right to Antonio Brown for no gain to the Dal38. Tackled by Anthony Brown.","(8:00) Penalty: Encroachment on Dallas (Terrell McClain) 5 yards.","(8:19) Penalty: False Start on Pittsburgh (David DeCastro) -5 yards.","(9:01) Le'Veon Bell rush up the middle for no gain to the Dal38. Tackled by Damien Wilson.","(9:06) Penalty: Roughing Passer on Dallas (Justin Durant) 15 yards.","(9:54) Le'Veon Bell rush to the left for 11 yards to the Pit47. Tackled by J.J. Wilcox and Byron Jones.","(10:29) Ben Roethlisberger pass to the left to Antonio Brown for 2 yards to the Pit36. Tackled by Byron Jones.","(11:04) Ben Roethlisberger pass to the right to Antonio Brown for 9 yards to the Pit34. Tackled by J.J. Wilcox.","(11:04) Dan Bailey kicks off to the endzone. Touchback.","(11:09) Dan Bailey 53 yard field goal attempt is GOOD. Holder: Chris Jones.","(11:15) Dak Prescott incomplete pass to the right intended for Cole Beasley.","(12:02) Alfred Morris rush to the left for 6 yards to the Pit35. Tackled by Jarvis Jones.","(12:46) Dak Prescott pass to the left to Alfred Morris for 6 yards to the Pit41. Tackled by Jarvis Jones.","(13:09) Penalty: Holding on Dallas (Doug Free) -10 yards.","(13:29) Penalty: Offside on Pittsburgh (Cameron Heyward) 5 yards.","(13:53) Dak Prescott pass to the left to Dez Bryant for 16 yards to the Pit42.","(14:28) Alfred Morris rush to the left for 2 yards to the Dal42. Tackled by Anthony Chickillo and Jarvis Jones.","(14:38) Jordan Berry punts for 44 yards to Dal35. Lucky Whitehead return for 5 yards to Dal40. Tackled by Tyler Matakevich and Arthur Moats.","(15:00) Le'Veon Bell rush to the right for a loss of 2 yards to the Pit28. Tackled by Demarcus Lawrence. FUMBLE, recovered by Pit.","(0:03) Ben Roethlisberger pass to the left to Antonio Brown for 9 yards to the Pit30. Tackled by Brandon Carr.","(0:07) Ben Roethlisberger incomplete pass to the right intended for Xavier Grimble defensed by J.J. Wilcox.","(0:12) Dan Bailey kicks off to the Pit4. Fitzgerald Toussaint return for 17 yards to Pit21. Tackled by Kavon Frazier and Lance Dunbar.","(0:12) Dan Bailey extra point is good.","(0:27) Dak Prescott pass to the right to Ezekiel Elliott for 83 yards for a TOUCHDOWN.","(0:44) Dak Prescott pass to the left to Cole Beasley for 7 yards to the Dal17. Tackled by Ryan Shazier and Artie Burns.","(1:13) Penalty: Holding on Dallas (Zack Martin) -10 yards.","(1:13) Penalty: False Start on Dallas (Tyron Smith) -5 yards.","(1:13) Chris Boswell kicks off to the endzone. Touchback.","(1:13) Ben Roethlisberger 2 pt conversion pass is NO GOOD - intended for Jesse James.","(1:18) Ben Roethlisberger pass to the left to Eli Rogers for 3 yards for a TOUCHDOWN.","(2:02) Le'Veon Bell rush to the right for a loss of 2 yards to the Dal3. Tackled by Byron Jones.","(2:26) Le'Veon Bell rush up the middle for 8 yards to the Dal1. Tackled by Terrell McClain and Anthony Brown.","(3:04) Le'Veon Bell rush up the middle for 16 yards to the Dal9. Tackled by Byron Jones and Anthony Hitchens.","(3:11) Penalty: Offside on Dallas (Ryan Davis) 5 yards.","(3:45) Le'Veon Bell rush up the middle for 1 yard to the Dal30. Tackled by Demarcus Lawrence.","(4:17) Ben Roethlisberger pass to the right to Jesse James for 17 yards to the Dal31. Tackled by Anthony Hitchens.","(4:45) Ben Roethlisberger pass to the left to Eli Rogers for 22 yards to the Dal48. Tackled by J.J. Wilcox.","(5:17) Ben Roethlisberger pass to the right to Antonio Brown for 5 yards to the Pit30. Tackled by Anthony Brown.","(5:17) Dan Bailey kicks off to the endzone. Touchback.","(5:20) Dan Bailey 37 yard field goal attempt is GOOD. Holder: Chris Jones.","(6:01) Dak Prescott pass to the left to Terrance Williams for 5 yards to the Pit18. Tackled by Ryan Shazier and Anthony Chickillo.","(6:05) Dak Prescott incomplete pass to the left intended for Jason Witten.","(6:07) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(6:41) Ezekiel Elliott rush up the middle for 4 yards to the Pit23. Tackled by Jarvis Jones.","(7:19) Ezekiel Elliott rush to the left for 7 yards to the Pit27. Tackled by Sean Davis.","(7:35) Penalty: False Start on Dallas (Ronald Leary) -5 yards.","(8:09) Ezekiel Elliott rush up the middle for 6 yards to the Pit29. Tackled by Sean Davis and Mike Mitchell.","(8:44) Dak Prescott pass to the left to Dez Bryant for 14 yards to the Pit35. Tackled by Artie Burns.","(9:16) Ezekiel Elliott rush to the right for 8 yards to the Pit49. Tackled by Sean Davis.","(9:54) Ezekiel Elliott rush up the middle for 3 yards to the Dal43. Tackled by Vince Williams and Anthony Chickillo.","(9:54) Chris Boswell kicks off to the Dal6, out of bounds. No return.","(9:54) Ben Roethlisberger 2 pt conversion pass is NO GOOD - intended for Ladarius Green.","(9:54) Ben Roethlisberger pass to the right to Le'Veon Bell for 2 yards for a TOUCHDOWN.","(10:01) Ben Roethlisberger incomplete pass to the left intended for Le'Veon Bell.","(10:43) Le'Veon Bell rush to the right for 2 yards to the Dal2. Tackled by J.J. Wilcox.","(11:25) Ben Roethlisberger pass to the right to David Johnson for 2 yards to the Dal4. Tackled by J.J. Wilcox.","(12:08) Le'Veon Bell rush to the left for 8 yards to the Dal6. Tackled by Byron Jones and Terrell McClain.","(12:39) Ben Roethlisberger pass to the right to Le'Veon Bell for 12 yards to the Dal14. Tackled by Orlando Scandrick and Sean Lee.","(13:11) Le'Veon Bell rush to the right for 4 yards to the Dal26. Tackled by Anthony Hitchens.","(13:45) Ben Roethlisberger pass to the middle to Jesse James for 8 yards to the Dal30. Tackled by Anthony Hitchens.","(13:55) Dak Prescott sacked at Dal38 for a loss of 12 yards by Anthony Chickillo. FUMBLE, recovered by Pit (Ryan Shazier). Tackled by Zack Martin.","(14:25) Dak Prescott pass to the left to Dez Bryant for 19 yards to the Dal50. Tackled by Artie Burns.","(15:00) Ezekiel Elliott rush to the right for 6 yards to the Dal31. Tackled by Robert Golden and Mike Mitchell.","(15:00) Chris Boswell kicks off to the endzone. Touchback."]