["(0:38) Alex Smith rush up the middle for a loss of 1 yard to the KC33.","(1:12) Alex Smith rush up the middle for a loss of 1 yard to the KC34.","(1:53) Alex Smith rush up the middle for a loss of 1 yard to the KC35.","(1:53) Atlanta Falcons timeout.","(2:00) Alex Smith pass to the right to Albert Wilson for 10 yards to the KC36. Tackled by Ricardo Allen.","(2:00) Two Minute Warning.","(2:14) Spencer Ware rush to the left for 4 yards to the KC26. Tackled by Deion Jones.","(2:56) Spencer Ware rush to the right for no gain to the KC22. Tackled by Jonathan Babineaux.","(3:42) Alex Smith pass to the left to Travis Kelce for 14 yards to the KC22. Tackled by Jalen Collins.","(4:24) Spencer Ware rush to the right for no gain to the KC8. Tackled by De'Vondre Campbell.","(4:32) Matt Bosher kicks off to the KC1. De'Anthony Thomas return for 15 yards to KC16. Tackled by Kemal Ishmael. Penalty: Illegal Block on Kansas City (Terrance Smith) -8 yards.","(4:32) Matt Ryan pass intercepted on a 2 pt conversion attempt intended for Austin Hooper by Eric Berry. Returned by Eric Berry for 2 pts.","(4:37) Matt Ryan pass to the left to Aldrick Robinson for 5 yards for a TOUCHDOWN.","(4:46) Matt Ryan incomplete pass to the middle intended for Justin Hardy.","(5:24) Matt Ryan rush to the right for 12 yards to the KC5. Tackled by Daniel Sorensen.","(5:29) Matt Ryan incomplete pass to the right intended for Aldrick Robinson defensed by Marcus Peters.","(6:13) Matt Ryan rush to the left for 1 yard to the KC17. Tackled by Jarvis Jenkins.","(6:57) Matt Ryan pass to the left to Levine Toilolo for 42 yards to the KC18. Tackled by Frank Zombo.","(6:57) Atlanta Falcons timeout.","(7:43) Tevin Coleman rush to the right for 4 yards to the Atl40. Tackled by Derrick Johnson.","(8:20) Tevin Coleman rush to the right for 5 yards to the Atl36. Tackled by Justin Houston.","(8:52) Tevin Coleman rush to the left for 4 yards to the Atl31. Tackled by Daniel Sorensen.","(9:25) Tevin Coleman rush to the right for 7 yards to the Atl27. Tackled by Ramik Wilson.","(9:34) Dustin Colquitt punts for 61 yards to Atl0. Touchback.","(9:40) Alex Smith incomplete pass to the left intended for Spencer Ware.","(10:21) Alex Smith pass to the middle to Albert Wilson for 8 yards to the KC39. Tackled by Ricardo Allen and Deion Jones.","(10:26) Alex Smith incomplete pass to the left intended for Chris Conley defensed by Jalen Collins.","(11:10) Alex Smith pass to the middle to Tyreek Hill for 5 yards to the KC31. Tackled by Deion Jones and Keanu Neal.","(11:51) Spencer Ware rush to the right for 5 yards to the KC26. Tackled by Tyson Jackson.","(11:57) Matt Bosher kicks off to the KC2. De'Anthony Thomas return for 19 yards to KC21. Tackled by Brooks Reed.","(11:57) Matt Ryan 2 pt conversion pass is NO GOOD - intended for Devonta Freeman.","(12:01) Devonta Freeman rush to the right for 1 yard for a TOUCHDOWN.","(12:33) Matt Ryan pass to the left to Taylor Gabriel for 14 yards to the KC1. Tackled by Terrance Mitchell.","(12:46) Penalty: Offside on Kansas City (Dee Ford) 5 yards.","(13:32) Tevin Coleman rush to the right for a loss of 1 yard to the KC20. Tackled by Derrick Johnson and Dee Ford.","(14:12) Devonta Freeman rush to the left for 2 yards to the KC19. Tackled by Ramik Wilson.","(14:38) Devonta Freeman rush to the left for 13 yards to the KC21. Tackled by Ramik Wilson.","(15:00) Devonta Freeman rush to the left for 4 yards to the KC34. Tackled by Frank Zombo.","(0:20) Tevin Coleman rush to the left for 2 yards to the KC38. Tackled by Ramik Wilson.","(0:37) Tevin Coleman rush to the right for 6 yards to the KC40. Tackled by Kendall Reyes.","(1:08) Matt Ryan pass to the right to Julio Jones for 20 yards to the KC46.","(1:30) Penalty: False Start on Atlanta (Justin Hardy) -5 yards.","(2:08) Matt Ryan pass to the left to Julio Jones for 21 yards to the Atl39. Tackled by Eric Berry.","(2:27) Penalty: Illegal Use of Hands on Kansas City (Chris Jones) 5 yards.","(3:09) Matt Ryan sacked at Atl13 for a loss of 7 yards by Tamba Hali.","(3:18) Dustin Colquitt punts for 45 yards to Atl0. Touchback.","(3:58) Alex Smith pass to the middle to Travis Kelce for 3 yards to the Atl45. Tackled by Grady Jarrett.","(4:16) Penalty: Offside on Atlanta (Dwight Freeney) 5 yards.","(4:53) Penalty: False Start on Kansas City (Eric Fisher) -5 yards.","(4:57) Penalty: Holding on Kansas City (Eric Fisher) -10 yards.","(5:37) Spencer Ware rush to the right for 3 yards to the Atl38. Tackled by Deion Jones and Grady Jarrett.","(6:16) Alex Smith pass to the middle to Travis Kelce for 5 yards to the Atl41. Tackled by Deion Jones.","(7:02) Alex Smith pass to the right to Tyreek Hill for 25 yards to the Atl46. Tackled by Keanu Neal.","(7:29) Spencer Ware rush to the left for 2 yards to the KC29. Tackled by Deion Jones.","(8:09) Spencer Ware rush to the left for a loss of 2 yards to the KC27. Tackled by Brian Poole.","(8:54) Alex Smith pass to the right to Travis Kelce for 19 yards to the KC29. Tackled by Ricardo Allen and Keanu Neal.","(9:00) Matt Ryan incomplete pass to the right intended for Devonta Freeman defensed by Frank Zombo.","(9:48) Matt Ryan pass to the right to Taylor Gabriel for 9 yards to the KC10. Tackled by Steven Nelson.","(9:54) Matt Ryan incomplete pass to the left intended for Tevin Coleman defensed by Steven Nelson.","(9:58) Matt Ryan incomplete pass to the right intended for Tevin Coleman.","(10:30) Matt Ryan pass to the left to Julio Jones for 20 yards to the KC19. Tackled by Steven Nelson.","(11:06) Tevin Coleman rush to the right for 9 yards to the KC39. Tackled by Jarvis Jenkins.","(11:51) Devonta Freeman rush to the right for a loss of 5 yards to the KC48. Tackled by Kendall Reyes.","(12:16) Matt Ryan pass to the middle to Mohamed Sanu for 18 yards to the KC43. Tackled by Steven Nelson.","(12:45) Devonta Freeman rush to the right for 14 yards to the Atl39. Tackled by Ramik Wilson.","(12:52) Matt Ryan incomplete pass to the right.","(12:52) Cairo Santos kicks off to the endzone. Touchback.","(12:52) Cairo Santos extra point is good.","(13:02) Albert Wilson rush to the right for 55 yards for a TOUCHDOWN.","(13:02) Atlanta Falcons timeout.","(13:27) Alex Smith pass to the right to Tyreek Hill for 7 yards to the KC45. Tackled by Robert Alford.","(14:12) Alex Smith pass to the left to Spencer Ware for 6 yards to the KC38. Tackled by Brian Poole.","(14:54) Spencer Ware rush to the left for a loss of 4 yards to the KC32. Tackled by Philip Wheeler.","(15:00) Matt Bosher kicks off to the KC6. De'Anthony Thomas return for 30 yards to KC36. Tackled by Matt Bosher.","(0:02) Matt Bryant 59 yard field goal attempt is GOOD. Holder: Matt Bosher.","(0:02) Atlanta Falcons timeout.","(0:06) Matt Ryan pass to the left to Taylor Gabriel for 9 yards to the KC42. Tackled by Derrick Johnson.","(0:06) Kansas City Chiefs timeout.","(0:13) Matt Ryan rush to the right for 10 yards to the Atl49. Tackled by Derrick Johnson.","(0:17) Matt Ryan incomplete pass to the right intended for Austin Hooper defensed by Daniel Sorensen.","(0:37) Matt Ryan pass to the right to Devonta Freeman for 14 yards to the Atl39. Tackled by Daniel Sorensen.","(0:37) Cairo Santos kicks off to the endzone. Touchback.","(0:37) Cairo Santos extra point is good.","(0:48) Matt Ryan pass intended for Taylor Gabriel INTERCEPTED by Eric Berry and returned for 37 yards for a TOUCHDOWN.","(1:00) Dustin Colquitt punts for 44 yards to Atl26. Eric Weems return for a loss of 1 yard to Atl25. Tackled by D.J. Alexander.","(1:00) Atlanta Falcons timeout.","(1:07) Alex Smith pass to the left to Albert Wilson for 9 yards to the KC30. Tackled by Robenson Therezie.","(1:07) Kansas City Chiefs timeout.","(1:56) Alex Smith pass to the middle to Demetrius Harris for 6 yards to the KC21. Tackled by Brian Poole.","(2:00) Penalty: Pass Interference on Kansas City (Demetrius Harris) -10 yards.","(2:00) Two Minute Warning.","(2:37) Charcandrick West rush to the left for no gain to the KC25. Tackled by Ben Garland.","(3:17) Alex Smith pass to the right to Spencer Ware for 14 yards to the KC25. Tackled by Robert Alford.","(3:26) Matt Bosher punts for 46 yards to KC12. Tyreek Hill return for a loss of 1 yard to KC11. Tackled by C.J. Goodwin.","(3:32) Matt Ryan incomplete pass to the right intended for Julio Jones.","(4:14) Devonta Freeman rush to the left for 3 yards to the Atl42. Tackled by Ramik Wilson.","(4:51) Devonta Freeman rush to the right for 2 yards to the Atl39. Tackled by Derrick Johnson.","(5:19) Matt Ryan pass to the left to Justin Hardy for 5 yards to the Atl37. Tackled by Terrance Mitchell.","(6:05) Matt Ryan pass to the right to Taylor Gabriel for 9 yards to the Atl32. Tackled by Marcus Peters.","(6:27) Penalty: Illegal Plyr Downfld on Atlanta (Ryan Schraeder) -5 yards.","(7:05) Matt Ryan pass to the middle to Mohamed Sanu for 8 yards to the Atl28. Tackled by Steven Nelson.","(7:05) Penalty: False Start on Atlanta (Patrick DiMarco) -5 yards.","(7:05) Cairo Santos kicks off to the endzone. Touchback.","(7:05) Cairo Santos extra point is good.","(7:10) Alex Smith pass to the left to Spencer Ware for 3 yards for a TOUCHDOWN.","(7:10) Kansas City Chiefs timeout.","(7:54) Alex Smith pass to the right to Tyreek Hill for 3 yards to the Atl3. Tackled by Kemal Ishmael and Ricardo Allen.","(8:40) Tyreek Hill rush to the left for 6 yards to the Atl6. Tackled by De'Vondre Campbell and Keanu Neal.","(9:20) Spencer Ware rush to the left for no gain to the Atl12. Tackled by Ra'Shede Hageman and De'Vondre Campbell.","(9:52) Alex Smith pass to the left to Travis Kelce for 27 yards to the Atl12. Tackled by Ricardo Allen.","(10:28) Spencer Ware rush to the right for 4 yards to the Atl39. Tackled by Tyson Jackson.","(11:07) Alex Smith pass to the right to Travis Kelce for 16 yards to the Atl43. Tackled by LaRoy Reynolds.","(11:52) Alex Smith pass to the middle to Albert Wilson for 21 yards to the KC41. Tackled by Brian Poole.","(11:57) Alex Smith incomplete pass to the right intended for Chris Conley.","(12:38) Spencer Ware rush to the left for a loss of 1 yard to the KC20. Tackled by De'Vondre Campbell.","(13:17) Alex Smith pass to the left to Tyreek Hill for 13 yards to the KC21. Tackled by Keanu Neal.","(13:25) Matt Bosher kicks off to the KC-3. De'Anthony Thomas return for 19 yards to KC16. Tackled by C.J. Goodwin. Penalty: Holding on Kansas City (D.J. Alexander) -8 yards.","(13:29) Matt Bryant 22 yard field goal attempt is GOOD. Holder: Matt Bosher.","(13:33) Matt Ryan incomplete pass to the middle intended for Justin Hardy.","(14:14) Devonta Freeman rush to the left for a loss of 2 yards to the KC4. Tackled by Tamba Hali.","(14:22) Matt Ryan incomplete pass to the right intended for Mohamed Sanu.","(15:00) Devonta Freeman rush to the right for 2 yards to the KC2. Tackled by Dontari Poe.","(0:52) Penalty: Too Many Men on Field on Kansas City (Ramik Wilson) 5 yards.","(0:58) Devonta Freeman rush to the left for 4 yards to the KC9. Tackled by Ramik Wilson.","(1:22) Devonta Freeman rush to the left for 3 yards to the KC18. Tackled by T.J. Barnes. Penalty: Illegal Use of Hands on Kansas City (Jarvis Jenkins) 5 yards.","(1:47) Matt Ryan pass to the right to Devonta Freeman for 7 yards to the KC21. Tackled by Ramik Wilson.","(2:14) Matt Ryan pass to the middle to Aldrick Robinson for 13 yards to the KC28. Tackled by Steven Nelson.","(2:45) Matt Ryan pass to the right to Devonta Freeman for 16 yards to the KC41. Tackled by Ron Parker.","(2:51) Matt Ryan incomplete pass to the right intended for Julio Jones.","(3:06) Alex Smith sacked at Atl43 for a loss of 4 yards by Vic Beasley Jr.. FUMBLE, recovered by Atl (Grady Jarrett). Tackled by Albert Wilson.","(3:47) Spencer Ware rush to the right for 7 yards to the Atl39. Tackled by Jonathan Babineaux and Deion Jones.","(3:51) Alex Smith incomplete pass to the right intended for Tyreek Hill.","(4:25) De'Anthony Thomas rush to the left for 23 yards to the Atl46. Tackled by Ricardo Allen.","(5:05) Spencer Ware rush to the left for 8 yards to the KC31. Tackled by Keanu Neal and Ricardo Allen.","(5:11) Matt Bosher kicks off to the KC1. De'Anthony Thomas return for 22 yards to KC23. Tackled by Eric Weems.","(5:15) Matt Bryant 22 yard field goal attempt is GOOD. Holder: Matt Bosher.","(5:53) Matt Ryan sacked at KC4 for no gain by Justin Houston.","(6:36) Tevin Coleman rush to the right for 3 yards to the KC4. Tackled by Derrick Johnson.","(7:14) Tevin Coleman rush to the right for 4 yards to the KC7. Tackled by Derrick Johnson.","(7:22) Penalty: Roughing Passer on Kansas City (Chris Jones) 11 yards.","(7:30) Penalty: Pass Interference on Kansas City (Eric Berry) 40 yards.","(7:35) Penalty: Offside on Kansas City (Rakeem Nunez-Roches) 5 yards.","(8:00) Tevin Coleman rush to the left for 8 yards to the Atl33. Tackled by Derrick Johnson.","(8:00) Cairo Santos kicks off to the endzone. Touchback.","(8:00) Cairo Santos extra point is BLOCKED.","(8:06) Spencer Ware rush to the left for 3 yards for a TOUCHDOWN.","(8:34) Alex Smith pass to the left to Travis Kelce for 35 yards to the Atl3. Tackled by Keanu Neal.","(9:15) Alex Smith pass to the left to Travis Kelce for 21 yards to the Atl38. Tackled by De'Vondre Campbell.","(9:54) Tyreek Hill rush to the right for 13 yards to the KC41. Tackled by Ricardo Allen.","(10:02) Matt Bosher kicks off to the KC3. De'Anthony Thomas return for 25 yards to KC28. Tackled by Joshua Perkins.","(10:02) Matt Bryant extra point is good.","(10:05) Devonta Freeman rush to the right for 1 yard for a TOUCHDOWN.","(10:09) Penalty: Pass Interference on Kansas City (Daniel Sorensen) 11 yards.","(10:49) Matt Ryan pass to the right to Julio Jones for 8 yards to the KC12. Tackled by Steven Nelson.","(11:20) Tevin Coleman rush to the right for a loss of 2 yards to the KC20. Tackled by Justin Houston.","(11:36) Matt Ryan pass to the left to Taylor Gabriel for 3 yards to the KC8. Tackled by Dontari Poe. Penalty: Holding on Atlanta (Jake Matthews) -10 yards.","(12:15) Matt Ryan pass to the middle to Devonta Freeman for 12 yards to the KC11. Tackled by Justin Houston.","(12:46) Devonta Freeman rush to the right for 5 yards to the KC23. Tackled by Ramik Wilson and Rakeem Nunez-Roches.","(13:13) Devonta Freeman rush to the left for 9 yards to the KC28. Tackled by Daniel Sorensen.","(13:43) Matt Ryan pass to the left to Julio Jones for 17 yards to the KC37. Tackled by Eric Berry and Daniel Sorensen.","(14:19) Matt Ryan pass to the right to Julio Jones for 16 yards to the Atl46. Tackled by Derrick Johnson.","(14:53) Matt Ryan pass to the middle to Julio Jones for 11 yards to the Atl30. Tackled by Ron Parker.","(15:00) Cairo Santos kicks off to the Atl2. Eric Weems return for 17 yards to Atl19. Tackled by Demetrius Harris."]