["(0:10) Tyrod Taylor pass to the left to Robert Woods for 10 yards to the Buf25. Lateral to Marquise Goodwin for 18 yards to the Buf43. Tackled by David Harris.","(0:18) Lachlan Edwards punts for 35 yards to Buf15. No return.","(0:18) New York Jets timeout.","(1:03) Matt Forte rush to the left for no gain to the NYJ50. Tackled by Lorenzo Alexander.","(1:03) Buffalo Bills timeout.","(1:10) Matt Forte rush to the right for 3 yards to the NYJ50. Tackled by Zach Brown and Ronald Darby.","(1:10) Buffalo Bills timeout.","(1:15) Matt Forte rush to the left for 2 yards to the NYJ47. Tackled by Zach Brown.","(1:17) Dan Carpenter onside kickoff to the NYJ48. Onside kick recovered by receiving team by Brandon Marshall.","(1:17) Dan Carpenter extra point is good.","(1:22) Tyrod Taylor pass to the right to Mike Gillislee for 18 yards for a TOUCHDOWN.","(1:29) Tyrod Taylor incomplete pass to the left intended for Greg Salas defensed by Buster Skrine.","(1:35) Tyrod Taylor pass to the right to Charles Clay for 11 yards to the NYJ18. Tackled by Marcus Gilchrist.","(2:00) Tyrod Taylor rush up the middle for 10 yards to the NYJ29. Tackled by Darrelle Revis.","(2:00) Two Minute Warning.","(2:23) Tyrod Taylor pass to the left to Greg Salas for 3 yards to the NYJ39. Tackled by Marcus Williams.","(2:54) Tyrod Taylor pass to the right to Greg Salas for 4 yards to the NYJ42. Tackled by Darron Lee.","(3:00) Tyrod Taylor pass to the left to LeSean McCoy for 8 yards to the NYJ46. Tackled by Darron Lee.","(3:25) Tyrod Taylor pass to the left to Greg Salas for 11 yards to the Buf46. Tackled by Marcus Williams.","(3:29) Tyrod Taylor incomplete pass to the right intended for Charles Clay.","(3:57) Tyrod Taylor pass to the middle to LeSean McCoy for 10 yards to the Buf35. Tackled by Sheldon Richardson.","(4:02) Nick Folk kicks off to the Buf12. Brandon Tate return for 13 yards to Buf25. Tackled by Josh Martin.","(4:02) Nick Folk extra point is good.","(4:07) Matt Forte rush to the left for 12 yards for a TOUCHDOWN.","(4:52) Matt Forte rush up the middle for 6 yards to the Buf12. Tackled by Corbin Bryant and Jerel Worthy.","(5:35) Matt Forte rush to the left for 7 yards to the Buf18. Tackled by Kyle Williams and Preston Brown.","(6:19) Ryan Fitzpatrick pass to the left to Eric Decker for 27 yards to the Buf25. Tackled by Nickell Robey-Coleman.","(7:03) Matt Forte rush to the right for 4 yards to the NYJ48. Tackled by Zach Brown and Preston Brown.","(7:11) LeSean McCoy rush to the left for no gain to the NYJ45. Tackled by Sheldon Richardson and Darron Lee.","(7:11) Buffalo Bills timeout.","(8:09) EJ Manuel rush up the middle for no gain to the NYJ45. Tackled by Leonard Williams. FUMBLE, recovered by Buf (EJ Manuel).","(8:29) Penalty: Offside on New York (Lorenzo Mauldin) 5 yards.","(9:10) LeSean McCoy rush to the right for a loss of 2 yards to the Buf50. Tackled by Darron Lee.","(9:53) LeSean McCoy rush to the left for 6 yards to the NYJ48. Tackled by Leonard Williams.","(10:34) LeSean McCoy rush up the middle for 24 yards to the Buf46. Tackled by Marcus Gilchrist.","(10:40) Nick Folk kicks off to the Buf-1. Brandon Tate return for 23 yards to Buf22. Tackled by Lawrence Thomas and Julian Stanford.","(10:40) Nick Folk 36 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(11:23) Ryan Fitzpatrick rush up the middle for 2 yards to the Buf18. Tackled by Preston Brown and Leger Douzable.","(11:53) Ryan Fitzpatrick pass to the right to Matt Forte for 3 yards to the Buf20. Tackled by Zach Brown.","(12:34) Matt Forte rush to the right for 1 yard to the Buf23. Tackled by Kyle Williams.","(13:16) Ryan Fitzpatrick pass to the right to Eric Decker for 35 yards to the Buf24. Tackled by Ronald Darby.","(14:03) Ryan Fitzpatrick pass to the left to Jalin Marshall for 27 yards to the NYJ41. Tackled by Stephon Gilmore and Zach Brown.","(14:09) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall defensed by Ronald Darby.","(14:52) Matt Forte rush to the right for 1 yard to the NYJ14. Tackled by Zach Brown.","(15:00) Tyrod Taylor pass intended for Sammy Watkins INTERCEPTED by Marcus Williams. No return. Tackled by Sammy Watkins.","(0:34) EJ Manuel pass to the left to Marquise Goodwin for 10 yards to the NYJ42. Tackled by Marcus Williams.","(1:11) LeSean McCoy rush to the right for a loss of 1 yard to the Buf48. Tackled by Muhammad Wilkerson.","(1:37) Penalty: Illegal Contact on New York (Marcus Williams) 5 yards.","(2:04) LeSean McCoy rush to the left for a loss of 3 yards to the Buf44. Tackled by David Harris.","(2:12) Nick Folk kicks off to the Buf2. Brandon Tate return for 45 yards to Buf47. Tackled by Juston Burris.","(2:12) Nick Folk extra point is good.","(2:17) Matt Forte rush up the middle for 3 yards for a TOUCHDOWN.","(2:38) Penalty: Too Many Men on Field on Buffalo 4 yards.","(3:19) Ryan Fitzpatrick pass to the middle to Jalin Marshall for 16 yards to the Buf7. Tackled by Aaron Williams.","(3:59) Ryan Fitzpatrick pass to the left to Matt Forte for 6 yards to the Buf23. Tackled by Stephon Gilmore.","(4:36) Ryan Fitzpatrick pass to the middle to Eric Decker for 17 yards to the Buf29. Tackled by Kevon Seymour and Aaron Williams.","(4:40) Ryan Fitzpatrick incomplete pass to the right intended for Eric Decker defensed by Ronald Darby.","(5:07) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 2 yards to the Buf46. Tackled by Nickell Robey-Coleman.","(5:49) Matt Forte rush up the middle for 11 yards to the Buf48. Tackled by Corey Graham.","(5:54) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(6:38) Ryan Fitzpatrick pass to the right to Brandon Marshall for 14 yards to the NYJ41. Tackled by Ronald Darby.","(7:20) Ryan Fitzpatrick pass to the right to Brandon Marshall for 3 yards to the NYJ27. Tackled by Ronald Darby and Jerry Hughes.","(8:00) Matt Forte rush to the left for 10 yards to the NYJ24. Tackled by Preston Brown.","(8:39) Matt Forte rush up the middle for a loss of 2 yards to the NYJ14. Tackled by Zach Brown and Preston Brown.","(8:47) Colton Schmidt punts for 45 yards to NYJ16. No return.","(8:52) Tyrod Taylor incomplete pass to the right intended for Charles Clay.","(8:58) Tyrod Taylor incomplete pass to the left intended for Sammy Watkins defensed by Marcus Williams.","(9:33) LeSean McCoy rush up the middle for 6 yards to the Buf39. Tackled by Leonard Williams.","(9:42) Lachlan Edwards punts for 47 yards to Buf25. Brandon Tate return for 8 yards to Buf33. Tackled by Julian Howsare.","(9:48) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(9:54) Ryan Fitzpatrick incomplete pass to the right intended for Eric Decker defensed by Ronald Darby.","(10:37) Ryan Fitzpatrick pass to the left to Brandon Marshall for 11 yards to the NYJ28. Tackled by Nickell Robey-Coleman.","(11:10) Penalty: Holding on New York (Ryan Clady) -10 yards.","(11:15) Dan Carpenter kicks off to the NYJ12. Julian Howsare return for 15 yards to NYJ27. Tackled by Jonathan Meeks and Lorenzo Alexander.","(11:15) Dan Carpenter extra point is good.","(11:15) Penalty: Offside on New York (Muhammad Wilkerson) 5 yards.","(11:28) Ryan Fitzpatrick pass to the right to Jalin Marshall for 2 yards to the NYJ35. Tackled by Preston Brown. FUMBLE, recovered by Buf (Nickell Robey-Coleman) and returned for 36 yards for a TOUCHDOWN.","(12:07) Matt Forte rush to the left for 2 yards to the NYJ33. Tackled by Corey Graham and Aaron Williams.","(12:42) Bilal Powell rush to the left for 2 yards to the NYJ31. Tackled by Nickell Robey-Coleman.","(13:22) Matt Forte rush to the left for 8 yards to the NYJ29. Tackled by Preston Brown and Leger Douzable.","(14:03) Matt Forte rush to the left for 1 yard to the NYJ21. Tackled by Zach Brown.","(14:09) Dan Carpenter kicks off to the NYJ1. Jalin Marshall return for 19 yards to NYJ20. Tackled by Robert Blanton.","(14:09) Dan Carpenter extra point is good.","(14:22) Tyrod Taylor pass to the right to Greg Salas for 71 yards for a TOUCHDOWN.","(14:28) Tyrod Taylor incomplete pass to the left intended for Sammy Watkins.","(15:00) Tyrod Taylor pass to the left to LeSean McCoy for 4 yards to the Buf29. Tackled by David Harris.","(15:00) Nick Folk kicks off to the endzone. Touchback.","(0:02) Ryan Fitzpatrick rush up the middle for a loss of 1 yard to the NYJ9.","(0:05) Dan Carpenter kicks off to the NYJ1. Jalin Marshall return for 9 yards to NYJ10. Tackled by Ramon Humber.","(0:10) Dan Carpenter 39 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(0:15) Tyrod Taylor incomplete pass to the right intended for LeSean McCoy.","(0:16) Tyrod Taylor incomplete pass to the middle.","(0:36) Tyrod Taylor pass to the left to LeSean McCoy for 9 yards to the NYJ21. Tackled by Darron Lee and Marcus Williams.","(0:36) Buffalo Bills timeout.","(0:41) EJ Manuel rush up the middle for 2 yards to the NYJ30. Tackled by Jarvis Jenkins.","(1:19) LeSean McCoy rush up the middle for 1 yard to the NYJ32. Tackled by Jarvis Jenkins and David Harris.","(1:23) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(1:28) Tyrod Taylor pass to the right to Charles Clay for 8 yards to the NYJ33.","(2:00) Tyrod Taylor pass to the right to Sammy Watkins for 11 yards to the NYJ41. Tackled by Calvin Pryor.","(2:00) Two Minute Warning.","(2:18) LeSean McCoy rush to the right for 4 yards to the Buf48. Tackled by Muhammad Wilkerson.","(2:56) Tyrod Taylor pass to the middle to Charles Clay for 4 yards to the Buf44. Tackled by David Harris.","(3:29) LeSean McCoy rush to the right for 6 yards to the Buf40. Tackled by Sheldon Richardson and Calvin Pryor.","(3:53) Tyrod Taylor pass to the left to Sammy Watkins for 9 yards to the Buf34. Tackled by Buster Skrine.","(3:53) Nick Folk kicks off to the endzone. Touchback.","(3:53) Nick Folk extra point is good.","(3:57) Ryan Fitzpatrick pass to the right to Eric Decker for 5 yards for a TOUCHDOWN.","(4:27) Ryan Fitzpatrick pass to the right to Eric Decker for 18 yards to the Buf5. Tackled by Aaron Williams.","(5:06) Matt Forte rush up the middle for no gain to the Buf23. Tackled by Kyle Williams and Zach Brown.","(5:31) Penalty: False Start on New York (Wesley Johnson) -5 yards.","(6:07) Ryan Fitzpatrick pass to the left to Brandon Marshall for 21 yards to the Buf18. Tackled by Stephon Gilmore.","(6:53) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 14 yards to the Buf39. Tackled by Corey Graham.","(7:09) Matt Forte rush to the left for 3 yards to the NYJ47. Tackled by Adolphus Washington and Preston Brown.","(7:47) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 21 yards to the NYJ44. Tackled by Duke Williams.","(7:54) Colton Schmidt punts for 40 yards to NYJ23. No return.","(8:23) LeSean McCoy rush to the right for 6 yards to the Buf37. Tackled by Jarvis Jenkins and Lorenzo Mauldin.","(8:51) Penalty: Holding on Buffalo (Nick O'Leary) -10 yards.","(8:59) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(9:25) Penalty: Holding on Buffalo (John Miller) -10 yards.","(9:29) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(10:05) LeSean McCoy rush up the middle for 10 yards to the NYJ49. Tackled by Marcus Gilchrist and Calvin Pryor.","(10:33) Tyrod Taylor rush to the right for 15 yards to the Buf41. Tackled by Calvin Pryor.","(11:07) LeSean McCoy rush to the right for 1 yard to the Buf26. Tackled by Darrelle Revis.","(11:07) Nick Folk kicks off to the endzone. Touchback.","(11:07) Nick Folk extra point is good.","(11:13) Matt Forte rush up the middle for 1 yard for a TOUCHDOWN.","(11:53) Matt Forte rush up the middle for 3 yards to the Buf1. Tackled by Corey Graham and Preston Brown.","(12:13) Ryan Fitzpatrick pass to the left to Brandon Marshall for 15 yards to the Buf8. Tackled by Stephon Gilmore. Penalty: Face Mask on Buffalo (Stephon Gilmore) 4 yards.","(12:58) Ryan Fitzpatrick rush to the left for 6 yards to the Buf23. Tackled by Nickell Robey-Coleman.","(13:01) Ryan Fitzpatrick incomplete pass to the left intended for Jalin Marshall.","(13:22) Ryan Fitzpatrick pass to the right to Brandon Marshall for 37 yards to the Buf29. Tackled by Ronald Darby.","(13:32) Colton Schmidt punts for 33 yards to NYJ34. No return.","(14:07) Tyrod Taylor pass to the right to Charles Clay for 6 yards to the Buf33. Tackled by Darrelle Revis.","(14:47) LeSean McCoy rush to the left for 1 yard to the Buf27. Tackled by Marcus Gilchrist.","(14:52) Tyrod Taylor incomplete pass to the right intended for Robert Woods.","(15:00) Nick Folk kicks off to the Buf4. Brandon Tate return for 22 yards to Buf26. Tackled by Antonio Allen.","(0:04) Nick Folk 29 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(0:42) Ryan Fitzpatrick pass to the middle to Bilal Powell for 1 yard to the Buf11. Tackled by Preston Brown and Zach Brown.","(1:23) Matt Forte rush up the middle for 6 yards to the Buf12. Tackled by Leger Douzable and Aaron Williams.","(1:59) Matt Forte rush to the left for 2 yards to the Buf18. Tackled by Preston Brown and Zach Brown.","(2:43) Ryan Fitzpatrick pass to the right to Eric Decker for 24 yards to the Buf20. Tackled by Duke Williams.","(2:48) Penalty: Pass Interference on Buffalo (Ronald Darby) 26 yards.","(2:48) Buffalo Bills timeout.","(3:15) Matt Forte rush to the right for a loss of 2 yards to the NYJ30. Tackled by Preston Brown and Jerry Hughes.","(3:48) Matt Forte rush to the right for 7 yards to the NYJ32. Tackled by Preston Brown and Zach Brown.","(4:27) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 11 yards to the NYJ25. Tackled by Stephon Gilmore.","(5:09) Matt Forte rush to the right for no gain to the NYJ14. Tackled by Kyle Williams and Zach Brown.","(5:16) Dan Carpenter kicks off to the NYJ3. Jalin Marshall return for 11 yards to NYJ14. Tackled by Lerentee McCray and Lorenzo Alexander.","(5:16) Dan Carpenter extra point is good.","(5:16) Tyrod Taylor pass to the right to Marquise Goodwin for 84 yards for a TOUCHDOWN. Penalty: Taunting on New York (Sheldon Richardson) 15 yards.","(6:05) Tyrod Taylor pass to the right to Charles Clay for a loss of 2 yards to the Buf16. Tackled by Muhammad Wilkerson.","(6:36) LeSean McCoy rush to the left for no gain to the Buf18. Tackled by Sheldon Richardson.","(6:41) Nick Folk kicks off to the Buf-4. Brandon Tate return for 22 yards to Buf18. Tackled by Julian Howsare.","(6:44) Nick Folk 28 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(6:51) Ryan Fitzpatrick incomplete pass to the middle intended for Bilal Powell.","(7:10) Penalty: False Start on New York (Brent Qvale) -5 yards.","(7:57) Ryan Fitzpatrick rush up the middle for 4 yards to the Buf5. Tackled by Jerry Hughes and Leger Douzable.","(8:39) Matt Forte rush up the middle for 4 yards to the Buf9. Tackled by Zach Brown and Preston Brown.","(9:20) Ryan Fitzpatrick rush up the middle for 10 yards to the Buf13. Tackled by Ronald Darby.","(9:24) Ryan Fitzpatrick incomplete pass to the right intended for Matt Forte.","(10:03) Matt Forte rush up the middle for 3 yards to the Buf23. Tackled by Kyle Williams and Adolphus Washington.","(10:42) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 10 yards to the Buf26. Tackled by Lorenzo Alexander.","(10:49) Ryan Fitzpatrick incomplete pass to the right intended for Kellen Davis defensed by Aaron Williams.","(11:30) Matt Forte rush to the right for 1 yard to the Buf36. Tackled by Lorenzo Alexander and Adolphus Washington.","(12:00) Penalty: Holding on Buffalo (Stephon Gilmore) 5 yards.","(12:51) Ryan Fitzpatrick sacked at Buf42 for a loss of 4 yards by Lorenzo Alexander. FUMBLE, recovered by NYJ (Kellen Davis).","(13:34) Matt Forte rush to the left for 3 yards to the Buf38. Tackled by Jerry Hughes and Preston Brown.","(14:11) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 34 yards to the Buf41. Tackled by Stephon Gilmore.","(14:54) Matt Forte rush to the right for no gain to the NYJ25. Tackled by Aaron Williams and Preston Brown.","(15:00) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Bostick.","(15:00) Dan Carpenter kicks off to the endzone. Touchback."]