["(0:08) Andy Dalton pass to the right to Giovani Bernard for 7 yards to the Cin27. FUMBLE, recovered by Pit (Cameron Heyward) and returned for 1 yard. Tackled by Giovani Bernard.","(0:14) Jordan Berry punts for 49 yards to Cin0. Touchback.","(1:01) Penalty: Delay of Game on Pittsburgh (Jordan Berry) -5 yards.","(1:01) DeAngelo Williams rush to the right for a loss of 3 yards to the Cin44. Tackled by Karlos Dansby.","(1:45) DeAngelo Williams rush up the middle for 6 yards to the Cin41. Tackled by Shawn Williams.","(1:45) Cincinnati Bengals timeout.","(1:50) DeAngelo Williams rush up the middle for a loss of 1 yard to the Cin47. Tackled by Karlos Dansby and Domata Peko.","(2:00) Andy Dalton pass to the right to Tyler Boyd for 6 yards to the Pit33. Tackled by James Harrison. FUMBLE, recovered by Pit (Robert Golden) and returned for 21 yards. Tackled by Giovani Bernard.","(2:00) Two Minute Warning.","(2:14) Andy Dalton pass to the right to Brandon LaFell for 17 yards to the Pit39. Tackled by Robert Golden and Mike Mitchell.","(2:20) Giovani Bernard rush to the right for 10 yards to the Cin44. Tackled by Artie Burns.","(2:56) Andy Dalton pass to the right to Brandon LaFell for 9 yards to the Cin34. Tackled by Artie Burns and Ryan Shazier.","(3:00) Andy Dalton incomplete pass to the middle intended for Tyler Kroft.","(3:12) Jordan Berry punts for 58 yards to Cin13. Adam Jones return for 12 yards to Cin25. Tackled by Tyler Matakevich and Robert Golden.","(3:16) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(3:16) Cincinnati Bengals timeout.","(3:20) DeAngelo Williams rush up the middle for 1 yard to the Pit29. Tackled by Domata Peko and Vincent Rey.","(3:20) Cincinnati Bengals timeout.","(3:25) DeAngelo Williams rush up the middle for 3 yards to the Pit28. Tackled by George Iloka.","(3:25) Mike Nugent kicks off to the endzone. Touchback.","(3:25) Mike Nugent extra point is good.","(3:34) Andy Dalton pass to the left to Giovani Bernard for 25 yards for a TOUCHDOWN.","(3:42) Andy Dalton rush to the left for 2 yards to the Pit25. Tackled by Stephon Tuitt.","(4:17) Andy Dalton pass to the right to James Wright for 10 yards to the Pit27. Tackled by Sean Davis.","(4:46) Andy Dalton pass to the middle to Jeremy Hill for 8 yards to the Pit37. Tackled by William Gay and Arthur Moats.","(5:19) Andy Dalton pass to the right to C.J. Uzomah for 2 yards to the Pit45. Tackled by Ross Cockrell.","(5:48) Andy Dalton pass to the right to Giovani Bernard for 9 yards to the Pit47. Tackled by Stephon Tuitt.","(6:19) Andy Dalton pass to the middle to Giovani Bernard for 12 yards to the Cin44. Tackled by Robert Golden and Ryan Shazier.","(6:48) Andy Dalton pass to the left to Giovani Bernard for 7 yards to the Cin32. Tackled by Ryan Shazier.","(6:48) Chris Boswell kicks off to the endzone. Touchback.","(6:48) Chris Boswell extra point is good.","(6:53) Ben Roethlisberger pass to the left to DeAngelo Williams for 4 yards for a TOUCHDOWN.","(6:53) Pittsburgh Steelers timeout.","(6:59) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown defensed by Karlos Dansby.","(7:40) DeAngelo Williams rush up the middle for 1 yard to the Cin4. Tackled by Karlos Dansby.","(8:28) Ben Roethlisberger rush to the left for 14 yards to the Cin5. Tackled by Michael Johnson.","(9:03) DeAngelo Williams rush up the middle for 1 yard to the Cin19. Tackled by Carlos Dunlap.","(9:43) Fitzgerald Toussaint rush up the middle for 4 yards to the Cin20. Tackled by Rey Maualuga.","(10:23) Ben Roethlisberger pass to the right to Darrius Heyward-Bey for 7 yards to the Cin24. Tackled by Dre Kirkpatrick and Margus Hunt.","(11:06) Ben Roethlisberger pass to the right to DeAngelo Williams for 20 yards to the Cin31. Tackled by Shawn Williams.","(11:46) DeAngelo Williams rush to the right for a loss of 3 yards to the Pit49. Tackled by Margus Hunt.","(12:21) Ben Roethlisberger pass to the left to Antonio Brown for 17 yards to the Cin48.","(13:00) DeAngelo Williams rush to the left for no gain to the Pit35. Tackled by Adam Jones.","(13:42) Ben Roethlisberger pass to the right to Antonio Brown for 3 yards to the Pit35. Tackled by Rey Maualuga.","(13:49) Kevin Huber punts for 43 yards to Pit32. No return.","(13:54) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(14:36) Jeremy Hill rush to the right for 3 yards to the Cin25. Tackled by Cameron Heyward.","(14:40) Andy Dalton incomplete pass to the left intended for A.J. Green.","(15:00) Andy Dalton pass to the left to Tyler Boyd for 9 yards to the Cin22. Tackled by Robert Golden.","(0:09) Jeremy Hill rush to the right for 4 yards to the Cin13. Tackled by Lawrence Timmons and Ryan Shazier.","(0:18) Jordan Berry punts for 45 yards to Cin9. Alex Erickson - no return. Tackled by Shamarko Thomas.","(0:22) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(1:06) DeAngelo Williams rush to the right for 7 yards to the Pit46. Tackled by Dre Kirkpatrick.","(1:12) Ben Roethlisberger incomplete pass to the right intended for Jesse James.","(1:27) Penalty: Offside on Cincinnati (Pat Sims) 5 yards.","(1:36) DeAngelo Williams rush to the right for 4 yards to the Pit34. Tackled by Carlos Dunlap.","(2:10) DeAngelo Williams rush up the middle for 5 yards to the Pit30. Tackled by Pat Sims.","(2:10) Mike Nugent kicks off to the endzone. Touchback.","(2:13) Mike Nugent 21 yard field goal attempt is GOOD. Holder: Kevin Huber.","(2:19) Andy Dalton incomplete pass to the left intended for C.J. Uzomah.","(2:24) Andy Dalton incomplete pass to the left intended for C.J. Uzomah defensed by Robert Golden.","(2:58) Jeremy Hill rush up the middle for a loss of 2 yards to the Pit3. Tackled by Ryan Shazier.","(3:02) Penalty: Pass Interference on Pittsburgh (Artie Burns) 9 yards.","(3:06) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(3:52) Andy Dalton pass to the left to Jeremy Hill for 4 yards to the Pit10. Tackled by Lawrence Timmons.","(3:57) Penalty: Pass Interference on Pittsburgh (Ross Cockrell) 20 yards.","(4:23) Andy Dalton pass to the middle to Alex Erickson for 20 yards to the Pit34. Tackled by William Gay.","(5:06) Andy Dalton pass to the right to Tyler Kroft for 7 yards to the Cin46. Tackled by William Gay.","(5:14) Andy Dalton incomplete pass to the right intended for A.J. Green.","(5:44) Andy Dalton pass to the right to Tyler Boyd for 29 yards to the Cin39. Tackled by Mike Mitchell.","(5:46) Penalty: Delay of Game on Cincinnati (Andy Dalton) -5 yards.","(6:16) Penalty: Holding on Cincinnati (Andrew Whitworth) -10 yards.","(6:16) Chris Boswell kicks off to the endzone. Touchback.","(6:16) Chris Boswell extra point is good.","(6:23) Ben Roethlisberger pass to the middle to Jesse James for 9 yards for a TOUCHDOWN.","(7:12) Ben Roethlisberger pass to the right to Sammie Coates for 53 yards to the Cin9. Tackled by Darqueze Dennard.","(7:56) Ben Roethlisberger pass to the middle to Xavier Grimble for 6 yards to the Pit38. Tackled by Karlos Dansby.","(8:01) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown defensed by George Iloka.","(8:27) Ben Roethlisberger pass to the left to Fitzgerald Toussaint for 9 yards to the Pit32. Tackled by George Iloka.","(9:01) DeAngelo Williams rush to the left for 6 yards to the Pit23. Tackled by Carlos Dunlap.","(9:36) DeAngelo Williams rush to the right for 8 yards to the Pit17. Tackled by Domata Peko.","(9:42) Kevin Huber punts for 42 yards to Pit9. No return.","(9:49) Andy Dalton incomplete pass to the left intended for Brandon LaFell defensed by William Gay.","(10:29) Jeremy Hill rush to the right for 1 yard to the Cin49. Tackled by Ryan Shazier.","(11:10) Andy Dalton sacked at Cin48 for no gain by Arthur Moats.","(11:43) Andy Dalton pass to the left to Jeremy Hill for 25 yards to the Cin33. Tackled by Javon Hargrave. Penalty: Horse Collar Tackle on Pittsburgh (Javon Hargrave) 15 yards.","(11:50) Jordan Berry punts for 42 yards to Cin8. No return.","(11:57) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates defensed by Dre Kirkpatrick.","(12:33) DeAngelo Williams rush up the middle for 6 yards to the Pit50. Tackled by Josh Shaw and Rey Maualuga.","(13:02) DeAngelo Williams rush up the middle for no gain to the Pit44. Tackled by Rey Maualuga.","(13:32) DeAngelo Williams rush up the middle for 8 yards to the Pit44. Tackled by Rey Maualuga.","(14:02) Ben Roethlisberger pass to the right to Antonio Brown for 3 yards to the Pit36. Tackled by Vincent Rey.","(14:16) Kevin Huber punts for 45 yards to Pit27. Eli Rogers return for 6 yards to Pit33. Tackled by Rex Burkhead. FUMBLE, recovered by Pit (Darrius Heyward-Bey).","(14:20) Andy Dalton incomplete pass to the left intended for Tyler Boyd defensed by Ross Cockrell.","(14:56) Jeremy Hill rush to the right for 3 yards to the Cin28. Tackled by Jarvis Jones.","(15:00) Andy Dalton incomplete pass to the left intended for Jeremy Hill.","(15:00) Chris Boswell kicks off to the endzone. Touchback.","(0:05) Mike Nugent 33 yard field goal attempt is GOOD. Holder: Kevin Huber.","(0:10) Andy Dalton incomplete pass to the right intended for Brandon LaFell defensed by Artie Burns.","(0:16) Andy Dalton pass to the right to A.J. Green for 17 yards to the Pit15.","(0:16) Cincinnati Bengals timeout.","(0:21) Andy Dalton pass to the right to C.J. Uzomah for 5 yards to the Pit32. Tackled by Ryan Shazier.","(0:25) Andy Dalton incomplete pass to the middle intended for Giovani Bernard.","(0:33) Andy Dalton pass to the right to Tyler Kroft for 7 yards to the Pit37. Tackled by Ryan Shazier.","(0:38) Andy Dalton incomplete pass to the left intended for Brandon LaFell defensed by William Gay.","(0:38) Cincinnati Bengals timeout.","(0:48) Andy Dalton pass to the right to Giovani Bernard for 24 yards to the Pit44. Tackled by Cameron Heyward.","(0:54) Ben Roethlisberger pass intended for Sammie Coates INTERCEPTED by Dre Kirkpatrick. No return. Tackled by Sammie Coates.","(1:24) Ben Roethlisberger pass to the left to DeAngelo Williams for 4 yards to the Pit20. Tackled by Karlos Dansby.","(1:30) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates.","(1:54) DeAngelo Williams rush to the left for 8 yards to the Pit16. Tackled by Shawn Williams.","(2:00) Kevin Huber punts for 37 yards to Pit8. No return.","(2:00) Two Minute Warning.","(2:44) Andy Dalton pass to the right to Giovani Bernard for 5 yards to the Pit45. Tackled by Anthony Chickillo and Stephon Tuitt.","(2:51) Andy Dalton incomplete pass to the right intended for C.J. Uzomah defensed by Mike Mitchell.","(3:14) Giovani Bernard rush to the right for 2 yards to the Cin50. Tackled by Lawrence Timmons and Ricardo Mathews.","(3:42) Andy Dalton pass to the middle to Tyler Boyd for 16 yards to the Cin48. Tackled by Mike Mitchell.","(3:46) Andy Dalton incomplete pass to the middle intended for Giovani Bernard defensed by Cameron Heyward.","(4:10) Andy Dalton pass to the right to Giovani Bernard for 7 yards to the Cin32. Tackled by Lawrence Timmons.","(4:10) Chris Boswell kicks off to the endzone. Touchback.","(4:14) Chris Boswell 49 yard field goal attempt is GOOD. Holder: Jordan Berry.","(4:20) Ben Roethlisberger incomplete pass to the left intended for DeAngelo Williams.","(5:00) Daryl Richardson rush to the right for 6 yards to the Cin30. Tackled by Shawn Williams and Pat Sims.","(5:05) Ben Roethlisberger incomplete pass to the middle intended for Eli Rogers.","(5:12) Kevin Huber punts for 32 yards to Cin36. No return.","(5:48) Giovani Bernard rush to the left for 1 yard to the Cin4. Tackled by William Gay.","(5:51) Andy Dalton incomplete pass to the left intended for A.J. Green.","(5:55) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Ross Cockrell.","(6:03) Jordan Berry punts for 46 yards to Cin5. No return. Penalty: Unnecessary Roughness on Cincinnati (Clayton Fejedelem) -2 yards.","(6:11) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown.","(6:50) DeAngelo Williams rush to the left for no gain to the Pit49. Tackled by Domata Peko.","(7:20) DeAngelo Williams rush to the left for no gain to the Pit49. Tackled by Pat Sims.","(7:31) Kevin Huber punts for 48 yards to Pit34. Eli Rogers return for 15 yards to Pit49. Tackled by Tyler Kroft.","(7:31) Andy Dalton incomplete pass to the right intended for Jeremy Hill.","(7:57) Andy Dalton pass to the left to Tyler Boyd for 8 yards to the Cin18. Tackled by Ryan Shazier and Ross Cockrell.","(8:31) Jeremy Hill rush to the right for 1 yard to the Cin10. Tackled by Lawrence Timmons.","(8:43) Penalty: Illegal Block on Cincinnati (Marquis Flowers) -9 yards.","(8:50) Ben Roethlisberger incomplete pass to the middle intended for Antonio Brown.","(9:31) DeAngelo Williams rush to the right for 3 yards to the Pit31. Tackled by Geno Atkins and Carlos Dunlap.","(10:12) Ben Roethlisberger sacked at Pit28 for a loss of 9 yards by Will Clarke.","(10:26) Kevin Huber punts for 55 yards to Pit33. Antonio Brown return for 4 yards to Pit37. Tackled by Clark Harris and Rex Burkhead.","(10:55) Andy Dalton pass to the right to C.J. Uzomah for 2 yards to the Cin12.","(10:59) Andy Dalton incomplete pass to the right intended for C.J. Uzomah.","(11:35) Giovani Bernard rush to the right for no gain to the Cin10. Tackled by Lawrence Timmons.","(11:42) Jordan Berry punts for 33 yards to Cin10. No return.","(11:46) Ben Roethlisberger incomplete pass to the middle intended for Darrius Heyward-Bey defensed by Adam Jones.","(12:26) DeAngelo Williams rush to the right for 1 yard to the Cin43. Tackled by Michael Johnson and Carlos Dunlap.","(13:09) Sammie Coates rush to the left for 6 yards to the Cin44. Tackled by Adam Jones and Michael Johnson.","(13:43) DeAngelo Williams rush to the left for 7 yards to the Pit50. Tackled by Karlos Dansby.","(14:15) Ben Roethlisberger pass to the left to Jesse James for 9 yards to the Pit43. Tackled by Karlos Dansby and Adam Jones.","(14:56) Ben Roethlisberger pass to the left to Eli Rogers for 9 yards to the Pit34. Tackled by Darqueze Dennard.","(15:00) Ben Roethlisberger incomplete pass to the right intended for Xavier Grimble.","(0:17) Ben Roethlisberger pass to the right to David Johnson for 5 yards to the Pit25. Tackled by Rey Maualuga and Karlos Dansby.","(0:23) Mike Nugent kicks off to the Pit-2. Fitzgerald Toussaint return for 22 yards to Pit20. Tackled by Josh Shaw.","(0:26) Mike Nugent 25 yard field goal attempt is GOOD. Holder: Kevin Huber.","(1:05) Andy Dalton pass to the middle to Giovani Bernard for 4 yards to the Pit7. Tackled by Mike Mitchell and Robert Golden.","(1:08) Andy Dalton incomplete pass to the left intended for Brandon LaFell defensed by Cameron Heyward.","(1:49) Giovani Bernard rush to the right for 4 yards to the Pit11. Tackled by Daniel McCullers and Jarvis Jones.","(2:29) Andy Dalton pass to the right to Tyler Kroft for 21 yards to the Pit15. Tackled by Ryan Shazier and Robert Golden.","(2:54) Andy Dalton pass to the middle to A.J. Green for 21 yards to the Pit36. Tackled by Robert Golden.","(3:28) Andy Dalton rush to the right for 5 yards to the Cin43.","(3:46) Andy Dalton pass to the right to Brandon LaFell for 13 yards to the Cin38.","(3:46) Chris Boswell kicks off to the endzone. Touchback.","(3:46) Chris Boswell extra point is good.","(3:53) Ben Roethlisberger pass to the right to Xavier Grimble for 20 yards for a TOUCHDOWN.","(4:35) DeAngelo Williams rush to the right for 1 yard to the Cin20. Tackled by Geno Atkins.","(4:35) Pittsburgh Steelers timeout.","(4:47) Ben Roethlisberger pass to the left to Sammie Coates for 44 yards to the Cin21. Tackled by Darqueze Dennard.","(4:51) Ben Roethlisberger incomplete pass to the middle intended for Xavier Grimble.","(5:29) DeAngelo Williams rush up the middle for 1 yard to the Pit35. Tackled by Domata Peko.","(5:39) Kevin Huber punts for 54 yards to Pit20. Antonio Brown return for 14 yards to Pit34. Tackled by Josh Shaw.","(5:44) Andy Dalton incomplete pass to the left intended for C.J. Uzomah.","(6:21) Jeremy Hill rush up the middle for 3 yards to the Cin26. Tackled by Ryan Shazier and Arthur Moats.","(6:25) Andy Dalton incomplete pass to the middle intended for A.J. Green.","(6:30) Ben Roethlisberger pass intended for Antonio Brown INTERCEPTED by Adam Jones and returned for 2 yards. Tackled by Antonio Brown.","(7:00) Ben Roethlisberger pass to the right to DeAngelo Williams for 10 yards to the Cin37. Tackled by Karlos Dansby and Vincent Rey.","(7:00) Penalty: False Start on Pittsburgh (Marcus Gilbert) -5 yards.","(7:06) Ben Roethlisberger incomplete pass to the middle intended for Eli Rogers.","(7:38) DeAngelo Williams rush up the middle for no gain to the Cin42. Tackled by Vincent Rey and Geno Atkins.","(8:00) Ben Roethlisberger pass to the left to Jesse James for 11 yards to the Cin42. Tackled by Karlos Dansby.","(8:07) Ben Roethlisberger incomplete pass to the left intended for Jesse James.","(8:43) DeAngelo Williams rush to the right for 11 yards to the Pit47. Tackled by Shawn Williams.","(9:11) Ben Roethlisberger pass to the left to Antonio Brown for 16 yards to the Pit36. Tackled by Adam Jones.","(9:41) DeAngelo Williams rush to the left for 3 yards to the Pit20. Tackled by George Iloka.","(10:14) DeAngelo Williams rush up the middle for 1 yard to the Pit17. Tackled by Vincent Rey.","(10:17) Kevin Huber punts for 51 yards to Pit10. Eli Rogers return for 6 yards to Pit16. Tackled by Marquis Flowers and James Wright.","(10:31) Andy Dalton incomplete pass to the left intended for A.J. Green.","(10:56) Jeremy Hill rush up the middle for 2 yards to the Cin39. Tackled by Lawrence Timmons and Ryan Shazier.","(11:27) Jeremy Hill rush to the left for 2 yards to the Cin37. Tackled by Stephon Tuitt.","(12:03) Andy Dalton pass to the left to Tyler Boyd for 10 yards to the Cin35. Tackled by Ross Cockrell.","(12:42) Jeremy Hill rush to the right for 5 yards to the Cin25. Tackled by Robert Golden.","(13:13) Jeremy Hill rush to the right for no gain to the Cin20. Tackled by Robert Golden.","(13:21) Jordan Berry punts for 46 yards to Cin20. No return.","(13:54) DeAngelo Williams rush up the middle for no gain to the Pit34. Tackled by George Iloka and Vincent Rey.","(14:30) DeAngelo Williams rush up the middle for 1 yard to the Pit34. Tackled by Michael Johnson.","(15:00) DeAngelo Williams rush up the middle for 8 yards to the Pit33. Tackled by Rey Maualuga.","(15:00) Mike Nugent kicks off to the endzone. Touchback."]