["(0:10) Brock Osweiler rush up the middle for a loss of 1 yard to the Chi46.","(0:18) Jay Cutler incomplete pass to the right intended for Kevin White defensed by Johnathan Joseph.","(0:23) Jay Cutler incomplete pass to the middle intended for Zach Miller.","(0:29) Jay Cutler incomplete pass to the left intended for Jeremy Langford.","(0:37) Jay Cutler incomplete pass to the left.","(1:02) Jay Cutler pass to the middle to Kevin White for 19 yards to the Chi45. Tackled by John Simon.","(1:08) Jay Cutler pass to the right to Jeremy Langford for 1 yard to the Chi26. Tackled by John Simon.","(1:37) Jay Cutler sacked at Chi25 for a loss of 6 yards by A.J. Bouye.","(2:00) Jay Cutler pass to the right to Kevin White for 10 yards to the Chi31. Tackled by Johnathan Joseph.","(2:00) Two Minute Warning.","(2:06) Shane Lechler punts for 35 yards to Chi21. No return.","(2:12) Brock Osweiler incomplete pass to the left intended for Will Fuller.","(2:56) Lamar Miller rush to the left for 3 yards to the Hou44. Tackled by Danny Trevathan and Eddie Goldman.","(2:56) Chicago Bears timeout.","(3:01) Lamar Miller rush to the right for no gain to the Hou41. Tackled by Lamarr Houston.","(3:01) Houston Texans timeout.","(4:00) Brock Osweiler pass to the right to Ryan Griffin for 12 yards to the Hou41. Tackled by Harold Jones-Quartey.","(4:00) Chicago Bears timeout.","(4:06) Lamar Miller rush to the right for 3 yards to the Hou29. Tackled by Deiondre' Hall and Jerrell Freeman.","(4:06) Houston Texans timeout.","(4:45) Lamar Miller rush to the right for 2 yards to the Hou26. Tackled by Danny Trevathan.","(4:56) Patrick O'Donnell punts for 44 yards to Hou32. Tyler Ervin return for 7 yards to Hou39. Tackled by Christian Jones. Penalty: Taunting on Houston (Jay Prosch) -15 yards.","(5:28) Jay Cutler sacked at Chi24 for a loss of 8 yards by John Simon.","(5:33) Jay Cutler incomplete pass to the left intended for Eddie Royal defensed by A.J. Bouye.","(6:04) Jay Cutler pass to the left to Eddie Royal for 6 yards to the Chi32. Tackled by A.J. Bouye.","(6:10) Nick Novak kicks off to the Chi3. Deonte Thompson return for 23 yards to Chi26. Tackled by Alfred Blue.","(6:14) Nick Novak 38 yard field goal attempt is GOOD. Holder: Shane Lechler.","(6:21) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(6:27) Brock Osweiler incomplete pass to the right intended for Will Fuller defensed by Deiondre' Hall.","(7:05) Lamar Miller rush to the left for 4 yards to the Chi20. Tackled by Akiem Hicks.","(7:46) Chicago Bears timeout.","(7:46) Brock Osweiler pass to the left to Will Fuller for 35 yards to the Chi24. Tackled by Deiondre' Hall.","(8:27) Lamar Miller rush to the left for 1 yard to the Hou41. Tackled by Danny Trevathan and Eddie Goldman.","(9:01) Lamar Miller rush up the middle for 6 yards to the Hou40. Tackled by Jerrell Freeman.","(9:10) Patrick O'Donnell punts for 43 yards to Hou21. Tyler Ervin return for 13 yards to Hou34. Tackled by Christian Jones and Jonathan Anderson.","(9:44) Jay Cutler sacked at Chi36 for a loss of 9 yards by Whitney Mercilus. FUMBLE, recovered by Chi (Jay Cutler).","(10:24) Jay Cutler pass to the left to Zach Miller for 5 yards to the Chi45. Tackled by Benardrick McKinney and Kareem Jackson.","(11:00) Jeremy Langford rush to the left for a loss of 1 yard to the Chi40. Tackled by Max Bullough and Whitney Mercilus.","(11:24) Jay Cutler pass to the right to Eddie Royal for 19 yards to the Chi41. Tackled by Quintin Demps.","(12:06) Jeremy Langford rush to the right for a loss of 1 yard to the Chi22. Tackled by D.J. Reader and Christian Covington.","(12:37) Jeremy Langford rush to the right for 6 yards to the Chi23. Tackled by Benardrick McKinney and Whitney Mercilus.","(12:44) Nick Novak kicks off to the Chi-1. Deonte Thompson return for 18 yards to Chi17. Tackled by Brian Peters.","(12:44) Nick Novak extra point is good.","(12:49) Brock Osweiler pass to the left to Will Fuller for 18 yards for a TOUCHDOWN.","(13:28) Lamar Miller rush to the right for 3 yards to the Chi18. Tackled by Deiondre' Hall.","(13:35) Brock Osweiler incomplete pass to the left intended for Will Fuller defensed by Jacoby Glenn.","(14:17) Brock Osweiler rush up the middle for 1 yard to the Chi21. Tackled by Sam Acho.","(15:00) Alfred Blue rush to the left for 4 yards to the Chi22. Tackled by Jacoby Glenn and Jerrell Freeman.","(0:18) Lamar Miller rush to the left for no gain to the Chi26. Tackled by Adrian Amos.","(0:36) Penalty: Offside on Chicago (Willie Young) 5 yards.","(1:15) Brock Osweiler pass to the left to Will Fuller for 27 yards to the Chi31. Tackled by Danny Trevathan and Lamarr Houston.","(1:57) Brock Osweiler pass to the left to Lamar Miller for 6 yards to the Hou42. Tackled by Danny Trevathan.","(2:36) Lamar Miller rush to the right for no gain to the Hou36. Tackled by Eddie Goldman.","(2:45) Patrick O'Donnell punts for 46 yards to Hou36. No return.","(2:50) Jay Cutler incomplete pass to the right intended for Alshon Jeffery.","(2:57) Jay Cutler incomplete pass to the right intended for Alshon Jeffery.","(3:31) Jeremy Langford rush to the right for 4 yards to the Chi18. Tackled by Max Bullough.","(3:43) Shane Lechler punts for 58 yards to Chi12. Eddie Royal return for 2 yards to Chi14. Tackled by Eddie Pleasant.","(4:22) Brock Osweiler pass to the left to DeAndre Hopkins for 14 yards to the Hou30. Tackled by Jacoby Glenn.","(5:04) Lamar Miller rush to the left for 4 yards to the Hou16. Tackled by Jerrell Freeman and Danny Trevathan.","(5:47) Brock Osweiler sacked at Hou12 for a loss of 9 yards by Eddie Goldman and Leonard Floyd.","(6:22) Brock Osweiler pass to the left to DeAndre Hopkins for 3 yards to the Hou21. Tackled by Tracy Porter and Jerrell Freeman.","(7:06) Brock Osweiler pass to the right to Stephen Anderson for 8 yards to the Hou18. Tackled by Adrian Amos.","(7:42) Lamar Miller rush to the right for 1 yard to the Hou10. Tackled by Eddie Goldman.","(7:50) Patrick O'Donnell punts for 29 yards to Hou9. No return.","(8:00) Jay Cutler incomplete pass to the right intended for Eddie Royal.","(8:44) Jeremy Langford rush to the left for 1 yard to the Hou38. Tackled by Max Bullough.","(9:19) Jeremy Langford rush to the right for 7 yards to the Hou39. Tackled by Andre Hal and Jadeveon Clowney.","(9:19) Houston Texans timeout.","(9:56) Jeremy Langford rush to the left for 15 yards to the Hou46. Tackled by Quintin Demps.","(10:04) Shane Lechler punts for 41 yards to Chi32. Eddie Royal return for 7 yards to Chi39. Tackled by Charles James.","(10:13) Brock Osweiler incomplete pass to the left intended for Will Fuller.","(10:56) Lamar Miller rush up the middle for a loss of 4 yards to the Hou27. Tackled by Akiem Hicks. FUMBLE, recovered by Hou (Lamar Miller).","(11:00) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(11:09) Patrick O'Donnell punts for 46 yards to Hou31. No return.","(11:35) Jay Cutler sacked at Chi23 for a loss of 1 yard by Jadeveon Clowney.","(11:43) Jay Cutler incomplete pass to the left intended for Jeremy Langford defensed by Vince Wilfork.","(12:17) Jeremy Langford rush to the right for a loss of 1 yard to the Chi24. Tackled by Vince Wilfork.","(12:17) Nick Novak kicks off to the endzone. Touchback.","(12:20) Nick Novak 28 yard field goal attempt is GOOD. Holder: Shane Lechler.","(12:25) Brock Osweiler incomplete pass to the left intended for Braxton Miller.","(13:04) Brock Osweiler pass to the left to Stephen Anderson for 5 yards to the Chi10. Tackled by Jerrell Freeman.","(13:09) Brock Osweiler incomplete pass to the left intended for Braxton Miller.","(13:38) Penalty: Holding on Houston (Jeff Allen) -10 yards.","(14:07) Brock Osweiler pass to the left to Will Fuller for 20 yards to the Chi5. Tackled by Jacoby Glenn.","(14:17) Jay Cutler pass intended for Kevin White INTERCEPTED by Andre Hal and returned for 12 yards. Tackled by Logan Paulsen.","(14:55) Jeremy Langford rush to the right for 5 yards to the Chi22. Tackled by Max Bullough.","(15:00) Nick Novak kicks off to the Chi1. Deonte Thompson return for 16 yards to Chi17. Tackled by Kevin Johnson.","(0:02) Brock Osweiler rush up the middle for a loss of 1 yard to the Hou26.","(0:07) Connor Barth kicks off to the Hou10. Tyler Ervin return for 17 yards to Hou27. Tackled by Christian Jones.","(0:07) Connor Barth extra point is good.","(0:13) Jay Cutler pass to the middle to Eddie Royal for 19 yards for a TOUCHDOWN.","(0:13) Houston Texans timeout.","(0:13) Chicago Bears timeout.","(0:24) Jay Cutler pass to the right to Alshon Jeffery for 54 yards to the Hou19. Tackled by Andre Hal.","(0:30) Penalty: Pass Interference on Chicago (Zach Miller) -10 yards.","(0:30) Chicago Bears timeout.","(0:38) Jay Cutler rush up the middle for 12 yards to the Chi37. Tackled by Kareem Jackson.","(0:50) Shane Lechler punts for 60 yards to Chi25. Eddie Royal - no return. Tackled by Charles James and Brian Peters.","(0:50) Chicago Bears timeout.","(0:57) Brock Osweiler sacked at Hou15 for a loss of 7 yards by Danny Trevathan.","(1:39) Lamar Miller rush to the right for 5 yards to the Hou22. Tackled by Jerrell Freeman.","(1:46) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(1:55) Patrick O'Donnell punts for 41 yards to Hou17. No return.","(2:00) Jay Cutler incomplete pass to the right intended for Kevin White.","(2:00) Two Minute Warning.","(2:08) Jeremy Langford rush to the right for a loss of 1 yard to the Chi42. Tackled by Kareem Jackson and John Simon.","(2:42) Jay Cutler pass to the left to Jeremy Langford for 5 yards to the Chi43. Tackled by A.J. Bouye.","(3:07) Jay Cutler pass to the right to Alshon Jeffery for 16 yards to the Chi38. Tackled by Johnathan Joseph and Quintin Demps.","(3:14) Nick Novak kicks off to the Chi2. Deonte Thompson return for 20 yards to Chi22. Tackled by Alfred Blue.","(3:14) Nick Novak extra point is good.","(3:21) Brock Osweiler pass to the left to DeAndre Hopkins for 23 yards for a TOUCHDOWN.","(4:00) Jay Prosch rush to the right for 2 yards to the Chi23. Tackled by Danny Trevathan and Lamarr Houston.","(4:35) Lamar Miller rush to the right for 6 yards to the Chi25. Tackled by Danny Trevathan.","(5:04) Tyler Ervin rush up the middle for 3 yards to the Chi31. Tackled by Leonard Floyd.","(5:27) Brock Osweiler pass to the left to DeAndre Hopkins for 9 yards to the Chi34. Tackled by Tracy Porter.","(5:33) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(6:10) Lamar Miller rush to the left for 4 yards to the Chi43. Tackled by Tracy Porter.","(6:41) Brock Osweiler pass to the right to Braxton Miller for 6 yards to the Chi47. Tackled by Harold Jones-Quartey.","(7:24) Brock Osweiler pass to the right to Lamar Miller for 5 yards to the Hou47. Tackled by Jerrell Freeman.","(8:03) Lamar Miller rush up the middle for 3 yards to the Hou42. Tackled by Akiem Hicks and Jerrell Freeman.","(8:15) Patrick O'Donnell punts for 47 yards to Hou30. Tyler Ervin return for 9 yards to Hou39. Tackled by Logan Paulsen.","(8:45) Jay Cutler sacked at Chi23 for a loss of 7 yards by Whitney Mercilus.","(9:20) Ka'Deem Carey rush to the right for 4 yards to the Chi30. Tackled by Kareem Jackson.","(9:58) Jay Cutler pass to the right to Zach Miller for 4 yards to the Chi26. Tackled by Johnathan Joseph.","(9:58) Houston Texans timeout.","(10:33) Jay Cutler pass to the right to Zach Miller for 5 yards to the Chi22. Tackled by Quintin Demps.","(11:14) Jeremy Langford rush up the middle for 7 yards to the Chi17. Tackled by Johnathan Joseph.","(11:18) Jay Cutler incomplete pass to the left intended for Kevin White.","(11:25) Nick Novak kicks off to the Chi-6. Deonte Thompson return for 26 yards to Chi20. Tackled by Jonathan Grimes. Penalty: Illegal Block on Chicago (DeAndre Houston-Carson) -10 yards.","(11:28) Nick Novak 28 yard field goal attempt is GOOD. Holder: Shane Lechler.","(11:32) Brock Osweiler incomplete pass to the right intended for Tyler Ervin.","(12:04) Brock Osweiler pass to the right to Will Fuller for 7 yards to the Chi10. Tackled by Jacoby Glenn.","(12:35) Lamar Miller rush to the right for 3 yards to the Chi17. Tackled by Lamarr Houston and Jerrell Freeman.","(12:42) Penalty: Pass Interference on Houston (DeAndre Hopkins) -10 yards.","(13:25) Lamar Miller rush up the middle for 6 yards to the Chi10. Tackled by Harold Jones-Quartey and Leonard Floyd.","(13:57) Brock Osweiler pass to the left to Tyler Ervin for 5 yards to the Chi16. Tackled by Adrian Amos.","(14:35) Lamar Miller rush to the left for 4 yards to the Chi21. Tackled by Cornelius Washington.","(15:00) Brock Osweiler pass to the middle to Stephen Anderson for 12 yards to the Chi25. Tackled by Adrian Amos.","(0:14) Brock Osweiler pass to the middle to Ryan Griffin for 5 yards to the Chi37. Tackled by Jerrell Freeman.","(0:24) Brock Osweiler incomplete pass to the left intended for Will Fuller defensed by Jacoby Glenn.","(1:01) Brock Osweiler pass to the left to DeAndre Hopkins for 5 yards to the Chi42. Tackled by Tracy Porter.","(1:40) Lamar Miller rush to the left for 7 yards to the Chi47. Tackled by Jerrell Freeman and Danny Trevathan.","(2:07) Lamar Miller rush up the middle for 11 yards to the Hou46. Tackled by Harold Jones-Quartey.","(2:44) Lamar Miller rush to the left for 4 yards to the Hou35. Tackled by Leonard Floyd and Jerrell Freeman.","(2:49) Jay Cutler rush up the middle for no gain to the Hou31. FUMBLE, recovered by Chi (Jay Cutler).","(3:40) Jay Cutler pass to the right to Kevin White for 5 yards to the Hou31. Tackled by Kareem Jackson.","(3:45) Jay Cutler incomplete pass to the right intended for Logan Paulsen.","(4:16) Jeremy Langford rush to the right for 4 yards to the Hou36. Tackled by Max Bullough and Benardrick McKinney.","(4:30) Shane Lechler punts for 49 yards to Chi29. Eddie Royal return for 31 yards to Hou40. Tackled by Shane Lechler.","(4:57) Lamar Miller rush up the middle for 12 yards to the Hou22. Tackled by Jerrell Freeman.","(5:26) Lamar Miller rush to the left for 6 yards to the Hou10. Tackled by Danny Trevathan.","(5:45) Penalty: False Start on Houston (Derek Newton) -4 yards.","(6:23) Brock Osweiler pass to the right to Lamar Miller for a loss of 6 yards to the Hou8. Tackled by Jerrell Freeman.","(6:51) Penalty: Holding on Houston (Chris Clark) -10 yards.","(6:58) Connor Barth kicks off to the Hou-4. Tyler Ervin return for 28 yards to Hou24. Tackled by Sherrick McManis.","(6:58) Connor Barth extra point is good.","(7:05) Jeremy Langford rush to the right for 1 yard for a TOUCHDOWN.","(7:41) Jeremy Langford rush to the right for 4 yards to the Hou1. Tackled by Brian Cushing.","(7:48) Penalty: Pass Interference on Houston (Kareem Jackson) 20 yards.","(8:13) Penalty: False Start on Chicago (Kevin White) -5 yards.","(8:36) Jay Cutler pass to the left to Alshon Jeffery for 29 yards to the Hou20. Tackled by Kevin Johnson.","(9:11) Jay Cutler pass to the right to Eddie Royal for 13 yards to the Hou49.","(9:44) Jeremy Langford rush up the middle for 1 yard to the Chi38. Tackled by Jadeveon Clowney.","(10:18) Jeremy Langford rush to the right for 2 yards to the Chi37. Tackled by John Simon and J.J. Watt.","(10:49) Jay Cutler pass to the right to Alshon Jeffery for 6 yards to the Chi35. Tackled by Benardrick McKinney and Brian Cushing.","(11:29) Jeremy Langford rush up the middle for 4 yards to the Chi29. Tackled by John Simon.","(11:37) Brock Osweiler pass intended for DeAndre Hopkins INTERCEPTED by Tracy Porter and returned for 3 yards. Tackled by DeAndre Hopkins.","(12:13) Lamar Miller rush to the left for 2 yards to the Chi34. Tackled by Leonard Floyd and Harold Jones-Quartey.","(12:48) Brock Osweiler rush up the middle for 15 yards to the Chi36. Tackled by Jacoby Glenn.","(13:29) Lamar Miller rush to the right for 2 yards to the Hou49. Tackled by Leonard Floyd.","(13:59) Brock Osweiler pass to the middle to Lamar Miller for 6 yards to the Hou47. Tackled by Jerrell Freeman and Eddie Goldman.","(14:37) Brock Osweiler pass to the right to C.J. Fiedorowicz for 6 yards to the Hou41. Tackled by Harold Jones-Quartey.","(14:54) Lamar Miller rush up the middle for 8 yards to the Hou35. Tackled by Jerrell Freeman and Harold Jones-Quartey.","(15:00) Connor Barth kicks off to the Hou-1. Tyler Ervin return for 28 yards to Hou27. Tackled by Chris Prosinski and Christian Jones."]