["(0:38) Drew Brees rush up the middle for a loss of 1 yard to the SF11.","(1:35) Drew Brees rush up the middle for a loss of 1 yard to the SF10.","(2:00) Mark Ingram rush to the left for 5 yards to the SF9. Tackled by Quinton Dial and Gerald Hodges Jr..","(2:00) Two Minute Warning.","(2:27) Mark Ingram rush up the middle for 7 yards to the SF14. Tackled by Jaquiski Tartt.","(2:35) Colin Kaepernick pass to the left to DuJuan Harris for 5 yards to the SF21. Tackled by Kenny Vaccaro. FUMBLE, recovered by NO (Vonn Bell). Tackled by Quinton Patton.","(2:54) Colin Kaepernick pass to the left to Garrett Celek for 8 yards to the SF16. Tackled by Kenny Vaccaro.","(3:05) Thomas Morstead punts for 54 yards to SF16. Jeremy Kerley return for 2 yards to SF18. Tackled by Nate Stupar. Penalty: Holding on San Francisco (Jaquiski Tartt) -10 yards.","(3:06) San Francisco 49ers timeout.","(3:11) Drew Brees pass to the right to John Kuhn for 3 yards to the NO30. Tackled by Gerald Hodges Jr..","(3:11) New Orleans Saints timeout.","(3:59) Tim Hightower rush up the middle for 4 yards to the NO27. Tackled by Nick Bellore.","(4:46) Tim Hightower rush up the middle for 1 yard to the NO23. Tackled by Glenn Dorsey.","(5:20) Tim Hightower rush up the middle for 5 yards to the NO22. Tackled by Glenn Dorsey.","(6:05) Tim Hightower rush to the left for 9 yards to the NO17. Tackled by Nick Bellore and Glenn Dorsey.","(6:13) Colin Kaepernick rush up the middle for no gain to the NO10. FUMBLE, recovered by NO (Kenny Vaccaro). Tackled by Zane Beadles.","(6:17) Colin Kaepernick incomplete pass to the right intended for Vance McDonald.","(6:22) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(6:26) Penalty: Offside on New Orleans (Chris McCain) 5 yards.","(6:32) Colin Kaepernick incomplete pass to the right intended for Aaron Burbridge defensed by Sterling Moore.","(7:02) Colin Kaepernick pass to the left to Quinton Patton for 19 yards to the NO15. Tackled by Jairus Byrd.","(7:36) Colin Kaepernick rush to the left for 11 yards to the NO34. Tackled by Craig Robertson.","(8:10) Colin Kaepernick pass to the left to Vance McDonald for 5 yards to the NO45. Tackled by Kenny Vaccaro and Craig Robertson.","(8:28) Colin Kaepernick pass to the left to Quinton Patton for 6 yards to the SF50. Tackled by Ken Crawley.","(8:52) Colin Kaepernick pass to the left to Quinton Patton for 19 yards to the SF44. Tackled by Ken Crawley.","(8:52) Wil Lutz kicks off to the endzone. Touchback.","(8:56) Wil Lutz 41 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(9:00) Drew Brees incomplete pass to the left intended for Michael Thomas.","(9:34) Mark Ingram rush to the left for 3 yards to the SF23. Tackled by Glenn Dorsey.","(10:12) Mark Ingram rush up the middle for 2 yards to the SF26. Tackled by Nick Bellore and DeForest Buckner.","(10:37) Drew Brees pass to the right to Brandon Coleman for 19 yards to the SF28. Tackled by Tramaine Brock.","(10:37) New Orleans Saints timeout.","(11:26) Tim Hightower rush to the right for no gain to the SF47. Tackled by Ahmad Brooks and Antoine Bethea.","(11:56) Mark Ingram rush to the left for 4 yards to the SF47. Tackled by Gerald Hodges Jr..","(12:30) Mark Ingram rush to the left for 11 yards to the NO49. Tackled by Gerald Hodges Jr..","(12:37) Drew Brees incomplete pass to the left intended for Brandin Cooks defensed by Jaquiski Tartt.","(12:54) Mark Ingram rush up the middle for 14 yards to the NO38. Tackled by Antoine Bethea.","(13:01) Bradley Pinion punts for 51 yards to NO24. No return.","(13:06) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(13:09) Colin Kaepernick incomplete pass to the middle intended for Vance McDonald defensed by Craig Robertson.","(13:13) Colin Kaepernick incomplete pass to the middle intended for Vance McDonald.","(13:13) Wil Lutz kicks off to the endzone. Touchback.","(13:13) Wil Lutz extra point is good.","(13:21) Drew Brees pass to the right to Michael Thomas for 32 yards for a TOUCHDOWN.","(13:58) John Kuhn rush up the middle for 2 yards to the SF32. Tackled by Gerald Hodges Jr..","(14:32) Tim Hightower rush to the left for 3 yards to the SF34. Tackled by Glenn Dorsey.","(15:00) Drew Brees pass to the left to John Kuhn for 6 yards to the SF37. Tackled by Jimmie Ward.","(0:30) Drew Brees pass to the left to Brandin Cooks for 28 yards to the SF43. Tackled by Keith Reaser.","(1:05) Tim Hightower rush to the left for 1 yard to the NO29. Tackled by Quinton Dial.","(1:36) Tim Hightower rush to the right for 5 yards to the NO28. Tackled by Tank Carradine.","(1:45) Bradley Pinion punts for 34 yards to NO23. No return.","(1:51) Colin Kaepernick incomplete pass to the right intended for Aaron Burbridge.","(2:29) Colin Kaepernick sacked at SF43 for a loss of 5 yards by Cameron Jordan and Vonn Bell.","(2:55) DuJuan Harris rush up the middle for 3 yards to the SF48. Tackled by Kenny Vaccaro.","(2:59) 55 yard field goal attempt by Wil Lutz is NO GOOD. Holder: Thomas Morstead.","(3:06) Drew Brees incomplete pass to the left intended for Coby Fleener defensed by Eric Reid.","(3:53) Drew Brees pass to the left to Michael Thomas for 8 yards to the SF37. Tackled by Nick Bellore.","(4:17) Penalty: Illegal Block on New Orleans (Max Unger) -10 yards.","(4:53) Tim Hightower rush up the middle for 1 yard to the SF35. Tackled by Glenn Dorsey.","(5:24) Tim Hightower rush to the right for 5 yards to the SF36. Tackled by Tramaine Brock.","(5:52) Drew Brees pass to the left to Brandin Cooks for 8 yards to the SF41. Tackled by Gerald Hodges Jr..","(6:29) Mark Ingram rush to the left for no gain to the SF49. Tackled by Nick Bellore.","(7:02) Drew Brees pass to the right to Willie Snead for 9 yards to the SF49. Tackled by Ahmad Brooks.","(7:35) Drew Brees pass to the right to Josh Hill for 2 yards to the NO42. Tackled by Antoine Bethea and Keith Reaser.","(8:13) Mark Ingram rush to the right for no gain to the NO40. Tackled by Quinton Dial.","(8:48) Mark Ingram rush to the right for 19 yards to the NO40. Tackled by Eric Reid.","(9:06) Drew Brees pass to the left to Brandon Coleman for 6 yards to the NO21. Tackled by Eli Harold.","(9:07) Bradley Pinion kicks off to the NO14. Travaris Cadet - no return.","(9:12) Phil Dawson 46 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(9:17) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(9:21) Colin Kaepernick incomplete pass to the right intended for Torrey Smith.","(9:21) San Francisco 49ers timeout.","(9:27) Colin Kaepernick incomplete pass to the right intended for Garrett Celek.","(9:54) Colin Kaepernick pass to the right to Torrey Smith for 13 yards to the NO28. Tackled by Kenny Vaccaro.","(10:14) DuJuan Harris rush up the middle for 16 yards to the NO41. Tackled by Jairus Byrd.","(10:23) Thomas Morstead punts for 59 yards to SF33. Jeremy Kerley return for 10 yards to SF43. Tackled by Jake Lampman.","(10:56) Drew Brees pass to the middle to Josh Hill for 4 yards to the NO8. Tackled by Eric Reid.","(11:32) Drew Brees sacked at NO4 for no gain by Gerald Hodges Jr..","(12:07) John Kuhn rush to the right for 3 yards to the NO4. Tackled by Tank Carradine.","(12:19) Mike Davis rush to the left for 7 yards to the NO1. Tackled by Nate Stupar. FUMBLE, recovered by NO (Nate Stupar). Tackled by Mike Davis.","(12:56) Colin Kaepernick pass to the middle to Mike Davis for 9 yards to the NO8. Tackled by Nate Stupar.","(13:21) Colin Kaepernick pass to the right to Jeremy Kerley for 17 yards to the NO17. Tackled by B.W. Webb.","(13:58) Mike Davis rush to the right for 4 yards to the NO34. Tackled by Craig Robertson.","(14:03) Colin Kaepernick incomplete pass to the right intended for Garrett Celek.","(14:22) DuJuan Harris rush to the right for 19 yards to the NO38. Tackled by Kenny Vaccaro.","(14:51) Colin Kaepernick pass to the right to Quinton Patton for 11 yards to the SF43. Tackled by Jairus Byrd.","(15:00) Wil Lutz kicks off to the SF-3. JaCorey Shepherd return for 35 yards to SF32. Tackled by Vonn Bell and Roman Harper.","(0:04) Wil Lutz 26 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(0:04) San Francisco 49ers timeout.","(0:08) Penalty: Holding on San Francisco (Eric Reid) 5 yards.","(0:13) Drew Brees pass to the left to Willie Snead for 19 yards to the SF13.","(0:18) Drew Brees pass to the right to Brandin Cooks for 17 yards to the SF32.","(0:22) Drew Brees incomplete pass to the left intended for Willie Snead defensed by Tramaine Brock.","(0:22) New Orleans Saints timeout.","(0:30) Drew Brees pass to the left to Coby Fleener for 26 yards to the SF49. Tackled by Antoine Bethea.","(0:58) Drew Brees pass to the middle to Travaris Cadet for 4 yards to the NO25. Tackled by Eric Reid.","(1:05) Bradley Pinion kicks off to the NO2. Travaris Cadet return for 19 yards to NO21. Tackled by Keith Reaser and Rod Streater.","(1:05) Phil Dawson extra point is good.","(1:16) Colin Kaepernick pass to the right to Vance McDonald for 65 yards for a TOUCHDOWN.","(1:16) New Orleans Saints timeout.","(1:22) DuJuan Harris rush to the right for 1 yard to the SF35. Tackled by Cameron Jordan.","(1:47) DuJuan Harris rush up the middle for 6 yards to the SF34. Tackled by Craig Robertson.","(1:54) Thomas Morstead punts for 41 yards to SF13. No return. Penalty: FC Interference on New Orleans (Brian Dixon) 15 yards.","(2:00) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Tramaine Brock.","(2:00) Two Minute Warning.","(2:05) Drew Brees pass to the right to Josh Hill for 2 yards to the NO46. Tackled by Antoine Bethea.","(2:44) Mark Ingram rush to the left for 4 yards to the NO44. Tackled by Eli Harold.","(3:20) Tim Hightower rush to the right for 7 yards to the NO40. Tackled by Tramaine Brock.","(3:53) Drew Brees pass to the left to Willie Snead for 8 yards to the NO33. Tackled by Gerald Hodges Jr..","(3:53) Bradley Pinion kicks off to the endzone. Touchback.","(3:58) Phil Dawson 48 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(4:03) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley defensed by Sterling Moore.","(4:28) Colin Kaepernick pass to the right to DuJuan Harris for 11 yards to the NO30. Tackled by Vonn Bell.","(4:48) Penalty: Illegal Block on San Francisco (Garrett Celek) -10 yards.","(5:07) Colin Kaepernick pass to the right to DuJuan Harris for 5 yards to the NO31. Tackled by B.W. Webb.","(5:38) Colin Kaepernick pass to the right to Garrett Celek for 31 yards to the NO36. Tackled by B.W. Webb.","(5:45) Wil Lutz kicks off to the SF0. JaCorey Shepherd return for 33 yards to SF33. Tackled by Kasim Edebali.","(5:45) Wil Lutz extra point is good.","(5:56) Mark Ingram rush to the right for 75 yards for a TOUCHDOWN.","(5:56) Bradley Pinion kicks off to the endzone. Touchback.","(5:56) Phil Dawson extra point is good.","(6:07) Colin Kaepernick pass to the right to DuJuan Harris for 47 yards for a TOUCHDOWN.","(6:36) DuJuan Harris rush up the middle for 3 yards to the NO47. Tackled by Sheldon Rankins.","(7:04) Colin Kaepernick pass to the left to Garrett Celek for 15 yards to the SF50. Tackled by Vonn Bell.","(7:33) Colin Kaepernick pass to the right to Jeremy Kerley for no gain to the SF35. Tackled by Jairus Byrd.","(7:40) Wil Lutz kicks off to the SF-1. JaCorey Shepherd return for 36 yards to SF35. Tackled by Vonn Bell.","(7:40) Wil Lutz extra point is good.","(7:46) Drew Brees pass to the right to Mark Ingram for 5 yards for a TOUCHDOWN.","(7:51) Drew Brees incomplete pass to the right intended for Coby Fleener defensed by Nick Bellore.","(8:29) Mark Ingram rush up the middle for 3 yards to the SF5. Tackled by Nick Bellore and Glenn Dorsey.","(9:02) Drew Brees pass to the right to Tim Hightower for 15 yards to the SF8. Tackled by Tramaine Brock.","(9:44) Tim Hightower rush to the left for 4 yards to the SF23. Tackled by Eli Harold.","(10:13) Tim Hightower rush to the right for 4 yards to the SF27. Tackled by Ahmad Brooks.","(10:56) Mark Ingram rush to the right for 7 yards to the SF31. Tackled by Eric Reid.","(11:27) Drew Brees pass to the left to Mark Ingram for 8 yards to the SF38. Tackled by Michael Wilhoite.","(12:06) Tim Hightower rush to the left for 4 yards to the SF46. Tackled by Michael Wilhoite.","(12:38) Drew Brees pass to the left to Michael Thomas for 9 yards to the NO50. Tackled by Jimmie Ward.","(13:13) Drew Brees pass to the left to Brandin Cooks for 15 yards to the NO41. Tackled by Nick Bellore and Tank Carradine.","(13:45) Tim Hightower rush to the left for 2 yards to the NO26. Tackled by Eli Harold.","(13:51) DuJuan Harris rush up the middle for no gain to the NO24. Tackled by Delvin Breaux.","(14:21) Colin Kaepernick pass to the left to Torrey Smith for 5 yards to the NO24. Tackled by Jairus Byrd.","(15:00) Colin Kaepernick rush to the right for no gain to the NO29. Tackled by Kenny Vaccaro.","(0:30) DuJuan Harris rush up the middle for 4 yards to the NO29. Tackled by Nate Stupar and Craig Robertson.","(1:08) Colin Kaepernick pass to the middle to Garrett Celek for 22 yards to the NO33. Tackled by Delvin Breaux.","(1:38) Colin Kaepernick pass to the right to Quinton Patton for 20 yards to the SF45. Tackled by Jairus Byrd.","(2:14) DuJuan Harris rush to the left for no gain to the SF25. Tackled by Nate Stupar.","(2:14) Wil Lutz kicks off to the endzone. Touchback.","(2:14) Wil Lutz extra point is good. Penalty: Leverage on San Francisco (Ahmad Brooks) 15 yards.","(2:17) Drew Brees pass to the left to Michael Thomas for 1 yard for a TOUCHDOWN.","(2:23) Drew Brees incomplete pass to the left intended for Willie Snead.","(2:23) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Jimmie Ward.","(3:06) Mark Ingram rush up the middle for 4 yards to the SF1. Tackled by Eric Reid.","(3:36) Drew Brees pass to the left to Coby Fleener for 7 yards to the SF5. Tackled by Gerald Hodges Jr..","(3:46) Colin Kaepernick pass intended for Jeremy Kerley INTERCEPTED by Craig Robertson and returned for 29 yards. Tackled by Quinton Patton. Penalty: Horse Collar Tackle on San Francisco (Quinton Patton) 13 yards.","(4:28) Colin Kaepernick rush to the right for 10 yards to the SF49. Tackled by Kenny Vaccaro.","(5:07) Colin Kaepernick pass to the left to Vance McDonald for 14 yards to the SF39. Tackled by Vonn Bell.","(5:11) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(5:11) Wil Lutz kicks off to the endzone. Touchback.","(5:11) Wil Lutz extra point is good.","(5:15) Tim Hightower rush to the right for 4 yards for a TOUCHDOWN.","(5:58) Drew Brees pass to the right to Coby Fleener for 9 yards to the SF4. Tackled by Nick Bellore.","(6:31) Drew Brees pass to the left to Brandin Cooks for a loss of 2 yards to the SF13. Tackled by Tank Carradine.","(7:09) Tim Hightower rush up the middle for 3 yards to the SF11. Tackled by Quinton Dial.","(7:35) Drew Brees pass to the left to Josh Hill for 32 yards to the SF14. Tackled by Jimmie Ward.","(7:54) Tim Hightower rush to the left for 9 yards to the SF46. Tackled by DeForest Buckner.","(8:26) Tim Hightower rush to the right for no gain to the NO45. Tackled by Gerald Hodges Jr..","(8:44) Drew Brees pass to the right to Michael Thomas for 23 yards to the NO45. Tackled by Keith Reaser.","(9:17) Tim Hightower rush to the right for 5 yards to the NO22. Tackled by Tramaine Brock and Jimmie Ward.","(9:21) Drew Brees incomplete pass to the right intended for Coby Fleener defensed by Nick Bellore.","(9:25) Bradley Pinion kicks off to the NO-2. Travaris Cadet return for 19 yards to NO17. Tackled by Shaun Draughn.","(9:30) Phil Dawson 49 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(9:35) Colin Kaepernick incomplete pass to the right intended for DuJuan Harris.","(9:49) Colin Kaepernick pass to the right to Jeremy Kerley for 5 yards to the NO31.","(10:10) Penalty: False Start on San Francisco (Vance McDonald) -5 yards.","(10:42) Colin Kaepernick rush up the middle for 2 yards to the NO31. Tackled by Kenny Vaccaro.","(10:50) Penalty: Pass Interference on San Francisco (DuJuan Harris) -10 yards.","(11:29) Colin Kaepernick pass to the middle to Quinton Patton for 31 yards to the NO23. Tackled by Nate Stupar.","(11:55) DuJuan Harris rush up the middle for 7 yards to the SF46. Tackled by Nate Stupar and Jairus Byrd.","(12:18) Colin Kaepernick pass to the right to DuJuan Harris for 15 yards to the SF39. Tackled by Jairus Byrd.","(12:24) Thomas Morstead punts for 56 yards to SF13. Jeremy Kerley return for 11 yards to SF24. Tackled by Michael Mauti and Brandon Coleman.","(12:36) Drew Brees incomplete pass to the left intended for Willie Snead.","(12:52) Penalty: Offside on San Francisco (Eli Harold) 5 yards.","(13:24) Tim Hightower rush to the right for 3 yards to the NO26. Tackled by Ronald Blair and Gerald Hodges Jr..","(13:28) Drew Brees incomplete pass to the left intended for Willie Snead.","(13:54) Penalty: Pass Interference on New Orleans (Brandin Cooks) -10 yards.","(14:23) Tim Hightower rush to the left for 5 yards to the NO33. Tackled by Nick Bellore.","(14:25) Penalty: Too Many Men on Field on San Francisco 5 yards.","(14:55) Tim Hightower rush to the right for 3 yards to the NO23. Tackled by Antoine Bethea and Arik Armstead.","(15:00) Bradley Pinion kicks off to the NO0. Travaris Cadet return for 20 yards to NO20. Tackled by Rod Streater."]