["(0:18) Mark Sanchez rush up the middle for a loss of 1 yard to the Cle18.","(0:55) Mark Sanchez rush up the middle for a loss of 1 yard to the Cle17.","(0:55) Cleveland Browns timeout.","(1:13) Mark Sanchez pass to the right to Geoff Swaim for 8 yards to the Cle16. Tackled by Ibraheim Campbell and Ed Reynolds.","(1:13) Dallas Cowboys timeout.","(2:00) Alfred Morris rush to the right for 3 yards to the Cle24. Tackled by Danny Shelton and Jamie Meder.","(2:00) Two Minute Warning.","(2:29) Alfred Morris rush to the right for 4 yards to the Cle27. Tackled by Cam Johnson.","(3:14) Alfred Morris rush to the right for 2 yards to the Cle31. Tackled by Jamie Collins and Cam Johnson.","(3:53) Cleveland Browns timeout.","(3:53) Alfred Morris rush to the right for 1 yard to the Cle33. Tackled by Demario Davis.","(4:34) Lucky Whitehead rush to the left for 2 yards to the Cle34. Tackled by Briean Boddy-Calhoun.","(5:17) Alfred Morris rush to the left for 5 yards to the Cle36. Tackled by Ed Reynolds and Jamie Meder.","(5:17) Dallas Cowboys timeout.","(5:46) Alfred Morris rush to the right for 2 yards to the Cle41. Tackled by Danny Shelton.","(6:26) Alfred Morris rush to the left for 3 yards to the Cle43. Tackled by Jamie Collins.","(7:08) Alfred Morris rush to the left for 4 yards to the Cle46. Tackled by Demario Davis.","(7:48) Alfred Morris rush to the right for 5 yards to the Dal50. Tackled by Cam Johnson.","(7:59) Britton Colquitt punts for 52 yards to Dal30. Lucky Whitehead return for 15 yards to Dal45. Tackled by Charley Hughlett.","(8:33) Cody Kessler pass to the right to Andrew Hawkins for 4 yards to the Cle18. Tackled by Orlando Scandrick.","(9:08) Isaiah Crowell rush to the left for a loss of 2 yards to the Cle14. Tackled by Demarcus Lawrence.","(9:41) Cody Kessler pass to the left to Isaiah Crowell for 4 yards to the Cle16. Tackled by Demarcus Lawrence.","(9:50) Chris Jones punts for 25 yards to Cle12. No return.","(9:55) Dak Prescott incomplete pass to the left intended for Jason Witten.","(10:35) Dak Prescott pass to the left to Cole Beasley for 5 yards to the Cle37. Tackled by Ibraheim Campbell.","(10:59) Penalty: Face Mask on Dallas (Travis Frederick) -15 yards.","(11:44) Alfred Morris rush to the right for 2 yards to the Cle27. Tackled by Danny Shelton and Ibraheim Campbell.","(12:20) Dak Prescott pass to the right to Cole Beasley for 6 yards to the Cle29. Tackled by Briean Boddy-Calhoun.","(12:59) Alfred Morris rush to the left for 2 yards to the Cle35. Tackled by Christian Kirksey and Xavier Cooper.","(13:38) Ezekiel Elliott rush to the left for 5 yards to the Cle37. Tackled by Jamie Collins.","(14:18) Dak Prescott pass to the right to Cole Beasley for 18 yards to the Cle42. Tackled by Ed Reynolds.","(15:00) Alfred Morris rush to the right for 1 yard to the Dal40. Tackled by Christian Kirksey and Emmanuel Ogbah.","(0:17) Alfred Morris rush to the left for 3 yards to the Dal39. Tackled by Cam Johnson.","(0:25) Britton Colquitt punts for 37 yards to Dal33. Lucky Whitehead return for 3 yards to Dal36.","(1:02) Cody Kessler rush to the right for 8 yards to the Cle30.","(1:08) Cody Kessler incomplete pass to the left intended for Corey Coleman.","(1:41) Cody Kessler sacked at Cle22 for a loss of 8 yards by Maliek Collins.","(1:41) Penalty: Offside on Dallas (Benson Mayowa) 5 yards.","(1:41) Dan Bailey kicks off to the endzone. Touchback.","(1:41) Dan Bailey extra point is good.","(1:46) Dak Prescott pass to the left to Gavin Escobar for 2 yards for a TOUCHDOWN.","(2:27) Ezekiel Elliott rush to the right for 2 yards to the Cle2. Tackled by Derrick Kindred and Christian Kirksey.","(3:16) Ezekiel Elliott rush to the left for 10 yards to the Cle4. Tackled by Jamie Meder.","(3:20) Dak Prescott incomplete pass to the middle intended for Dez Bryant.","(4:04) Dak Prescott pass to the left to Jason Witten for 27 yards to the Cle14. Tackled by Tramon Williams.","(4:45) Alfred Morris rush to the right for a loss of 1 yard to the Cle41. Tackled by Demario Davis.","(5:05) Penalty: Offside on Cleveland (Xavier Cooper) 5 yards.","(5:52) Dak Prescott pass to the right to Ezekiel Elliott for 5 yards to the Cle45. Tackled by Christian Kirksey.","(6:32) Dak Prescott rush to the left for 13 yards to the Dal50. Tackled by Briean Boddy-Calhoun.","(7:11) Ezekiel Elliott rush to the right for 1 yard to the Dal37. Tackled by Derrick Kindred.","(7:19) Britton Colquitt punts for 34 yards to Dal36. No return.","(7:57) Cody Kessler sacked at Cle30 for a loss of 2 yards by Justin Durant.","(8:01) Cody Kessler incomplete pass to the left intended for Terrelle Pryor Sr..","(8:31) Duke Johnson Jr. rush to the right for 2 yards to the Cle32. Tackled by Tyrone Crawford.","(9:10) Cody Kessler pass to the right to Terrelle Pryor Sr. for 6 yards to the Cle30. Tackled by Anthony Brown.","(9:47) Cody Kessler pass to the right to Isaiah Crowell for 13 yards to the Cle24. Tackled by Terrell McClain.","(10:32) Cody Kessler sacked at Cle11 for a loss of 8 yards by Maliek Collins.","(11:00) Cody Kessler pass to the right to Gary Barnidge for 9 yards to the Cle19. Tackled by Sean Lee.","(11:24) Isaiah Crowell rush to the right for 2 yards to the Cle10. Tackled by Anthony Hitchens and Terrell McClain.","(11:30) Dan Bailey kicks off to the Cle0. Ricardo Louis return for 16 yards to Cle16. Tackled by Leon McFadden. Penalty: Holding on Cleveland (Cam Johnson) -8 yards.","(11:30) Dan Bailey extra point is good.","(11:36) Ezekiel Elliott rush to the left for 8 yards for a TOUCHDOWN.","(12:03) Dak Prescott pass to the right to Jason Witten for 6 yards to the Cle8. Tackled by Christian Kirksey.","(12:07) Penalty: Offside on Cleveland (Tyrone Holmes) 5 yards.","(12:47) Dak Prescott rush to the right for 1 yard to the Cle19. Tackled by Demario Davis.","(12:52) Dak Prescott incomplete pass to the right intended for Terrance Williams.","(13:36) Dak Prescott pass to the left to Dez Bryant for 19 yards to the Cle20. Tackled by Joe Haden.","(14:18) Ezekiel Elliott rush to the left for 1 yard to the Cle39. Tackled by Demario Davis. FUMBLE, recovered by Dal (Ezekiel Elliott).","(15:00) Dak Prescott pass to the right to Jason Witten for 35 yards to the Cle40. Tackled by Derrick Kindred.","(15:00) Cody Parkey kicks off to the endzone. Touchback.","(0:23) Dak Prescott rush up the middle for a loss of 1 yard to the Dal24.","(0:23) Cody Parkey kicks off to the endzone. Touchback.","(0:23) Cody Parkey extra point is good.","(0:30) Cody Kessler pass to the right to Terrelle Pryor Sr. for 12 yards for a TOUCHDOWN.","(0:35) Cody Kessler incomplete pass to the left intended for Corey Coleman defensed by Brandon Carr.","(0:44) Cody Kessler pass to the left to Terrelle Pryor Sr. for 9 yards to the Dal25. Tackled by Brandon Carr. Penalty: Roughing Passer on Dallas (Demarcus Lawrence) 13 yards.","(0:50) Cody Kessler pass to the right to Corey Coleman for 12 yards to the Dal34.","(0:50) Cleveland Browns timeout.","(0:53) Duke Johnson Jr. rush to the right for 9 yards to the Dal46. Tackled by Maliek Collins.","(1:18) Cody Kessler pass to the middle to Duke Johnson Jr. for 7 yards to the Cle45. Tackled by Sean Lee and Orlando Scandrick.","(1:43) Cody Kessler pass to the right to Corey Coleman for 18 yards to the Cle38. Tackled by Anthony Hitchens.","(1:50) Dan Bailey kicks off to the Cle1. George Atkinson III return for 19 yards to Cle20. Tackled by Kyle Wilber.","(1:50) Dan Bailey extra point is good.","(1:54) Dak Prescott pass to the left to Cole Beasley for 6 yards for a TOUCHDOWN.","(2:00) Dak Prescott incomplete pass to the right intended for Jason Witten.","(2:00) Two Minute Warning.","(2:25) Dak Prescott pass to the right to Terrance Williams for 4 yards to the Cle6. Tackled by Ed Reynolds.","(3:05) Ezekiel Elliott rush to the left for 15 yards to the Cle10. Tackled by Ed Reynolds.","(3:38) Ezekiel Elliott rush to the left for 6 yards to the Cle25.","(4:21) Dak Prescott pass to the right to Cole Beasley for 12 yards to the Cle31. Tackled by Joe Haden.","(5:03) Ezekiel Elliott rush to the left for a loss of 3 yards to the Cle43. Tackled by Jamie Collins.","(5:49) Dak Prescott pass to the right to Jason Witten for 15 yards to the Cle40. Tackled by Derrick Kindred.","(6:29) Ezekiel Elliott rush to the left for 12 yards to the Dal45.","(6:38) Britton Colquitt punts for 38 yards to Dal33. Lucky Whitehead - no return. Tackled by Joe Schobert.","(7:16) Cody Kessler pass to the left to Gary Barnidge for 5 yards to the Cle29. Tackled by Jeff Heath.","(7:59) Isaiah Crowell rush to the right for a loss of 1 yard to the Cle24. Tackled by Cedric Thornton.","(8:34) Cody Kessler pass to the right to Terrelle Pryor Sr. for 4 yards to the Cle25. Tackled by Sean Lee.","(9:13) Duke Johnson Jr. rush to the right for 9 yards to the Cle21. Tackled by Byron Jones and J.J. Wilcox.","(9:54) Duke Johnson Jr. rush to the right for 2 yards to the Cle12. Tackled by Orlando Scandrick.","(10:02) Dan Bailey kicks off to the Cle2. Ricardo Louis return for 18 yards to Cle20. Tackled by J.J. Wilcox. Penalty: Holding on Cleveland (Ibraheim Campbell) -10 yards.","(10:02) Dan Bailey extra point is good.","(10:09) Ezekiel Elliott rush to the right for 10 yards for a TOUCHDOWN.","(10:47) Dak Prescott pass to the middle to Jason Witten for 10 yards to the Cle10. Tackled by Ibraheim Campbell.","(11:27) Dak Prescott pass to the left to Brice Butler for 9 yards to the Cle20. Tackled by Jamar Taylor.","(11:27) Penalty: False Start on Dallas (Doug Free) -5 yards.","(11:32) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(12:11) Dak Prescott pass to the right to Jason Witten for 10 yards to the Cle24. Tackled by Christian Kirksey.","(12:46) Alfred Morris rush to the left for 2 yards to the Cle34. Tackled by Emmanuel Ogbah and Jamie Collins.","(13:29) Alfred Morris rush to the right for 13 yards to the Cle36. Tackled by Ibraheim Campbell and Demario Davis.","(14:11) Alfred Morris rush to the right for 5 yards to the Cle49. Tackled by Jamie Collins.","(14:50) Dak Prescott pass to the right to Terrance Williams for 15 yards to the Dal46. Tackled by Ibraheim Campbell.","(14:54) 41 yard field goal attempt by Cody Parkey is NO GOOD. Holder: Britton Colquitt.","(15:00) Cody Kessler incomplete pass to the left intended for Terrelle Pryor Sr..","(0:13) Duke Johnson Jr. rush to the left for 8 yards to the Dal23. Tackled by Sean Lee.","(0:18) Cody Kessler incomplete pass to the right intended for Corey Coleman.","(0:47) Cody Kessler pass to the right to Corey Coleman for 11 yards to the Dal31. Tackled by Orlando Scandrick.","(1:17) Cody Kessler rush up the middle for 3 yards to the Dal42. Tackled by Benson Mayowa.","(1:50) Cody Kessler pass to the middle to Gary Barnidge for 9 yards to the Dal45. Tackled by Sean Lee.","(2:23) Isaiah Crowell rush to the left for 8 yards to the Cle46. Tackled by Anthony Hitchens.","(3:01) Cody Kessler sacked at Cle38 for a loss of 8 yards by Anthony Hitchens and Damien Wilson.","(3:11) Chris Jones punts for 50 yards to Cle44. Duke Johnson Jr. return for 2 yards to Cle46. Tackled by Damien Wilson.","(3:16) Dak Prescott incomplete pass to the middle intended for Dez Bryant defensed by Tramon Williams.","(3:58) Ezekiel Elliott rush to the left for no gain to the Dal6. Tackled by Cam Johnson.","(4:33) Ezekiel Elliott rush to the right for 5 yards to the Dal6. Tackled by Derrick Kindred.","(4:44) Britton Colquitt punts for 59 yards to Dal1. No return.","(5:22) Cody Kessler pass to the left to Duke Johnson Jr. for 9 yards to the Cle40. Tackled by Justin Durant.","(5:27) Cody Kessler incomplete pass to the left intended for Corey Coleman.","(5:45) Isaiah Crowell rush to the left for a loss of 5 yards to the Cle31. Tackled by Sean Lee.","(6:13) Cody Kessler pass to the left to Andrew Hawkins for 9 yards to the Cle36. Tackled by Brandon Carr.","(6:47) Cody Kessler pass to the right to Isaiah Crowell for 2 yards to the Cle27. Tackled by J.J. Wilcox and Sean Lee.","(6:47) Dan Bailey kicks off to the endzone. Touchback.","(6:47) Dan Bailey extra point is good.","(6:53) Dak Prescott pass to the right to Jason Witten for 26 yards for a TOUCHDOWN.","(7:39) Ezekiel Elliott rush to the right for 2 yards to the Cle26. Tackled by Derrick Kindred and Demario Davis.","(8:14) Ezekiel Elliott rush to the right for 10 yards to the Cle28. Tackled by Demario Davis.","(8:14) Dallas Cowboys timeout.","(8:53) Dak Prescott rush to the left for 7 yards to the Cle38. Tackled by Jamie Collins.","(9:46) Penalty: Offside on Cleveland (Emmanuel Ogbah) 5 yards.","(9:46) Dak Prescott pass to the middle to Jason Witten for 5 yards to the Dal50. Tackled by Jamie Collins and Christian Kirksey.","(10:27) Ezekiel Elliott rush to the right for a loss of 4 yards to the Dal45. Tackled by Christian Kirksey.","(11:05) Dak Prescott pass to the middle to Cole Beasley for 9 yards to the Dal49. Tackled by Jamar Taylor.","(11:42) Dak Prescott pass to the right to Geoff Swaim for 3 yards to the Dal40. Tackled by Tracy Howard.","(12:16) Ezekiel Elliott rush to the right for 4 yards to the Dal37. Tackled by Demario Davis.","(12:40) Ezekiel Elliott rush to the left for 8 yards to the Dal33. Tackled by Christian Kirksey and Emmanuel Ogbah.","(12:40) Cody Parkey kicks off to the endzone. Touchback.","(12:44) Cody Parkey 31 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(12:55) Cody Kessler incomplete pass to the left intended for Andrew Hawkins.","(13:00) Cody Kessler incomplete pass to the left intended for Andrew Hawkins.","(13:41) Isaiah Crowell rush to the right for 2 yards to the Dal13. Tackled by Anthony Hitchens and Sean Lee.","(14:27) Cody Kessler pass to the middle to Isaiah Crowell for 44 yards to the Dal15. Tackled by Anthony Hitchens.","(15:00) Cody Kessler pass to the right to Terrelle Pryor Sr. for 16 yards to the Cle41. Tackled by Orlando Scandrick.","(15:00) Dan Bailey kicks off to the endzone. Touchback."]