["(0:40) Andrew Luck rush up the middle for a loss of 1 yard to the GB23.","(1:19) Andrew Luck rush up the middle for a loss of 1 yard to the GB22.","(2:00) Andrew Luck rush up the middle for a loss of 1 yard to the GB21.","(2:00) Two Minute Warning.","(2:21) Andrew Luck pass to the middle to T.Y. Hilton for 27 yards to the GB20. Tackled by Ladarius Gunter.","(2:21) Indianapolis Colts timeout.","(2:25) Andrew Luck pass to the left to T.Y. Hilton for 6 yards to the GB47.","(3:07) Frank Gore rush up the middle for 2 yards to the Ind47. Tackled by Kentrell Brice.","(3:07) Green Bay Packers timeout.","(3:19) Andrew Luck pass to the left to Jack Doyle for 20 yards to the Ind45. Tackled by Kyler Fackrell.","(3:24) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(3:24) Green Bay Packers timeout.","(3:29) Frank Gore rush to the left for no gain to the Ind25. Tackled by Letroy Guion.","(3:29) Mason Crosby kicks off to the endzone. Touchback.","(3:29) Mason Crosby extra point is good.","(3:34) Aaron Rodgers pass to the left to Randall Cobb for 3 yards for a TOUCHDOWN.","(3:41) Aaron Rodgers pass to the left to Jordy Nelson for 13 yards to the Ind3. Tackled by Darius Butler.","(3:50) Aaron Rodgers rush to the right for 21 yards to the Ind16. Tackled by T.J. Green.","(4:18) Aaron Rodgers pass to the left to Aaron Ripkowski for 3 yards to the Ind37. Tackled by Clayton Geathers.","(4:52) Aaron Rodgers pass to the left to Richard Rodgers for 9 yards to the Ind40. Tackled by D'Qwell Jackson.","(4:57) Aaron Rodgers pass to the left to Jordy Nelson for 13 yards to the Ind49. Tackled by Vontae Davis.","(5:28) Aaron Rodgers pass to the middle to Ty Montgomery for 18 yards to the GB38. Tackled by Clayton Geathers and Hassan Ridgeway.","(5:35) Pat McAfee punts for 46 yards to GB20. No return.","(6:17) Andrew Luck pass to the left to Jack Doyle for 5 yards to the Ind34. Tackled by Kyler Fackrell.","(6:58) Frank Gore rush to the right for a loss of 3 yards to the Ind29. Tackled by Jake Ryan.","(7:40) Andrew Luck pass to the right to Erik Swoope for 7 yards to the Ind32. Tackled by Ladarius Gunter and Quinten Rollins.","(7:40) Mason Crosby kicks off to the endzone. Touchback.","(7:40) Aaron Rodgers 2 pt conversion pass is NO GOOD - intended for Davante Adams.","(7:43) Aaron Rodgers pass to the left to Davante Adams for 2 yards for a TOUCHDOWN.","(7:49) Aaron Rodgers incomplete pass to the right intended for Richard Rodgers.","(8:17) Aaron Rodgers pass to the left to Randall Cobb for 11 yards to the Ind2. Tackled by Frankie Williams.","(9:02) Aaron Rodgers pass to the right to Davante Adams for 40 yards to the Ind13. Tackled by D'Qwell Jackson.","(9:28) Aaron Rodgers pass to the left to Ty Montgomery for 7 yards to the GB32. Tackled by Vontae Davis. Penalty: Unnecessary Roughness on Indianapolis (Vontae Davis) 15 yards.","(9:35) Aaron Rodgers incomplete pass to the middle intended for Davante Adams.","(9:35) Pat McAfee kicks off to the endzone. Touchback.","(9:35) Adam Vinatieri extra point is good.","(9:39) Frank Gore rush to the right for 4 yards for a TOUCHDOWN.","(10:15) Frank Gore rush to the left for 5 yards to the GB4. Tackled by Morgan Burnett and Blake Martinez.","(10:19) Penalty: Holding on Green Bay (Kentrell Brice) 5 yards.","(10:25) Andrew Luck incomplete pass to the right intended for Robert Turbin.","(11:07) Andrew Luck pass to the right to Jack Doyle for 12 yards to the GB14. Tackled by Morgan Burnett.","(11:48) Frank Gore rush to the left for 6 yards to the GB26. Tackled by Jake Ryan.","(12:28) Andrew Luck pass to the left to Donte Moncrief for 39 yards to the GB32. Tackled by Ladarius Gunter.","(12:34) Jacob Schum punts for 31 yards to Ind29. No return.","(12:40) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(13:18) Aaron Rodgers rush to the left for 4 yards to the GB40. Tackled by Clayton Geathers.","(13:22) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(13:52) Aaron Ripkowski rush to the right for 2 yards to the GB36. Tackled by Arthur Jones.","(14:21) Aaron Rodgers pass to the right to Justin Perillo for 9 yards to the GB34. Tackled by Patrick Robinson.","(14:28) Pat McAfee punts for 67 yards to GB0. Touchback. Penalty: Illegal Formation on Indianapolis 5 yards.","(15:00) Andrew Luck sacked at Ind33 for a loss of 5 yards by Morgan Burnett.","(0:38) Andrew Luck pass to the left to Robert Turbin for 4 yards to the Ind38. Tackled by Joe Thomas.","(1:21) Frank Gore rush to the right for a loss of 3 yards to the Ind34. Tackled by Micah Hyde.","(1:46) Frank Gore rush up the middle for 7 yards to the Ind37. Tackled by Letroy Guion.","(1:46) Penalty: Offside on Green Bay (Mike Daniels) 5 yards.","(1:46) Mason Crosby kicks off to the endzone. Touchback.","(1:49) Mason Crosby 27 yard field goal attempt is GOOD. Holder: Jacob Schum.","(2:22) Aaron Rodgers rush to the right for 4 yards to the Ind9. Tackled by Clayton Geathers.","(2:27) Aaron Rodgers incomplete pass to the left intended for Geronimo Allison.","(3:16) Ty Montgomery rush to the right for 1 yard to the Ind13. Tackled by Clayton Geathers.","(3:53) Aaron Rodgers pass to the left to Jeff Janis for 25 yards to the Ind14. Tackled by T.J. Green and Darius Butler.","(4:35) Don Jackson rush to the left for 2 yards to the Ind39. Tackled by David Parry and Arthur Jones.","(5:25) Aaron Rodgers pass to the left to Ty Montgomery for 13 yards to the Ind41. Tackled by T.J. Green.","(6:08) Don Jackson rush to the right for 6 yards to the GB46. Tackled by David Parry and Arthur Jones.","(6:48) Aaron Rodgers pass to the right to Richard Rodgers for 1 yard to the GB40. Tackled by Edwin Jackson.","(7:24) Aaron Rodgers pass to the right to Jordy Nelson for 13 yards to the GB39. Tackled by Edwin Jackson.","(7:34) Pat McAfee punts for 54 yards to GB18. Trevor Davis return for 8 yards to GB26. Tackled by Curt Maggitt.","(7:38) Andrew Luck incomplete pass to the left intended for Jack Doyle defensed by Kyler Fackrell.","(8:20) Frank Gore rush to the right for no gain to the Ind28. Tackled by Jake Ryan and Nick Perry.","(8:43) Andrew Luck pass to the right to T.Y. Hilton for 7 yards to the Ind28. Tackled by Quinten Rollins.","(8:48) Aaron Rodgers pass intended for Davante Adams INTERCEPTED by Darius Butler. No return. Tackled by Justin Perillo.","(9:03) Green Bay Packers timeout.","(9:50) Aaron Rodgers sacked at Ind33 for a loss of 1 yard by David Parry.","(10:20) Aaron Rodgers pass to the right to Jordy Nelson for 10 yards to the Ind32. Tackled by Rashaan Melvin.","(10:50) Penalty: Holding on Green Bay (David Bakhtiari) -10 yards.","(10:55) Penalty: Holding on Indianapolis (Patrick Robinson) 5 yards.","(11:37) Aaron Rodgers rush to the left for 3 yards to the Ind37. Tackled by D'Qwell Jackson.","(12:21) Aaron Rodgers pass to the right to Jordy Nelson for 10 yards to the Ind40. Tackled by Rashaan Melvin.","(13:07) Ty Montgomery rush to the left for 4 yards to the GB50. Tackled by Arthur Jones and D'Qwell Jackson.","(13:43) Aaron Rodgers pass to the middle to Jordy Nelson for 9 yards to the GB46. Tackled by Rashaan Melvin.","(14:16) Aaron Rodgers pass to the right to Richard Rodgers for 11 yards to the GB37. Tackled by Clayton Geathers.","(14:51) Ty Montgomery rush to the right for 1 yard to the GB26. Tackled by David Parry.","(14:55) Aaron Rodgers incomplete pass to the middle intended for Davante Adams.","(15:00) Pat McAfee kicks off to the GB4. Trevor Davis return for 21 yards to GB25. Tackled by Akeem Ayers and Josh McNary.","(0:11) Aaron Rodgers rush up the middle for a loss of 1 yard to the GB24.","(0:11) Pat McAfee kicks off to the endzone. Touchback.","(0:11) Adam Vinatieri extra point is good.","(0:15) Andrew Luck pass to the left to Donte Moncrief for 8 yards for a TOUCHDOWN.","(0:37) Andrew Luck pass to the middle to Jack Doyle for 12 yards to the GB8. Tackled by Ladarius Gunter.","(0:37) Indianapolis Colts timeout.","(0:43) Andrew Luck rush to the left for 7 yards to the GB20. Tackled by Jake Ryan.","(0:46) Andrew Luck incomplete pass to the left intended for Donte Moncrief.","(0:46) Indianapolis Colts timeout.","(0:59) Andrew Luck pass to the left to Robert Turbin for 9 yards to the GB27. Tackled by Ladarius Gunter.","(1:25) Andrew Luck pass to the left to Jack Doyle for 12 yards to the GB36. Tackled by Morgan Burnett.","(1:33) Andrew Luck incomplete pass to the middle intended for Jack Doyle.","(1:56) Robert Turbin rush up the middle for 7 yards to the GB48. Tackled by Blake Martinez.","(2:00) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(2:00) Two Minute Warning.","(2:39) Frank Gore rush to the right for 3 yards to the Ind45. Tackled by Jake Ryan.","(2:58) Penalty: Offside on Green Bay (Julius Peppers) 5 yards.","(3:35) Andrew Luck pass to the middle to T.Y. Hilton for 17 yards to the Ind37. Tackled by Micah Hyde.","(4:17) Frank Gore rush to the right for 2 yards to the Ind20. Tackled by Letroy Guion and Blake Martinez.","(4:58) Andrew Luck pass to the middle to Phillip Dorsett for 13 yards to the Ind18. Tackled by Joe Thomas.","(5:07) Andrew Luck incomplete pass to the middle intended for Donte Moncrief.","(5:44) Frank Gore rush to the right for 1 yard to the Ind5. Tackled by Morgan Burnett and Datone Jones.","(5:51) Jacob Schum punts for 43 yards to Ind4. No return.","(6:25) Aaron Rodgers sacked at Ind47 for no gain by Erik Walden.","(7:12) Aaron Ripkowski rush to the left for 2 yards to the Ind47. Tackled by Arthur Jones.","(7:17) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(7:53) Ty Montgomery rush to the left for 4 yards to the Ind49. Tackled by Clayton Geathers.","(8:16) Aaron Rodgers pass to the left to Justin Perillo for 9 yards to the GB47. Tackled by D'Qwell Jackson.","(8:39) Ty Montgomery rush to the right for 17 yards to the GB38. Tackled by T.J. Green.","(9:23) Pat McAfee punts for 55 yards to GB21. No return.","(9:23) Andrew Luck sacked at Ind24 for a loss of 6 yards by Ha Ha Clinton-Dix and Nick Perry.","(9:29) Andrew Luck incomplete pass to the left intended for Jack Doyle.","(10:00) Andrew Luck rush to the left for 3 yards to the Ind30. Tackled by Jake Ryan and Morgan Burnett.","(10:14) Andrew Luck pass to the right to Josh Ferguson for 9 yards to the Ind27. Tackled by Blake Martinez.","(10:55) Frank Gore rush to the right for 2 yards to the Ind18. Tackled by Mike Daniels.","(11:36) Andrew Luck rush to the left for 6 yards to the Ind16. Tackled by Blake Martinez.","(11:45) Jacob Schum punts for 65 yards to Ind10. Chester Rogers - no return. FUMBLE, recovered by Ind.","(11:53) Aaron Rodgers incomplete pass to the left intended for Jeff Janis.","(11:59) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(12:05) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Rashaan Melvin.","(12:05) Pat McAfee kicks off to the endzone. Touchback.","(12:09) Adam Vinatieri 28 yard field goal attempt is GOOD. Holder: Pat McAfee.","(12:53) Andrew Luck rush to the left for 2 yards to the GB10. Tackled by Micah Hyde.","(13:35) Robert Turbin rush to the right for 3 yards to the GB12. Tackled by Jake Ryan and Nick Perry.","(13:41) Andrew Luck incomplete pass to the right intended for Dwayne Allen defensed by Jake Ryan.","(14:03) Andrew Luck pass to the right to Frank Gore for 11 yards to the GB15. Tackled by Joe Thomas.","(14:08) Andrew Luck incomplete pass to the left intended for Phillip Dorsett.","(14:35) Frank Gore rush up the middle for 11 yards to the GB26. Tackled by Nick Perry and Blake Martinez.","(14:50) Andrew Luck pass to the left to Donte Moncrief for 8 yards to the GB37. Tackled by Ladarius Gunter.","(15:00) Mason Crosby kicks off to the Ind-6. Jordan Todman return for 61 yards to GB45. Tackled by Blake Martinez.","(15:00) Mason Crosby extra point is good.","(0:01) Aaron Rodgers pass to the left to Jordy Nelson for 26 yards for a TOUCHDOWN.","(0:39) Aaron Rodgers pass to the right to Richard Rodgers for 9 yards to the Ind26. Tackled by Edwin Jackson.","(0:46) Aaron Rodgers incomplete pass to the left intended for Richard Rodgers.","(1:25) Aaron Rodgers rush to the right for 12 yards to the Ind35. Tackled by Patrick Robinson.","(1:32) Andrew Luck pass intended for Jack Doyle INTERCEPTED by Ha Ha Clinton-Dix. No return.","(2:13) Frank Gore rush up the middle for 9 yards to the Ind24. Tackled by Blake Martinez.","(2:47) Frank Gore rush to the left for 2 yards to the Ind15. Tackled by Jake Ryan.","(3:00) Jacob Schum punts for 54 yards to Ind20. Chester Rogers return for 3 yards to Ind23. Tackled by Jake Ryan. Penalty: Illegal Block on Indianapolis (Edwin Jackson) -10 yards.","(3:05) Aaron Rodgers incomplete pass to the middle intended for Richard Rodgers defensed by Clayton Geathers.","(3:44) Don Jackson rush to the right for 4 yards to the GB26. Tackled by D'Qwell Jackson.","(4:23) Don Jackson rush to the left for 4 yards to the GB22. Tackled by Arthur Jones and Edwin Jackson.","(4:28) Pat McAfee kicks off to the GB1. Trevor Davis return for 17 yards to GB18. Tackled by Josh McNary.","(4:28) Adam Vinatieri extra point is good.","(4:33) Frank Gore rush to the left for 7 yards for a TOUCHDOWN.","(5:16) Andrew Luck pass to the middle to Dwayne Allen for 15 yards to the GB7. Tackled by Ha Ha Clinton-Dix.","(5:48) Andrew Luck pass to the left to T.Y. Hilton for 5 yards to the GB22. Tackled by Kyler Fackrell.","(6:29) Andrew Luck pass to the left to Frank Gore for no gain to the GB27. Tackled by Jake Ryan.","(7:00) Andrew Luck pass to the right to T.Y. Hilton for 20 yards to the GB27. Tackled by Jake Ryan.","(7:31) Andrew Luck pass to the right to Phillip Dorsett for 15 yards to the GB47. Tackled by Quinten Rollins.","(7:35) Andrew Luck incomplete pass to the left intended for Donte Moncrief defensed by Datone Jones.","(7:40) 48 yard field goal attempt by Mason Crosby is NO GOOD. Holder: Jacob Schum.","(7:45) Aaron Rodgers incomplete pass to the right intended for Richard Rodgers.","(8:26) Aaron Rodgers pass to the right to Davante Adams for a loss of 3 yards to the Ind30. Tackled by Rashaan Melvin.","(9:08) Aaron Rodgers pass to the left to Davante Adams for 2 yards to the Ind27. Tackled by Vontae Davis.","(9:22) Andrew Luck pass intended for Phillip Dorsett INTERCEPTED by Ha Ha Clinton-Dix and returned for 20 yards. Tackled by Robert Turbin.","(10:06) Frank Gore rush up the middle for 5 yards to the Ind30. Tackled by Jake Ryan.","(10:46) Frank Gore rush to the left for no gain to the Ind25. Tackled by Ha Ha Clinton-Dix and Julius Peppers.","(10:46) Mason Crosby kicks off to the endzone. Touchback.","(10:50) Mason Crosby 34 yard field goal attempt is GOOD. Holder: Jacob Schum.","(10:55) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(11:03) Aaron Rodgers incomplete pass to the left.","(11:47) Aaron Rodgers sacked at Ind16 for a loss of 7 yards by Lavar Edwards.","(12:33) Aaron Rodgers pass to the left to Richard Rodgers for 22 yards to the Ind9. Tackled by Vontae Davis.","(13:16) Aaron Rodgers pass to the left to Richard Rodgers for 12 yards to the Ind31. Tackled by T.J. Green.","(13:24) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(14:04) Ty Montgomery rush to the left for 2 yards to the Ind43. Tackled by T.J. Green and Clayton Geathers.","(14:42) Ty Montgomery rush to the left for 24 yards to the Ind45. Tackled by D'Qwell Jackson.","(14:47) Pat McAfee kicks off to the GB5. Trevor Davis return for 26 yards to GB31. Tackled by Erik Swoope.","(14:47) Adam Vinatieri extra point is good.","(15:00) Mason Crosby kicks off to the Ind1. Jordan Todman return for 99 yards for a TOUCHDOWN."]