["(0:31) Cam Newton rush up the middle for a loss of 1 yard to the Car23.","(0:34) Greg Zuerlein onside kickoff to the Car19. Onside kick recovered by receiving team by Ted Ginn Jr.. Penalty: Illegal Formation on Los Angeles 5 yards.","(0:34) Greg Zuerlein extra point is good.","(0:38) Case Keenum pass to the right to Kenny Britt for 10 yards for a TOUCHDOWN.","(0:38) Los Angeles Rams timeout.","(0:44) Case Keenum sacked at Car10 for a loss of 4 yards by Kony Ealy.","(0:48) Case Keenum incomplete pass to the right intended for Kenny Britt defensed by James Bradberry.","(0:51) Case Keenum pass to the left to Brian Quick for 1 yard to the Car6. Tackled by Daryl Worley and Kurt Coleman.","(1:14) Case Keenum pass to the left to Brian Quick for 27 yards to the Car7. Tackled by Daryl Worley.","(1:14) Los Angeles Rams timeout.","(1:30) Case Keenum pass to the right to Benny Cunningham for 6 yards to the Car34. Tackled by Charles Johnson.","(1:37) Case Keenum incomplete pass to the right intended for Brian Quick.","(1:44) Case Keenum pass to the left to Benny Cunningham for 7 yards to the Car40. Tackled by Thomas Davis.","(1:44) Penalty: Offside on Carolina (Mario Addison) 5 yards.","(1:52) Case Keenum pass to the left to Lance Kendricks for 9 yards to the LA48. Tackled by Thomas Davis.","(2:00) Case Keenum incomplete pass to the right intended for Tavon Austin defensed by James Bradberry.","(2:00) Two Minute Warning.","(2:14) Case Keenum pass to the middle to Benny Cunningham for 2 yards to the LA39. Tackled by Luke Kuechly.","(2:39) Case Keenum pass to the left to Benny Cunningham for 11 yards to the LA37. Tackled by Thomas Davis.","(2:44) Case Keenum incomplete pass to the left intended for Tyler Higbee defensed by Tre Boston.","(3:07) Case Keenum pass to the left to Kenny Britt for 11 yards to the LA26. Tackled by Daryl Worley.","(3:11) Case Keenum incomplete pass to the right intended for Tyler Higbee.","(3:18) Penalty: Holding on Los Angeles (Rob Havenstein) -10 yards.","(3:18) Graham Gano kicks off to the endzone. Touchback.","(3:23) Graham Gano 37 yard field goal attempt is GOOD. Holder: Andy Lee.","(3:28) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(4:13) Cam Newton rush to the right for 4 yards to the LA19. Tackled by T.J. McDonald.","(4:13) Carolina Panthers timeout.","(4:59) Mike Tolbert rush up the middle for a loss of 1 yard to the LA23. Tackled by Mark Barron.","(5:30) Jonathan Stewart rush to the right for 2 yards to the LA37. Tackled by William Hayes. Penalty: Horse Collar Tackle on Los Angeles (William Hayes) 15 yards.","(6:13) Cam Newton pass to the left to Kelvin Benjamin for 15 yards to the LA39. Tackled by E.J. Gaines.","(6:50) Jonathan Stewart rush to the left for 6 yards to the Car46. Tackled by William Hayes.","(7:12) Penalty: False Start on Carolina (Trai Turner) -5 yards.","(7:24) Penalty: Offside on Los Angeles (Robert Quinn) 5 yards.","(8:01) Cam Newton pass to the left to Kelvin Benjamin for 15 yards to the Car40. Tackled by E.J. Gaines.","(8:01) Greg Zuerlein kicks off to the endzone. Touchback.","(8:06) Greg Zuerlein 25 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(8:11) Case Keenum incomplete pass to the left intended for Lance Kendricks.","(8:16) Case Keenum incomplete pass to the left intended for Tyler Higbee.","(8:21) Case Keenum incomplete pass to the left intended for Lance Kendricks.","(9:00) Todd Gurley rush to the left for 10 yards to the Car7. Tackled by Kurt Coleman.","(9:35) Case Keenum pass to the left to Lance Kendricks for 25 yards to the Car17. Tackled by Kurt Coleman.","(9:35) Carolina Panthers timeout.","(9:58) Case Keenum pass to the middle to Todd Gurley for 11 yards to the Car42. Tackled by Luke Kuechly.","(10:21) Case Keenum pass to the left to Lance Kendricks for 9 yards to the LA47. Tackled by Michael Griffin.","(10:46) Case Keenum pass to the left to Lance Kendricks for 12 yards to the LA38. Tackled by Michael Griffin.","(11:12) Tavon Austin rush to the left for 1 yard to the LA26. Tackled by Kurt Coleman.","(11:12) Graham Gano kicks off to the endzone. Touchback.","(11:17) Graham Gano 38 yard field goal attempt is GOOD. Holder: Andy Lee.","(11:59) Cam Newton sacked at LA20 for a loss of 9 yards by Aaron Donald.","(12:40) Jonathan Stewart rush to the right for 6 yards to the LA11. Tackled by Mark Barron.","(13:16) Jonathan Stewart rush to the left for 2 yards to the LA17. Tackled by Mark Barron.","(13:53) Jonathan Stewart rush up the middle for 17 yards to the LA19. Tackled by Alec Ogletree and Trumaine Johnson.","(14:30) Cam Newton pass to the left to Ted Ginn Jr. for 9 yards to the LA36. Tackled by E.J. Gaines.","(15:00) Cam Newton rush up the middle for 1 yard to the LA45.","(0:01) Cam Newton pass to the right to Ted Ginn Jr. for 4 yards to the LA46. Tackled by Mark Barron.","(0:05) Cam Newton incomplete pass to the middle intended for Corey Brown.","(0:05) Penalty: Encroachment on Los Angeles (Cam Thomas) 5 yards.","(0:13) Case Keenum pass intended for Tyler Higbee INTERCEPTED by Thomas Davis. No return. Tackled by Tyler Higbee.","(0:46) Benny Cunningham rush up the middle for 3 yards to the LA43. Tackled by Thomas Davis.","(1:17) Case Keenum pass to the right to Tavon Austin for 17 yards to the LA40.","(1:48) Case Keenum pass to the left to Todd Gurley for 5 yards to the LA33. Tackled by Kurt Coleman. Penalty: Holding on Los Angeles (Kenny Britt) -10 yards.","(2:22) Todd Gurley rush to the right for 3 yards to the LA28. Tackled by Luke Kuechly and Kony Ealy.","(2:48) Case Keenum pass to the left to Lance Kendricks for 8 yards to the LA25. Tackled by Kurt Coleman.","(3:19) Case Keenum pass to the right to Todd Gurley for 5 yards to the LA17.","(3:27) Andy Lee punts for 38 yards to LA12. No return.","(3:54) Cam Newton pass to the left to Ted Ginn Jr. for 7 yards to the Car50. Tackled by E.J. Gaines.","(4:39) Cam Newton sacked at Car43 for a loss of 8 yards by Mark Barron.","(5:20) Jonathan Stewart rush to the right for 1 yard to the LA49. Tackled by Mark Barron.","(6:01) Cam Newton pass to the right to Greg Olsen for 7 yards to the Car50. Tackled by T.J. McDonald.","(6:40) Cam Newton pass to the right to Ed Dickson for 6 yards to the Car43. Tackled by Alec Ogletree.","(7:16) Cam Newton pass to the right to Ted Ginn Jr. for 8 yards to the Car37. Tackled by Alec Ogletree.","(7:37) Cam Newton pass to the left to Fozzy Whittaker for 1 yard to the Car39. Tackled by Mark Barron. Penalty: Illegal Block on Carolina (Gino Gradkowski) -10 yards.","(7:46) Johnny Hekker punts for 43 yards to Car38. No return.","(8:25) Case Keenum sacked at LA19 for a loss of 6 yards by Mario Addison.","(9:03) Malcolm Brown rush up the middle for no gain to the LA25. Tackled by Luke Kuechly.","(9:29) Case Keenum pass to the left to Todd Gurley for 5 yards to the LA25. Tackled by Thomas Davis.","(9:36) Andy Lee punts for 40 yards to LA0. Touchback.","(9:36) Los Angeles Rams timeout.","(10:14) Cam Newton sacked at LA40 for a loss of 10 yards by Aaron Donald.","(10:14) Carolina Panthers timeout.","(10:18) Cam Newton incomplete pass to the right intended for Devin Funchess.","(11:02) Cam Newton rush to the right for 1 yard to the LA30. Tackled by E.J. Gaines.","(11:23) Cam Newton pass to the right to Corey Brown for 11 yards to the LA31. Tackled by Lamarcus Joyner.","(12:08) Cam Newton rush to the left for 2 yards to the LA42. Tackled by Alec Ogletree.","(12:15) Cam Newton incomplete pass to the left intended for Devin Funchess.","(12:57) Cam Newton pass to the left to Devin Funchess for 28 yards to the LA44. Tackled by Lamarcus Joyner.","(13:39) Mike Tolbert rush up the middle for 2 yards to the Car28. Tackled by Alec Ogletree.","(14:22) Cam Newton rush up the middle for 3 yards to the Car26. Tackled by Eugene Sims.","(14:54) Cam Newton pass to the right to Greg Olsen for 11 yards to the Car23. Tackled by Mark Barron.","(15:00) Greg Zuerlein kicks off to the Car2. Joe Webb return for 8 yards to Car12. Tackled by Bryce Hager.","(0:04) 55 yard field goal attempt by Greg Zuerlein is NO GOOD. Holder: Johnny Hekker.","(0:04) Los Angeles Rams timeout.","(0:11) Case Keenum pass to the left to Brian Quick for 11 yards to the Car37. Tackled by Thomas Davis and Daryl Worley.","(0:13) Case Keenum incomplete pass to the left intended for Todd Gurley.","(0:23) Case Keenum pass to the left to Kenny Britt for 13 yards to the Car48. Tackled by Daryl Worley.","(0:29) Case Keenum incomplete pass to the middle intended for Kenny Britt defensed by Daryl Worley.","(0:34) 48 yard field goal attempt by Graham Gano is NO GOOD. Holder: Andy Lee.","(0:42) Cam Newton incomplete pass to the right intended for Greg Olsen.","(0:42) Carolina Panthers timeout.","(0:47) Cam Newton incomplete pass to the middle intended for Ed Dickson.","(0:56) Penalty: Holding on Carolina (Mike Remmers) -10 yards.","(1:28) Fozzy Whittaker rush up the middle for no gain to the LA21. Tackled by William Hayes.","(2:00) Cam Newton pass to the left to Kelvin Benjamin for 24 yards to the LA21. Tackled by E.J. Gaines and Lamarcus Joyner.","(2:00) Two Minute Warning.","(2:34) Jonathan Stewart rush to the left for a loss of 2 yards to the LA45. Tackled by Eugene Sims.","(3:08) Cam Newton pass to the right to Greg Olsen for 18 yards to the LA43. Tackled by Trumaine Johnson.","(3:15) Todd Gurley rush up the middle for a loss of 1 yard to the Car39. Tackled by A.J. Klein and Luke Kuechly.","(3:57) Case Keenum pass to the left to Brian Quick for 9 yards to the Car38. Tackled by Leonard Johnson.","(4:02) Case Keenum incomplete pass to the left intended for Bradley Marquez.","(4:10) Case Keenum incomplete pass to the right intended for Tyler Higbee.","(4:48) Todd Gurley rush up the middle for 18 yards to the Car47. Tackled by Kurt Coleman.","(5:06) Andy Lee punts for 46 yards to LA26. Tavon Austin return for 19 yards to LA45. Tackled by A.J. Klein and Jeremy Cash. Penalty: Illegal Block on Los Angeles (Chase Reynolds) -10 yards.","(5:43) Cam Newton pass to the right to Kelvin Benjamin for 16 yards to the Car28. Tackled by Maurice Alexander.","(6:29) Cam Newton sacked at Car12 for a loss of 8 yards by Eugene Sims.","(6:34) Cam Newton incomplete pass to the middle intended for Greg Olsen.","(6:39) Johnny Hekker punts for 40 yards to Car0. Touchback.","(6:39) Carolina Panthers timeout.","(7:23) Case Keenum sacked at Car40 for a loss of 4 yards by Thomas Davis. FUMBLE, recovered by LA (Benny Cunningham).","(8:03) Case Keenum pass to the right to Lance Kendricks for 12 yards to the Car36. Tackled by Thomas Davis.","(8:41) Todd Gurley rush up the middle for 1 yard to the Car48. Tackled by Wes Horton and Thomas Davis.","(9:10) Case Keenum pass to the right to Pharoh Cooper for 3 yards to the Car39. Penalty: Holding on Los Angeles (Brian Quick) -10 yards.","(9:46) Todd Gurley rush up the middle for 3 yards to the Car42. Tackled by Leonard Johnson.","(10:23) Benny Cunningham rush to the left for 3 yards to the Car45. Tackled by Luke Kuechly.","(11:06) Case Keenum pass to the left to Benny Cunningham for 6 yards to the Car48. Tackled by Thomas Davis.","(11:19) Andy Lee punts for 48 yards to LA41. Tavon Austin return for 5 yards to LA46. Tackled by Michael Griffin.","(11:24) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(12:11) Jonathan Stewart rush to the right for 5 yards to the Car11. Tackled by Alec Ogletree.","(12:54) Jonathan Stewart rush up the middle for no gain to the Car6. Tackled by Mark Barron.","(13:01) Johnny Hekker punts for 37 yards to Car11. No return. Penalty: Holding on Carolina (Charles Johnson) -5 yards.","(13:14) Case Keenum incomplete pass to the right intended for Brian Quick.","(13:20) Case Keenum incomplete pass to the right intended for Lance Kendricks.","(13:59) Todd Gurley rush to the right for 3 yards to the Car48. Tackled by Michael Griffin.","(14:42) Case Keenum pass to the left to Tyler Higbee for 31 yards to the LA49. Tackled by A.J. Klein.","(14:54) Andy Lee punts for 58 yards to LA4. Tavon Austin return for 14 yards to LA18. Tackled by Jeremy Cash.","(15:00) Cam Newton incomplete pass to the left intended for Ted Ginn Jr..","(0:33) Jonathan Stewart rush to the right for a loss of 2 yards to the Car38. Tackled by Aaron Donald.","(0:37) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(0:45) Penalty: Pass Interference on Los Angeles (Lamarcus Joyner) 29 yards.","(1:30) Jonathan Stewart rush to the left for no gain to the Car11. Tackled by Alec Ogletree.","(2:07) Jonathan Stewart rush up the middle for a loss of 2 yards to the Car11. Tackled by William Hayes.","(2:22) Johnny Hekker punts for 75 yards to Car13. No return.","(2:56) Case Keenum sacked at LA12 for a loss of 2 yards by Mario Addison.","(3:02) Case Keenum incomplete pass to the right intended for Tyler Higbee.","(3:36) Todd Gurley rush to the left for 5 yards to the LA14. Tackled by Kony Ealy.","(3:44) Graham Gano kicks off to the LA-6. Benny Cunningham return for 10 yards to LA4. Lateral to Cody Davis for 15 yards to the LA19. Tackled by Graham Gano. Penalty: Holding on Los Angeles (Eugene Sims) -10 yards.","(3:44) Graham Gano extra point is good.","(3:49) Cam Newton pass to the right to Greg Olsen for 9 yards for a TOUCHDOWN.","(4:34) Jonathan Stewart rush to the right for 5 yards to the LA9. Tackled by William Hayes.","(4:40) Cam Newton incomplete pass to the left intended for Devin Funchess defensed by E.J. Gaines.","(5:26) Cam Newton rush up the middle for 6 yards to the LA14. Tackled by Aaron Donald.","(6:08) Cam Newton pass to the right to Kelvin Benjamin for 6 yards to the LA20. Tackled by Trumaine Johnson.","(6:43) Jonathan Stewart rush up the middle for no gain to the LA26. Tackled by Dominique Easley.","(7:24) Cam Newton pass to the right to Ed Dickson for 11 yards to the LA26. Tackled by Lamarcus Joyner.","(8:06) Cam Newton pass to the right to Ted Ginn Jr. for 12 yards to the LA37. Tackled by Trumaine Johnson.","(8:51) Jonathan Stewart rush to the right for 4 yards to the LA49. Tackled by Alec Ogletree and Dominique Easley.","(9:03) Johnny Hekker punts for 48 yards to Car47. No return.","(9:09) Case Keenum incomplete pass to the left intended for Benny Cunningham defensed by Mario Addison.","(9:13) Case Keenum incomplete pass to the right intended for Lance Kendricks defensed by Charles Johnson.","(9:48) Todd Gurley rush up the middle for 2 yards to the LA5. Tackled by Kawann Short.","(9:59) Andy Lee punts for 52 yards to LA1. Tavon Austin return for 2 yards to LA3. Tackled by Corey Brown.","(10:36) Cam Newton sacked at Car47 for a loss of 5 yards by Cam Thomas.","(11:12) Cam Newton pass to the left to Greg Olsen for 7 yards to the LA48. Tackled by Alec Ogletree.","(11:16) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by Josh Forrest.","(11:22) 55 yard field goal attempt by Greg Zuerlein is NO GOOD. Holder: Johnny Hekker.","(11:28) Case Keenum incomplete pass to the left intended for Lance Kendricks defensed by Kawann Short.","(12:05) Todd Gurley rush to the left for 2 yards to the Car37. Tackled by Tre Boston.","(12:43) Benny Cunningham rush up the middle for 4 yards to the Car39. Tackled by Michael Griffin.","(13:21) Case Keenum pass to the left to Kenny Britt for 15 yards to the Car43. Tackled by Tre Boston.","(13:57) Todd Gurley rush to the left for no gain to the LA42. Tackled by Kawann Short.","(14:33) Todd Gurley rush to the right for 2 yards to the LA42. Tackled by Thomas Davis.","(15:00) Case Keenum pass to the right to Lance Kendricks for 15 yards to the LA40. Tackled by James Bradberry.","(15:00) Graham Gano kicks off to the endzone. Touchback."]