["(0:30) Nick Foles rush up the middle for a loss of 1 yard to the KC44.","(1:01) Nick Foles rush up the middle for a loss of 1 yard to the KC45.","(1:43) Nick Foles rush up the middle for a loss of 1 yard to the KC46.","(1:43) Jacksonville Jaguars timeout.","(1:51) Charcandrick West rush to the right for 14 yards to the KC47. Tackled by Paul Posluszny.","(1:51) Jacksonville Jaguars timeout.","(1:55) Charcandrick West rush up the middle for 1 yard to the KC33. Tackled by Johnathan Cyprien.","(2:00) Blake Bortles incomplete pass to the left intended for Bryan Walters defensed by Steven Nelson.","(2:00) Two Minute Warning.","(2:10) T.J. Yeldon rush up the middle for a loss of 2 yards to the KC32. Tackled by Dontari Poe.","(2:15) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(2:48) Blake Bortles pass to the left to Julius Thomas for 9 yards to the KC30. Tackled by Daniel Sorensen.","(2:57) Blake Bortles rush to the left for 26 yards to the KC39. Tackled by Eric Berry.","(3:01) Blake Bortles incomplete pass to the left intended for Marcedes Lewis defensed by Eric Berry.","(3:15) Dustin Colquitt punts for 59 yards to Jax23. Bryan Walters return for 12 yards to Jax35. Tackled by D.J. Alexander.","(3:15) Jacksonville Jaguars timeout.","(3:22) Nick Foles sacked at KC18 for a loss of 11 yards by Sen'Derrick Marks.","(3:26) Nick Foles incomplete pass to the left intended for Tyreek Hill defensed by Telvin Smith.","(4:10) Knile Davis rush up the middle for 4 yards to the KC29. Tackled by Dante Fowler Jr..","(4:10) Jason Myers kicks off to the endzone. Touchback.","(4:10) Jason Myers extra point is good.","(4:15) Blake Bortles pass to the right to T.J. Yeldon for 13 yards for a TOUCHDOWN.","(4:20) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(4:50) Blake Bortles pass to the middle to T.J. Yeldon for 10 yards to the KC13. Tackled by Rakeem Nunez-Roches.","(4:58) Blake Bortles rush to the left for no gain to the KC23. Tackled by Phillip Gaines.","(5:34) Blake Bortles pass to the left to Allen Robinson for 10 yards to the KC23. Tackled by Phillip Gaines.","(5:40) Blake Bortles incomplete pass to the left intended for Allen Robinson defensed by Steven Nelson.","(6:05) Blake Bortles pass to the left to Marqise Lee for 16 yards to the KC33. Tackled by Phillip Gaines.","(6:08) Blake Bortles incomplete pass to the middle intended for Chris Ivory.","(6:34) Chris Ivory rush to the left for 12 yards to the KC49. Tackled by Steven Nelson.","(6:46) Dustin Colquitt punts for 54 yards to Jax31. Bryan Walters return for 8 yards to Jax39. Tackled by Frank Zombo.","(7:31) Nick Foles sacked at KC15 for a loss of 7 yards by Malik Jackson and Dante Fowler Jr..","(7:37) Nick Foles incomplete pass to the middle intended for Chris Conley.","(8:23) Charcandrick West rush to the left for 2 yards to the KC22. Tackled by Yannick Ngakoue.","(8:28) Chris Ivory rush up the middle for no gain to the KC1. Tackled by Ramik Wilson. FUMBLE, recovered by KC (Marcus Peters). Touchback.","(9:07) Chris Ivory rush up the middle for 2 yards to the KC1. Tackled by Eric Berry.","(9:30) Blake Bortles pass to the right to Marqise Lee for 51 yards to the KC3. Tackled by Marcus Peters.","(9:47) Blake Bortles pass to the left to Arrelious Benn for 16 yards to the Jax46. Tackled by Phillip Gaines.","(10:20) Blake Bortles pass to the left to T.J. Yeldon for 5 yards to the Jax30. Tackled by Kendall Reyes.","(10:20) Cairo Santos kicks off to the endzone. Touchback.","(10:23) Cairo Santos 36 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(11:13) Nick Foles pass to the right to Charcandrick West for 24 yards to the Jax18. Tackled by Aaron Colvin.","(11:18) Nick Foles incomplete pass to the right intended for Travis Kelce defensed by Prince Amukamara. Penalty: Unsports. Conduct on Kansas City (Travis Kelce) -15 yards. Penalty: Disqualification on Kansas City (Travis Kelce) -15 yards.","(12:03) Knile Davis rush to the right for 6 yards to the Jax12. Tackled by Paul Posluszny and Jalen Ramsey.","(12:46) Nick Foles pass to the left to Travis Kelce for 14 yards to the Jax18. Tackled by Telvin Smith.","(13:42) Charcandrick West rush to the left for 3 yards to the Jax32. Tackled by Abry Jones.","(14:23) Nick Foles pass to the right to James O'Shaughnessy for no gain to the Jax35. Tackled by Paul Posluszny.","(15:00) Nick Foles pass to the middle to Albert Wilson for 16 yards to the Jax35. Tackled by Telvin Smith.","(0:29) Tyreek Hill rush to the left for 5 yards to the KC49. Tackled by Myles Jack.","(0:34) 54 yard field goal attempt by Jason Myers is NO GOOD. Holder: Brad Nortman.","(0:39) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(1:24) Chris Ivory rush to the right for a loss of 2 yards to the KC36. Tackled by Jaye Howard and Chris Jones.","(1:49) Chris Ivory rush to the right for 7 yards to the KC34. Tackled by Daniel Sorensen and Eric Berry.","(2:25) Blake Bortles pass to the right to Marcedes Lewis for 6 yards to the KC41. Tackled by Ron Parker.","(3:10) Blake Bortles pass to the middle to Allen Robinson for 19 yards to the KC47. Tackled by Daniel Sorensen.","(3:16) Penalty: Holding on Jacksonville (A.J. Cann) -10 yards.","(3:50) Chris Ivory rush up the middle for no gain to the Jax44. Tackled by Derrick Johnson.","(3:59) Cairo Santos kicks off to the Jax-1. Marqise Lee return for 45 yards to Jax44. Tackled by Terrance Smith and D.J. Alexander.","(4:02) Cairo Santos 24 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(4:45) Nick Foles pass to the left to Albert Wilson for 3 yards to the Jax5. Tackled by Prince Amukamara.","(4:48) Nick Foles incomplete pass to the right intended for Tyreek Hill.","(5:22) Nick Foles pass to the right to Tyreek Hill for 5 yards to the Jax8. Tackled by Paul Posluszny and Aaron Colvin.","(5:55) Nick Foles pass to the left to Chris Conley for 12 yards to the Jax13. Tackled by Johnathan Cyprien.","(6:28) Nick Foles pass to the left to Charcandrick West for 5 yards to the Jax25. Tackled by Telvin Smith.","(6:40) Brad Nortman punts for 42 yards to KC24. Tyreek Hill return for 36 yards to Jax40. Tackled by Brad Nortman. Penalty: Holding on Jacksonville (Carson Tinker) 10 yards.","(6:48) Blake Bortles incomplete pass to the right.","(7:33) Chris Ivory rush up the middle for a loss of 3 yards to the Jax34. Tackled by Derrick Johnson.","(7:39) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(7:59) Blake Bortles pass to the right to Allen Robinson for 4 yards to the Jax37.","(8:37) Chris Ivory rush up the middle for 8 yards to the Jax33. Tackled by Tamba Hali.","(8:43) Blake Bortles incomplete pass to the left intended for Allen Hurns defensed by Steven Nelson.","(8:43) Cairo Santos kicks off to the endzone. Touchback.","(8:48) Cairo Santos 51 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(8:53) Nick Foles incomplete pass to the left intended for Demetrius Harris.","(9:37) Nick Foles pass to the right to Charcandrick West for 6 yards to the Jax33. Tackled by Abry Jones.","(10:15) Charcandrick West rush up the middle for a loss of 1 yard to the Jax39. Tackled by Tyson Alualu.","(10:30) T.J. Yeldon rush up the middle for 16 yards to the Jax35. Tackled by Phillip Gaines. FUMBLE, recovered by KC (Steven Nelson). Tackled by Jermey Parnell.","(11:11) Blake Bortles sacked at Jax19 for a loss of 7 yards by Dee Ford.","(11:49) T.J. Yeldon rush up the middle for no gain to the Jax26. Tackled by Dee Ford.","(12:09) Blake Bortles pass to the left to Allen Robinson for 3 yards to the Jax26. Tackled by Ramik Wilson.","(12:44) T.J. Yeldon rush up the middle for 9 yards to the Jax23. Tackled by Marcus Peters.","(12:51) Dustin Colquitt punts for 55 yards to Jax14. No return.","(13:30) Nick Foles pass to the right to Anthony Sherman for 6 yards to the KC31. Tackled by Aaron Colvin.","(14:14) Charcandrick West rush to the left for a loss of 2 yards to the KC25. Tackled by Dan Skuta.","(14:53) Nick Foles pass to the left to Tyreek Hill for 3 yards to the KC27. Tackled by Paul Posluszny.","(15:00) Jason Myers kicks off to the KC-2. Tyreek Hill return for 26 yards to KC24. Tackled by Denard Robinson.","(0:02) Jason Myers kicks off to the KC27. De'Anthony Thomas return for 7 yards to KC34.","(0:02) Jason Myers extra point is good.","(0:07) Blake Bortles pass to the right to Allen Robinson for 1 yard for a TOUCHDOWN.","(0:12) Blake Bortles incomplete pass to the right intended for Allen Hurns defensed by Ron Parker.","(0:12) Jacksonville Jaguars timeout.","(0:18) T.J. Yeldon rush up the middle for no gain to the KC1. Tackled by Frank Zombo and Derrick Johnson.","(0:23) Penalty: Pass Interference on Kansas City (Steven Nelson) 5 yards.","(0:27) Blake Bortles incomplete pass to the left intended for Allen Robinson defensed by Phillip Gaines.","(0:35) Blake Bortles rush to the left for 5 yards to the KC6. Tackled by Marcus Peters.","(0:44) Blake Bortles pass to the right to Marqise Lee for 14 yards to the KC21. Tackled by Marcus Peters. Penalty: Unnecessary Roughness on Kansas City (Daniel Sorensen) 10 yards.","(0:44) Jacksonville Jaguars timeout.","(0:50) Blake Bortles sacked at KC35 for a loss of 1 yard by Dee Ford.","(1:23) Blake Bortles pass to the left to Allen Robinson for 20 yards to the KC34. Tackled by Ron Parker.","(2:00) Blake Bortles rush up the middle for 6 yards to the Jax46. Tackled by Jaye Howard.","(2:00) Two Minute Warning.","(2:40) Blake Bortles pass to the left to Marcedes Lewis for 17 yards to the Jax40. Tackled by Steven Nelson.","(3:21) Marqise Lee rush to the left for 11 yards to the Jax23. Tackled by Eric Berry.","(3:28) Dustin Colquitt punts for 42 yards to Jax12. No return.","(3:32) Nick Foles incomplete pass to the right intended for Albert Wilson.","(4:18) Nick Foles pass to the right to Travis Kelce for 2 yards to the KC46. Tackled by Dante Fowler Jr. and Johnathan Cyprien.","(4:23) Nick Foles incomplete pass to the middle intended for Charcandrick West.","(5:05) Nick Foles pass to the right to Travis Kelce for 13 yards to the KC44. Tackled by Aaron Colvin.","(5:47) Charcandrick West rush up the middle for 2 yards to the KC31. Tackled by Paul Posluszny.","(6:13) Nick Foles pass to the right to Chris Conley for 9 yards to the KC29.","(6:24) Brad Nortman punts for 47 yards to KC10. Tyreek Hill return for 10 yards to KC20. Tackled by Denard Robinson.","(6:37) Chris Ivory rush up the middle for no gain to the Jax43. Tackled by Marcus Peters.","(7:23) Chris Ivory rush to the right for no gain to the Jax43. Tackled by Derrick Johnson.","(7:55) Chris Ivory rush to the right for 9 yards to the Jax43. Tackled by Marcus Peters.","(8:32) Blake Bortles pass to the left to Marqise Lee for 3 yards to the Jax34. Tackled by Phillip Gaines.","(9:12) Chris Ivory rush to the right for 4 yards to the Jax31. Tackled by Marcus Peters.","(9:47) Chris Ivory rush up the middle for 4 yards to the Jax27. Tackled by Kendall Reyes.","(9:54) Cairo Santos kicks off to the Jax0. Marqise Lee return for 23 yards to Jax23. Tackled by Kenneth Acker and De'Anthony Thomas.","(9:58) Cairo Santos 26 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(10:43) Nick Foles pass to the left to Chris Conley for 7 yards to the Jax8. Tackled by Paul Posluszny and Aaron Colvin.","(11:29) Nick Foles pass to the right to Tyreek Hill for 3 yards to the Jax15. Tackled by Jalen Ramsey.","(12:00) Albert Wilson rush to the left for a loss of 5 yards to the Jax18.","(12:16) Blake Bortles pass intended for Allen Robinson INTERCEPTED by Ramik Wilson and returned for 6 yards. Tackled by Allen Robinson. Penalty: Unnecessary Roughness on Jacksonville (Blake Bortles) 13 yards.","(12:21) Blake Bortles incomplete pass to the right intended for Marcedes Lewis.","(12:31) Dustin Colquitt punts for 54 yards to Jax13. Bryan Walters return for 6 yards to Jax19. Tackled by Daniel Sorensen.","(12:37) Nick Foles incomplete pass to the right intended for Albert Wilson.","(12:49) Penalty: Offside on Jacksonville (Sen'Derrick Marks) 5 yards.","(13:34) Nick Foles pass to the left to Knile Davis for 7 yards to the KC28. Tackled by Telvin Smith.","(14:14) Knile Davis rush to the left for no gain to the KC21. Tackled by Paul Posluszny and Dante Fowler Jr..","(14:21) Penalty: Holding on Kansas City (Mitch Morse) -10 yards.","(14:27) Blake Bortles incomplete pass to the right intended for Allen Hurns.","(15:00) Jacksonville Jaguars timeout.","(15:00) Blake Bortles rush up the middle for 12 yards to the KC30. Tackled by Daniel Sorensen.","(0:07) Chris Ivory rush to the right for a loss of 3 yards to the KC42. Tackled by Ramik Wilson.","(0:14) Blake Bortles incomplete pass to the right intended for T.J. Yeldon.","(0:39) Blake Bortles pass to the left to T.J. Yeldon for 4 yards to the KC39. Tackled by Derrick Johnson.","(1:16) T.J. Yeldon rush up the middle for 7 yards to the KC43. Tackled by Dontari Poe.","(1:44) Chris Ivory rush to the left for 42 yards to the Jax50.","(1:49) Cairo Santos kicks off to the Jax-3. Marqise Lee return for 19 yards to Jax16. Tackled by Demetrius Harris. Penalty: Holding on Jacksonville (Arthur Brown) -8 yards.","(1:49) Cairo Santos extra point is good.","(1:55) Nick Foles pass to the left to Albert Wilson for 23 yards for a TOUCHDOWN.","(2:03) Nick Foles incomplete pass to the right intended for Travis Kelce.","(2:16) Dustin Colquitt punts for 53 yards to Jax15. Bryan Walters return for 8 yards to Jax23. Tackled by D.J. Alexander. FUMBLE, recovered by KC (James O'Shaughnessy). Tackled by Arthur Brown.","(2:22) Nick Foles incomplete pass to the right intended for Albert Wilson.","(3:05) Charcandrick West rush to the left for 6 yards to the KC32. Tackled by Aaron Colvin.","(3:30) Penalty: False Start on Kansas City (Albert Wilson) -5 yards.","(4:06) Charcandrick West rush to the right for 4 yards to the KC31. Tackled by Paul Posluszny.","(4:35) Tyreek Hill rush to the left for 16 yards to the KC27. Tackled by Telvin Smith.","(5:14) Charcandrick West rush to the left for 1 yard to the KC11. Tackled by Paul Posluszny.","(5:22) Brad Nortman punts for 43 yards to KC0. Touchback. Penalty: Holding on Kansas City (Demarcus Robinson) -10 yards.","(5:29) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(6:12) Blake Bortles pass to the left to Chris Ivory for no gain to the KC43. Tackled by Derrick Johnson.","(6:52) Chris Ivory rush to the left for 3 yards to the KC43. Tackled by Jaye Howard.","(7:23) Chris Ivory rush to the right for 13 yards to the KC46. Tackled by Eric Berry.","(8:07) Chris Ivory rush to the left for 11 yards to the Jax41. Tackled by Derrick Johnson.","(8:29) Blake Bortles pass to the left to Julius Thomas for 12 yards to the Jax30. Tackled by Eric Berry.","(8:37) Dustin Colquitt punts for 36 yards to Jax18. No return.","(8:43) Nick Foles incomplete pass to the middle intended for Albert Wilson.","(9:24) Charcandrick West rush up the middle for 4 yards to the KC46. Tackled by Johnathan Cyprien.","(9:24) Kansas City Chiefs timeout.","(9:32) Nick Foles incomplete pass to the middle intended for Albert Wilson.","(10:30) Penalty: False Start on Kansas City (Mitchell Schwartz) -5 yards.","(10:30) Charcandrick West rush up the middle for 2 yards to the KC47. Tackled by Johnathan Cyprien.","(10:53) Nick Foles pass to the right to Travis Kelce for 6 yards to the KC45. Tackled by Aaron Colvin.","(11:00) Nick Foles incomplete pass to the left intended for Jeremy Maclin.","(11:36) Charcandrick West rush up the middle for 3 yards to the KC39. Tackled by Prince Amukamara.","(12:06) Nick Foles pass to the left to Travis Kelce for 23 yards to the KC36. Tackled by Prince Amukamara.","(12:15) Brad Nortman punts for 35 yards to KC13. No return.","(12:20) Blake Bortles incomplete pass to the left intended for Allen Hurns.","(13:03) Blake Bortles rush to the right for 5 yards to the KC48. Tackled by Chris Jones.","(13:43) Blake Bortles pass to the right to T.J. Yeldon for no gain to the Jax47. Tackled by Ramik Wilson.","(14:22) Blake Bortles pass to the left to Allen Robinson for 19 yards to the Jax47. Tackled by Phillip Gaines.","(14:27) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(15:00) T.J. Yeldon rush to the left for 3 yards to the Jax28. Tackled by Ramik Wilson.","(15:00) Cairo Santos kicks off to the endzone. Touchback."]