["(0:37) Philip Rivers rush up the middle for no gain to the Ten16.","(1:14) Philip Rivers rush up the middle for a loss of 2 yards to the Ten16.","(2:00) Melvin Gordon rush up the middle for 2 yards to the Ten14. Tackled by Wesley Woodyard.","(2:00) Two Minute Warning.","(2:22) Melvin Gordon rush up the middle for 6 yards to the Ten16. Tackled by Jurrell Casey.","(2:22) Tennessee Titans timeout.","(2:27) Melvin Gordon rush up the middle for 3 yards to the Ten22. Tackled by Wesley Woodyard.","(2:27) San Diego Chargers timeout.","(2:37) Melvin Gordon rush to the left for 47 yards to the Ten25. Tackled by Jason McCourty.","(2:37) Tennessee Titans timeout.","(2:40) Kenneth Farrow rush to the left for 3 yards to the SD28. Tackled by Jurrell Casey.","(2:40) Tennessee Titans timeout.","(2:45) Melvin Gordon rush to the right for no gain to the SD25. Tackled by Sean Spence.","(2:45) Ryan Succop kicks off to the endzone. Touchback.","(2:45) Ryan Succop extra point is good.","(2:53) DeMarco Murray rush up the middle for 1 yard for a TOUCHDOWN.","(2:57) Penalty: Pass Interference on San Diego (Casey Hayward) 6 yards.","(3:03) Marcus Mariota pass to the left to DeMarco Murray for 3 yards to the SD7. Tackled by Trevor Williams.","(3:03) San Diego Chargers timeout.","(3:26) DeMarco Murray rush up the middle for 13 yards to the SD10. Tackled by Korey Toomer.","(3:56) Marcus Mariota pass to the right to Rishard Matthews for 9 yards to the SD23. Tackled by Dexter McCoil.","(3:58) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(4:09) Marcus Mariota pass to the left to Rishard Matthews for 14 yards to the SD32. Tackled by Trevor Williams.","(4:15) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(4:23) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(4:32) Marcus Mariota pass to the left to Harry Douglas for 27 yards to the SD46. Tackled by Casey Hayward.","(4:51) Marcus Mariota pass to the right to DeMarco Murray for 2 yards to the Ten27. Tackled by Dexter McCoil.","(4:51) Josh Lambo kicks off to the endzone. Touchback.","(4:51) Josh Lambo extra point is good.","(5:01) Marcus Mariota pass intended for Kendall Wright INTERCEPTED by Brandon Flowers and returned for 33 yards for a TOUCHDOWN.","(5:45) Marcus Mariota pass to the right to DeMarco Murray for 2 yards to the Ten29. Tackled by Dwight Lowery.","(6:05) Marcus Mariota rush to the right for 2 yards to the Ten27. Tackled by Dwight Lowery.","(6:05) Josh Lambo kicks off to the endzone. Touchback.","(6:10) Josh Lambo 36 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(6:10) San Diego Chargers timeout.","(6:53) Melvin Gordon rush up the middle for 6 yards to the Ten18. Tackled by Wesley Woodyard.","(6:59) Philip Rivers incomplete pass to the left intended for Dontrelle Inman.","(7:39) Kenneth Farrow rush up the middle for 3 yards to the Ten24. Tackled by Jason McCourty and Kevin Byard.","(8:20) Philip Rivers pass to the middle to Melvin Gordon for 35 yards to the Ten27. Tackled by Daimion Stafford.","(9:06) Melvin Gordon rush to the right for 3 yards to the SD38. Tackled by Perrish Cox.","(9:51) Melvin Gordon rush to the right for 15 yards to the SD35. Tackled by Brice McCain.","(9:51) Penalty: False Start on San Diego (Spencer Pulley) -5 yards.","(9:51) Ryan Succop kicks off to the endzone. Touchback.","(9:51) Ryan Succop extra point is good.","(9:55) Marcus Mariota pass to the left to Delanie Walker for 8 yards for a TOUCHDOWN.","(10:39) Marcus Mariota pass to the left to DeMarco Murray for 10 yards to the SD8. Tackled by Trevor Williams.","(10:44) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(11:17) Marcus Mariota pass to the left to DeMarco Murray for no gain to the SD18. Tackled by Korey Toomer.","(11:36) Penalty: Too Many Men on Field on San Diego 5 yards.","(12:00) Marcus Mariota pass to the left to Kendall Wright for 48 yards to the SD23. Tackled by Dwight Lowery and Casey Hayward.","(12:21) Marcus Mariota pass to the middle to Rishard Matthews for 10 yards to the Ten29. Tackled by Korey Toomer and Joshua Perry.","(12:50) Marcus Mariota pass to the left to Delanie Walker for a loss of 1 yard to the Ten19. Tackled by Brandon Flowers.","(12:58) Drew Kaser punts for 58 yards to Ten0. Touchback.","(13:39) Philip Rivers pass to the left to Dontrelle Inman for 6 yards to the SD42. Tackled by Jason McCourty and Kevin Byard.","(13:44) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(14:25) Melvin Gordon rush to the right for 2 yards to the SD36. Tackled by DaQuan Jones and Kevin Byard.","(15:00) Philip Rivers pass to the left to Tyrell Williams for 10 yards to the SD34. Tackled by Jason McCourty.","(0:17) Melvin Gordon rush to the left for 2 yards to the SD24. Tackled by Kevin Byard.","(0:30) Brett Kern punts for 45 yards to SD22. Isaiah Burse - no return. Tackled by Nate Palmer.","(1:06) DeMarco Murray rush up the middle for a loss of 1 yard to the Ten33. Tackled by Brandon Flowers.","(1:46) DeMarco Murray rush up the middle for 6 yards to the Ten34. Tackled by Melvin Ingram.","(2:31) DeMarco Murray rush to the left for 3 yards to the Ten28. Tackled by Corey Liuget and Kyle Emanuel.","(2:31) Josh Lambo kicks off to the endzone. Touchback.","(2:31) Josh Lambo extra point is good.","(2:44) Marcus Mariota rush to the right for a loss of 2 yards to the SD49. Tackled by Korey Toomer. FUMBLE, recovered by SD (Dwight Lowery) and returned for 36 yards for a TOUCHDOWN.","(2:51) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(3:14) Penalty: False Start on Tennessee (Delanie Walker) -5 yards.","(3:53) DeMarco Murray rush to the right for 13 yards to the SD42. Tackled by Korey Toomer.","(4:00) Marcus Mariota incomplete pass to the left intended for Rishard Matthews defensed by Dwight Lowery.","(4:25) Penalty: Offside on San Diego (Joey Bosa) 5 yards.","(4:47) Penalty: Offside on San Diego (Joey Bosa) 5 yards.","(5:22) DeMarco Murray rush to the left for no gain to the Ten35. Tackled by Brandon Flowers.","(5:28) Josh Lambo kicks off to the Ten-7. Marc Mariani return for 37 yards to Ten30. Tackled by Steve Williams. Penalty: Illegal Substitution on San Diego (Adrian Phillips) 5 yards.","(5:28) Josh Lambo extra point is good.","(5:35) Melvin Gordon rush up the middle for 1 yard for a TOUCHDOWN.","(5:43) Penalty: Holding on Tennessee (Da'Norris Searcy) 0 yards.","(6:27) Melvin Gordon rush to the left for no gain to the Ten1. Tackled by DaQuan Jones.","(7:10) Melvin Gordon rush up the middle for no gain to the Ten1. Tackled by Daimion Stafford.","(7:39) Philip Rivers pass to the left to Antonio Gates for 17 yards to the Ten1. Tackled by Da'Norris Searcy.","(7:45) Philip Rivers incomplete pass to the middle intended for Antonio Gates.","(8:27) Melvin Gordon rush up the middle for 3 yards to the Ten18. Tackled by DaQuan Jones and Avery Williamson.","(9:01) Philip Rivers pass to the right to Dontrelle Inman for 11 yards to the Ten21. Tackled by Brice McCain.","(9:45) Melvin Gordon rush up the middle for no gain to the Ten32. Tackled by Sean Spence.","(9:49) Penalty: Holding on Tennessee (Jason McCourty) 5 yards.","(9:55) Philip Rivers incomplete pass to the middle intended for Kenneth Farrow.","(10:31) Philip Rivers pass to the left to Tyrell Williams for 2 yards to the Ten37. Tackled by Perrish Cox.","(11:10) Philip Rivers pass to the right to Melvin Gordon for 12 yards to the Ten39. Tackled by DaQuan Jones.","(11:16) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(11:22) Penalty: Pass Interference on Tennessee (Brice McCain) 12 yards.","(11:55) Melvin Gordon rush up the middle for 6 yards to the SD37. Tackled by DaQuan Jones and Avery Williamson.","(12:19) Philip Rivers pass to the right to Dontrelle Inman for 6 yards to the SD31. Tackled by Perrish Cox.","(12:19) Ryan Succop kicks off to the endzone. Touchback.","(12:19) Ryan Succop extra point is good.","(12:28) Marcus Mariota rush to the right for 14 yards for a TOUCHDOWN.","(12:32) Marcus Mariota incomplete pass to the middle intended for Kendall Wright defensed by Brandon Flowers.","(12:57) Marcus Mariota pass to the right to Harry Douglas for 21 yards to the SD14.","(13:17) Marcus Mariota pass to the left to Tajae Sharpe for 10 yards to the SD35. Tackled by Steve Williams.","(13:51) Marcus Mariota pass to the right to DeMarco Murray for 5 yards to the SD45. Tackled by Corey Liuget.","(14:07) Marcus Mariota pass to the left to Tajae Sharpe for 7 yards to the Ten50. Tackled by Steve Williams.","(14:30) Marcus Mariota pass to the right to Delanie Walker for 6 yards to the Ten43. Tackled by Dwight Lowery.","(14:55) Marcus Mariota pass to the left to Tajae Sharpe for 12 yards to the Ten37. Tackled by Steve Williams and Dexter McCoil.","(15:00) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(15:00) Josh Lambo kicks off to the endzone. Touchback.","(0:14) Philip Rivers rush up the middle for a loss of 1 yard to the SD24.","(0:14) Ryan Succop kicks off to the endzone. Touchback.","(0:14) Ryan Succop extra point is good.","(0:19) Marcus Mariota pass to the left to Rishard Matthews for 7 yards for a TOUCHDOWN.","(0:24) Marcus Mariota pass to the left to Tajae Sharpe for 29 yards to the SD7. Tackled by Casey Hayward.","(0:43) Marcus Mariota pass to the left to Delanie Walker for 9 yards to the SD36. Tackled by Brandon Flowers.","(0:43) Marcus Mariota incomplete pass to the middle.","(0:59) Marcus Mariota pass to the middle to DeMarco Murray for 7 yards to the SD45. Tackled by Darrell Stuckey.","(0:59) San Diego Chargers timeout.","(1:11) Marcus Mariota pass to the right to Rishard Matthews for 7 yards to the Ten48. Tackled by Steve Williams.","(1:32) Marcus Mariota pass to the left to Kendall Wright for 16 yards to the Ten41. Tackled by Brandon Flowers.","(1:32) Josh Lambo kicks off to the endzone. Touchback.","(1:35) Josh Lambo 23 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(1:46) Philip Rivers incomplete pass to the middle intended for Tyrell Williams.","(1:47) Tennessee Titans timeout.","(1:51) Melvin Gordon rush to the left for a loss of 2 yards to the Ten5. Tackled by Kevin Byard.","(1:52) Tennessee Titans timeout.","(1:56) Melvin Gordon rush to the right for 1 yard to the Ten3. Tackled by Avery Williamson and Jurrell Casey.","(1:56) Tennessee Titans timeout.","(2:00) Melvin Gordon rush up the middle for 4 yards to the Ten4. Tackled by Kevin Byard and DaQuan Jones.","(2:00) Two Minute Warning.","(2:24) Melvin Gordon rush to the right for 7 yards to the Ten8. Tackled by DaQuan Jones and Avery Williamson.","(2:35) Marcus Mariota pass intended for Delanie Walker INTERCEPTED by Casey Hayward and returned for 25 yards. Tackled by Dennis Kelly.","(2:42) Drew Kaser punts for 43 yards to Ten21. Marc Mariani - no return.","(2:49) Philip Rivers incomplete pass to the right intended for Antonio Gates defensed by Kevin Byard.","(3:26) Philip Rivers pass to the left to Kenneth Farrow for 4 yards to the SD36. Tackled by Sean Spence.","(4:00) Kenneth Farrow rush up the middle for 4 yards to the SD32. Tackled by DaQuan Jones and Sean Spence.","(4:36) Melvin Gordon rush up the middle for 19 yards to the SD28. Tackled by Avery Williamson.","(5:08) Penalty: Holding on San Diego (D.J. Fluker) -8 yards.","(5:13) Penalty: Pass Interference on Tennessee (Kevin Byard) 5 yards.","(5:22) Brett Kern punts for 46 yards to SD22. Isaiah Burse return for 3 yards to SD25. Tackled by LeShaun Sims and Kevin Byard. Penalty: Unnecessary Roughness on San Diego (Dexter McCoil) -13 yards.","(5:28) Marcus Mariota incomplete pass to the right intended for Kendall Wright.","(6:11) Antonio Andrews rush up the middle for 6 yards to the Ten32. Tackled by Deon King and Dwight Lowery.","(6:51) DeMarco Murray rush to the right for a loss of 1 yard to the Ten26. Tackled by Tourek Williams.","(6:55) Drew Kaser punts for 39 yards to Ten17. No return. Penalty: Holding on San Diego (Korey Toomer) 10 yards.","(7:26) Philip Rivers sacked at SD44 for a loss of 7 yards by Wesley Woodyard.","(8:10) Melvin Gordon rush up the middle for a loss of 4 yards to the Ten49. Tackled by Derrick Morgan.","(8:34) Penalty: False Start on San Diego (Joe Barksdale) -4 yards.","(9:18) Melvin Gordon rush to the right for 2 yards to the Ten41. Tackled by Daimion Stafford and Sean Spence.","(9:48) Philip Rivers pass to the left to Tyrell Williams for 16 yards to the Ten43. Tackled by Da'Norris Searcy.","(10:23) Melvin Gordon rush to the left for 3 yards to the SD41. Tackled by Brian Orakpo.","(10:50) Melvin Gordon rush to the right for 4 yards to the SD38. Tackled by Sean Spence and Jurrell Casey.","(11:14) Melvin Gordon rush up the middle for 9 yards to the SD34. Tackled by Da'Norris Searcy.","(11:14) Ryan Succop kicks off to the endzone. Touchback.","(11:14) Ryan Succop extra point is good.","(11:21) Marcus Mariota pass to the right to Rishard Matthews for 16 yards for a TOUCHDOWN.","(11:59) DeMarco Murray rush up the middle for 1 yard to the SD16. Tackled by Kyle Emanuel.","(12:26) Marcus Mariota pass to the middle to Anthony Fasano for 9 yards to the SD17. Tackled by Korey Toomer.","(12:26) San Diego Chargers timeout.","(12:27) Marcus Mariota incomplete pass to the right intended for Rishard Matthews defensed by Adrian Phillips.","(12:34) Marcus Mariota incomplete pass to the left intended for Delanie Walker defensed by Brandon Flowers.","(13:06) DeMarco Murray rush to the left for 5 yards to the SD41. Tackled by Adrian Phillips. Penalty: Unsports. Conduct on San Diego (Melvin Ingram) 15 yards.","(13:41) Antonio Andrews rush to the left for 9 yards to the SD46. Tackled by Steve Williams.","(14:18) Marcus Mariota pass to the left to Delanie Walker for 20 yards to the Ten45. Tackled by Korey Toomer.","(14:18) Josh Lambo kicks off to the endzone. Touchback.","(14:18) Josh Lambo extra point is good. Penalty: Leverage on Tennessee (Angelo Blackson) 15 yards.","(14:22) Philip Rivers pass to the right to Tyrell Williams for 6 yards for a TOUCHDOWN.","(15:00) Melvin Gordon rush up the middle for 43 yards to the Ten6. Tackled by Kevin Byard.","(0:12) Philip Rivers pass to the right to Tyrell Williams for 19 yards to the Ten49. Tackled by Perrish Cox.","(0:49) Philip Rivers pass to the right to Antonio Gates for 15 yards to the SD32. Tackled by Kevin Dodd.","(1:14) Penalty: Holding on Tennessee (Brice McCain) 5 yards.","(1:47) Kenneth Farrow rush to the left for 5 yards to the SD12. Tackled by Avery Williamson.","(2:09) Penalty: Holding on San Diego (King Dunlap) -6 yards.","(2:17) Brett Kern punts for 55 yards to SD13. No return.","(2:54) DeMarco Murray rush up the middle for a loss of 2 yards to the Ten32. Tackled by Corey Liuget.","(3:30) DeMarco Murray rush to the right for 6 yards to the Ten34. Tackled by Adrian Phillips.","(4:10) DeMarco Murray rush to the right for 3 yards to the Ten28. Tackled by Korey Toomer and Joey Bosa.","(4:11) Josh Lambo kicks off to the endzone. Touchback.","(4:15) Josh Lambo 32 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(4:27) Penalty: Delay of Game on San Diego (Philip Rivers) -5 yards.","(5:15) Philip Rivers pass to the left to Melvin Gordon for 4 yards to the Ten10. Tackled by Jurrell Casey.","(5:55) Philip Rivers pass to the left to Jeremy Butler for 5 yards to the Ten14. Tackled by Jason McCourty.","(6:03) Philip Rivers incomplete pass to the left intended for Dontrelle Inman.","(6:03) San Diego Chargers timeout.","(6:42) Philip Rivers pass to the right to Melvin Gordon for 14 yards to the Ten4. Tackled by Jason McCourty and Kevin Byard. Penalty: Unnecessary Roughness on San Diego (D.J. Fluker) -15 yards.","(7:18) Melvin Gordon rush to the left for a loss of 2 yards to the Ten18. Tackled by Wesley Woodyard.","(7:49) Philip Rivers pass to the left to Antonio Gates for 13 yards to the Ten16. Tackled by Derrick Morgan.","(7:53) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(8:32) Melvin Gordon rush up the middle for 4 yards to the Ten29. Tackled by Avery Williamson and Jurrell Casey.","(8:55) Philip Rivers pass to the right to Dontrelle Inman for 17 yards to the Ten33. Tackled by Kevin Byard.","(9:02) Brett Kern punts for 36 yards to Ten50. No return.","(9:07) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(9:50) DeMarco Murray rush to the right for 4 yards to the Ten14. Tackled by Kyle Emanuel and Korey Toomer.","(9:54) Marcus Mariota incomplete pass to the right intended for Delanie Walker.","(10:02) Josh Lambo kicks off to the Ten5. Marc Mariani return for 15 yards to Ten20. Tackled by Tourek Williams. Penalty: Holding on Tennessee (Karl Klug) -10 yards.","(10:02) Josh Lambo extra point is NO GOOD.","(10:07) Philip Rivers pass to the left to Antonio Gates for 13 yards for a TOUCHDOWN.","(10:46) Melvin Gordon rush up the middle for 6 yards to the Ten13. Tackled by Karl Klug and Avery Williamson.","(11:11) Philip Rivers pass to the left to Travis Benjamin for 5 yards to the Ten19. Tackled by Jason McCourty.","(11:49) Philip Rivers pass to the right to Dontrelle Inman for 11 yards to the Ten24. Tackled by Perrish Cox.","(12:34) Philip Rivers pass to the left to Tyrell Williams for 12 yards to the Ten35. Tackled by Jason McCourty.","(13:04) Melvin Gordon rush to the left for 5 yards to the Ten47. Tackled by Brian Orakpo.","(13:42) Philip Rivers pass to the right to Antonio Gates for 17 yards to the SD48. Tackled by Jurrell Casey.","(14:25) Philip Rivers pass to the right to Dontrelle Inman for 5 yards to the SD31. Tackled by Jason McCourty.","(15:00) Melvin Gordon rush up the middle for 1 yard to the SD26. Tackled by Jurrell Casey.","(15:00) Ryan Succop kicks off to the endzone. Touchback."]