["(0:13) Russell Wilson rush up the middle for a loss of 1 yard to the Sea14.","(0:20) Tyrod Taylor incomplete pass to the left intended for Robert Woods.","(0:52) Tyrod Taylor sacked at Sea15 for a loss of 7 yards by Cliff Avril.","(0:52) Seattle Seahawks timeout.","(1:01) Tyrod Taylor sacked at Sea8 for a loss of 1 yard by K.J. Wright.","(1:01) Seattle Seahawks timeout.","(1:09) LeSean McCoy rush to the right for 3 yards to the Sea7. Tackled by Bobby Wagner.","(1:09) Penalty: Offside on Seattle (Frank Clark) 5 yards.","(1:17) Tyrod Taylor rush to the right for 8 yards to the Sea15. Tackled by K.J. Wright.","(1:25) Tyrod Taylor pass to the right to Robert Woods for 22 yards to the Sea38. Penalty: Roughing Passer on Seattle (Bobby Wagner) 15 yards.","(2:00) Tyrod Taylor sacked at Buf40 for a loss of 10 yards by Bobby Wagner and Frank Clark.","(2:00) Two Minute Warning.","(2:09) LeSean McCoy rush up the middle for a loss of 1 yard to the Buf50. Tackled by Damontre Moore.","(2:41) Tyrod Taylor pass to the left to Robert Woods for 11 yards to the Sea49. Tackled by Richard Sherman.","(2:53) Jon Ryan punts for 62 yards to Buf27. Reggie Bush return for 13 yards to Buf40. Tackled by Kevin Pierre-Louis and Neiko Thorpe.","(2:53) Buffalo Bills timeout.","(2:59) Russell Wilson sacked at Sea11 for a loss of 9 yards by Kyle Williams.","(2:59) Buffalo Bills timeout.","(3:04) C.J. Prosise rush to the right for 3 yards to the Sea20. Tackled by Preston Brown and Zach Brown.","(3:04) Buffalo Bills timeout.","(3:14) Russell Wilson pass to the left to Jimmy Graham for a loss of 1 yard to the Sea17. Tackled by Corey Graham.","(3:22) Colton Schmidt punts for 27 yards to Sea18. No return.","(4:05) LeSean McCoy rush up the middle for a loss of 2 yards to the Sea45. Tackled by Damontre Moore.","(4:16) Penalty: Tripping on Buffalo (Cordy Glenn) -11 yards.","(5:06) LeSean McCoy rush to the left for no gain to the Sea32. Tackled by Kelcie McCray.","(5:11) Tyrod Taylor incomplete pass to the left intended for Jerome Felton.","(5:54) Mike Gillislee rush to the right for 3 yards to the Sea32. Tackled by Kelcie McCray.","(6:31) Mike Gillislee rush to the right for 2 yards to the Sea35. Tackled by Bobby Wagner and Brock Coyle.","(6:57) LeSean McCoy rush to the right for 7 yards to the Sea37. Tackled by Bobby Wagner and K.J. Wright.","(7:26) Tyrod Taylor rush to the left for 16 yards to the Sea44. Tackled by Deshawn Shead.","(8:04) LeSean McCoy rush to the right for 3 yards to the Buf40. Tackled by Bobby Wagner.","(8:34) Mike Gillislee rush up the middle for 3 yards to the Buf37. Tackled by K.J. Wright and Brock Coyle.","(9:10) Seattle Seahawks timeout.","(9:10) Tyrod Taylor pass to the left to Walt Powell for 9 yards to the Buf34. Tackled by Deshawn Shead.","(9:49) LeSean McCoy rush to the left for no gain to the Buf25. Tackled by Kelcie McCray.","(9:49) Steven Hauschka kicks off to the endzone. Touchback.","(9:54) Steven Hauschka 49 yard field goal attempt is GOOD. Holder: Jon Ryan.","(10:00) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(10:41) Russell Wilson pass to the right to Paul Richardson for 15 yards to the Buf31. Tackled by Robert Blanton.","(11:09) Penalty: Illegal Motion on Seattle (Jermaine Kearse) -5 yards.","(11:53) Russell Wilson sacked at Buf41 for a loss of 6 yards by Lorenzo Alexander.","(11:58) Penalty: Pass Interference on Buffalo (Nickell Robey-Coleman) 24 yards.","(12:07) Russell Wilson incomplete pass to the left intended for Brandon Williams.","(12:43) C.J. Prosise rush up the middle for 4 yards to the Sea41. Tackled by Corey Graham and Preston Brown.","(13:19) Russell Wilson pass to the left to Jimmy Graham for 10 yards to the Sea37. Tackled by Corey Graham and Preston Brown.","(13:57) Russell Wilson pass to the left to Doug Baldwin for 7 yards to the Sea27. Tackled by Corey White.","(14:26) Penalty: Illegal Motion on Seattle (Doug Baldwin) -5 yards.","(14:26) Dan Carpenter kicks off to the endzone. Touchback.","(14:26) Tyrod Taylor 2 pt rush attempt. Successful.","(14:28) Mike Gillislee rush to the left for 1 yard for a TOUCHDOWN.","(15:00) Tyrod Taylor pass to the left to Robert Woods for 13 yards to the Sea1. Tackled by Brock Coyle.","(0:57) Penalty: Too Many Men on Field on Buffalo -5 yards.","(0:57) Tyrod Taylor pass to the left to LeSean McCoy for 15 yards to the Sea9. Tackled by Kelcie McCray.","(1:30) LeSean McCoy rush to the right for 6 yards to the Sea24. Tackled by Richard Sherman and Kelcie McCray.","(2:16) Tyrod Taylor pass to the middle to Robert Woods for 15 yards to the Sea30. Tackled by Earl Thomas and Jeremy Lane.","(2:46) Tyrod Taylor pass to the left to Marquise Goodwin for 7 yards to the Sea45.","(3:19) Mike Gillislee rush to the left for 2 yards to the Buf48. Tackled by Sealver Siliga and Kelcie McCray.","(3:50) Tyrod Taylor pass to the right to Robert Woods for 10 yards to the Sea39. Tackled by Bobby Wagner. Penalty: Taunting on Buffalo (Robert Woods) -15 yards.","(4:28) LeSean McCoy rush to the right for 4 yards to the Sea49. Tackled by Earl Thomas and Richard Sherman.","(5:03) LeSean McCoy rush up the middle for 12 yards to the Buf47. Tackled by Damontre Moore and Earl Thomas.","(5:29) Tyrod Taylor pass to the right to Marquise Goodwin for 13 yards to the Buf35. Tackled by Jeremy Lane.","(5:34) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(6:15) LeSean McCoy rush to the left for 4 yards to the Buf22. Tackled by K.J. Wright.","(6:23) Jon Ryan punts for 37 yards to Buf18. No return.","(6:59) Russell Wilson sacked at Sea45 for a loss of 12 yards by Shaq Lawson.","(7:39) Christine Michael rush to the right for no gain to the Buf43. Tackled by Kyle Williams.","(7:45) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(8:27) Russell Wilson pass to the right to Brandon Williams for 16 yards to the Buf43. Tackled by Robert Blanton and Corey White.","(9:10) Russell Wilson rush to the left for 8 yards to the Sea41. Tackled by Jerry Hughes.","(9:45) Russell Wilson pass to the right to Doug Baldwin for 6 yards to the Sea33. Tackled by Corey White.","(10:18) Christine Michael rush to the left for no gain to the Sea27. Tackled by Stephon Gilmore and Lorenzo Alexander.","(10:30) Tyrod Taylor pass intended for Robert Woods INTERCEPTED by Richard Sherman and returned for 31 yards. Tackled by Marquise Goodwin.","(11:05) Tyrod Taylor pass to the left to LeSean McCoy for 4 yards to the Sea27. Tackled by Deshawn Shead.","(11:40) Mike Gillislee rush to the left for 7 yards to the Sea31. Tackled by Ahtyba Rubin.","(12:18) Tyrod Taylor pass to the left to Robert Woods for 9 yards to the Sea38. Tackled by Bobby Wagner and Brock Coyle.","(13:02) Tyrod Taylor pass to the right to LeSean McCoy for 5 yards to the Sea47. Tackled by K.J. Wright.","(13:45) Tyrod Taylor rush to the right for 2 yards to the Buf48. Tackled by K.J. Wright.","(14:21) Tyrod Taylor pass to the left to Mike Gillislee for 6 yards to the Buf46. Tackled by Brock Coyle.","(15:00) Tyrod Taylor pass to the left to Marquise Goodwin for 15 yards to the Buf40. Tackled by Deshawn Shead.","(15:00) Steven Hauschka kicks off to the endzone. Touchback.","(0:01) 54 yard field goal attempt by Dan Carpenter is NO GOOD. Holder: Colton Schmidt.","(0:01) Penalty: Delay of Game on Buffalo (Dan Carpenter) -5 yards.","(0:03) Jonathan Williams incomplete pass to the middle.","(0:03) Buffalo Bills timeout.","(0:03) Penalty: Offside on Seattle (Richard Sherman) 5 yards.","(0:03) Buffalo Bills timeout.","(0:11) Tyrod Taylor pass to the middle to Robert Woods for 15 yards to the Sea35. Tackled by Bobby Wagner and Earl Thomas.","(0:20) Tyrod Taylor pass to the left to Reggie Bush for 8 yards to the Sea40. Penalty: Illegal Block on Buffalo (Walt Powell) -10 yards.","(0:27) Tyrod Taylor incomplete pass to the left.","(0:48) Tyrod Taylor pass to the middle to Robert Woods for 29 yards to the Sea48. Tackled by Kelcie McCray.","(0:48) Seattle Seahawks timeout.","(1:00) Tyrod Taylor pass to the left to Mike Gillislee for a loss of 2 yards to the Buf23. Tackled by Bobby Wagner and Frank Clark.","(1:00) Steven Hauschka kicks off to the endzone. Touchback.","(1:00) Steven Hauschka extra point is good.","(1:05) Russell Wilson pass to the right to Jimmy Graham for 18 yards for a TOUCHDOWN.","(1:45) Russell Wilson pass to the middle to Jimmy Graham for 14 yards to the Buf18. Tackled by Robert Blanton and Corey Graham.","(1:48) Russell Wilson incomplete pass to the right.","(1:50) Russell Wilson pass to the left to C.J. Prosise for 6 yards to the Buf32. Tackled by Corey Graham.","(2:00) Russell Wilson pass to the left to Jermaine Kearse for 20 yards to the Buf38.","(2:00) Penalty: False Start on Seattle (Jimmy Graham) -5 yards.","(2:00) Two Minute Warning.","(2:19) Russell Wilson pass to the left to Jimmy Graham for 15 yards to the Sea47. Tackled by Nickell Robey-Coleman.","(2:29) Colton Schmidt punts for 36 yards to Sea44. Tyler Lockett return for a loss of 2 yards to Sea42. Tackled by Corey Graham. Penalty: Holding on Seattle (Damontre Moore) -10 yards.","(3:09) LeSean McCoy rush to the left for 15 yards to the Buf20. Tackled by Deshawn Shead and Kelcie McCray.","(3:09) Penalty: Delay of Game on Buffalo (Tyrod Taylor) -5 yards.","(3:14) Tyrod Taylor incomplete pass to the right.","(3:56) Tyrod Taylor pass to the middle to Charles Clay for 3 yards to the Buf10. Tackled by Bobby Wagner.","(4:21) Penalty: Holding on Buffalo (Cordy Glenn) -6 yards.","(4:29) Steven Hauschka kicks off to the Buf0. Reggie Bush return for 13 yards to Buf13. Tackled by Steven Terrell.","(4:29) Steven Hauschka extra point is good.","(4:33) Christine Michael rush to the right for 3 yards for a TOUCHDOWN.","(4:38) Penalty: Pass Interference on Buffalo (Ronald Darby) 24 yards.","(5:06) Penalty: Clipping on Seattle (George Fant) -15 yards.","(5:39) Russell Wilson pass to the right to Doug Baldwin for 12 yards to the Buf12. Tackled by Preston Brown.","(6:11) Russell Wilson pass to the left to Jermaine Kearse for 16 yards to the Buf24. Tackled by Stephon Gilmore.","(6:21) Colton Schmidt punts for 35 yards to Sea38. Tyler Lockett return for 22 yards to Buf40. Tackled by Mike Gillislee.","(6:28) Tyrod Taylor incomplete pass to the right.","(6:35) Penalty: Offside on Seattle (Cliff Avril) 5 yards.","(6:41) Tyrod Taylor incomplete pass to the left intended for Charles Clay defensed by Kelcie McCray.","(7:18) LeSean McCoy rush to the right for 1 yard to the Buf22. Tackled by Kelcie McCray and Deshawn Shead.","(7:27) Jon Ryan punts for 43 yards to Buf21. Reggie Bush - no return. Tackled by Neiko Thorpe.","(8:02) Russell Wilson sacked at Sea36 for a loss of 10 yards by Jerry Hughes.","(8:41) C.J. Prosise rush up the middle for 2 yards to the Sea46. Tackled by Lorenzo Alexander and Kyle Williams.","(8:48) Russell Wilson incomplete pass to the right intended for Jermaine Kearse defensed by Ronald Darby.","(9:28) Russell Wilson pass to the right to Jimmy Graham for 17 yards to the Sea44. Tackled by Preston Brown and Ronald Darby.","(9:32) Dan Carpenter kicks off to the Sea17. Cassius Marsh return for 10 yards to Sea27. Tackled by Lerentee McCray and Corey White.","(9:35) Dan Carpenter 31 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(9:51) Tyrod Taylor sacked at Sea13 for a loss of 7 yards by Cliff Avril and Frank Clark.","(9:58) Tyrod Taylor incomplete pass to the right intended for LeSean McCoy.","(9:58) Buffalo Bills timeout.","(10:33) LeSean McCoy rush to the right for 2 yards to the Sea6. Tackled by Jarran Reed.","(11:19) Tyrod Taylor pass to the right to LeSean McCoy for 11 yards to the Sea8. Tackled by Earl Thomas and Richard Sherman.","(11:25) Tyrod Taylor incomplete pass to the left.","(11:58) Tyrod Taylor pass to the left to Reggie Bush for 14 yards to the Sea19. Tackled by Earl Thomas.","(12:19) Tyrod Taylor rush to the right for 2 yards to the Sea38. Tackled by Kelcie McCray. Penalty: Holding on Seattle (Richard Sherman) 5 yards.","(12:59) LeSean McCoy rush to the right for 2 yards to the Sea40. Tackled by Bobby Wagner.","(13:36) LeSean McCoy rush to the right for no gain to the Sea42. Tackled by Bobby Wagner.","(14:14) LeSean McCoy rush to the left for 8 yards to the Sea42. Tackled by Jarran Reed and Deshawn Shead.","(14:54) Tyrod Taylor pass to the left to Robert Woods for 25 yards to the Buf50. Tackled by Earl Thomas.","(14:54) Steven Hauschka kicks off to the endzone. Touchback.","(14:54) Steven Hauschka extra point is good.","(15:00) Russell Wilson pass to the right to Jimmy Graham for 17 yards for a TOUCHDOWN.","(0:09) Russell Wilson pass to the right to Jimmy Graham for 13 yards to the Buf17. Tackled by Robert Blanton and Zach Brown.","(0:47) Christine Michael rush to the right for no gain to the Buf30. Tackled by Kyle Williams.","(1:18) Russell Wilson pass to the left to Tyler Lockett for 17 yards to the Buf30. Tackled by Corey Graham.","(2:15) Penalty: Offside on Buffalo (Lorenzo Alexander) 5 yards.","(2:15) Tyler Lockett rush to the right for 13 yards to the Sea48. Tackled by Jerry Hughes.","(2:21) Dan Carpenter kicks off to the Sea23. Brandon Williams return for 12 yards to Sea35. Tackled by Ramon Humber and Walt Powell.","(2:21) Dan Carpenter extra point is good.","(2:24) Tyrod Taylor pass to the right to Justin Hunter for 5 yards for a TOUCHDOWN.","(3:08) LeSean McCoy rush up the middle for no gain to the Sea5. Tackled by Cliff Avril and Tony McDaniel.","(3:43) Tyrod Taylor rush to the left for 4 yards to the Sea5. Tackled by K.J. Wright.","(4:24) Jerome Felton rush up the middle for 2 yards to the Sea9. Tackled by Richard Sherman and Brock Coyle.","(5:01) Tyrod Taylor rush to the left for 3 yards to the Sea11. Tackled by Bobby Wagner.","(5:34) Tyrod Taylor pass to the right to Charles Clay for 6 yards to the Sea14. Tackled by Kelcie McCray and K.J. Wright.","(6:01) LeSean McCoy rush to the right for 11 yards to the Sea20. Tackled by Bobby Wagner and Earl Thomas.","(6:08) Tyrod Taylor incomplete pass to the right intended for Robert Woods.","(6:46) Mike Gillislee rush up the middle for 9 yards to the Sea31. Tackled by K.J. Wright.","(7:25) Mike Gillislee rush to the left for 5 yards to the Sea40. Tackled by Bobby Wagner.","(8:08) LeSean McCoy rush to the left for 4 yards to the Sea45. Tackled by Bobby Wagner and K.J. Wright.","(8:52) Tyrod Taylor pass to the right to Robert Woods for 13 yards to the Sea49. Tackled by Kelcie McCray.","(9:35) LeSean McCoy rush to the left for 6 yards to the Buf38. Tackled by Earl Thomas and Deshawn Shead.","(10:14) Tyrod Taylor sacked at Buf32 for a loss of 1 yard by Brock Coyle.","(11:08) Penalty: Delay of Game on Buffalo (Tyrod Taylor) -5 yards.","(11:08) Tyrod Taylor pass to the right to Marquise Goodwin for 8 yards to the Buf38. Tackled by Jeremy Lane.","(11:46) Tyrod Taylor rush to the left for 5 yards to the Buf30. Tackled by Kelcie McCray.","(12:21) Tyrod Taylor pass to the right to Charles Clay for no gain to the Buf25. Tackled by Brock Coyle.","(12:21) Steven Hauschka kicks off to the endzone. Touchback.","(12:21) Steven Hauschka extra point is good.","(12:26) Russell Wilson rush to the right for 3 yards for a TOUCHDOWN.","(12:26) Buffalo Bills timeout.","(12:58) Russell Wilson pass to the right to Doug Baldwin for 50 yards to the Buf3. Tackled by Ronald Darby.","(13:25) Russell Wilson pass to the right to Doug Baldwin for 5 yards to the Sea47. Tackled by Stephon Gilmore.","(13:32) Dan Carpenter kicks off to the Sea-1. Tyler Lockett return for 43 yards to Sea42. Tackled by Jonathan Meeks.","(13:32) Dan Carpenter extra point is good.","(13:36) Tyrod Taylor rush to the left for 3 yards for a TOUCHDOWN.","(13:45) Jon Ryan punt blocked by Jerry Hughes. Returned to the Buf3.","(13:51) Russell Wilson incomplete pass to the right.","(14:30) Christine Michael rush to the right for a loss of 2 yards to the Sea32. Tackled by Jerel Worthy and Preston Brown.","(15:00) Russell Wilson pass to the left to Doug Baldwin for 9 yards to the Sea34. Tackled by Kevon Seymour.","(15:00) Dan Carpenter kicks off to the endzone. Touchback."]