["(0:44) Eli Manning rush up the middle for a loss of 3 yards to the NYG13.","(1:23) Eli Manning rush up the middle for a loss of 1 yard to the NYG16.","(1:28) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(1:28) Philadelphia Eagles timeout.","(1:32) Carson Wentz incomplete pass to the left intended for Darren Sproles defensed by Jonathan Casillas defensed by Jason Pierre-Paul.","(1:36) Carson Wentz incomplete pass to the right intended for Darren Sproles defensed by Keenan Robinson.","(1:41) Carson Wentz incomplete pass to the right intended for Nelson Agholor.","(1:48) Carson Wentz pass to the left to Nelson Agholor for 17 yards to the NYG17. Tackled by Janoris Jenkins.","(1:55) Eli Manning pass intended for Will Tye INTERCEPTED by Jordan Hicks defensed by Connor Barwin and returned for 3 yards. Tackled by Will Tye.","(1:55) Philadelphia Eagles timeout.","(2:00) Paul Perkins rush to the right for 6 yards to the NYG29. Tackled by Jordan Hicks and Fletcher Cox.","(2:00) Two Minute Warning.","(2:16) Paul Perkins rush to the left for no gain to the NYG23. Tackled by Jordan Hicks.","(3:03) Paul Perkins rush to the right for 2 yards to the NYG23. Tackled by Jaylen Watkins.","(3:47) Paul Perkins rush to the left for 9 yards to the NYG21. Tackled by Rodney McLeod.","(3:51) Caleb Sturgis kicks off to the NYG-2. Dwayne Harris return for 14 yards to NYG12. Tackled by Najee Goode.","(3:55) Caleb Sturgis 38 yard field goal attempt is GOOD. Holder: Donnie Jones.","(4:01) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(4:51) Carson Wentz pass to the left to Jordan Matthews for no gain to the NYG21. Tackled by Keenan Robinson.","(5:28) Carson Wentz pass to the right to Nelson Agholor for no gain to the NYG21. Tackled by Dominique Rodgers-Cromartie. FUMBLE, recovered by Phi (Nelson Agholor).","(6:12) Carson Wentz pass to the left to Jordan Matthews for 25 yards to the NYG21. Tackled by Andrew Adams and Keenan Robinson.","(6:19) Carson Wentz incomplete pass to the left intended for Nelson Agholor.","(7:00) Darren Sproles rush up the middle for 1 yard to the NYG46. Tackled by Damon Harrison and Johnathan Hankins.","(7:03) Carson Wentz incomplete pass to the right intended for Darren Sproles.","(7:11) Brad Wing punts for 40 yards to NYG47. No return.","(7:21) Eli Manning incomplete pass to the right intended for Sterling Shepard.","(8:04) Rashad Jennings rush to the right for 2 yards to the NYG7. Tackled by Jaylen Watkins and Jordan Hicks.","(8:34) Eli Manning pass to the left to Will Tye for 1 yard to the NYG5. Tackled by Rodney McLeod.","(8:44) Donnie Jones punts for 48 yards to NYG4. No return.","(9:23) Carson Wentz rush to the right for 2 yards to the Phi48. Tackled by Andrew Adams and Landon Collins.","(10:01) Wendell Smallwood rush to the left for 6 yards to the Phi46. Tackled by Devon Kennard and Landon Collins.","(10:08) Carson Wentz incomplete pass to the left intended for Bryce Treggs.","(10:21) Eli Manning pass intended for Odell Beckham Jr. INTERCEPTED by Nolan Carroll. No return. Tackled by Odell Beckham Jr..","(10:25) Eli Manning incomplete pass to the right intended for Will Tye defensed by Fletcher Cox.","(10:55) Paul Perkins rush to the right for 14 yards to the Phi45. Tackled by Jalen Mills.","(11:37) Eli Manning pass to the right to Paul Perkins for 15 yards to the NYG41. Tackled by Jalen Mills and Malcolm Jenkins.","(12:01) Paul Perkins rush up the middle for 1 yard to the NYG26. Tackled by Jordan Hicks and Fletcher Cox.","(12:01) Caleb Sturgis kicks off to the endzone. Touchback.","(12:06) Caleb Sturgis 26 yard field goal attempt is GOOD. Holder: Donnie Jones.","(12:50) Carson Wentz pass to the left to Zach Ertz for 6 yards to the NYG8. Tackled by Keenan Robinson.","(13:32) Ryan Mathews rush to the right for 1 yard to the NYG14. Tackled by Landon Collins.","(14:21) Carson Wentz pass to the left to Ryan Mathews for no gain to the NYG15. Tackled by Landon Collins.","(15:00) Carson Wentz pass to the right to Zach Ertz for 15 yards to the NYG15. Tackled by Landon Collins.","(0:26) Carson Wentz pass to the middle to Zach Ertz for 6 yards to the NYG30. Tackled by Keenan Robinson.","(0:55) Carson Wentz pass to the left to Darren Sproles for 3 yards to the NYG36. Tackled by Jonathan Casillas.","(1:24) Carson Wentz pass to the right to Darren Sproles for 6 yards to the NYG39. Tackled by Jonathan Casillas and Keenan Robinson.","(1:48) Darren Sproles rush to the right for 4 yards to the NYG45. Tackled by Johnathan Hankins.","(2:18) Darren Sproles rush to the right for 8 yards to the NYG49. Tackled by Andrew Adams.","(2:59) Carson Wentz pass to the left to Zach Ertz for 9 yards to the Phi43. Tackled by Trevin Wade.","(3:07) Carson Wentz incomplete pass to the left intended for Darren Sproles.","(3:46) Carson Wentz pass to the middle to Zach Ertz for 20 yards to the Phi34. Tackled by Andrew Adams and Landon Collins.","(4:27) Darren Sproles rush to the right for 2 yards to the Phi14. Tackled by Damon Harrison.","(4:35) Brad Wing punts for 33 yards to Phi12. No return.","(4:43) Eli Manning incomplete pass to the middle intended for Odell Beckham Jr. defensed by Jaylen Watkins defensed by Jordan Hicks.","(4:43) Penalty: False Start on New York (Odell Beckham Jr.) -5 yards.","(4:56) Philadelphia Eagles timeout.","(4:56) Eli Manning incomplete pass to the left intended for Jerell Adams defensed by Rodney McLeod.","(5:27) Rashad Jennings rush to the right for a loss of 5 yards to the Phi40. Tackled by Brandon Graham.","(5:55) Eli Manning pass to the left to Odell Beckham Jr. for 9 yards to the NYG49. Tackled by Jaylen Watkins and Vinny Curry. Penalty: Unnecessary Roughness on Philadelphia (Nigel Bradham) 16 yards.","(6:06) Donnie Jones punts for 45 yards to NYG30. Dwayne Harris return for 10 yards to NYG40. Tackled by Chris Maragos and Najee Goode.","(6:13) Carson Wentz incomplete pass to the right intended for Bryce Treggs defensed by Dominique Rodgers-Cromartie.","(6:55) Darren Sproles rush to the left for no gain to the Phi25. Tackled by Jason Pierre-Paul and Landon Collins.","(7:35) Carson Wentz pass to the left to Nelson Agholor for 1 yard to the Phi25. Tackled by Keenan Robinson.","(7:41) Robbie Gould kicks off to the Phi0. Wendell Smallwood return for 24 yards to Phi24. Tackled by Trevin Wade and Romeo Okwara.","(7:41) Robbie Gould extra point is good.","(7:50) Eli Manning pass to the right to Sterling Shepard for 32 yards for a TOUCHDOWN.","(8:30) Paul Perkins rush to the right for 3 yards to the Phi32. Tackled by Malcolm Jenkins.","(9:01) Eli Manning pass to the left to Odell Beckham Jr. for 10 yards to the Phi35. Tackled by Nolan Carroll.","(9:40) Paul Perkins rush to the right for 1 yard to the Phi45. Tackled by Vinny Curry and Jaylen Watkins.","(10:09) Eli Manning pass to the left to Jerell Adams for 10 yards to the Phi46. Tackled by Malcolm Jenkins.","(10:38) Rashad Jennings rush up the middle for 6 yards to the NYG44. Tackled by Nigel Bradham.","(10:46) Eli Manning incomplete pass to the right intended for Will Tye.","(11:12) Rashad Jennings rush to the right for 4 yards to the NYG38. Tackled by Fletcher Cox.","(11:43) Rashad Jennings rush to the right for 4 yards to the NYG34. Tackled by Jordan Hicks and Jaylen Watkins.","(12:17) Eli Manning pass to the left to Rashad Jennings for 5 yards to the NYG30. Tackled by Nigel Bradham and Connor Barwin.","(12:17) Caleb Sturgis kicks off to the endzone. Touchback.","(12:17) Caleb Sturgis extra point is good.","(12:26) Kenjon Barner rush to the right for 3 yards for a TOUCHDOWN.","(12:54) Carson Wentz pass to the left to Nelson Agholor for 23 yards to the NYG3. Tackled by Andrew Adams.","(13:24) Darren Sproles rush to the right for 5 yards to the NYG26. Tackled by Olivier Vernon.","(13:57) Darren Sproles rush to the left for 17 yards to the NYG31. Tackled by Eli Apple and Olivier Vernon.","(14:05) Penalty: Offside on New York (Eli Apple) 5 yards.","(14:28) Carson Wentz pass to the right to Jordan Matthews for 5 yards to the Phi47. Tackled by Eli Apple.","(14:54) Carson Wentz pass to the left to Trey Burton for 12 yards to the Phi42. Tackled by Andrew Adams.","(15:00) Robbie Gould kicks off to the Phi4. Wendell Smallwood return for 26 yards to Phi30. Tackled by B.J. Goodson.","(0:10) Carson Wentz sacked at Phi28 for a loss of 12 yards by Landon Collins.","(0:19) Carson Wentz incomplete pass to the left intended for Darren Sproles.","(0:23) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(0:23) New York Giants timeout.","(0:39) Eli Manning pass to the right to Jerell Adams for 8 yards to the Phi40. Tackled by Nigel Bradham.","(0:44) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by Connor Barwin.","(0:48) Penalty: Holding on New York (John Jerry) -10 yards.","(1:07) Eli Manning pass to the right to Will Tye for 9 yards to the Phi38. Tackled by Nigel Bradham.","(1:19) Caleb Sturgis 40 yard field goal attempt is BLOCKED by Jason Pierre-Paul. Return blocked field goal by Janoris Jenkins to the NYG46. FUMBLE, recovered by NYG (Mark Herzlich).","(1:25) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(1:31) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(1:37) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(2:00) Carson Wentz pass to the left to Jordan Matthews for 16 yards to the NYG22. Tackled by Andrew Adams.","(2:00) Two Minute Warning.","(2:11) Carson Wentz pass to the right to Jordan Matthews for 33 yards to the NYG38. Tackled by Dominique Rodgers-Cromartie.","(2:29) Brad Wing punts for 56 yards to Phi29. No return.","(2:55) Rashad Jennings rush up the middle for 1 yard to the NYG15. Tackled by Beau Allen and Jaylen Watkins.","(3:19) Eli Manning pass to the left to Will Tye for 10 yards to the NYG14. Tackled by Nigel Bradham and Jordan Hicks.","(3:45) Rashad Jennings rush up the middle for a loss of 2 yards to the NYG4. Tackled by Fletcher Cox and Beau Allen.","(3:55) Darren Sproles rush to the right for no gain to the NYG6. Tackled by Damon Harrison and Kelvin Sheppard.","(4:38) Carson Wentz pass to the left to Jordan Matthews for 9 yards to the NYG6. Tackled by Dominique Rodgers-Cromartie.","(5:21) Ryan Mathews rush to the right for no gain to the NYG15. Tackled by Jonathan Casillas and Damon Harrison.","(5:25) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(5:42) Brad Wing punts for 55 yards to Phi19. Darren Sproles return for 66 yards to NYG15. Tackled by Keenan Robinson.","(5:47) Eli Manning incomplete pass to the left intended for Roger Lewis.","(5:58) Penalty: Offside on Philadelphia (Brandon Graham) 5 yards.","(6:25) Eli Manning pass to the left to Sterling Shepard for 3 yards to the NYG21. Tackled by Nolan Carroll.","(6:51) Penalty: False Start on New York (Jerell Adams) -5 yards.","(7:22) Eli Manning pass to the right to Paul Perkins for 2 yards to the NYG23. Tackled by Mychal Kendricks.","(7:35) Donnie Jones punts for 48 yards to NYG21. No return.","(8:08) Carson Wentz pass to the right to Zach Ertz for 4 yards to the Phi31. Tackled by Nat Berhe.","(8:54) Darren Sproles rush to the right for 7 yards to the Phi27. Tackled by Keenan Robinson.","(9:28) Carson Wentz sacked at Phi20 for a loss of 5 yards by Olivier Vernon.","(9:28) Robbie Gould kicks off to the endzone. Touchback.","(9:28) Robbie Gould extra point is good.","(9:36) Eli Manning pass to the right to Odell Beckham Jr. for 1 yard for a TOUCHDOWN.","(10:14) Rashad Jennings rush to the right for 1 yard to the Phi1. Tackled by Destiny Vaeao.","(10:18) Penalty: Pass Interference on Philadelphia (Nolan Carroll) 7 yards.","(10:55) Eli Manning pass to the right to Victor Cruz for 46 yards to the Phi9. Tackled by Leodis McKelvin.","(11:10) Penalty: False Start on New York (Ereck Flowers) -5 yards.","(11:26) Eli Manning pass to the middle to Sterling Shepard for 15 yards to the NYG35. Tackled by Jaylen Watkins and Nigel Bradham. Penalty: Unnecessary Roughness on Philadelphia (Jaylen Watkins) 15 yards.","(11:32) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(12:05) Eli Manning pass to the left to Jerell Adams for 6 yards to the NYG20. Tackled by Nolan Carroll and Nigel Bradham.","(12:11) Caleb Sturgis kicks off to the NYG-2. Dwayne Harris return for 16 yards to NYG14. Tackled by Najee Goode and Marcus Smith.","(12:11) Caleb Sturgis extra point is good.","(12:19) Ryan Mathews rush to the left for 8 yards for a TOUCHDOWN.","(12:58) Ryan Mathews rush to the right for 4 yards to the NYG8. Tackled by Olivier Vernon and Keenan Robinson.","(13:44) Carson Wentz pass to the left to Bryce Treggs for 58 yards to the NYG12. Tackled by Nat Berhe.","(13:57) Brad Wing punts for 58 yards to Phi20. Darren Sproles return for 10 yards to Phi30. Tackled by Roger Lewis and Jonathan Casillas.","(14:02) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(14:33) Paul Perkins rush up the middle for a loss of 2 yards to the NYG22. Tackled by Beau Allen.","(14:53) Paul Perkins rush to the right for a loss of 4 yards to the NYG24. Tackled by Vinny Curry and Fletcher Cox.","(15:00) Carson Wentz rush to the left for a loss of 4 yards to the NYG27. Tackled by Janoris Jenkins and Damon Harrison.","(0:35) Darren Sproles rush to the left for 4 yards to the NYG23. Tackled by Devon Kennard and Jason Pierre-Paul.","(0:42) Carson Wentz incomplete pass to the right intended for Jordan Matthews defensed by Andrew Adams.","(1:20) Darren Sproles rush to the left for 4 yards to the NYG27. Tackled by Robert Thomas and Keenan Robinson.","(1:55) Carson Wentz pass to the left to Zach Ertz for 30 yards to the NYG31. Tackled by Andrew Adams.","(2:30) Wendell Smallwood rush to the right for 19 yards to the Phi39. Tackled by Andrew Adams.","(2:43) Brad Wing punts for 39 yards to Phi20. No return.","(3:21) Eli Manning sacked at NYG41 for a loss of 9 yards by Destiny Vaeao.","(4:02) Eli Manning pass to the left to Rashad Jennings for 3 yards to the NYG50. Tackled by Jordan Hicks.","(4:41) Rashad Jennings rush to the right for 3 yards to the NYG47. Tackled by Destiny Vaeao and Nigel Bradham.","(5:21) Eli Manning pass to the middle to Will Tye for 13 yards to the NYG44. Tackled by Rodney McLeod and Jaylen Watkins.","(5:51) Rashad Jennings rush to the left for 6 yards to the NYG31. Tackled by Jaylen Watkins.","(5:51) Caleb Sturgis kicks off to the endzone. Touchback.","(5:55) Caleb Sturgis 34 yard field goal attempt is GOOD. Holder: Donnie Jones.","(6:06) Carson Wentz incomplete pass to the left intended for Darren Sproles.","(6:49) Carson Wentz rush to the left for a loss of 5 yards to the NYG16. Tackled by Jason Pierre-Paul.","(6:55) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(7:21) Darren Sproles rush to the right for 3 yards to the NYG11. Tackled by Coty Sensabaugh and Keenan Robinson.","(7:46) Carson Wentz pass to the left to Darren Sproles for 5 yards to the NYG14. Tackled by Landon Collins.","(8:12) Darren Sproles rush to the left for 2 yards to the NYG19. Tackled by Devon Kennard and Jason Pierre-Paul.","(8:42) Carson Wentz pass to the left to Bryce Treggs for 11 yards to the NYG21.","(9:15) Carson Wentz pass to the left to Trey Burton for 11 yards to the NYG32. Tackled by Landon Collins.","(9:43) Carson Wentz pass to the right to Trey Burton for 32 yards to the NYG43. Tackled by Eli Apple.","(9:43) Robbie Gould kicks off to the endzone. Touchback.","(9:43) Robbie Gould extra point is good.","(9:50) Eli Manning pass to the right to Roger Lewis for 30 yards for a TOUCHDOWN.","(10:26) Eli Manning pass to the left to Paul Perkins for a loss of 2 yards to the Phi30. Tackled by Nigel Bradham.","(10:55) Paul Perkins rush to the left for 2 yards to the Phi28. Tackled by Destiny Vaeao and Beau Allen.","(11:05) Carson Wentz pass intended for Dorial Green-Beckham INTERCEPTED by Andrew Adams and returned for 19 yards. Tackled by Darren Sproles.","(11:52) Ryan Mathews rush to the right for 2 yards to the Phi30. Tackled by Olivier Vernon and Landon Collins.","(12:27) Carson Wentz rush to the left for 3 yards to the Phi28. Tackled by Jason Pierre-Paul.","(12:27) Robbie Gould kicks off to the endzone. Touchback.","(12:27) Robbie Gould extra point is good.","(12:36) Eli Manning pass to the right to Odell Beckham Jr. for 26 yards for a TOUCHDOWN.","(13:17) Eli Manning pass to the right to Rashad Jennings for 5 yards to the Phi26. Tackled by Beau Allen.","(13:29) Carson Wentz pass intended for Nelson Agholor INTERCEPTED by Landon Collins and returned for 7 yards. Tackled by Halapoulivaati Vaitai.","(14:08) Carson Wentz pass to the left to Zach Ertz for 7 yards to the Phi35. Tackled by Eli Apple and Landon Collins.","(14:15) Brad Wing punts for 41 yards to Phi28. No return.","(14:21) Eli Manning incomplete pass to the right intended for Sterling Shepard.","(14:30) Eli Manning incomplete pass to the left intended for Sterling Shepard defensed by Nigel Bradham.","(15:00) Rashad Jennings rush to the left for 6 yards to the NYG31. Tackled by Connor Barwin and Nigel Bradham.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback."]