["(0:25) Joe Flacco rush up the middle for a loss of 1 yard to the Pit38.","(0:44) Joe Flacco rush up the middle for a loss of 1 yard to the Pit37.","(0:48) Chris Boswell onside kickoff to the Pit36. Onside kick recovered by kicking team by Chris Boswell. Penalty: Illegal Touch on Pittsburgh (Chris Boswell) 0 yards.","(0:48) Baltimore Ravens timeout.","(0:48) Chris Boswell extra point is good.","(0:56) Ben Roethlisberger rush up the middle for 4 yards for a TOUCHDOWN.","(1:06) Ben Roethlisberger pass to the left to Le'Veon Bell for 12 yards to the Bal4. Tackled by Eric Weddle.","(1:43) Le'Veon Bell rush to the right for 13 yards to the Bal16. Tackled by Zachary Orr.","(1:48) Ben Roethlisberger incomplete pass to the left intended for Cobi Hamilton.","(1:58) Ben Roethlisberger pass to the right to Le'Veon Bell for 7 yards to the Bal29. Tackled by Matt Judon.","(1:58) Two Minute Warning.","(2:04) Ben Roethlisberger pass to the middle to Eli Rogers for 29 yards to the Bal36. Tackled by Lardarius Webb.","(2:08) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(2:14) Sam Koch punts for 45 yards to Pit35. No return.","(2:14) Pittsburgh Steelers timeout.","(2:18) Joe Flacco sacked at Bal20 for a loss of 6 yards by Ryan Shazier and Anthony Chickillo.","(2:18) Pittsburgh Steelers timeout.","(2:24) Terrance West rush to the left for 1 yard to the Bal26. Tackled by Robert Golden.","(3:04) Terrance West rush to the right for no gain to the Bal25. Tackled by James Harrison.","(3:09) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates.","(3:09) Pittsburgh Steelers timeout.","(3:20) Ben Roethlisberger sacked at Bal25 for a loss of 12 yards by Matt Judon.","(3:26) Ben Roethlisberger pass to the right to Antonio Brown for 4 yards to the Bal13. Tackled by Tavon Young.","(3:30) Ben Roethlisberger incomplete pass to the right intended for Le'Veon Bell.","(3:59) Ben Roethlisberger pass to the middle to Antonio Brown for 10 yards to the Bal17. Tackled by C.J. Mosley.","(4:04) Ben Roethlisberger incomplete pass to the left intended for Eli Rogers defensed by Eric Weddle.","(4:09) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates.","(4:16) Ben Roethlisberger pass to the right to Eli Rogers for 22 yards to the Bal27. Tackled by Lardarius Webb.","(4:21) Ben Roethlisberger incomplete pass to the right intended for Eli Rogers.","(4:54) Ben Roethlisberger pass to the right to Antonio Brown for 12 yards to the Bal49. Tackled by Lardarius Webb.","(5:00) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates.","(5:30) Ben Roethlisberger pass to the middle to Eli Rogers for 30 yards to the Pit39. Tackled by Zachary Orr.","(5:32) Ben Roethlisberger incomplete pass to the middle intended for Eli Rogers defensed by Jerraud Powers.","(6:16) Ben Roethlisberger sacked at Pit9 for a loss of 11 yards by Jerraud Powers.","(6:50) Ben Roethlisberger pass to the right to Xavier Grimble for 10 yards to the Pit20. Tackled by C.J. Mosley.","(7:00) Sam Koch punts for 43 yards to Pit12. Antonio Brown return for a loss of 2 yards to Pit10. Tackled by Darren Waller.","(7:43) Joe Flacco pass to the right to Darren Waller for 8 yards to the Bal45. Tackled by Anthony Chickillo.","(7:49) Joe Flacco incomplete pass to the middle intended for Terrance West defensed by Lawrence Timmons.","(8:32) Kenneth Dixon rush to the right for 1 yard to the Bal37. Tackled by Lawrence Timmons.","(8:38) Chris Boswell kicks off to the Bal8. Devin Hester return for 28 yards to Bal36. Tackled by Shamarko Thomas.","(8:38) Chris Boswell extra point is good.","(8:47) Ben Roethlisberger pass to the right to Antonio Brown for 23 yards for a TOUCHDOWN.","(9:27) Ben Roethlisberger pass to the middle to Eli Rogers for 10 yards to the Bal23. Tackled by Jimmy Smith.","(9:36)  FUMBLE, recovered by Pit (Ben Roethlisberger). Ben Roethlisberger incomplete pass to the right intended for Antonio Brown defensed by Lardarius Webb.","(10:11) Ben Roethlisberger pass to the right to Le'Veon Bell for 2 yards to the Bal33. Tackled by Zachary Orr.","(10:31) Penalty: False Start on Pittsburgh (David DeCastro) -5 yards.","(11:05) Ben Roethlisberger pass to the right to Antonio Brown for 27 yards to the Bal30. Tackled by Eric Weddle.","(11:29) Penalty: Holding on Baltimore (Zachary Orr) 5 yards.","(12:04) Le'Veon Bell rush to the right for 1 yard to the Pit38. Tackled by Timmy Jernigan and Za'Darius Smith.","(12:38) Le'Veon Bell rush to the left for 3 yards to the Pit37. Tackled by Zachary Orr.","(13:09) Ben Roethlisberger rush up the middle for no gain to the Pit30. FUMBLE, recovered by Pit (Le'Veon Bell) and advanced for 4 yards.","(13:36) Ben Roethlisberger pass to the right to Eli Rogers for 5 yards to the Pit30. Tackled by C.J. Mosley.","(13:36) Justin Tucker kicks off to the endzone. Touchback.","(13:36) Joe Flacco 2 pt conversion pass to Steve Smith Sr. is GOOD.","(13:44) Jordan Berry punt blocked by Javorius Allen. Returned by Chris Moore for a TOUCHDOWN.","(13:49) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(14:27) Ben Roethlisberger pass to the right to Eli Rogers for 7 yards to the Pit33. Tackled by Lardarius Webb.","(14:56) Penalty: Illegal Formation on Pittsburgh (Antonio Brown) -5 yards.","(15:00) Ben Roethlisberger incomplete pass to the middle intended for Le'Veon Bell defensed by Terrell Suggs.","(0:02) Sam Koch punts for 40 yards to Pit31. No return.","(0:41) Joe Flacco sacked at Bal29 for a loss of 8 yards by James Harrison. FUMBLE, recovered by Bal (Marshal Yanda).","(0:46) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(1:19) Terrance West rush to the left for 1 yard to the Bal37. Tackled by Lawrence Timmons.","(2:02) Joe Flacco pass to the left to Kamar Aiken for 9 yards to the Bal36. Tackled by Ryan Shazier.","(2:42) Terrance West rush to the left for a loss of 1 yard to the Bal27. Tackled by Ross Cockrell.","(3:18) Terrance West rush to the right for 5 yards to the Bal28. Tackled by Lawrence Timmons.","(3:26) Jordan Berry punts for 54 yards to Bal23. No return.","(3:32) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown.","(4:12) Le'Veon Bell rush to the left for 2 yards to the Pit23. Tackled by Zachary Orr.","(4:50) Le'Veon Bell rush to the right for a loss of 4 yards to the Pit21. Tackled by Michael Pierce.","(4:50) Justin Tucker kicks off to the endzone. Touchback.","(4:55) Justin Tucker 42 yard field goal attempt is GOOD. Holder: Sam Koch.","(5:42) Joe Flacco pass to the left to Mike Wallace for 7 yards to the Pit24. Tackled by Ross Cockrell and Mike Mitchell.","(6:17) Terrance West rush to the left for 1 yard to the Pit31. Tackled by Lawrence Timmons.","(6:20) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(6:27) Ben Roethlisberger pass intended for Jesse James INTERCEPTED by Timmy Jernigan defensed by Brandon Williams. No return. Tackled by B.J. Finney.","(6:34) Sam Koch punts for 47 yards to Pit34. Antonio Brown - no return.","(7:14) Joe Flacco sacked at Bal19 for a loss of 12 yards by James Harrison.","(7:55) Kenneth Dixon rush to the left for a loss of 1 yard to the Bal31. Tackled by Stephon Tuitt.","(8:33) Joe Flacco pass to the middle to Dennis Pitta for 8 yards to the Bal32. Tackled by Lawrence Timmons.","(8:41) Jordan Berry punts for 42 yards to Bal24. No return.","(8:47) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates.","(9:09) Ben Roethlisberger pass to the right to Antonio Brown for 4 yards to the Pit34. Tackled by Tavon Young.","(9:37) DeAngelo Williams rush to the right for 1 yard to the Pit30. Tackled by C.J. Mosley.","(9:46) Sam Koch punts for 45 yards to Pit14. No return. Penalty: Unnecessary Roughness on Baltimore (Darren Waller) 15 yards.","(10:08) Penalty: Delay of Game on Baltimore (Joe Flacco) -5 yards.","(11:18) Ryan Mallett pass to the right to Darren Waller for 9 yards to the Bal46. Tackled by Lawrence Timmons and Anthony Chickillo.","(11:55) Terrance West rush to the left for a loss of 5 yards to the Bal37. Tackled by James Harrison.","(12:27) Terrance West rush to the right for 5 yards to the Bal42. Tackled by James Harrison.","(13:15) Joe Flacco rush to the right for 14 yards to the Bal37. Tackled by Anthony Chickillo.","(13:57) Joe Flacco pass to the left to Mike Wallace for 12 yards to the Bal23. Tackled by Sean Davis.","(14:32) Joe Flacco pass to the left to Kenneth Dixon for a loss of 4 yards to the Bal11. Tackled by Ryan Shazier.","(15:00) Chris Boswell kicks off to the endzone. Touchback. Penalty: Holding on Baltimore (Ronnie Stanley) -10 yards.","(15:00) Penalty: Offside on Pittsburgh (Sammie Coates) -5 yards.","(0:03) Ben Roethlisberger rush up the middle for a loss of 1 yard to the Pit24.","(0:03) Justin Tucker kicks off to the endzone. Touchback.","(0:08) Justin Tucker 49 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:08) Penalty: Illegal Formation on Pittsburgh 5 yards.","(0:12) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(0:17) Penalty: Holding on Baltimore (Ronnie Stanley) -10 yards.","(0:22) Joe Flacco incomplete pass to the middle intended for Kamar Aiken defensed by Lawrence Timmons.","(0:26) Joe Flacco incomplete pass to the middle.","(0:34) Joe Flacco pass to the right to Breshad Perriman for 11 yards to the Pit26. Tackled by Artie Burns.","(0:39) Joe Flacco pass to the right to Breshad Perriman for 16 yards to the Pit37. Tackled by Artie Burns.","(0:39) Penalty: Pass Interference on Pittsburgh (Artie Burns) 9 yards.","(0:39) Baltimore Ravens timeout.","(0:50) Joe Flacco pass to the right to Steve Smith Sr. for 5 yards to the Bal38. Tackled by Robert Golden.","(0:50) Baltimore Ravens timeout.","(1:23) Kenneth Dixon rush to the left for a loss of 2 yards to the Bal33. Tackled by Cameron Heyward.","(1:44) Joe Flacco pass to the right to Steve Smith Sr. for 9 yards to the Bal35. Tackled by Lawrence Timmons.","(1:57) Jordan Berry punts for 54 yards to Bal26. No return.","(2:00) Ben Roethlisberger incomplete pass to the left intended for Le'Veon Bell.","(2:00) Two Minute Warning.","(2:10) Penalty: False Start on Pittsburgh (David Johnson) -5 yards.","(2:53) Le'Veon Bell rush up the middle for 3 yards to the Pit25. Tackled by Lardarius Webb.","(3:22) Ben Roethlisberger pass to the left to Antonio Brown for 5 yards to the Pit22. Tackled by Jimmy Smith.","(3:30) Sam Koch punts for 46 yards to Pit17. No return.","(3:30) Pittsburgh Steelers timeout.","(3:37) Joe Flacco pass to the middle to Breshad Perriman for 6 yards to the Bal37. Tackled by Arthur Moats and Vince Williams.","(3:37) Baltimore Ravens timeout.","(3:43) Joe Flacco incomplete pass to the left intended for Darren Waller.","(4:19) Terrance West rush to the left for 2 yards to the Bal31. Tackled by Javon Hargrave and Cameron Heyward.","(4:30) Jordan Berry punts for 56 yards to Bal28. Devin Hester return for 1 yard to Bal29. Tackled by Cobi Hamilton.","(5:06) Ben Roethlisberger pass to the right to Le'Veon Bell for 6 yards to the Pit16. Tackled by Tavon Young and Zachary Orr.","(5:50) Le'Veon Bell rush to the right for 1 yard to the Pit10. Tackled by C.J. Mosley.","(6:27) Le'Veon Bell rush to the right for 1 yard to the Pit9. Tackled by Brandon Williams.","(6:36) Sam Koch punts for 33 yards to Pit8. No return.","(6:41) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(7:10) Kenneth Dixon rush to the left for 3 yards to the Pit41. Tackled by Jarvis Jones and Arthur Moats.","(7:46) Joe Flacco pass to the right to Steve Smith Sr. for 3 yards to the Pit44. Tackled by Ross Cockrell.","(7:52) Penalty: Running into Kicker on Pittsburgh (Shamarko Thomas) 15 yards.","(8:06) Penalty: Offside on Pittsburgh (Ryan Shazier) 5 yards.","(8:42) Kyle Juszczyk rush to the left for 2 yards to the Bal33. Tackled by Ryan Shazier.","(9:10) Penalty: Holding on Baltimore (Ronnie Stanley) -10 yards.","(9:47) Terrance West rush to the left for 2 yards to the Bal41. Tackled by Stephon Tuitt and Daniel McCullers.","(9:53) Joe Flacco incomplete pass to the left intended for Terrance West defensed by Artie Burns.","(10:18) Kenneth Dixon rush to the right for 2 yards to the Bal34. Tackled by Jarvis Jones. Penalty: Illegal Use of Hands on Pittsburgh (Javon Hargrave) 5 yards.","(10:50) Joe Flacco pass to the right to Kenneth Dixon for 4 yards to the Bal32. Tackled by Anthony Chickillo.","(11:05) Kenneth Dixon rush to the right for 1 yard to the Bal13. Tackled by Ryan Shazier. Penalty: Face Mask on Pittsburgh (Anthony Chickillo) 15 yards.","(11:14) Jordan Berry punts for 42 yards to Bal25. Devin Hester - no return. Tackled by Sean Davis. Penalty: Unsports. Conduct on Baltimore (Marqueston Huff) -13 yards.","(11:23) Ben Roethlisberger incomplete pass to the left intended for Darrius Heyward-Bey.","(11:28) Ben Roethlisberger incomplete pass to the left intended for Eli Rogers defensed by C.J. Mosley.","(12:12) Ben Roethlisberger pass to the middle to Jesse James for 7 yards to the Pit33. Tackled by Albert McClellan.","(12:34) Penalty: Face Mask on Pittsburgh (Le'Veon Bell) -15 yards.","(12:46) Sam Koch punts for 48 yards to Pit34. Antonio Brown return for 7 yards to Pit41. Tackled by Patrick Onwuasor.","(13:24) Joe Flacco pass to the right to Dennis Pitta for 6 yards to the Bal18. Tackled by Lawrence Timmons.","(14:02) Terrance West rush to the right for 9 yards to the Bal12. Tackled by Daniel McCullers.","(14:47) Terrance West rush up the middle for a loss of 11 yards to the Bal5. Tackled by Ryan Shazier. FUMBLE, recovered by Bal (Kamar Aiken) and advanced for a loss of 2 yards.","(14:56) Jordan Berry punts for 43 yards to Bal16. No return.","(15:00) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates.","(0:24) Le'Veon Bell rush to the left for 4 yards to the Pit41. Tackled by Zachary Orr.","(1:03) Ben Roethlisberger pass to the right to Le'Veon Bell for 1 yard to the Pit37. Tackled by Tavon Young.","(1:07) Penalty: Pass Interference on Baltimore (Zachary Orr) 11 yards.","(1:07) Justin Tucker kicks off to the endzone. Touchback.","(1:07) Justin Tucker extra point is good.","(1:21) Joe Flacco pass to the left to Mike Wallace for 95 yards for a TOUCHDOWN.","(1:50) Kenneth Dixon rush to the left for 1 yard to the Bal5. Tackled by Lawrence Timmons.","(2:00) Jordan Berry punts for 51 yards to Bal4. No return.","(2:32) Le'Veon Bell rush to the left for no gain to the Pit45. Tackled by Zachary Orr.","(3:16) Ben Roethlisberger pass to the left to Le'Veon Bell for 10 yards to the Pit45. Tackled by Matt Judon.","(3:41) Penalty: False Start on Pittsburgh (Marcus Gilbert) -5 yards.","(4:23) Ben Roethlisberger pass to the middle to Jesse James for 6 yards to the Pit40. Tackled by C.J. Mosley.","(4:48) Penalty: Delay of Game on Pittsburgh (Ben Roethlisberger) -5 yards.","(5:38) Ben Roethlisberger pass to the right to David Johnson for 15 yards to the Pit39. Tackled by Tavon Young.","(5:41) Ben Roethlisberger incomplete pass to the left intended for Jesse James.","(5:59) Joe Flacco pass intended for Dennis Pitta INTERCEPTED by Artie Burns and returned for 9 yards. Tackled by Kyle Juszczyk.","(6:17) Penalty: Illegal Shift on Baltimore -5 yards.","(6:53) Terrance West rush to the left for a loss of 1 yard to the Pit17. Tackled by Stephon Tuitt.","(7:32) Joe Flacco pass to the middle to Terrance West for 6 yards to the Pit16. Tackled by Ryan Shazier.","(8:09) Joe Flacco pass to the left to Mike Wallace for 10 yards to the Pit22. Tackled by Artie Burns and Ryan Shazier.","(8:43) Joe Flacco pass to the middle to Steve Smith Sr. for 30 yards to the Pit32. Tackled by Sean Davis.","(9:04) Chris Moore rush to the left for 2 yards to the Bal38. Tackled by Jarvis Jones.","(9:16) Jordan Berry punts for 61 yards to Bal22. Devin Hester return for 14 yards to Bal36. Tackled by Vince Williams.","(9:22) Ben Roethlisberger incomplete pass to the right intended for Darrius Heyward-Bey defensed by Lardarius Webb.","(10:04) Le'Veon Bell rush to the right for 3 yards to the Pit17. Tackled by Zachary Orr and Michael Pierce.","(10:40) Le'Veon Bell rush to the right for 2 yards to the Pit14. Tackled by Eric Weddle and Brandon Williams.","(10:48) Sam Koch punts for 33 yards to Pit12. No return.","(10:53) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(10:58) Penalty: Illegal Use of Hands on Baltimore (Ronnie Stanley) -10 yards.","(11:37) Kenneth Dixon rush to the right for 2 yards to the Pit35. Tackled by Jarvis Jones.","(12:12) Kenneth Dixon rush to the left for 6 yards to the Pit37. Tackled by Anthony Chickillo.","(12:48) Terrance West rush to the right for 5 yards to the Pit43. Tackled by Lawrence Timmons and Ryan Shazier.","(12:54) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(13:26) Terrance West rush to the right for 8 yards to the Pit48. Tackled by Jarvis Jones.","(13:33) Jordan Berry punts for 28 yards to Bal44. No return.","(14:05) Le'Veon Bell rush to the left for 2 yards to the Pit28. Tackled by Timmy Jernigan and Eric Weddle.","(14:52) Le'Veon Bell rush to the right for 1 yard to the Pit26. Tackled by Lawrence Guy.","(15:00) Ben Roethlisberger incomplete pass to the right intended for David Johnson.","(15:00) Justin Tucker kicks off to the endzone. Touchback."]