["(0:27) Matt Schaub rush up the middle for a loss of 1 yard to the TB46.","(0:57) Matt Schaub rush up the middle for a loss of 1 yard to the TB45.","(0:59) Roberto Aguayo onside kickoff to the TB44. Onside kick recovered by receiving team by Austin Hooper.","(0:59) Mike Glennon 2 pt conversion pass to Brandon Myers is GOOD.","(1:01) Mike Glennon pass to the right to Cameron Brate for 2 yards for a TOUCHDOWN.","(1:25) Mike Glennon pass to the right to Peyton Barber for 11 yards to the Atl2. Tackled by De'Vondre Campbell.","(1:47) Mike Glennon pass to the middle to Peyton Barber for 4 yards to the Atl13. Tackled by Deion Jones.","(1:54) Mike Glennon pass to the left to Cameron Brate for 13 yards to the Atl17. Tackled by De'Vondre Campbell.","(2:00) Mike Glennon incomplete pass to the left intended for Peyton Barber.","(2:00) Two Minute Warning.","(2:10) Mike Glennon pass to the left to Peyton Barber for 4 yards to the Atl30. Tackled by De'Vondre Campbell.","(2:21) Mike Glennon pass to the left to Adam Humphries for 12 yards to the Atl34. Tackled by Vic Beasley Jr..","(2:50) Mike Glennon pass to the right to Adam Humphries for 9 yards to the Atl46. Tackled by Jalen Collins.","(2:55) Mike Glennon pass to the right to Cameron Brate for 3 yards to the TB45. Tackled by Vic Beasley Jr..","(3:19) Mike Glennon pass to the right to Antone Smith for 8 yards to the TB42. Tackled by Jonathan Babineaux.","(3:42) Mike Glennon pass to the right to Antone Smith for 9 yards to the TB34. Tackled by De'Vondre Campbell.","(3:42) Matt Bosher kicks off to the endzone. Touchback.","(3:47) Matt Bryant 50 yard field goal attempt is GOOD. Holder: Matt Bosher.","(3:53) Matt Ryan pass to the right to Taylor Gabriel for 1 yard to the TB32. Tackled by Brent Grimes.","(4:38) Stevan Ridley rush to the right for 3 yards to the TB33. Tackled by John Hughes III.","(5:21) Stevan Ridley rush to the right for a loss of 3 yards to the TB36. Tackled by Lavonte David.","(6:07) Stevan Ridley rush to the left for 7 yards to the TB33. Tackled by Chris Conte and Daryl Smith.","(6:47) Terron Ward rush to the right for 4 yards to the TB40. Tackled by Daryl Smith and Kwon Alexander.","(6:47) Roberto Aguayo onside kickoff to the TB44. Onside kick recovered by receiving team by Mohamed Sanu.","(6:47) Jameis Winston 2 pt rush attempt.","(6:53) Jameis Winston pass to the left to Adam Humphries for 7 yards for a TOUCHDOWN.","(7:18) Jameis Winston pass to the left to Cecil Shorts III for 20 yards to the Atl7. Tackled by Ricardo Allen.","(7:18) Tampa Bay Buccaneers timeout.","(7:31) Jameis Winston sacked at Atl27 for a loss of 5 yards by Adrian Clayborn.","(7:58) Jameis Winston pass to the right to Freddie Martino for 9 yards to the Atl22. Tackled by Robert Alford.","(8:03) Jameis Winston incomplete pass to the right intended for Cameron Brate defensed by De'Vondre Campbell.","(8:10) Penalty: Pass Interference on Tampa Bay (Mike Evans) -10 yards.","(8:31) Jameis Winston pass to the left to Mike Evans for 15 yards to the Atl21. Tackled by Deion Jones.","(8:36) Jameis Winston incomplete pass to the left intended for Cecil Shorts III.","(9:00) Jameis Winston pass to the middle to Mike James for 6 yards to the Atl36. Tackled by Deion Jones and Ricardo Allen.","(9:29) Jameis Winston pass to the middle to Mike Evans for 28 yards to the Atl42. Tackled by Robert Alford and Ricardo Allen.","(9:33) Jameis Winston incomplete pass to the right intended for Mike Evans.","(9:56) Jameis Winston pass to the right to Mike James for 5 yards to the TB30. Tackled by Keanu Neal.","(9:56) Matt Bosher kicks off to the endzone. Touchback.","(9:56) Matt Bryant extra point is good.","(10:00) Matt Ryan pass to the middle to Austin Hooper for 2 yards for a TOUCHDOWN.","(10:08) Matt Ryan incomplete pass to the right intended for Austin Hooper defensed by Bradley McDougald.","(10:47) Devonta Freeman rush to the left for a loss of 1 yard to the TB2. Tackled by William Gholston and Kwon Alexander.","(11:29) Devonta Freeman rush to the left for 6 yards to the TB1. Tackled by Bradley McDougald.","(12:10) Devonta Freeman rush to the right for 5 yards to the TB7. Tackled by Gerald McCoy and Bradley McDougald.","(12:51) Devonta Freeman rush to the right for 11 yards to the TB12. Tackled by Brent Grimes.","(13:22) Matt Ryan pass to the left to Mohamed Sanu for 24 yards to the TB23. Tackled by Vernon Hargreaves III.","(13:59) Devonta Freeman rush to the left for 5 yards to the TB47. Tackled by DaVonte Lambert.","(14:39) Devonta Freeman rush to the right for 5 yards to the Atl48. Tackled by Bradley McDougald.","(14:45) Jameis Winston incomplete pass to the middle intended for Adam Humphries.","(15:00) Penalty: Holding on Tampa Bay (Ali Marpet) -10 yards.","(0:02) Peyton Barber rush up the middle for no gain to the Atl33. Tackled by Deion Jones and Jonathan Babineaux.","(0:30) Jameis Winston pass to the right to Peyton Barber for 5 yards to the Atl33. Tackled by De'Vondre Campbell.","(1:13) Peyton Barber rush to the right for 4 yards to the Atl38. Tackled by De'Vondre Campbell.","(1:46) Jameis Winston pass to the right to Mike Evans for 16 yards to the Atl42. Tackled by Keanu Neal.","(1:52) Jameis Winston incomplete pass to the right intended for Mike Evans.","(1:56) Jameis Winston incomplete pass to the right intended for Adam Humphries.","(2:27) Jameis Winston pass to the right to Mike Evans for 14 yards to the TB42. Tackled by Jalen Collins.","(3:02) Peyton Barber rush up the middle for 3 yards to the TB28. Tackled by Tyson Jackson and Brooks Reed.","(3:02) Matt Bosher kicks off to the endzone. Touchback.","(3:02) Matt Bryant extra point is good.","(3:07) Matt Ryan pass to the left to Julio Jones for 3 yards for a TOUCHDOWN.","(3:43) Terron Ward rush up the middle for 2 yards to the TB3. Tackled by Adarius Glanton.","(4:07) Terron Ward rush up the middle for 6 yards to the TB5. Tackled by Adarius Glanton.","(4:43) Matt Ryan pass to the left to Mohamed Sanu for 8 yards to the TB11. Tackled by Vernon Hargreaves III.","(5:24) Matt Ryan pass to the right to Austin Hooper for 28 yards to the TB19. Tackled by Keith Tandy.","(6:07) Matt Ryan rush up the middle for no gain to the TB45. FUMBLE, recovered by Atl (Matt Ryan).","(6:29) Matt Ryan pass to the right to Taylor Gabriel for 13 yards to the TB45. Tackled by Jude Adjei-Barimah.","(7:08) Matt Ryan pass to the middle to Mohamed Sanu for 20 yards to the Atl42. Tackled by Bradley McDougald.","(7:46) Devonta Freeman rush up the middle for 4 yards to the Atl22. Tackled by Akeem Spence.","(7:54) Matt Ryan incomplete pass to the left intended for Mohamed Sanu defensed by Bradley McDougald.","(8:06) Bryan Anger punts for 50 yards to Atl17. Eric Weems return for 1 yard to Atl18. Tackled by Ryan Smith.","(8:11) Jameis Winston incomplete pass to the left intended for Cecil Shorts III defensed by Jalen Collins.","(8:50) Antone Smith rush to the right for 8 yards to the TB33. Tackled by Keanu Neal.","(8:54) Jameis Winston incomplete pass to the right intended for Mike Evans defensed by Brian Poole.","(8:54) Matt Bosher kicks off to the endzone. Touchback.","(8:54) Matt Ryan 2 pt conversion pass is NO GOOD - intended for Julio Jones.","(8:59) Matt Ryan pass to the left to Patrick DiMarco for 1 yard for a TOUCHDOWN.","(9:32) Devonta Freeman rush to the left for no gain to the TB1. Tackled by Adarius Glanton and Robert Ayers Jr..","(9:37) Penalty: Pass Interference on Tampa Bay (Vernon Hargreaves III) 1 yards.","(10:17) Terron Ward rush up the middle for 3 yards to the TB2. Tackled by Daryl Smith and Robert Ayers Jr..","(11:00) Terron Ward rush to the right for 3 yards to the TB5. Tackled by Jude Adjei-Barimah.","(11:41) Matt Ryan pass to the left to Julio Jones for 11 yards to the TB8. Tackled by Daryl Smith.","(12:20) Matt Ryan pass to the left to Julio Jones for 16 yards to the TB19. Tackled by Chris Conte.","(12:46) Matt Ryan pass to the left to Julio Jones for 21 yards to the TB35. Tackled by Adarius Glanton and Bradley McDougald.","(13:09) Tampa Bay Buccaneers timeout.","(13:09) Matt Ryan pass to the left to Julio Jones for 11 yards to the Atl44. Tackled by Vernon Hargreaves III.","(13:52) Devonta Freeman rush to the right for no gain to the Atl33. Tackled by Adarius Glanton.","(14:28) Devonta Freeman rush to the right for 5 yards to the Atl33. Tackled by Adarius Glanton and Akeem Spence.","(14:55) Matt Ryan pass to the middle to Mohamed Sanu for 14 yards to the Atl28. Tackled by Vernon Hargreaves III.","(15:00) Roberto Aguayo kicks off to the Atl-1. Eric Weems return for 25 yards to Atl24. Tackled by Alan Cross. Penalty: Holding on Atlanta (Stevan Ridley) -10 yards.","(0:32) Matt Ryan sacked at Atl38 for a loss of 10 yards by William Gholston.","(0:32) Atlanta Falcons timeout.","(0:40) Matt Ryan pass to the left to Devonta Freeman for 1 yard to the Atl48. Tackled by Jude Adjei-Barimah.","(0:58) Matt Ryan pass to the right to Mohamed Sanu for 8 yards to the Atl47. Tackled by Daryl Smith.","(1:03) Penalty: Illegal Formation on Atlanta (Mohamed Sanu) -5 yards.","(1:24) Matt Ryan pass to the left to Julio Jones for 17 yards to the Atl44. Tackled by Chris Conte.","(1:46) Matt Ryan pass to the left to Julio Jones for 11 yards to the Atl27. Tackled by Lavonte David.","(1:53) Bryan Anger punts for 40 yards to Atl16. No return.","(1:53) Atlanta Falcons timeout.","(2:00) Jameis Winston sacked at TB44 for a loss of 5 yards by Grady Jarrett.","(2:00) Two Minute Warning.","(2:04) Jameis Winston rush up the middle for a loss of 3 yards to the TB49. Tackled by Grady Jarrett.","(2:40) Jameis Winston pass to the right to Mike James for 6 yards to the Atl48. Tackled by Philip Wheeler and Jonathan Babineaux.","(2:46) Penalty: Holding on Atlanta (Brian Poole) 5 yards.","(2:53) Jameis Winston incomplete pass to the left intended for Mike Evans.","(3:01) Penalty: Offside on Atlanta (Vic Beasley Jr.) 5 yards.","(3:27) Mike James rush to the right for 3 yards to the TB36. Tackled by De'Vondre Campbell.","(3:56) Jameis Winston pass to the right to Adam Humphries for 8 yards to the TB33. Tackled by Brian Poole.","(3:56) Matt Bosher kicks off to the endzone. Touchback.","(3:56) Matt Bryant extra point is good.","(4:01) Taylor Gabriel rush to the right for 9 yards for a TOUCHDOWN.","(4:03) Atlanta Falcons timeout.","(4:48) Devonta Freeman rush up the middle for 3 yards to the TB9. Tackled by Kwon Alexander and William Gholston.","(5:27) Matt Ryan pass to the right to Austin Hooper for 16 yards to the TB12. Tackled by Kwon Alexander.","(5:33) Matt Ryan incomplete pass to the right intended for Julio Jones defensed by Brent Grimes.","(5:33) Tampa Bay Buccaneers timeout.","(6:13) Devonta Freeman rush to the right for a loss of 2 yards to the TB28. Tackled by Lavonte David.","(6:41) Matt Ryan pass to the right to Taylor Gabriel for 26 yards to the TB26.","(7:10) Devonta Freeman rush to the left for 3 yards to the Atl48. Tackled by DaVonte Lambert and Kwon Alexander.","(7:50) Terron Ward rush to the left for 5 yards to the Atl45. Tackled by Vernon Hargreaves III.","(8:09) Penalty: Encroachment on Tampa Bay (William Gholston) 5 yards.","(8:29) Terron Ward rush to the left for 4 yards to the Atl30. Tackled by John Hughes III and Daryl Smith. Penalty: Holding on Tampa Bay (John Hughes III) 5 yards.","(8:35) Roberto Aguayo kicks off to the Atl-3. Eric Weems return for 29 yards to Atl26. Tackled by Alterraun Verner.","(8:35) Roberto Aguayo extra point is good.","(8:35) Penalty: False Start on Tampa Bay (Akeem Spence) -5 yards.","(8:43) Jameis Winston pass to the left to Mike Evans for 24 yards for a TOUCHDOWN.","(8:49) Jameis Winston incomplete pass to the left intended for Mike Evans.","(8:58) Penalty: Illegal Formation on Tampa Bay (Brandon Myers) -5 yards.","(9:06) Matt Ryan sacked at Atl19 for a loss of 9 yards by Gerald McCoy. FUMBLE, recovered by TB (Daryl Smith). Tackled by Andy Levitre.","(9:46) Devonta Freeman rush to the right for 3 yards to the Atl28. Tackled by Akeem Spence.","(10:22) Matt Ryan pass to the middle to Julio Jones for 21 yards to the Atl25. Tackled by Bradley McDougald.","(10:29) Matt Ryan incomplete pass to the right intended for Julio Jones.","(10:41) Penalty: Holding on Atlanta (Robenson Therezie) -4 yards.","(11:19) Jameis Winston pass to the left to Antone Smith for 10 yards to the TB39. Tackled by Courtney Upshaw.","(11:28) Jameis Winston incomplete pass to the right intended for Cecil Shorts III.","(12:05) Peyton Barber rush to the left for 3 yards to the TB29. Tackled by Adrian Clayborn.","(12:22) Penalty: Holding on Tampa Bay (Joe Hawley) -10 yards.","(12:58) Jameis Winston pass to the middle to Mike Evans for 7 yards to the TB36. Tackled by Ricardo Allen.","(13:38) Peyton Barber rush to the right for 4 yards to the TB29. Tackled by Robert Alford and Brooks Reed.","(13:38) Matt Bosher kicks off to the endzone. Touchback.","(13:42) Matt Bryant 41 yard field goal attempt is GOOD. Holder: Matt Bosher.","(13:48) Matt Ryan incomplete pass to the left intended for Austin Hooper defensed by Chris Conte.","(14:25) Terron Ward rush up the middle for 3 yards to the TB23. Tackled by William Gholston and Vernon Hargreaves III.","(14:34) Matt Ryan incomplete pass to the right intended for Joshua Perkins.","(15:00) Devonta Freeman rush to the left for 20 yards to the TB26. Tackled by Chris Conte.","(0:19) Matt Ryan pass to the right to Taylor Gabriel for 9 yards to the TB46. Tackled by Brent Grimes.","(1:00) Matt Ryan rush up the middle for no gain to the Atl48. FUMBLE, recovered by Atl (Matt Ryan).","(1:40) Devonta Freeman rush to the left for 9 yards to the Atl48. Tackled by DaVonte Lambert.","(1:47) Jameis Winston rush up the middle for no gain to the Atl39. Tackled by Desmond Trufant. FUMBLE, recovered by Atl (Paul Worrilow). Tackled by Peyton Barber.","(2:19) Jameis Winston pass to the right to Cameron Brate for 17 yards to the Atl39. Tackled by Ricardo Allen.","(2:40) Penalty: Pass Interference on Tampa Bay (Mike Evans) -10 yards.","(3:21) Peyton Barber rush to the right for 2 yards to the Atl46. Tackled by Jonathan Babineaux and Keanu Neal.","(3:56) Jameis Winston rush to the left for 14 yards to the Atl48. Tackled by Ricardo Allen.","(3:59) Jameis Winston incomplete pass to the right intended for Freddie Martino defensed by Brian Poole.","(4:30) Peyton Barber rush to the right for 3 yards to the TB38. Tackled by Deion Jones.","(4:37) Penalty: Pass Interference on Atlanta (Robert Alford) 5 yards.","(5:17) Jameis Winston pass to the right to Mike Evans for 8 yards to the TB30. Tackled by Deion Jones.","(5:41) Penalty: Holding on Tampa Bay (Donovan Smith) -10 yards.","(6:08) Jameis Winston pass to the right to Mike Evans for 7 yards to the TB32. Tackled by Desmond Trufant.","(6:08) Matt Bosher kicks off to the endzone. Touchback.","(6:12) Matt Bryant 29 yard field goal attempt is GOOD. Holder: Matt Bosher.","(6:18) Matt Ryan incomplete pass to the left intended for Austin Hooper.","(6:58) Matt Ryan pass to the left to Taylor Gabriel for 3 yards to the TB11. Tackled by Jude Adjei-Barimah.","(7:04) Matt Ryan incomplete pass to the left intended for Julio Jones.","(7:13) Antone Smith rush up the middle for no gain to the TB14. Tackled by De'Vondre Campbell. FUMBLE, recovered by Atl (Brian Poole). Tackled by Ali Marpet.","(7:39) Antone Smith rush to the right for 3 yards to the TB28. Tackled by Robert Alford and Keanu Neal. Penalty: Face Mask on Tampa Bay (Joe Hawley) -14 yards.","(7:39) Matt Bosher kicks off to the endzone. Touchback.","(7:39) Matt Bryant extra point is good.","(7:47) Matt Ryan pass to the right to Levine Toilolo for 32 yards for a TOUCHDOWN.","(8:09) Taylor Gabriel rush to the left for 15 yards to the TB32. Tackled by Bradley McDougald.","(8:42) Matt Ryan pass to the middle to Devonta Freeman for 27 yards to the TB47. Tackled by Kwon Alexander.","(9:21) Devonta Freeman rush to the right for 1 yard to the Atl26. Tackled by Gerald McCoy.","(9:28) Matt Ryan incomplete pass to the left intended for Mohamed Sanu defensed by Vernon Hargreaves III.","(9:28) Roberto Aguayo kicks off to the endzone. Touchback.","(9:28) Roberto Aguayo extra point is good.","(9:37) Jameis Winston pass to the right to Mike Evans for 3 yards for a TOUCHDOWN.","(10:11) Antone Smith rush to the right for 7 yards to the Atl3. Tackled by Brian Poole.","(10:32) Jameis Winston pass to the left to Cameron Brate for 8 yards to the Atl10. Tackled by Keanu Neal.","(11:05) Peyton Barber rush up the middle for 1 yard to the Atl18. Tackled by Brooks Reed and Jonathan Babineaux.","(11:31) Peyton Barber rush to the left for 4 yards to the Atl19. Tackled by Brooks Reed and De'Vondre Campbell.","(11:58) Jameis Winston pass to the right to Mike Evans for 11 yards to the Atl23. Tackled by Desmond Trufant.","(12:05) Jameis Winston incomplete pass to the left intended for Mike Evans.","(12:44) Jameis Winston pass to the right to Mike Evans for 17 yards to the Atl34. Tackled by Desmond Trufant.","(13:26) Peyton Barber rush to the right for 8 yards to the TB49. Tackled by Keanu Neal and Ricardo Allen.","(13:33) Jameis Winston incomplete pass to the right intended for Antone Smith.","(14:04) Antone Smith rush to the left for 7 yards to the TB41. Tackled by Keanu Neal.","(14:27) Jameis Winston pass to the right to Adam Humphries for 10 yards to the TB34. Tackled by Brian Poole.","(15:00) Peyton Barber rush to the right for a loss of 1 yard to the TB24. Tackled by Adrian Clayborn and Vic Beasley Jr..","(15:00) Matt Bosher kicks off to the endzone. Touchback."]