["(8:34) Matthew Stafford pass to the left to Golden Tate for 28 yards for a TOUCHDOWN.","(9:18) Theo Riddick rush to the left for a loss of 2 yards to the Min28. Tackled by Anthony Barr and Shamar Stephen.","(10:04) Theo Riddick rush to the left for 4 yards to the Min26. Tackled by Shamar Stephen and Audie Cole.","(10:08) Penalty: Pass Interference on Minnesota (Xavier Rhodes) 13 yards.","(10:54) Matthew Stafford sacked at Min43 for a loss of 5 yards by Everson Griffen.","(11:39) Theo Riddick rush to the left for 5 yards to the Min38. Tackled by Shamar Stephen and Chad Greenway.","(12:18) Matthew Stafford pass to the right to Golden Tate for 12 yards to the Min43. Tackled by Trae Waynes.","(13:00) Matthew Stafford pass to the left to Eric Ebron for 2 yards to the Det45. Tackled by Anthony Barr and Xavier Rhodes.","(13:04) Matthew Stafford incomplete pass to the left intended for Theo Riddick.","(13:43) Matthew Stafford pass to the left to Eric Ebron for 23 yards to the Det43. Tackled by Terence Newman.","(14:16) Theo Riddick rush to the left for a loss of 1 yard to the Det20. Tackled by Everson Griffen.","(14:56) Matthew Stafford pass to the left to Golden Tate for 8 yards to the Det21. Tackled by Xavier Rhodes.","(15:00) Blair Walsh kicks off to the Det3. Andre Roberts return for 10 yards to Det13. Tackled by Jayron Kearse and Emmanuel Lamur.","(0:02) Matt Prater 58 yard field goal attempt is GOOD. Holder: Sam Martin.","(0:02) Matthew Stafford incomplete pass to the middle.","(0:17) Matthew Stafford pass to the middle to Andre Roberts for 27 yards to the Min40. Tackled by Emmanuel Lamur.","(0:23) Matthew Stafford pass to the left to Golden Tate for 8 yards to the Det33.","(0:23) Blair Walsh kicks off to the endzone. Touchback.","(0:23) Blair Walsh extra point is good. Penalty: Running into Kicker on Detroit (Johnson Bademosi) 15 yards.","(0:27) Rhett Ellison rush to the right for 1 yard for a TOUCHDOWN.","(0:27) Minnesota Vikings timeout.","(0:46) Matt Asiata rush up the middle for 1 yard to the Det1. Tackled by Tavon Wilson.","(1:13) Sam Bradford pass to the left to Stefon Diggs for 1 yard to the Det2. Tackled by Johnson Bademosi.","(1:13) Detroit Lions timeout.","(1:17) Sam Bradford pass to the middle to Stefon Diggs for 8 yards to the Det3. Tackled by Tahir Whitehead.","(1:21) Sam Bradford incomplete pass to the left intended for Kyle Rudolph defensed by A'Shawn Robinson.","(1:43) Sam Bradford pass to the left to Adam Thielen for 6 yards to the Det11. Tackled by Tavon Wilson.","(1:48) Sam Bradford incomplete pass to the right intended for Cordarrelle Patterson.","(1:48) Penalty: Offside on Detroit (A'Shawn Robinson) 5 yards.","(1:48) Detroit Lions timeout.","(2:00) Sam Bradford pass to the right to Stefon Diggs for 7 yards to the Det22. Tackled by Nevin Lawson.","(2:00) Two Minute Warning.","(2:23) Matt Asiata rush up the middle for 1 yard to the Det29. Tackled by Glover Quin.","(3:00) Sam Bradford pass to the right to Adam Thielen for 17 yards to the Det30. Tackled by Tavon Wilson.","(3:35) Sam Bradford pass to the right to Adam Thielen for 29 yards to the Det47. Tackled by Rafael Bush.","(3:38) Sam Bradford incomplete pass to the right intended for Adam Thielen.","(4:14) Matt Asiata rush up the middle for 3 yards to the Min24. Tackled by Ezekiel Ansah.","(4:26) Sam Martin punts for 53 yards to Min19. Stefon Diggs return for 2 yards to Min21. Tackled by Johnson Bademosi.","(4:31) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(5:19) Golden Tate rush to the left for 1 yard to the Det28. Tackled by Shamar Stephen.","(6:01) Theo Riddick rush to the left for no gain to the Det27. Tackled by Anthony Barr.","(6:40) Matthew Stafford pass to the left to Eric Ebron for 12 yards to the Det27. Tackled by Harrison Smith.","(7:27) Matthew Stafford pass to the right to Theo Riddick for 6 yards to the Det15. Tackled by Trae Waynes.","(8:09) Theo Riddick rush to the right for 4 yards to the Det9. Tackled by Harrison Smith and Everson Griffen.","(8:14) Matt Asiata rush up the middle for no gain to the Det5. Tackled by Josh Bynes.","(8:56) Minnesota Vikings timeout.","(8:56) Jerick McKinnon rush up the middle for 1 yard to the Det5. Tackled by Josh Bynes and Tahir Whitehead.","(9:20) Sam Bradford pass to the middle to Stefon Diggs for 5 yards to the Det6. Tackled by Tavon Wilson.","(9:59) Ronnie Hillman rush to the right for 3 yards to the Det11. Tackled by Glover Quin.","(10:30) Sam Bradford pass to the right to Ronnie Hillman for 32 yards to the Det14. Tackled by Johnson Bademosi.","(11:09) Sam Bradford pass to the left to Cordarrelle Patterson for 7 yards to the Det46. Tackled by Josh Bynes.","(11:52) Sam Bradford pass to the left to Stefon Diggs for 6 yards to the Min47. Tackled by Tavon Wilson.","(12:28) Sam Bradford pass to the right to Stefon Diggs for 10 yards to the Min41. Tackled by Tahir Whitehead.","(12:33) Matt Prater kicks off to the Min-1. Cordarrelle Patterson return for 32 yards to Min31. Tackled by Quandre Diggs.","(12:38) Matt Prater 53 yard field goal attempt is GOOD. Holder: Sam Martin.","(12:43) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(12:52) Penalty: Offside on Minnesota (Everson Griffen) 5 yards.","(13:36) Theo Riddick rush to the right for 3 yards to the Min39. Tackled by Xavier Rhodes.","(13:41) Matthew Stafford incomplete pass to the right intended for Theo Riddick.","(13:50) Blair Walsh 46 yard field goal attempt is BLOCKED by Tyrunn Walker. Return blocked field goal by Glover Quin to the Min42. Tackled by Joe Berger.","(14:28) Sam Bradford pass to the right to Cordarrelle Patterson for 3 yards to the Det28. Tackled by Tahir Whitehead and Quandre Diggs.","(14:33) Sam Bradford incomplete pass to the left intended for Charles Johnson.","(15:00) Jerick McKinnon rush up the middle for no gain to the Det31. Tackled by Tahir Whitehead.","(0:08) Sam Bradford pass to the middle to Stefon Diggs for 12 yards to the Det31. Tackled by Nevin Lawson.","(0:50) Jerick McKinnon rush up the middle for 2 yards to the Det43. Tackled by Tahir Whitehead.","(0:56) Sam Bradford incomplete pass to the left intended for Cordarrelle Patterson.","(1:36) Sam Bradford pass to the left to Cordarrelle Patterson for 8 yards to the Det45. Tackled by Ezekiel Ansah.","(2:17) Sam Bradford pass to the left to Cordarrelle Patterson for 5 yards to the Min47. Tackled by Ezekiel Ansah.","(2:54) Matt Asiata rush up the middle for 1 yard to the Min42. Tackled by Quandre Diggs.","(3:11) Sam Martin punts for 54 yards to Min22. Stefon Diggs return for 19 yards to Min41. Tackled by Miles Killebrew.","(3:17) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by Trae Waynes.","(3:20) Matthew Stafford incomplete pass to the left intended for Dwayne Washington.","(4:02) Dwayne Washington rush to the left for a loss of 1 yard to the Det24. Tackled by Anthony Barr and Xavier Rhodes.","(4:02) Blair Walsh kicks off to the endzone. Touchback.","(4:02) Blair Walsh extra point is NO GOOD.","(4:02) Sam Bradford pass to the right to Kyle Rudolph for 1 yard for a TOUCHDOWN.","(4:46) Penalty: Too Many Men on Field on Detroit 0 yards.","(4:46) Matt Asiata rush to the left for 3 yards to the Det1. Tackled by Ezekiel Ansah.","(5:12) Matt Asiata rush to the right for 6 yards to the Det4. Tackled by Johnson Bademosi.","(6:16) Penalty: False Start on Minnesota (Matt Asiata) -5 yards.","(6:16) Matt Asiata rush to the right for 4 yards to the Det5. Tackled by Anthony Zettel.","(6:57) Matt Asiata rush to the right for 8 yards to the Det9. Tackled by Haloti Ngata and Brandon Copeland.","(6:57) Detroit Lions timeout.","(7:40) Sam Bradford pass to the left to Adam Thielen for 16 yards to the Det17. Tackled by Glover Quin.","(8:19) Stefon Diggs rush to the left for 12 yards to the Det33. Tackled by Tahir Whitehead.","(8:23) Ronnie Hillman rush up the middle for 2 yards to the Min33. Tackled by Glover Quin and Khyri Thornton. Penalty: Pass Interference on Detroit (Johnson Bademosi) 22 yards.","(9:35) Sam Bradford pass to the left to Charles Johnson for 9 yards to the Min31. Tackled by Rafael Bush.","(9:41) Sam Martin punts for 51 yards to Min22. No return.","(9:46) Matthew Stafford incomplete pass to the middle intended for Anquan Boldin defensed by Terence Newman.","(10:29) Theo Riddick rush up the middle for 4 yards to the Det27. Tackled by Everson Griffen.","(10:35) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by Trae Waynes.","(10:42) Jeff Locke punts for 40 yards to Det23. No return.","(11:26) Sam Bradford sacked at Min37 for a loss of 5 yards by Kerry Hyder.","(12:11) Sam Bradford pass to the middle to Matt Asiata for 5 yards to the Min42. Tackled by Antwione Williams and Tahir Whitehead.","(12:50) Sam Bradford pass to the right to Stefon Diggs for 2 yards to the Min37. Tackled by Nevin Lawson.","(12:56) Sam Martin punts for 49 yards to Min27. Stefon Diggs return for 8 yards to Min35. Tackled by Brandon Copeland.","(13:37) Matthew Stafford pass to the right to Golden Tate for a loss of 2 yards to the Det24. Tackled by Terence Newman.","(14:18) Dwayne Washington rush to the left for 4 yards to the Det26. Tackled by Andrew Sendejo and Linval Joseph.","(14:56) Dwayne Washington rush to the left for no gain to the Det22. Tackled by Chad Greenway.","(15:00) Blair Walsh kicks off to the Det8. Andre Roberts return for 14 yards to Det22. Tackled by Edmond Robinson.","(0:05) Sam Martin kicks off to the Min2. Cordarrelle Patterson return for 27 yards to Min29. Tackled by Michael Burton.","(0:05) Matt Prater extra point is good.","(0:08) Matthew Stafford pass to the left to Anquan Boldin for 1 yard for a TOUCHDOWN.","(0:13) Penalty: Holding on Minnesota (Mackensie Alexander) 1 yards.","(0:13) Detroit Lions timeout.","(0:19) Matthew Stafford pass to the left to Golden Tate for 3 yards to the Min2. Tackled by Shamar Stephen and Anthony Barr.","(0:19) Detroit Lions timeout.","(0:27) Matthew Stafford pass to the right to Eric Ebron for 20 yards to the Min5. Tackled by Anthony Harris.","(1:10) Dwayne Washington rush up the middle for 2 yards to the Min25. Tackled by Brian Robison and Chad Greenway.","(1:55) Matthew Stafford pass to the middle to Eric Ebron for 14 yards to the Min27. Tackled by Mackensie Alexander.","(2:00) Matthew Stafford pass to the middle to Golden Tate for 2 yards to the Min31. Tackled by Andrew Sendejo. Penalty: Holding on Detroit (Dwayne Washington) -10 yards.","(2:00) Two Minute Warning.","(2:39) Dwayne Washington rush up the middle for 3 yards to the Min33. Tackled by Linval Joseph.","(3:20) Matthew Stafford pass to the middle to Anquan Boldin for 9 yards to the Min36. Tackled by Emmanuel Lamur and Andrew Sendejo.","(4:06) Matthew Stafford pass to the left to Golden Tate for 4 yards to the Min45. Tackled by Harrison Smith.","(4:47) Dwayne Washington rush to the right for 3 yards to the Min49. Tackled by Harrison Smith.","(5:11) Penalty: Illegal Use of Hands on Minnesota (Xavier Rhodes) 5 yards.","(5:16) Matthew Stafford incomplete pass to the left intended for Eric Ebron.","(5:56) Theo Riddick rush up the middle for no gain to the Det43. Tackled by Chad Greenway.","(6:36) Theo Riddick rush to the left for 5 yards to the Det43. Tackled by Harrison Smith.","(7:20) Matthew Stafford pass to the left to Eric Ebron for 9 yards to the Det38. Tackled by Xavier Rhodes.","(7:42) Penalty: False Start on Detroit (Larry Warford) -5 yards.","(8:22) Dwayne Washington rush to the right for 5 yards to the Det34. Tackled by Linval Joseph.","(9:06) Matthew Stafford pass to the left to Marvin Jones Jr. for 5 yards to the Det29. Tackled by Xavier Rhodes.","(9:50) Dwayne Washington rush to the left for 8 yards to the Det24. Tackled by Anthony Barr and Danielle Hunter.","(9:56) Jeff Locke punts for 24 yards to Det16. No return.","(10:42) Sam Bradford sacked at Det40 for a loss of 9 yards by Kerry Hyder.","(11:21) Ronnie Hillman rush to the right for a loss of 4 yards to the Det31. Tackled by Glover Quin.","(11:37) Sam Bradford pass to the left to Stefon Diggs for 2 yards to the Det17. Tackled by Tahir Whitehead. Penalty: Illegal Block on Minnesota (Jeremiah Sirles) -10 yards.","(11:47) Penalty: False Start on Minnesota (T.J. Clemmings) -5 yards.","(12:25) Jerick McKinnon rush up the middle for 4 yards to the Det14. Tackled by Tavon Wilson.","(12:33) Matthew Stafford pass intended for Michael Burton INTERCEPTED by Chad Greenway and returned for 17 yards. Tackled by Corey Robinson.","(13:14) Matthew Stafford pass to the right to Eric Ebron for 12 yards to the Det35. Tackled by Chad Greenway.","(13:20) Blair Walsh kicks off to the Det-3. Andre Roberts return for 26 yards to Det23. Tackled by Trae Waynes.","(13:23) Blair Walsh 33 yard field goal attempt is GOOD. Holder: Jeff Locke.","(14:01) Sam Bradford pass to the middle to Stefon Diggs for 5 yards to the Det14. Tackled by Josh Bynes.","(14:24) Sam Bradford pass to the right to Stefon Diggs for 7 yards to the Det19. Tackled by Tahir Whitehead.","(15:00) Jerick McKinnon rush up the middle for a loss of 3 yards to the Det26. Tackled by Ezekiel Ansah.","(0:23) Ronnie Hillman rush up the middle for 4 yards to the Det23. Tackled by Glover Quin.","(0:48) Sam Bradford pass to the right to Cordarrelle Patterson for 9 yards to the Det27. Tackled by Tahir Whitehead.","(1:25) Ronnie Hillman rush to the left for 4 yards to the Det36. Tackled by Haloti Ngata and Kerry Hyder.","(1:48) Ronnie Hillman rush to the right for 7 yards to the Det40. Tackled by Glover Quin.","(2:18) Sam Bradford pass to the left to Cordarrelle Patterson for 13 yards to the Det47. Tackled by Tavon Wilson.","(2:46) Sam Bradford pass to the left to Laquon Treadwell for 15 yards to the Min40. Tackled by Rafael Bush.","(2:49) Sam Bradford incomplete pass to the left intended for Stefon Diggs.","(2:55) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(3:04) Sam Martin punts for 55 yards to Min23. Marcus Sherels return for 2 yards to Min25. Tackled by Don Carey.","(3:41) Matthew Stafford pass to the right to Golden Tate for 7 yards to the Det22. Tackled by Everson Griffen.","(4:20) Dwayne Washington rush up the middle for 2 yards to the Det15. Tackled by Everson Griffen and Harrison Smith.","(4:23) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(4:31) Jeff Locke punts for 44 yards to Det13. No return.","(4:36) Sam Bradford incomplete pass to the right intended for Charles Johnson.","(5:04) Penalty: Pass Interference on Minnesota (Cordarrelle Patterson) -10 yards.","(5:43) Jerick McKinnon rush to the left for 3 yards to the Det47. Tackled by A'Shawn Robinson.","(6:18) Sam Bradford pass to the left to Stefon Diggs for 6 yards to the Min50. Tackled by Nevin Lawson.","(6:48) Ronnie Hillman rush to the left for 14 yards to the Min44. Tackled by Glover Quin.","(7:14) Sam Bradford pass to the left to Sam Bradford for 5 yards to the Min30. Tackled by Tahir Whitehead.","(7:14) Sam Martin kicks off to the endzone. Touchback.","(7:18) Matt Prater 47 yard field goal attempt is GOOD. Holder: Sam Martin.","(7:22) Matthew Stafford incomplete pass to the middle intended for Anquan Boldin.","(8:02) Dwayne Washington rush to the right for no gain to the Min29. Tackled by Anthony Barr.","(8:46) Matthew Stafford pass to the left to Golden Tate for 1 yard to the Min29. Tackled by Shamar Stephen.","(9:32) Theo Riddick rush up the middle for 42 yards to the Min30. Tackled by Captain Munnerlyn.","(10:17) Theo Riddick rush to the right for 3 yards to the Det28. Tackled by Chad Greenway.","(10:58) Theo Riddick rush to the left for no gain to the Det25. Tackled by Everson Griffen.","(11:32) Matthew Stafford pass to the left to Golden Tate for 8 yards to the Det25. Tackled by Xavier Rhodes.","(12:14) Theo Riddick rush to the left for 3 yards to the Det17. Tackled by Harrison Smith.","(12:21) Jeff Locke punts for 38 yards to Det14. No return.","(12:26) Sam Bradford incomplete pass to the left intended for Adam Thielen defensed by Johnson Bademosi.","(13:08) Jerick McKinnon rush up the middle for 1 yard to the Min48. Tackled by Josh Bynes.","(13:52) Sam Bradford pass to the right to Rhett Ellison for 4 yards to the Min47. Tackled by Tavon Wilson.","(14:27) Sam Bradford pass to the left to Stefon Diggs for 9 yards to the Min43. Tackled by Glover Quin.","(14:55) Sam Bradford pass to the right to Matt Asiata for 9 yards to the Min34. Tackled by Josh Bynes.","(15:00) Sam Martin kicks off to the Min-3. Cordarrelle Patterson return for 28 yards to Min25. Tackled by Miles Killebrew."]