["(7:56) Dak Prescott pass to the left to Jason Witten for 5 yards for a TOUCHDOWN.","(8:32) Dak Prescott rush up the middle for a loss of 1 yard to the Phi5. Tackled by Malcolm Jenkins and Nigel Bradham.","(9:04) Dak Prescott pass to the left to Ezekiel Elliott for 10 yards to the Phi4. Tackled by Jalen Mills.","(9:38) Ezekiel Elliott rush up the middle for no gain to the Phi14. Tackled by Brandon Graham and Nigel Bradham.","(10:19) Ezekiel Elliott rush up the middle for 12 yards to the Phi14. Tackled by Malcolm Jenkins.","(10:59) Dak Prescott rush up the middle for 2 yards to the Phi26. Tackled by Fletcher Cox and Brandon Graham.","(10:59) Dallas Cowboys timeout.","(11:40) Ezekiel Elliott rush to the left for no gain to the Phi28. Tackled by Brandon Graham and Nigel Bradham.","(12:25) Dak Prescott pass to the right to Cole Beasley for 7 yards to the Phi28. Tackled by Nigel Bradham.","(13:03) Ezekiel Elliott rush up the middle for 2 yards to the Phi35. Tackled by Jordan Hicks.","(13:46) Dak Prescott pass to the right to Cole Beasley for 24 yards to the Phi37. Tackled by Jalen Mills.","(14:22) Dak Prescott pass to the left to Terrance Williams for 10 yards to the Dal39. Tackled by Nolan Carroll.","(15:00) Ezekiel Elliott rush to the right for 4 yards to the Dal29. Tackled by Leodis McKelvin and Fletcher Cox.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback.","(0:33) Dak Prescott sacked at Dal18 for a loss of 10 yards by Connor Barwin.","(0:38) Dak Prescott incomplete pass to the right intended for Cole Beasley defensed by Brandon Graham.","(0:46) Donnie Jones punts for 53 yards to Dal38. No return. Penalty: Holding on Dallas (Kyle Wilber) -10 yards.","(0:46) Dallas Cowboys timeout.","(0:53) Carson Wentz sacked at Phi9 for a loss of 2 yards by Orlando Scandrick.","(0:53) Dallas Cowboys timeout.","(0:59) Carson Wentz pass to the middle to Jordan Matthews for 7 yards to the Phi11. Tackled by Orlando Scandrick.","(0:59) Dallas Cowboys timeout.","(1:07) Carson Wentz sacked at Phi4 for a loss of 6 yards by Cedric Thornton and Tyrone Crawford.","(1:13) Penalty: Pass Interference on Philadelphia (Dorial Green-Beckham) -10 yards.","(1:24) Chris Jones punts for 60 yards to Phi0. Touchback.","(1:29) Dak Prescott incomplete pass to the left intended for Cole Beasley.","(1:35) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(1:42) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(1:54) Donnie Jones punts for 29 yards to Dal40. No return.","(2:00) Carson Wentz incomplete pass to the left intended for Trey Burton defensed by Brandon Carr.","(2:00) Two Minute Warning.","(2:21) Carson Wentz pass to the left to Jordan Matthews for a loss of 2 yards to the Phi31. Tackled by Brandon Carr.","(3:04) Darren Sproles rush to the right for 8 yards to the Phi33. Tackled by J.J. Wilcox.","(3:04) Dan Bailey kicks off to the endzone. Touchback.","(3:04) Dan Bailey extra point is good.","(3:11) Dak Prescott pass to the left to Dez Bryant for 22 yards for a TOUCHDOWN.","(3:19) Dak Prescott incomplete pass to the right intended for Brice Butler.","(3:27) Dak Prescott rush to the left for 12 yards to the Phi22.","(3:34) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(4:13) Ezekiel Elliott rush to the left for 3 yards to the Phi34. Tackled by Fletcher Cox.","(4:45) Ezekiel Elliott rush to the right for 7 yards to the Phi37. Tackled by Jalen Mills and Malcolm Jenkins.","(4:51) Dak Prescott pass to the right to Brice Butler for 19 yards to the Phi44.","(4:59) Dak Prescott pass to the right to Cole Beasley for 10 yards to the Dal37.","(5:04) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(5:36) Dak Prescott pass to the left to Dez Bryant for 15 yards to the Dal27. Tackled by Rodney McLeod.","(5:54) Penalty: Holding on Dallas (Travis Frederick) -10 yards.","(6:26) Dak Prescott pass to the left to Cole Beasley for 12 yards to the Dal22. Tackled by Malcolm Jenkins.","(6:34) Donnie Jones punts for 26 yards to Dal10. No return.","(7:17)  FUMBLE, recovered by Phi (Carson Wentz). Carson Wentz pass to the right to Darren Sproles for a loss of 6 yards to the Dal36. Tackled by Sean Lee.","(7:59) Kenjon Barner rush to the right for 2 yards to the Dal30. Tackled by Demarcus Lawrence.","(8:06)  FUMBLE, recovered by Phi (Carson Wentz). Josh Huff incomplete pass to the right intended for Jordan Matthews.","(8:49) Darren Sproles rush up the middle for 9 yards to the Dal32. Tackled by Byron Jones.","(9:23) Carson Wentz pass to the left to Darren Sproles for 3 yards to the Dal41. Tackled by Justin Durant.","(10:01) Carson Wentz pass to the middle to Jordan Matthews for 11 yards to the Dal44. Tackled by Damien Wilson.","(10:30) Kenjon Barner rush to the left for 3 yards to the Phi45. Tackled by Terrell McClain.","(10:51) Kenjon Barner rush up the middle for 4 yards to the Phi42. Tackled by Sean Lee and Benson Mayowa.","(11:28) Darren Sproles rush to the left for 13 yards to the Phi38. Tackled by Brandon Carr.","(11:34) Carson Wentz incomplete pass to the right intended for Jordan Matthews defensed by Orlando Scandrick.","(11:34) Dan Bailey kicks off to the endzone. Touchback.","(11:34) Dan Bailey 49 yard field goal attempt is GOOD. Holder: Chris Jones.","(11:43) Dak Prescott incomplete pass to the right intended for Dez Bryant defensed by Leodis McKelvin.","(12:18) Ezekiel Elliott rush up the middle for 4 yards to the Phi31. Tackled by Malcolm Jenkins.","(12:58) Dak Prescott pass to the right to Keith Smith for 1 yard to the Phi35. Tackled by Mychal Kendricks.","(13:05) Wendell Smallwood rush to the left for a loss of 5 yards to the Phi36. Tackled by Terrell McClain. FUMBLE, recovered by Dal (Tyrone Crawford). Tackled by Carson Wentz.","(13:12) Chris Jones punts for 39 yards to Phi41. No return.","(13:21) Cole Beasley incomplete pass to the right intended for Terrance Williams.","(13:21) Penalty: Delay of Game on Dallas (Dak Prescott) -5 yards.","(13:29) Dak Prescott incomplete pass to the right intended for Terrance Williams defensed by Leodis McKelvin.","(14:09) Ezekiel Elliott rush to the left for no gain to the Dal25. Tackled by Jordan Hicks.","(14:09) Caleb Sturgis kicks off to the endzone. Touchback.","(14:13) Caleb Sturgis 34 yard field goal attempt is GOOD. Holder: Donnie Jones.","(14:20) Carson Wentz incomplete pass to the right intended for Darren Sproles.","(14:28) Carson Wentz incomplete pass to the middle intended for Dorial Green-Beckham.","(14:32) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(15:00) Carson Wentz pass to the middle to Jordan Matthews for 13 yards to the Dal16. Tackled by Justin Durant.","(0:19) Penalty: Offside on Dallas (Orlando Scandrick) 5 yards.","(0:46) Carson Wentz pass to the left to Zach Ertz for 11 yards to the Dal34. Tackled by Byron Jones.","(0:56) Dan Bailey kicks off to the Phi2. Josh Huff return for 53 yards to Dal45. Tackled by Dan Bailey.","(1:00) Dan Bailey 23 yard field goal attempt is GOOD. Holder: Chris Jones.","(1:11) Dak Prescott incomplete pass to the right intended for Terrance Williams.","(1:16) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Jalen Mills.","(1:54) Ezekiel Elliott rush up the middle for 2 yards to the Phi5. Tackled by Malcolm Jenkins.","(2:34) Ezekiel Elliott rush to the left for 16 yards to the Phi7. Tackled by Jordan Hicks and Leodis McKelvin.","(3:16) Dak Prescott pass to the left to Terrance Williams for 15 yards to the Phi23. Tackled by Jalen Mills.","(3:58) Ezekiel Elliott rush up the middle for 1 yard to the Phi38. Tackled by Jordan Hicks.","(4:23) Dak Prescott rush to the left for 4 yards to the Phi39. Tackled by Nigel Bradham.","(4:55) Chris Jones rush to the left for 30 yards to the Phi43. Tackled by Darren Sproles.","(5:00) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(5:40) Ezekiel Elliott rush to the left for a loss of 6 yards to the Dal27. Tackled by Rodney McLeod.","(6:20) Dak Prescott pass to the right to Geoff Swaim for 8 yards to the Dal33. Tackled by Nigel Bradham.","(6:20) Caleb Sturgis kicks off to the endzone. Touchback.","(6:20) Caleb Sturgis extra point is good.","(6:22) Carson Wentz pass to the right to Jordan Matthews for 5 yards for a TOUCHDOWN.","(6:47) Carson Wentz pass to the left to Darren Sproles for 12 yards to the Dal5. Tackled by Demarcus Lawrence and Anthony Hitchens.","(7:11) Penalty: Pass Interference on Philadelphia (Zach Ertz) -10 yards.","(7:27) Darren Sproles rush to the left for 4 yards to the Dal7. Tackled by Jack Crawford.","(7:52) Carson Wentz pass to the right to Nelson Agholor for 7 yards to the Dal11. Tackled by Brandon Carr.","(8:29) Carson Wentz pass to the left to Darren Sproles for 4 yards to the Dal18. Tackled by Barry Church.","(8:33) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(8:37) Carson Wentz incomplete pass to the left intended for Jordan Matthews. Penalty: Unnecessary Roughness on Dallas (Anthony Hitchens) 15 yards.","(9:02) Carson Wentz pass to the left to Dorial Green-Beckham for 14 yards to the Dal37. Tackled by Brandon Carr.","(9:25) Carson Wentz pass to the left to Jordan Matthews for 4 yards to the Phi49. Tackled by Byron Jones.","(9:48) Carson Wentz pass to the left to Jordan Matthews for 8 yards to the Phi45. Tackled by Orlando Scandrick.","(10:08) Carson Wentz pass to the right to Zach Ertz for 4 yards to the Phi37. Tackled by Byron Jones.","(10:30) Darren Sproles rush to the left for 2 yards to the Phi33. Tackled by Maliek Collins and Tyrone Crawford.","(10:42) Chris Jones punts for 39 yards to Phi16. Darren Sproles - no return. FUMBLE, recovered by Phi (Darren Sproles). Penalty: Illegal Block on Dallas (Rod Smith) 15 yards.","(11:22) Dak Prescott pass to the middle to Jason Witten for 11 yards to the Dal45. Tackled by Jordan Hicks and Malcolm Jenkins.","(12:02) Dak Prescott rush up the middle for a loss of 2 yards to the Dal34. FUMBLE, recovered by Dal (Dak Prescott).","(12:39) Ezekiel Elliott rush up the middle for a loss of 1 yard to the Dal36. Tackled by Fletcher Cox.","(12:53) Donnie Jones punts for 61 yards to Dal25. Lucky Whitehead return for 12 yards to Dal37. Tackled by Bryan Braman.","(13:33) Darren Sproles rush to the left for a loss of 2 yards to the Phi14. Tackled by Sean Lee.","(14:16) Darren Sproles rush up the middle for a loss of 1 yard to the Phi16. Tackled by Tyrone Crawford.","(14:52) Darren Sproles rush to the right for 9 yards to the Phi17. Tackled by Sean Lee.","(15:00) Dan Bailey kicks off to the Phi-1. Josh Huff return for 9 yards to Phi8. Tackled by Byron Jones.","(0:01) Caleb Sturgis 55 yard field goal attempt is GOOD. Holder: Donnie Jones.","(0:01) Dallas Cowboys timeout.","(0:05) Carson Wentz pass to the left to Dorial Green-Beckham for 7 yards to the Dal37. Tackled by Brandon Carr.","(0:10) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(0:10) Philadelphia Eagles timeout.","(0:18) Carson Wentz pass to the left to Dorial Green-Beckham for 12 yards to the Dal44. Tackled by Brandon Carr.","(0:36) Carson Wentz pass to the right to Nelson Agholor for 7 yards to the Phi44. Tackled by Morris Claiborne.","(0:58) Carson Wentz pass to the right to Zach Ertz for 4 yards to the Phi37. Tackled by Byron Jones.","(1:03) Carson Wentz pass to the left to Darren Sproles for 4 yards to the Phi33. Tackled by Brandon Carr.","(1:26) Carson Wentz pass to the middle to Jordan Matthews for 9 yards to the Phi29. Tackled by Sean Lee and Anthony Hitchens.","(1:35) Dak Prescott pass intended for Brice Butler INTERCEPTED by Jordan Hicks. No return. Touchback.","(1:40) Dak Prescott incomplete pass to the right intended for Dez Bryant defensed by Leodis McKelvin.","(1:40) Philadelphia Eagles timeout.","(1:58) Dak Prescott rush up the middle for 16 yards to the Phi7. Tackled by Rodney McLeod.","(1:58) Two Minute Warning.","(2:04) Ezekiel Elliott rush up the middle for 1 yard to the Phi23. Tackled by Nigel Bradham.","(2:32) Dak Prescott pass to the left to Dez Bryant for 23 yards to the Phi24. Tackled by Nolan Carroll.","(3:09) Ezekiel Elliott rush to the right for 11 yards to the Phi47. Tackled by Mychal Kendricks and Connor Barwin.","(3:41) Lucky Whitehead rush to the left for 17 yards to the Dal42. Tackled by Leodis McKelvin.","(3:41) Caleb Sturgis kicks off to the endzone. Touchback.","(3:41) Caleb Sturgis extra point is good.","(3:45) Ryan Mathews rush to the left for 1 yard for a TOUCHDOWN.","(4:29) Ryan Mathews rush up the middle for 3 yards to the Dal1. Tackled by Byron Jones.","(4:43) Penalty: Holding on Dallas (Byron Jones) 4 yards.","(5:18) Ryan Mathews rush to the left for a loss of 1 yard to the Dal8. Tackled by Justin Durant.","(5:58) Carson Wentz pass to the right to Trey Burton for 6 yards to the Dal7. Tackled by Justin Durant.","(6:35) Darren Sproles rush to the left for 19 yards to the Dal13. Tackled by Justin Durant.","(6:42) Penalty: Too Many Men on Field on Philadelphia -5 yards.","(6:42) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(7:23) Darren Sproles rush to the left for 9 yards to the Dal27. Tackled by J.J. Wilcox.","(8:04) Darren Sproles rush to the left for 2 yards to the Dal36. Tackled by Sean Lee and Justin Durant.","(8:46) Ryan Mathews rush to the right for 7 yards to the Dal38. Tackled by Sean Lee and Byron Jones.","(8:58) Chris Jones punts for 41 yards to Phi46. Darren Sproles return for 9 yards to Dal45. Tackled by Jeff Heath and Gavin Escobar.","(9:39) Dak Prescott pass to the right to Ezekiel Elliott for 7 yards to the Dal13. Tackled by Jordan Hicks.","(9:46) Dak Prescott incomplete pass to the left intended for Terrance Williams.","(10:18) Alfred Morris rush to the left for 1 yard to the Dal6. Tackled by Rodney McLeod and Brandon Graham.","(10:34) Donnie Jones punts for 62 yards to Dal3. Lucky Whitehead return for 7 yards to Dal10. Tackled by Nigel Bradham. Penalty: Holding on Dallas (Rod Smith) -5 yards.","(11:05) Carson Wentz sacked at Phi35 for no gain by Tyrone Crawford.","(11:48) Carson Wentz pass to the left to Jordan Matthews for 2 yards to the Phi35. Tackled by Sean Lee.","(11:52) Penalty: Pass Interference on Philadelphia (Dorial Green-Beckham) -10 yards.","(12:30) Darren Sproles rush to the right for 2 yards to the Phi43. Tackled by Tyrone Crawford and Barry Church.","(13:25) Penalty: Offside on Dallas (Demarcus Lawrence) 5 yards.","(13:25) Carson Wentz pass to the right to Dorial Green-Beckham for 10 yards to the Phi36. Tackled by Morris Claiborne.","(14:12) Carson Wentz pass to the left to Zach Ertz for no gain to the Phi26. Tackled by Damien Wilson.","(14:50) Carson Wentz pass to the right to Ryan Mathews for 1 yard to the Phi26. Tackled by Morris Claiborne.","(14:50) Dan Bailey kicks off to the endzone. Touchback.","(14:55) Dan Bailey 38 yard field goal attempt is GOOD. Holder: Chris Jones.","(15:00) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(0:33) Alfred Morris rush up the middle for a loss of 3 yards to the Phi20. Tackled by Brandon Graham.","(1:13) Alfred Morris rush up the middle for 8 yards to the Phi17. Tackled by Malcolm Jenkins.","(1:20) Penalty: Illegal Contact on Philadelphia (Jalen Mills) 5 yards.","(1:51) Ezekiel Elliott rush to the right for 13 yards to the Phi30. Tackled by Leodis McKelvin.","(2:24) Dak Prescott pass to the right to Ezekiel Elliott for 25 yards to the Phi38. Tackled by Rodney McLeod. Penalty: Delay of Game on Dallas (Ezekiel Elliott) -5 yards.","(3:03) Ezekiel Elliott rush up the middle for 9 yards to the Dal37. Tackled by Nigel Bradham.","(3:10) Dak Prescott incomplete pass to the right intended for Jason Witten.","(3:21) Donnie Jones punts for 38 yards to Dal28. No return.","(3:59) Carson Wentz pass to the middle to Nelson Agholor for 11 yards to the Phi34. Tackled by Sean Lee.","(3:59) Philadelphia Eagles timeout.","(4:03) Carson Wentz incomplete pass to the right intended for Darren Sproles.","(4:39) Darren Sproles rush to the right for a loss of 2 yards to the Phi23. Tackled by Tyrone Crawford.","(4:41) Dan Bailey kicks off to the endzone. Touchback.","(4:41) Dan Bailey extra point is good.","(4:46) Dak Prescott rush up the middle for 7 yards for a TOUCHDOWN.","(5:21) Ezekiel Elliott rush up the middle for 15 yards to the Phi7. Tackled by Rodney McLeod.","(5:26) Dak Prescott incomplete pass to the left intended for Terrance Williams.","(6:00) Dak Prescott pass to the right to Dez Bryant for 53 yards to the Phi22. Tackled by Leodis McKelvin.","(6:39) Ezekiel Elliott rush to the right for no gain to the Dal25. Tackled by Leodis McKelvin and Mychal Kendricks.","(6:39) Caleb Sturgis kicks off to the endzone. Touchback.","(6:44) Caleb Sturgis 30 yard field goal attempt is GOOD. Holder: Donnie Jones.","(6:48) Carson Wentz incomplete pass to the left intended for Nelson Agholor.","(7:25) Carson Wentz pass to the right to Kenjon Barner for 5 yards to the Dal12. Tackled by Sean Lee.","(8:07) Darren Sproles rush to the right for a loss of 1 yard to the Dal17. Tackled by David Irving.","(8:45) Darren Sproles rush to the right for 15 yards to the Dal16. Tackled by Damien Wilson.","(9:09) Carson Wentz pass to the left to Jordan Matthews for 8 yards to the Dal31.","(9:16) Penalty: Too Many Men on Field on Dallas 5 yards.","(9:59) Carson Wentz rush to the right for a loss of 3 yards to the Dal44. Tackled by Anthony Hitchens.","(10:37) Carson Wentz pass to the right to Jordan Matthews for no gain to the Dal41. Tackled by Morris Claiborne.","(11:11) Carson Wentz pass to the left to Josh Huff for 9 yards to the Dal41. Tackled by Barry Church.","(11:50) Carson Wentz pass to the right to Dorial Green-Beckham for 12 yards to the Phi50. Tackled by Sean Lee.","(11:58) Chris Jones punts for 43 yards to Phi38. No return.","(12:04) Dak Prescott incomplete pass to the left intended for Cole Beasley.","(12:45) Ezekiel Elliott rush to the right for 2 yards to the Dal19. Tackled by Marcus Smith.","(13:27) Dak Prescott sacked at Dal17 for a loss of 4 yards by Marcus Smith.","(14:16) Dak Prescott pass to the left to Ezekiel Elliott for 10 yards to the Dal21. Tackled by Nigel Bradham.","(14:21) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Nolan Carroll.","(14:55) Ezekiel Elliott rush to the left for 1 yard to the Dal11. Tackled by Brandon Graham.","(15:00) Caleb Sturgis kicks off to the Dal-3. Lucky Whitehead return for 13 yards to Dal10. Tackled by Terrence Brooks. FUMBLE, recovered by Dal (Lucky Whitehead)."]