["(0:19) Carson Palmer pass to the left to David Johnson for 21 yards to the Ari25. Tackled by Zack Sanchez.","(0:25) Jonathan Stewart rush to the right for a loss of 1 yard to the Ari4. Tackled by Frostee Rucker and Corey Peters.","(1:09) Jonathan Stewart rush to the right for 7 yards to the Ari3. Tackled by Kevin Minter and Deone Bucannon.","(1:54) Jonathan Stewart rush up the middle for a loss of 3 yards to the Ari10. Tackled by Josh Mauro.","(1:54) Arizona Cardinals timeout.","(2:00) Cam Newton rush to the left for 4 yards to the Ari7. Tackled by Patrick Peterson.","(2:00) Two Minute Warning.","(2:25) Cam Newton pass to the right to Jonathan Stewart for 25 yards to the Ari11. Tackled by Tony Jefferson.","(2:25) Carolina Panthers timeout.","(2:25) Arizona Cardinals timeout.","(2:31) Jonathan Stewart rush up the middle for a loss of 1 yard to the Ari36. Tackled by Calais Campbell and Josh Mauro.","(3:13) Jonathan Stewart rush to the right for 9 yards to the Ari35. Tackled by Tony Jefferson.","(3:19) Carson Palmer pass intended for David Johnson INTERCEPTED by Kony Ealy and returned for 7 yards. Tackled by A.Q. Shipley.","(3:28) Jonathan Stewart rush to the right for 3 yards to the Car40. Tackled by Tony Jefferson. FUMBLE, recovered by Ari (Tony Jefferson). Tackled by Greg Olsen.","(4:14) Jonathan Stewart rush up the middle for 2 yards to the Car37. Tackled by Deone Bucannon and Kevin Minter.","(4:59) Cam Newton rush up the middle for 9 yards to the Car35. Tackled by D.J. Swearinger.","(5:01) Chandler Catanzaro kicks off to the Car26. Ted Ginn Jr. - no return.","(5:01) Carson Palmer 2 pt conversion pass is NO GOOD - intended for J.J. Nelson.","(5:05) Carson Palmer pass to the middle to J.J. Nelson for 4 yards for a TOUCHDOWN.","(5:38) Carson Palmer pass to the right to Larry Fitzgerald for 11 yards to the Car4. Tackled by Kurt Coleman.","(6:02) Carson Palmer pass to the left to David Johnson for 21 yards to the Car15. Tackled by Star Lotulelei.","(6:02) Carolina Panthers timeout.","(6:07) Carson Palmer incomplete pass to the right intended for David Johnson.","(6:39) Carson Palmer pass to the right to Brittan Golden for 12 yards to the Car36.","(7:06) Carson Palmer sacked at Car48 for a loss of 7 yards by Kawann Short.","(7:06) Carolina Panthers timeout.","(7:28) Carson Palmer pass to the middle to John Brown for 14 yards to the Car41. Tackled by Luke Kuechly.","(7:51) David Johnson rush up the middle for 2 yards to the Ari45. Tackled by Kyle Love and Thomas Davis.","(8:14) Carson Palmer pass to the left to J.J. Nelson for 9 yards to the Ari43.","(8:38) Carson Palmer pass to the left to J.J. Nelson for 6 yards to the Ari34. Tackled by Daryl Worley.","(8:59) Carson Palmer pass to the middle to Larry Fitzgerald for 9 yards to the Ari28. Tackled by Luke Kuechly.","(9:04) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(9:28) Carson Palmer pass to the left to Larry Fitzgerald for 9 yards to the Ari19. Tackled by Kurt Coleman and Daryl Worley.","(9:50) Carson Palmer pass to the right to David Johnson for 2 yards to the Ari10. Tackled by Leonard Johnson.","(10:04) Andy Lee punts for 60 yards to Ari14. Patrick Peterson return for 2 yards to Ari16. Tackled by A.J. Klein. Penalty: Holding on Arizona (Brandon Williams) -8 yards.","(10:38) Cam Newton pass to the left to Ted Ginn Jr. for 3 yards to the Car26. Tackled by Marcus Cooper.","(10:38) Penalty: Delay of Game on Carolina (Cam Newton) -5 yards.","(10:44) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(11:22) Jonathan Stewart rush up the middle for 1 yard to the Car28. Tackled by Kevin Minter and Chandler Jones.","(12:02) Jonathan Stewart rush to the right for 10 yards to the Car27. Tackled by D.J. Swearinger.","(12:11) Ryan Quigley punts for 47 yards to Car17. No return.","(12:49) Carson Palmer pass to the right to Andre Ellington for 16 yards to the Ari36. Tackled by Luke Kuechly.","(12:55) Carson Palmer incomplete pass to the right intended for J.J. Nelson.","(13:18) Penalty: Illegal Use of Hands on Arizona (D.J. Humphries) -10 yards. Penalty: Unsports. Conduct on Arizona (Carson Palmer) -15 yards.","(14:01) Carson Palmer pass to the right to Jermaine Gresham for 6 yards to the Ari45. Tackled by Luke Kuechly.","(14:33) Penalty: Illegal Formation on Arizona (Jared Veldheer) -5 yards.","(15:00) Penalty: Holding on Arizona (Earl Watford) -10 yards.","(0:09) Carson Palmer pass to the right to J.J. Nelson for 19 yards to the Car46. Tackled by Robert McClain.","(0:46) Carson Palmer pass to the middle to Larry Fitzgerald for 5 yards to the Ari35. Tackled by Leonard Johnson.","(0:54) Andy Lee punts for 41 yards to Ari30. No return.","(0:59) Cam Newton incomplete pass to the right intended for Corey Brown defensed by Justin Bethel.","(1:40) Jonathan Stewart rush up the middle for 4 yards to the Car29. Tackled by Deone Bucannon and Calais Campbell.","(1:45) Cam Newton incomplete pass to the left intended for Greg Olsen defensed by Deone Bucannon.","(1:45) Chandler Catanzaro kicks off to the endzone. Touchback.","(1:45) Chandler Catanzaro extra point is good.","(1:51) Carson Palmer pass to the middle to John Brown for 17 yards for a TOUCHDOWN.","(1:57) Carson Palmer incomplete pass to the right intended for Ifeanyi Momah.","(2:37) Carson Palmer pass to the middle to Larry Fitzgerald for 4 yards to the Car17. Tackled by Thomas Davis.","(3:23) Carson Palmer pass to the right to David Johnson for 14 yards to the Car21. Tackled by Robert McClain and Tre Boston.","(4:08) David Johnson rush to the left for 5 yards to the Car35. Tackled by Kurt Coleman and Star Lotulelei.","(4:38) Carson Palmer pass to the right to John Brown for 13 yards to the Car40. Tackled by Thomas Davis.","(5:21) Carson Palmer sacked at Ari47 for a loss of 7 yards by Leonard Johnson.","(6:01) David Johnson rush to the left for 9 yards to the Car46. Tackled by Leonard Johnson and Kurt Coleman.","(6:41) Carson Palmer pass to the left to J.J. Nelson for 11 yards to the Ari45. Tackled by Daryl Worley.","(7:18) Carson Palmer pass to the left to David Johnson for 9 yards to the Ari34. Tackled by Daryl Worley and Tre Boston.","(7:18) Graham Gano kicks off to the endzone. Touchback.","(7:22) Graham Gano 21 yard field goal attempt is GOOD. Holder: Andy Lee.","(7:27) Cam Newton incomplete pass to the left intended for Corey Brown.","(8:08) Cam Newton rush up the middle for no gain to the Ari2. Tackled by Deone Bucannon.","(8:38) Jonathan Stewart rush up the middle for 7 yards to the Ari2. Tackled by Markus Golden and D.J. Swearinger.","(8:58) Arizona Cardinals timeout.","(8:58) Cam Newton pass to the right to Ted Ginn Jr. for 13 yards to the Ari9.","(9:02) Cam Newton incomplete pass to the left intended for Devin Funchess.","(9:07) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(9:54) Jonathan Stewart rush to the left for 19 yards to the Ari22. Tackled by D.J. Swearinger and Patrick Peterson.","(10:25) Cam Newton pass to the left to Ted Ginn Jr. for 16 yards to the Ari41. Tackled by Justin Bethel.","(10:30) Ryan Quigley punts for 40 yards to Car43. No return.","(10:35) Carson Palmer incomplete pass to the right intended for J.J. Nelson.","(11:18) Carson Palmer sacked at Ari17 for a loss of 5 yards by Charles Johnson. FUMBLE, recovered by Ari (Earl Watford).","(11:56) David Johnson rush to the right for 2 yards to the Ari22. Tackled by Thomas Davis and Robert McClain.","(11:56) Penalty: False Start on Arizona (Mike Iupati) -5 yards.","(11:56) Graham Gano kicks off to the endzone. Touchback.","(12:02) Graham Gano 52 yard field goal attempt is GOOD. Holder: Andy Lee.","(12:06) Cam Newton incomplete pass to the middle intended for Fozzy Whittaker.","(12:28) Cam Newton pass to the right to Ted Ginn Jr. for 10 yards to the Ari34. Tackled by Justin Bethel.","(13:02) Jonathan Stewart rush up the middle for a loss of 3 yards to the Ari44. Tackled by Markus Golden.","(13:43) Cam Newton pass to the left to Kelvin Benjamin for 23 yards to the Ari41. Tackled by Patrick Peterson.","(13:47) Cam Newton incomplete pass to the left intended for Corey Brown defensed by Deone Bucannon.","(14:22) Jonathan Stewart rush to the left for 4 yards to the Car36. Tackled by Calais Campbell.","(15:00) Jonathan Stewart rush to the right for 7 yards to the Car32. Tackled by Tharold Simon and Calais Campbell.","(15:00) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:20) Fozzy Whittaker rush to the left for 1 yard to the Car43. Tackled by Kevin Minter and Frostee Rucker.","(0:20) Chandler Catanzaro kicks off to the Car0. Joe Webb return for 37 yards to Car37. Tackled by Justin Bethel. Penalty: Offside on Arizona (Patrick Peterson) 5 yards.","(0:20) Chandler Catanzaro extra point is good.","(0:26) Carson Palmer pass to the left to J.J. Nelson for 5 yards for a TOUCHDOWN.","(0:46) Carson Palmer pass to the middle to J.J. Nelson for 7 yards to the Car5. Tackled by Kurt Coleman.","(1:12) Carson Palmer pass to the right to Brittan Golden for 17 yards to the Car12. Tackled by Luke Kuechly.","(1:12) Arizona Cardinals timeout.","(1:22) Carson Palmer sacked at Car29 for a loss of 6 yards by Star Lotulelei.","(1:22) Arizona Cardinals timeout.","(1:29) Carson Palmer pass to the right to Larry Fitzgerald for 11 yards to the Car23. Tackled by Leonard Johnson and Thomas Davis.","(1:36) Carson Palmer incomplete pass to the left intended for J.J. Nelson defensed by Daryl Worley.","(1:41) Penalty: Unnecessary Roughness on Carolina (Leonard Johnson) 15 yards.","(2:00) Carson Palmer pass to the right to Larry Fitzgerald for 6 yards to the Car49. Tackled by Leonard Johnson.","(2:00) Two Minute Warning.","(2:19) Carson Palmer pass to the left to Larry Fitzgerald for 5 yards to the Ari45. Tackled by Daryl Worley.","(2:45) Carson Palmer pass to the middle to David Johnson for 15 yards to the Ari40. Tackled by Mario Addison.","(2:45) Graham Gano kicks off to the endzone. Touchback.","(2:51) Graham Gano 43 yard field goal attempt is GOOD. Holder: Andy Lee.","(2:56) Cam Newton incomplete pass to the right intended for Corey Brown.","(3:34) Jonathan Stewart rush to the right for a loss of 2 yards to the Ari25. Tackled by Tony Jefferson.","(4:11) Mike Tolbert rush to the right for 2 yards to the Ari23. Tackled by Deone Bucannon and Markus Golden.","(4:53) Jonathan Stewart rush up the middle for 4 yards to the Ari25. Tackled by Deone Bucannon and Calais Campbell.","(5:38) Jonathan Stewart rush to the right for 7 yards to the Ari29. Tackled by Marcus Cooper and Deone Bucannon.","(6:14) Jonathan Stewart rush to the right for 4 yards to the Ari36. Tackled by Robert Nkemdiche and Calais Campbell.","(6:22) Cam Newton incomplete pass to the right intended for Greg Olsen defensed by Tony Jefferson.","(7:03) Fozzy Whittaker rush to the right for no gain to the Ari40. Tackled by Deone Bucannon.","(7:31) Cam Newton pass to the right to Fozzy Whittaker for 9 yards to the Ari40. Tackled by Kevin Minter.","(8:11) Cam Newton pass to the middle to Devin Funchess for 5 yards to the Ari49. Tackled by Marcus Cooper.","(8:42) Cam Newton pass to the right to Corey Brown for 3 yards to the Car46. Tackled by Marcus Cooper.","(9:16) Jonathan Stewart rush to the left for 3 yards to the Car43. Tackled by Deone Bucannon and Rodney Gunter.","(9:24) Ryan Quigley punts for 54 yards to Car40. No return.","(9:55) Carson Palmer pass to the left to John Brown for 5 yards to the Ari6. Tackled by Leonard Johnson and Daryl Worley.","(10:34) Carson Palmer sacked at Ari1 for a loss of 6 yards by Star Lotulelei.","(11:00) Carson Palmer sacked at Ari7 for a loss of 7 yards by Daryl Worley.","(11:05) Graham Gano kicks off to the Ari-2. Andre Ellington return for 16 yards to Ari14. Tackled by David Mayo.","(11:05) Graham Gano extra point is good.","(11:10) Jonathan Stewart rush to the right for 1 yard for a TOUCHDOWN.","(11:54) Cam Newton rush to the left for 4 yards to the Ari1. Tackled by Kevin Minter.","(12:39) Mike Tolbert rush to the right for no gain to the Ari5. Tackled by Gabe Martin and Kevin Minter.","(13:07) Cam Newton pass to the right to Greg Olsen for 11 yards to the Ari5. Tackled by Tharold Simon.","(13:07) Penalty: False Start on Carolina (Kelvin Benjamin) -5 yards.","(13:07) Carolina Panthers timeout.","(13:13) Cam Newton incomplete pass to the right intended for Jonathan Stewart.","(13:13) Carolina Panthers timeout.","(13:55) Cam Newton rush to the right for 4 yards to the Ari11. Tackled by D.J. Swearinger and Kevin Minter.","(14:45) Cam Newton pass to the right to Kelvin Benjamin for 50 yards to the Ari15. Tackled by Tyrann Mathieu.","(14:53) Ryan Quigley punts for 39 yards to Car35. Ted Ginn Jr. - no return.","(15:00) Carson Palmer incomplete pass to the right intended for Jermaine Gresham defensed by Leonard Johnson.","(0:09) Carson Palmer pass to the left to David Johnson for 2 yards to the Ari26. Tackled by Kawann Short and Daryl Worley.","(0:28) Penalty: Holding on Arizona (Mike Iupati) -10 yards.","(1:07) David Johnson rush to the left for a loss of 2 yards to the Ari34. Tackled by Shaq Thompson.","(1:44) David Johnson rush to the left for 2 yards to the Ari36. Tackled by Daryl Worley.","(2:24) David Johnson rush to the right for 9 yards to the Ari34. Tackled by Thomas Davis.","(2:24) Graham Gano kicks off to the endzone. Touchback.","(2:24) Graham Gano extra point is good.","(2:27) Jonathan Stewart rush to the right for 2 yards for a TOUCHDOWN.","(3:08) Cam Newton rush to the right for 3 yards to the Ari2. Tackled by Calais Campbell and Corey Peters.","(3:43) Jonathan Stewart rush to the left for 6 yards to the Ari5. Tackled by Marcus Cooper.","(4:08) Cam Newton rush up the middle for 19 yards to the Ari11. Tackled by Patrick Peterson.","(4:13) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(4:43) Cam Newton pass to the right to Devin Funchess for 22 yards to the Ari30. Tackled by D.J. Swearinger.","(5:19) Cam Newton pass to the right to Devin Funchess for 11 yards to the Car48. Tackled by D.J. Swearinger.","(5:41) Cam Newton pass to the left to Ted Ginn Jr. for 11 yards to the Car37. Tackled by Marcus Cooper.","(6:18) Jonathan Stewart rush to the right for 1 yard to the Car26. Tackled by Calais Campbell and Corey Peters.","(6:26) Ryan Quigley punts for 36 yards to Car25. No return.","(6:49) Carson Palmer pass to the left to Jermaine Gresham for 19 yards to the Ari39. Tackled by Leonard Johnson.","(6:55) Carson Palmer incomplete pass to the left. Penalty: Intentional Grounding on Arizona (Carson Palmer) -10 yards.","(7:01) Carson Palmer incomplete pass to the middle intended for Jermaine Gresham defensed by Luke Kuechly.","(7:22) Penalty: Holding on Arizona (D.J. Humphries) -10 yards.","(8:02) Carson Palmer pass to the left to J.J. Nelson for 18 yards to the Ari40. Tackled by Daryl Worley.","(8:13) Andy Lee punts for 56 yards to Ari18. Brittan Golden return for 4 yards to Ari22. Tackled by Joe Webb.","(8:55) Cam Newton sacked at Car26 for a loss of 4 yards by Kareem Martin.","(9:00) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(9:28) Penalty: Holding on Carolina (Mike Remmers) -10 yards.","(9:52) Penalty: Illegal Formation on Carolina (Devin Funchess) -5 yards.","(10:27) Jonathan Stewart rush up the middle for 4 yards to the Car45. Tackled by Kevin Minter and Calais Campbell.","(10:35) Ryan Quigley punts for 43 yards to Car41. No return.","(11:05) Carson Palmer sacked at Ari16 for a loss of 9 yards by Luke Kuechly.","(11:10) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald.","(11:47) David Johnson rush to the right for no gain to the Ari25. Tackled by Paul Soliai and Kyle Love.","(11:48) Graham Gano kicks off to the endzone. Touchback.","(11:48) Graham Gano extra point is good.","(12:01) Carson Palmer sacked at Ari43 for no gain by Star Lotulelei. FUMBLE, recovered by Car (Thomas Davis) and returned for 46 yards for a TOUCHDOWN.","(12:34) Carson Palmer pass to the left to Larry Fitzgerald for 5 yards to the Ari43. Tackled by Daryl Worley.","(13:13) David Johnson rush up the middle for a loss of 1 yard to the Ari38. Tackled by Robert McClain and Kyle Love.","(13:50) Carson Palmer pass to the left to Jermaine Gresham for 7 yards to the Ari39. Tackled by Kurt Coleman.","(14:27) David Johnson rush to the right for a loss of 2 yards to the Ari32. Tackled by Kawann Short and Tre Boston.","(15:00) Carson Palmer pass to the right to Larry Fitzgerald for 9 yards to the Ari34. Tackled by Robert McClain.","(15:00) Graham Gano kicks off to the endzone. Touchback."]