["(0:39) Shaun Hill rush up the middle for a loss of 1 yard to the Min11.","(1:18) Shaun Hill rush up the middle for a loss of 1 yard to the Min12.","(2:00) Shaun Hill rush up the middle for a loss of 1 yard to the Min13.","(2:00) Two Minute Warning.","(2:08) Patrick O'Donnell punts for 41 yards to Min14. No return.","(2:14) David Fales incomplete pass to the right intended for Cameron Meredith.","(2:51) David Fales rush up the middle for no gain to the Chi44. FUMBLE, recovered by Chi (Jordan Howard).","(2:55) David Fales incomplete pass to the right intended for Deonte Thompson.","(3:26) David Fales pass to the left to Jeremy Langford for 10 yards to the Chi44. Tackled by Emmanuel Lamur.","(3:30) Shaun Hill incomplete pass to the right intended for Jerick McKinnon.","(3:30) Minnesota Vikings timeout.","(4:16) Jerick McKinnon rush to the right for a loss of 3 yards to the Chi34. Tackled by Jonathan Bullard.","(4:59) Jerick McKinnon rush to the left for 3 yards to the Chi31. Tackled by C.J. Wilson and Mitch Unrein.","(5:43) Jerick McKinnon rush to the right for 3 yards to the Chi34. Tackled by Jerrell Freeman.","(6:31) Jerick McKinnon rush to the left for 36 yards to the Chi37. Tackled by Demontre Hurst.","(7:18) Jerick McKinnon rush to the right for 1 yard to the Min27. Tackled by Harold Jones-Quartey.","(7:30) Patrick O'Donnell punts for 54 yards to Min17. Marcus Sherels return for 9 yards to Min26. Tackled by Sherrick McManis.","(8:02) David Fales sacked at Chi29 for a loss of 5 yards by Brian Robison and Linval Joseph.","(8:41) Jeremy Langford rush up the middle for no gain to the Chi34. Tackled by Eric Kendricks.","(8:46) David Fales incomplete pass to the right intended for Joshua Bellamy defensed by Trae Waynes.","(9:13) David Fales pass to the right to Cameron Meredith for 12 yards to the Chi34. Tackled by Harrison Smith.","(9:46) Jeremy Langford rush up the middle for 3 yards to the Chi22. Tackled by Everson Griffen.","(9:51) Kai Forbath kicks off to the Chi-3. Deonte Thompson return for 22 yards to Chi19. Tackled by Stephen Weatherly.","(9:51) Kai Forbath extra point is good.","(10:04) Matt Barkley sacked at Chi33 for a loss of 4 yards by Linval Joseph and Danielle Hunter. FUMBLE, recovered by Min (Everson Griffen) and returned for 20 yards for a TOUCHDOWN.","(10:44) Jordan Howard rush to the left for 1 yard to the Chi37. Tackled by Harrison Smith and Anthony Barr.","(11:21) Matt Barkley pass to the right to Daniel Brown for 6 yards to the Chi36. Tackled by Captain Munnerlyn.","(12:06) Matt Barkley pass to the left to Daniel Brown for 12 yards to the Chi30. Tackled by Eric Kendricks.","(12:11) Kai Forbath kicks off to the Chi-3. Deonte Thompson return for 21 yards to Chi18. Tackled by Jayron Kearse.","(12:11) Kai Forbath extra point is good.","(12:16) Jerick McKinnon rush to the right for 10 yards for a TOUCHDOWN.","(12:56) Matt Asiata rush up the middle for 3 yards to the Chi10. Tackled by Jerrell Freeman.","(13:40) Sam Bradford pass to the left to Kyle Rudolph for 22 yards to the Chi13. Tackled by Jerrell Freeman.","(14:07) Sam Bradford pass to the left to Kyle Rudolph for 5 yards to the Chi35. Tackled by Cre'von LeBlanc.","(14:18) Jordan Howard rush to the left for no gain to the Chi40. Tackled by Xavier Rhodes.","(15:00) Jordan Howard rush to the left for 1 yard to the Chi40. Tackled by Danielle Hunter.","(0:46) Jeremy Langford rush to the right for 5 yards to the Chi39. Tackled by Eric Kendricks and Danielle Hunter.","(1:20) Jeremy Langford rush to the right for 3 yards to the Chi34. Tackled by Eric Kendricks.","(1:59) Jordan Howard rush to the right for 7 yards to the Chi31. Tackled by Everson Griffen and Linval Joseph.","(2:20) Jordan Howard rush to the left for 4 yards to the Chi24. Tackled by Eric Kendricks.","(2:25) Sam Bradford pass intended for Cordarrelle Patterson INTERCEPTED by Cre'von LeBlanc. No return. Touchback.","(2:32) Sam Bradford incomplete pass to the middle intended for Kyle Rudolph defensed by Jerrell Freeman.","(3:16) Matt Asiata rush to the right for no gain to the Chi21. Tackled by Adrian Amos.","(3:55) Matt Asiata rush to the left for 2 yards to the Chi21. Tackled by Jerrell Freeman and Akiem Hicks.","(4:16) Sam Bradford pass to the right to Matt Asiata for 9 yards to the Chi23. Tackled by Tracy Porter.","(4:54) Sam Bradford pass to the right to Kyle Rudolph for 3 yards to the Chi32. Tackled by Jerrell Freeman.","(5:38) Jerick McKinnon rush to the left for 9 yards to the Chi35. Tackled by Jerrell Freeman.","(5:43) Sam Bradford incomplete pass to the left intended for Jarius Wright defensed by Harold Jones-Quartey.","(6:24) Sam Bradford pass to the left to Charles Johnson for 11 yards to the Chi44. Tackled by Johnthan Banks.","(7:06) Sam Bradford pass to the left to Jerick McKinnon for a loss of 2 yards to the Min45. Tackled by Adrian Amos.","(7:41) Jerick McKinnon rush to the left for 4 yards to the Min47. Tackled by Harold Jones-Quartey.","(8:01) Sam Bradford pass to the right to Kyle Rudolph for 12 yards to the Min28. Tackled by Deiondre' Hall. Penalty: Roughing Passer on Chicago (Akiem Hicks) 15 yards.","(8:46) Jerick McKinnon rush up the middle for 3 yards to the Min16. Tackled by Willie Young and Nick Kwiatkoski.","(9:25) Sam Bradford pass to the right to Jarius Wright for 2 yards to the Min13. Tackled by Jerrell Freeman.","(9:33) Matt Barkley pass intended for Cameron Meredith INTERCEPTED by Trae Waynes. No return. Tackled by Cameron Meredith.","(10:14) Joshua Bellamy rush to the left for a loss of 4 yards to the Min23. Tackled by Eric Kendricks.","(10:55) Matt Barkley pass to the left to MyCole Pruitt for 6 yards to the Min19. Tackled by Anthony Harris.","(11:34) Jeremy Langford rush up the middle for 4 yards to the Min25. Tackled by Shamar Stephen and Eric Kendricks.","(12:17) Matt Barkley pass to the left to Jeremy Langford for 12 yards to the Min29. Tackled by Shamar Stephen and Anthony Harris.","(12:35) Penalty: False Start on Chicago (Charles Leno Jr.) -5 yards.","(13:13) Jordan Howard rush to the left for 6 yards to the Min36. Tackled by Brian Robison and Eric Kendricks.","(13:45) Jordan Howard rush to the right for 5 yards to the Min42. Tackled by Anthony Harris.","(14:21) Matt Barkley pass to the right to Alshon Jeffery for 10 yards to the Min47. Tackled by Xavier Rhodes.","(15:00) Jordan Howard rush to the left for 18 yards to the Chi43. Tackled by Anthony Harris.","(15:00) Kai Forbath kicks off to the endzone. Touchback.","(0:02) Connor Barth 29 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(0:02) Chicago Bears timeout.","(0:09) Matt Barkley pass to the right to Cameron Meredith for 31 yards to the Min11. Tackled by Captain Munnerlyn.","(0:18) Kai Forbath kicks off to the Chi-6. Deonte Thompson return for 64 yards to Min42. Tackled by Isaac Fruechte.","(0:18) Kai Forbath extra point is good.","(0:21) Sam Bradford pass to the right to Jarius Wright for 1 yard for a TOUCHDOWN.","(0:25) Sam Bradford pass to the left to Adam Thielen for 7 yards to the Chi1. Tackled by Harold Jones-Quartey.","(0:25) Minnesota Vikings timeout.","(0:31) Sam Bradford pass to the left to Kyle Rudolph for 11 yards to the Chi8. Tackled by Harold Jones-Quartey.","(0:34) Sam Bradford incomplete pass to the left intended for Jarius Wright defensed by Harold Jones-Quartey.","(1:00) Jerick McKinnon rush to the left for 2 yards to the Chi19. Tackled by Nick Kwiatkoski.","(1:11) Jeff Locke punts for 41 yards to Chi24. Bralon Addison - no return. FUMBLE, recovered by Min (Jayron Kearse). Tackled by MyCole Pruitt.","(1:16) Sam Bradford pass to the right to Kyle Rudolph for 5 yards to the Min35. Tackled by Jerrell Freeman.","(1:16) Chicago Bears timeout.","(1:23) Sam Bradford incomplete pass to the left intended for Isaac Fruechte.","(1:33) Penalty: Holding on Minnesota (Jeremiah Sirles) -10 yards.","(1:37) Sam Bradford incomplete pass to the middle intended for Kyle Rudolph defensed by Jerrell Freeman.","(1:42) Sam Bradford pass to the left to Jarius Wright for 8 yards to the Min40.","(1:48) Sam Bradford pass to the right to Jerick McKinnon for 7 yards to the Min32. Tackled by Harold Jones-Quartey.","(1:48) Connor Barth kicks off to the endzone. Touchback.","(1:48) Connor Barth extra point is good.","(1:52) Cameron Meredith pass to the right to Matt Barkley for 2 yards for a TOUCHDOWN.","(1:52) Minnesota Vikings timeout.","(2:00) Jordan Howard rush up the middle for 1 yard to the Min2. Tackled by Anthony Barr and Emmanuel Lamur.","(2:00) Two Minute Warning.","(2:24) Jeremy Langford rush up the middle for 1 yard to the Min3. Tackled by Brian Robison.","(2:58) Matt Barkley pass to the left to Jeremy Langford for 19 yards to the Min4. Tackled by Anthony Barr.","(3:21) Jordan Howard rush up the middle for 5 yards to the Min13. Tackled by Harrison Smith and Anthony Harris. Penalty: Holding on Chicago (Josh Sitton) -10 yards.","(3:57) Jordan Howard rush up the middle for 6 yards to the Min18. Tackled by Shamar Stephen.","(4:32) Jordan Howard rush to the left for 5 yards to the Min24. Tackled by Toby Johnson.","(5:03) Matt Barkley pass to the left to Cameron Meredith for 8 yards to the Min29. Tackled by Captain Munnerlyn.","(5:07) Matt Barkley incomplete pass to the left intended for Deonte Thompson defensed by Trae Waynes.","(5:49) Jeremy Langford rush to the right for no gain to the Min37. Tackled by Linval Joseph and Anthony Barr.","(6:29) Jeremy Langford rush to the right for 4 yards to the Min37. Tackled by Shamar Stephen.","(7:02) Jordan Howard rush up the middle for 17 yards to the Min41. Tackled by Anthony Harris.","(7:38) Matt Barkley pass to the right to Cameron Meredith for 10 yards to the Chi42. Tackled by Trae Waynes.","(8:00) Bralon Addison rush to the right for 4 yards to the Chi42. Tackled by Chad Greenway. Penalty: Holding on Chicago (Logan Paulsen) -10 yards.","(8:37) Jordan Howard rush to the left for 3 yards to the Chi38. Tackled by Brian Robison and Linval Joseph.","(9:11) Jordan Howard rush up the middle for 9 yards to the Chi35. Tackled by Anthony Harris and Danielle Hunter.","(9:44) Jordan Howard rush to the right for 11 yards to the Chi26. Tackled by Anthony Harris.","(9:52) Jeff Locke punts for 23 yards to Chi15. No return.","(9:59) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(10:37) Jerick McKinnon rush up the middle for a loss of 1 yard to the Chi38. Tackled by C.J. Wilson.","(11:14) Sam Bradford pass to the right to Kyle Rudolph for 5 yards to the Chi37. Tackled by Adrian Amos and Sam Acho.","(11:28) Patrick O'Donnell punts for 48 yards to Min22. Marcus Sherels return for 36 yards to Chi42. Tackled by John Timu.","(11:33) Matt Barkley incomplete pass to the left intended for Alshon Jeffery.","(12:10) Jordan Howard rush to the right for 6 yards to the Chi30. Tackled by Anthony Barr and Linval Joseph.","(12:51) Jordan Howard rush to the left for 4 yards to the Chi24. Tackled by Everson Griffen.","(12:51) Penalty: False Start on Chicago (Bobby Massie) -5 yards.","(12:51) Kai Forbath kicks off to the endzone. Touchback.","(12:51) Kai Forbath extra point is good.","(12:58) Sam Bradford pass to the middle to Kyle Rudolph for 22 yards for a TOUCHDOWN.","(13:37) Matt Asiata rush up the middle for no gain to the Chi22. Tackled by Nick Kwiatkoski.","(14:13) Sam Bradford pass to the right to Kyle Rudolph for 13 yards to the Chi22. Tackled by Tracy Porter.","(14:20) Jeremy Langford rush to the right for 2 yards to the Chi31. FUMBLE, recovered by Min (Anthony Harris). Tackled by Cameron Meredith.","(14:53) Jeremy Langford rush up the middle for 4 yards to the Chi29. Tackled by Eric Kendricks and Danielle Hunter.","(14:53) Kai Forbath kicks off to the endzone. Touchback.","(14:57) Kai Forbath 21 yard field goal attempt is GOOD. Holder: Jeff Locke.","(15:00) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(15:00) Penalty: Offside on Chicago (Willie Young) 4 yards.","(0:37) Matt Asiata rush to the left for a loss of 1 yard to the Chi7. Tackled by Akiem Hicks.","(1:14) Jerick McKinnon rush up the middle for 1 yard to the Chi6. Tackled by Nick Kwiatkoski.","(1:48) Jerick McKinnon rush to the left for 8 yards to the Chi7. Tackled by Demontre Hurst.","(2:19) Jerick McKinnon rush up the middle for 6 yards to the Chi15. Tackled by Jerrell Freeman.","(2:42) Sam Bradford pass to the left to Jarius Wright for 9 yards to the Chi21. Tackled by Demontre Hurst.","(2:50) Penalty: False Start on Minnesota (Sam Bradford) -5 yards.","(3:39) Matt Asiata rush to the left for 4 yards to the Chi25. Tackled by C.J. Wilson.","(4:24) Jerick McKinnon rush to the left for 3 yards to the Chi29. Tackled by Jerrell Freeman.","(4:59) Sam Bradford rush to the right for 24 yards to the Chi32.","(5:44) Sam Bradford pass to the middle to Matt Asiata for 17 yards to the Min44. Tackled by Harold Jones-Quartey.","(6:21) Matt Asiata rush to the right for 4 yards to the Min27. Tackled by Cornelius Washington.","(7:01) Sam Bradford pass to the right to Kyle Rudolph for 15 yards to the Min23. Tackled by Harold Jones-Quartey.","(7:26) Sam Bradford pass to the right to Jarius Wright for 4 yards to the Min8. Tackled by Sam Acho.","(7:33) Matt Barkley pass intended for Alshon Jeffery INTERCEPTED by Xavier Rhodes and returned for 4 yards. Tackled by Alshon Jeffery.","(8:06) Jordan Howard rush to the left for 4 yards to the Min16. Tackled by Anthony Barr and Shamar Stephen.","(8:43) Joshua Bellamy rush to the left for 22 yards to the Min20. Tackled by Trae Waynes.","(9:21) Jordan Howard rush up the middle for 5 yards to the Min42. Tackled by Xavier Rhodes.","(9:48) Matt Barkley pass to the left to Bralon Addison for 11 yards to the Min47. Tackled by Xavier Rhodes.","(10:27) Jordan Howard rush to the left for 12 yards to the Chi42. Tackled by Eric Kendricks.","(11:03) Jordan Howard rush to the left for 2 yards to the Chi30. Tackled by Chad Greenway and Shamar Stephen.","(11:36) Jordan Howard rush to the left for 3 yards to the Chi28. Tackled by Shamar Stephen and Linval Joseph.","(11:36) Kai Forbath kicks off to the endzone. Touchback.","(11:36) Kai Forbath extra point is good.","(11:45) Sam Bradford pass to the left to Jerick McKinnon for 16 yards for a TOUCHDOWN.","(12:20) Jerick McKinnon rush to the left for 4 yards to the Chi16. Tackled by Mitch Unrein.","(12:54) Sam Bradford pass to the right to Cordarrelle Patterson for 39 yards to the Chi20. Tackled by Cre'von LeBlanc.","(13:38) Sam Bradford pass to the left to Kyle Rudolph for 4 yards to the Min41. Tackled by Willie Young and Johnthan Banks.","(14:21) Sam Bradford pass to the left to Matt Asiata for 5 yards to the Min37. Tackled by Johnthan Banks.","(14:55) Matt Asiata rush up the middle for 2 yards to the Min32. Tackled by Willie Young.","(15:00) Connor Barth kicks off to the Min-5. Cordarrelle Patterson return for 35 yards to Min30. Tackled by Deiondre' Hall."]