["(0:39) Ryan Fitzpatrick rush up the middle for no gain to the NYJ25.","(0:39) Dan Carpenter kicks off to the endzone. Touchback.","(0:39) Dan Carpenter extra point is good.","(0:43) Mike Gillislee rush up the middle for 1 yard for a TOUCHDOWN.","(1:24) Jerome Felton rush up the middle for no gain to the NYJ1. Tackled by David Harris and Anthony Johnson.","(2:00) Jonathan Williams rush up the middle for no gain to the NYJ1. Tackled by Sheldon Richardson and Muhammad Wilkerson.","(2:00) Two Minute Warning.","(2:47) Cardale Jones pass to the right to Justin Hunter for 64 yards to the NYJ1. Tackled by Rontez Miles.","(3:17) Cardale Jones pass to the right to Charles Clay for 6 yards to the Buf35. Tackled by David Harris and Darrelle Revis.","(3:21) Nick Folk kicks off to the Buf15. Nick O'Leary return for 14 yards to Buf29. Tackled by Bryson Keeton.","(3:21) Nick Folk extra point is good.","(3:21) Nick Folk kicks off to the Buf0. Kickoff recovered by kicking team by Doug Middleton for a TOUCHDOWN.","(3:24) Nick Folk 25 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(3:31) Ryan Fitzpatrick incomplete pass to the left intended for Charone Peake.","(4:19) Brandon Burks rush to the left for a loss of 5 yards to the Buf7. Tackled by Zach Brown and Preston Brown.","(5:03) Brandon Burks rush up the middle for 1 yard to the Buf2. Tackled by Leger Douzable.","(5:16) Cardale Jones pass intended for Justin Hunter INTERCEPTED by Darrelle Revis defensed by Calvin Pryor and returned for 51 yards. Tackled by Cyrus Kouandjio.","(5:45) Cardale Jones pass to the middle to Marquise Goodwin for 8 yards to the Buf43. Tackled by Darron Lee.","(6:30) Cardale Jones sacked at Buf35 for a loss of 2 yards by Deon Simon.","(6:43) Lachlan Edwards punts for 49 yards to Buf14. Brandon Tate return for 23 yards to Buf37. Tackled by Darron Lee.","(7:42) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 10 yards to the NYJ37. Tackled by Preston Brown.","(8:24) Ryan Fitzpatrick pass to the right to Brandon Bostick for 7 yards to the NYJ27. Tackled by Leger Douzable and Corey Graham.","(9:03) Ryan Fitzpatrick sacked at NYJ20 for a loss of 8 yards by Lorenzo Alexander.","(9:14) Colton Schmidt punts for 40 yards to NYJ26. Jalin Marshall return for 2 yards to NYJ28. Tackled by Garrison Sanborn and Preston Brown.","(9:18) Cardale Jones incomplete pass to the left intended for Sammy Watkins defensed by Bruce Carter.","(9:57) Cardale Jones pass to the right to Charles Clay for 7 yards to the Buf34. Tackled by Bruce Carter.","(10:02) Cardale Jones incomplete pass to the left intended for Marquise Goodwin.","(10:14) Lachlan Edwards punts for 53 yards to Buf26. Brandon Tate return for 1 yard to Buf27. Tackled by Darron Lee.","(10:19) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa.","(11:02) Bilal Powell rush to the left for a loss of 3 yards to the NYJ21. Tackled by Preston Brown and Zach Brown.","(11:43) Bilal Powell rush to the left for 3 yards to the NYJ24. Tackled by Preston Brown and Zach Brown.","(11:48) Cardale Jones incomplete pass to the left intended for Sammy Watkins defensed by Darryl Roberts.","(12:33) Cardale Jones rush to the left for a loss of 1 yard to the NYJ21. Tackled by Jordan Jenkins.","(12:38) Cardale Jones incomplete pass to the right intended for Brandon Tate.","(13:14) Mike Gillislee rush to the left for 4 yards to the NYJ20. Tackled by Buster Skrine.","(13:49) Cardale Jones pass to the right to Robert Woods for 6 yards to the NYJ24. Tackled by Darrelle Revis.","(14:21) Cardale Jones pass to the left to Sammy Watkins for 5 yards to the NYJ30.","(15:00) Mike Gillislee rush to the right for 16 yards to the NYJ35. Tackled by Rontez Miles.","(0:01) Nick Folk kicks off to the Buf7. Brandon Tate return for 42 yards to Buf49. Tackled by Nick Folk.","(0:06) Nick Folk 36 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(0:43) Bilal Powell rush to the right for 4 yards to the Buf18. Tackled by Lorenzo Alexander.","(1:24) Ryan Fitzpatrick pass to the right to Brandon Wilds for 8 yards to the Buf22. Tackled by Zach Brown.","(1:28) Ryan Fitzpatrick incomplete pass to the middle intended for Quincy Enunwa defensed by Zach Brown.","(1:55) Penalty: Holding on New York (Dakota Dozier) -10 yards.","(2:36) Ryan Fitzpatrick pass to the middle to Brandon Wilds for 12 yards to the Buf20. Tackled by Preston Brown.","(2:41) Jonathan Williams rush up the middle for a loss of 8 yards to the Buf32. Tackled by Sheldon Richardson. FUMBLE, recovered by NYJ (Sheldon Richardson). Tackled by Jonathan Williams.","(3:19) EJ Manuel pass to the right to Robert Woods for 16 yards to the Buf40. Tackled by Buster Skrine.","(3:24) EJ Manuel incomplete pass to the right intended for Charles Clay.","(4:03) Jonathan Williams rush to the left for a loss of 1 yard to the Buf24. Tackled by Calvin Pryor.","(4:03) Nick Folk kicks off to the endzone. Touchback.","(4:03) Nick Folk extra point is good.","(4:08) Ryan Fitzpatrick pass to the left to Jalin Marshall for 6 yards for a TOUCHDOWN.","(4:52) Bilal Powell rush up the middle for 4 yards to the Buf6. Tackled by Lorenzo Alexander.","(5:31) Bilal Powell rush to the left for 3 yards to the Buf10. Tackled by Preston Brown and Leger Douzable.","(5:37) EJ Manuel sacked at Buf14 for a loss of 12 yards by Jordan Jenkins. FUMBLE, recovered by NYJ (Jordan Jenkins).","(5:43) EJ Manuel incomplete pass to the right intended for Sammy Watkins.","(6:16) Mike Gillislee rush to the left for a loss of 1 yard to the Buf26. Tackled by Sheldon Richardson.","(6:54) EJ Manuel pass to the right to Robert Woods for 13 yards to the Buf27. Tackled by Marcus Williams.","(7:00) EJ Manuel incomplete pass to the left intended for Charles Clay.","(7:35) Mike Gillislee rush to the right for 3 yards to the Buf14. Tackled by David Harris.","(7:41) Bilal Powell rush to the left for a loss of 1 yard to the Buf11. Tackled by Marcell Dareus and Preston Brown.","(7:41) New York Jets timeout.","(8:17) Ryan Fitzpatrick pass to the left to Jalin Marshall for 3 yards to the Buf10. Tackled by Kevon Seymour.","(8:57) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 6 yards to the Buf13. Tackled by Corey White.","(9:01) Ryan Fitzpatrick incomplete pass to the left intended for Charone Peake defensed by Marcus Roberson.","(9:01) New York Jets timeout.","(9:46) Bilal Powell rush up the middle for 1 yard to the Buf19. Tackled by Leger Douzable.","(10:28) Brandon Wilds rush up the middle for 1 yard to the Buf20. Tackled by Marcell Dareus.","(11:12) Bilal Powell rush to the right for 8 yards to the Buf21. Tackled by Corey Graham.","(11:49) Ryan Fitzpatrick pass to the right to Robby Anderson for 15 yards to the Buf29. Tackled by Ronald Darby.","(12:02) Colton Schmidt punts for 43 yards to NYJ37. Jalin Marshall return for 19 yards to Buf44. Tackled by Corey Graham.","(12:06) EJ Manuel incomplete pass to the left intended for Robert Woods.","(12:11) EJ Manuel incomplete pass to the left intended for Marquise Goodwin.","(12:46) Mike Gillislee rush to the right for no gain to the Buf20. Tackled by Freddie Bishop III.","(12:54) Lachlan Edwards punts for 42 yards to Buf0. Touchback.","(13:30) Bilal Powell rush to the right for 3 yards to the Buf42. Tackled by Jerry Hughes.","(13:34) Ryan Fitzpatrick incomplete pass to the left intended for Robby Anderson.","(14:12) Bilal Powell rush up the middle for 2 yards to the Buf45. Tackled by Marcell Dareus.","(14:53) Bilal Powell rush to the right for 25 yards to the Buf47. Tackled by Ronald Darby.","(15:00) Dan Carpenter kicks off to the NYJ-4. Jalin Marshall return for 32 yards to NYJ28. Tackled by Corey Graham.","(0:03) Nick Folk 30 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(0:03) New York Jets timeout.","(0:14) Ryan Fitzpatrick pass to the left to Bilal Powell for 7 yards to the Buf12. Tackled by Preston Brown.","(0:14) New York Jets timeout.","(0:20) Ryan Fitzpatrick pass to the middle to Charone Peake for 6 yards to the Buf19. Tackled by Nickell Robey-Coleman.","(0:42) Bilal Powell rush up the middle for 10 yards to the Buf25. Tackled by Zach Brown and Kevon Seymour.","(0:42) New York Jets timeout.","(0:49) Ryan Fitzpatrick pass to the left to Charone Peake for 16 yards to the Buf35. Tackled by Marcus Roberson.","(0:56) Ryan Fitzpatrick incomplete pass to the left intended for Jalin Marshall defensed by Nickell Robey-Coleman.","(1:00) Ryan Fitzpatrick incomplete pass to the left intended for Robby Anderson.","(1:18) Ryan Fitzpatrick pass to the middle to Jalin Marshall for 13 yards to the NYJ49. Tackled by Nickell Robey-Coleman.","(1:23) Ryan Fitzpatrick pass to the right to Bilal Powell for 6 yards to the NYJ36. Tackled by Zach Brown.","(1:45) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 5 yards to the NYJ30. Tackled by Nickell Robey-Coleman.","(1:45) Dan Carpenter kicks off to the endzone. Touchback.","(1:48) Dan Carpenter 34 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(1:53) EJ Manuel incomplete pass to the right intended for Charles Clay.","(2:00) EJ Manuel incomplete pass to the right intended for Sammy Watkins defensed by Buster Skrine.","(2:00) Two Minute Warning.","(2:05) Mike Gillislee rush to the left for a loss of 3 yards to the NYJ16. Tackled by David Harris.","(2:37) Mike Gillislee rush to the right for 3 yards to the NYJ13. Tackled by Darron Lee and Sheldon Richardson.","(3:11) EJ Manuel pass to the left to Robert Woods for 8 yards to the NYJ16. Tackled by Buster Skrine.","(3:47) EJ Manuel pass to the right to Sammy Watkins for 14 yards to the NYJ24. Tackled by Darryl Roberts.","(4:13) Jonathan Williams rush to the right for 20 yards to the NYJ38. Tackled by David Harris.","(4:44) Mike Gillislee rush up the middle for 3 yards to the Buf42. Tackled by Darron Lee and Sheldon Richardson.","(5:22) EJ Manuel pass to the middle to Mike Gillislee for 10 yards to the Buf39. Tackled by Darron Lee.","(5:57) Mike Gillislee rush up the middle for a loss of 1 yard to the Buf29. Tackled by Freddie Bishop III.","(6:04) Lachlan Edwards punts for 48 yards to Buf30. No return.","(6:10) Ryan Fitzpatrick incomplete pass to the left intended for Charone Peake.","(6:16) Ryan Fitzpatrick incomplete pass to the middle intended for Robby Anderson.","(6:53) Brandon Wilds rush to the right for 1 yard to the NYJ22. Tackled by Jerry Hughes.","(7:00) Colton Schmidt punts for 37 yards to NYJ21. No return.","(7:35) Mike Gillislee rush to the left for a loss of 1 yard to the Buf42. Tackled by Sheldon Richardson.","(8:16) EJ Manuel rush up the middle for 6 yards to the Buf43. Tackled by Deon Simon.","(8:51) Mike Gillislee rush up the middle for 3 yards to the Buf37. Tackled by Deon Simon.","(9:22) Mike Gillislee rush to the left for 10 yards to the Buf34. Tackled by Buster Skrine.","(9:28) Nick Folk kicks off to the Buf-1. Brandon Tate return for 25 yards to Buf24. Tackled by Dexter McDougle.","(9:28) Nick Folk extra point is good.","(9:32) Ryan Fitzpatrick pass to the right to Bilal Powell for 2 yards for a TOUCHDOWN.","(10:13) Bilal Powell rush to the left for a loss of 1 yard to the Buf2. Tackled by Zach Brown and Shaq Lawson.","(10:54) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 9 yards to the Buf1. Tackled by Ronald Darby.","(11:17) Penalty: False Start on New York (Robby Anderson) -5 yards.","(12:02) Brandon Wilds rush up the middle for 5 yards to the Buf5. Tackled by Preston Brown and Jerel Worthy.","(12:36) Brandon Wilds rush to the right for 2 yards to the Buf10. Tackled by Zach Brown.","(13:17) Bilal Powell rush to the right for 12 yards to the Buf12. Tackled by Corey Graham.","(14:02) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 51 yards to the Buf24. Tackled by Corey Graham.","(14:13) Colton Schmidt punts for 49 yards to NYJ27. Jalin Marshall return for a loss of 2 yards to NYJ25. Tackled by Lorenzo Alexander.","(14:19) EJ Manuel incomplete pass to the left intended for Sammy Watkins.","(14:19) Buffalo Bills timeout.","(14:24) EJ Manuel incomplete pass to the left intended for Marquise Goodwin defensed by Freddie Bishop III.","(15:00) LeSean McCoy rush to the right for a loss of 2 yards to the Buf24. Tackled by Freddie Bishop III.","(0:32) Mike Gillislee rush to the right for 3 yards to the Buf26. Tackled by David Harris and Bruce Carter.","(1:10) EJ Manuel pass to the right to Charles Clay for 7 yards to the Buf23. Tackled by Bruce Carter and Anthony Johnson.","(1:43) LeSean McCoy rush up the middle for 2 yards to the Buf16. Tackled by Calvin Pryor and Anthony Johnson.","(1:51) Bilal Powell rush up the middle for no gain to the Buf14. Tackled by Preston Brown.","(1:51) Buffalo Bills timeout.","(2:28) Ryan Fitzpatrick pass to the right to Robby Anderson for 6 yards to the Buf14. Tackled by Preston Brown.","(3:14) Bilal Powell rush to the left for a loss of 1 yard to the Buf20. Tackled by Marcell Dareus and Preston Brown.","(3:54) Bilal Powell rush up the middle for 4 yards to the Buf19. Tackled by Preston Brown and Zach Brown.","(4:27) Ryan Fitzpatrick pass to the right to Robby Anderson for 17 yards to the Buf23. Tackled by Ronald Darby.","(5:03) Ryan Fitzpatrick rush up the middle for no gain to the Buf36. FUMBLE, recovered by NYJ (Brandon Wilds).","(5:40) Bilal Powell rush to the right for 10 yards to the Buf36. Tackled by Zach Brown.","(6:12) Bilal Powell rush to the right for 1 yard to the Buf46. Tackled by Zach Brown and Leger Douzable.","(6:47) Bilal Powell rush to the right for 11 yards to the Buf47. Tackled by Corey White.","(6:57) Colton Schmidt punts for 46 yards to NYJ38. Jalin Marshall return for 4 yards to NYJ42. Tackled by Lerentee McCray.","(7:03) EJ Manuel incomplete pass to the middle intended for Charles Clay defensed by Sheldon Richardson defensed by Buster Skrine.","(7:47) EJ Manuel sacked at Buf16 for a loss of 6 yards by Muhammad Wilkerson.","(8:27) LeSean McCoy rush to the left for 3 yards to the Buf22. Tackled by Leonard Williams and Muhammad Wilkerson.","(9:04) EJ Manuel pass to the left to Sammy Watkins for 7 yards to the Buf19. Tackled by Darryl Roberts.","(9:41) LeSean McCoy rush up the middle for 4 yards to the Buf12. Tackled by Jordan Jenkins.","(9:48) Lachlan Edwards punts for 39 yards to Buf8. No return.","(10:22) Ryan Fitzpatrick pass to the left to Robby Anderson for 5 yards to the Buf47. Tackled by Marcus Roberson.","(10:26) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa.","(11:05) Bilal Powell rush up the middle for 4 yards to the NYJ48. Tackled by Leger Douzable.","(11:43) Bilal Powell rush to the right for 23 yards to the NYJ44. Tackled by Corey Graham.","(11:55) Colton Schmidt punts for 39 yards to NYJ20. Jalin Marshall return for 1 yard to NYJ21. Tackled by Ramon Humber.","(12:00) EJ Manuel incomplete pass to the left intended for Marquise Goodwin.","(12:48) EJ Manuel rush to the right for 2 yards to the Buf41. Tackled by David Harris.","(13:22) Mike Gillislee rush to the right for no gain to the Buf39. Tackled by Leonard Williams and Muhammad Wilkerson.","(13:51) EJ Manuel pass to the right to LeSean McCoy for 6 yards to the Buf39. Tackled by David Harris.","(14:32) LeSean McCoy rush to the left for 3 yards to the Buf33. Tackled by Darron Lee.","(15:00) EJ Manuel pass to the left to Sammy Watkins for 5 yards to the Buf30.","(15:00) Nick Folk kicks off to the endzone. Touchback."]