["(0:12) Aaron Rodgers rush up the middle for a loss of 1 yard to the Det47.","(0:13) Sam Martin onside kickoff to the Det46. Onside kick recovered by receiving team by Richard Rodgers.","(0:13) Matt Prater extra point is good.","(0:22) Matthew Stafford pass to the middle to Anquan Boldin for 35 yards for a TOUCHDOWN.","(0:28) Jacob Schum punts for 18 yards to GB35. No return.","(0:28) Green Bay Packers timeout.","(1:14) Aaron Rodgers rush up the middle for a loss of 2 yards to the GB17.","(1:14) Detroit Lions timeout.","(1:16) Aaron Rodgers rush up the middle for a loss of 1 yard to the GB19.","(1:16) Green Bay Packers timeout.","(1:30) Joe Kerridge rush up the middle for no gain to the GB20. Tackled by A'Shawn Robinson.","(1:35) Matthew Stafford pass intended for Golden Tate INTERCEPTED by Micah Hyde. No return. Touchback.","(1:53) Matthew Stafford pass to the left to Eric Ebron for 6 yards to the GB15. Tackled by Ha Ha Clinton-Dix.","(1:57) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by Ladarius Gunter.","(1:57) Two Minute Warning.","(2:04) Matthew Stafford pass to the right to Golden Tate for 24 yards to the GB21. Tackled by Micah Hyde.","(2:24) Matthew Stafford pass to the right to Eric Ebron for 19 yards to the GB45. Tackled by Kentrell Brice.","(2:46) Matthew Stafford pass to the right to Eric Ebron for 11 yards to the Det36. Tackled by Kentrell Brice.","(2:50) Matthew Stafford incomplete pass to the middle intended for Anquan Boldin defensed by Morgan Burnett.","(2:50) Mason Crosby kicks off to the endzone. Touchback.","(2:50) Aaron Rodgers 2 pt conversion pass to Davante Adams is GOOD.","(2:54) Aaron Rodgers pass to the left to Davante Adams for 9 yards for a TOUCHDOWN.","(2:54) Detroit Lions timeout.","(2:59) Ty Montgomery rush up the middle for 7 yards to the Det9. Tackled by Tavon Wilson.","(2:59) Detroit Lions timeout.","(3:03) Aaron Rodgers pass to the right to Jordy Nelson for 5 yards to the Det16. Tackled by Darius Slay.","(3:03) Green Bay Packers timeout.","(3:50) Ty Montgomery rush up the middle for 4 yards to the Det21. Tackled by Tyrunn Walker.","(4:35) Ty Montgomery rush to the right for 9 yards to the Det25. Tackled by Tavon Wilson.","(5:21) Aaron Rodgers pass to the right to Ty Montgomery for 9 yards to the Det34. Tackled by Glover Quin.","(5:26) Penalty: Too Many Men on Field on Detroit (DeAndre Levy) 5 yards.","(5:30) Aaron Rodgers incomplete pass to the left intended for Davante Adams defensed by Nevin Lawson.","(5:35) Aaron Rodgers incomplete pass to the left intended for Jared Cook.","(5:41) Penalty: Holding on Detroit (Darius Slay) 5 yards.","(6:16) Aaron Rodgers rush to the left for 13 yards to the GB47. Tackled by Nevin Lawson.","(6:58) Aaron Rodgers pass to the left to Davante Adams for 2 yards to the GB34. Tackled by Nevin Lawson.","(7:42) Ty Montgomery rush to the left for 7 yards to the GB32. Tackled by Tahir Whitehead.","(7:42) Sam Martin kicks off to the endzone. Touchback.","(7:47) Matt Prater 54 yard field goal attempt is GOOD. Holder: Sam Martin.","(7:53) Matthew Stafford incomplete pass to the left intended for TJ Jones.","(7:58) Matthew Stafford incomplete pass to the left intended for TJ Jones defensed by Ladarius Gunter.","(8:01) Matthew Stafford incomplete pass to the left intended for TJ Jones defensed by Kenny Clark.","(8:47) Matthew Stafford pass to the left to Marvin Jones Jr. for 23 yards to the GB36. Tackled by Kentrell Brice.","(9:19) Matthew Stafford pass to the left to Golden Tate for 5 yards to the Det41. Tackled by Datone Jones.","(9:56) Zach Zenner rush to the right for 5 yards to the Det36. Tackled by Blake Martinez.","(10:02) Mason Crosby kicks off to the Det-5. Andre Roberts return for 36 yards to Det31. Tackled by Ha Ha Clinton-Dix.","(10:02) Mason Crosby extra point is NO GOOD.","(10:13) Aaron Rodgers pass to the left to Geronimo Allison for 10 yards for a TOUCHDOWN.","(10:17) Aaron Rodgers incomplete pass to the right intended for Ty Montgomery defensed by Josh Bynes.","(11:01) Christine Michael rush to the right for 1 yard to the Det10. Tackled by Ezekiel Ansah.","(11:28) Aaron Rodgers pass to the right to Jordy Nelson for 11 yards to the Det11. Tackled by Darius Slay.","(12:12) Aaron Rodgers pass to the left to Jared Cook for 15 yards to the Det22. Tackled by Miles Killebrew.","(12:18) Aaron Rodgers incomplete pass to the right intended for Christine Michael.","(12:47) Aaron Rodgers pass to the right to Davante Adams for 7 yards to the Det37. Tackled by Crezdon Butler.","(13:32) Aaron Rodgers pass to the left to Geronimo Allison for 31 yards to the Det44. Tackled by Crezdon Butler.","(14:06) Christine Michael rush to the left for 4 yards to the GB35. Tackled by Josh Bynes. Penalty: Illegal Block on Green Bay (T.J. Lang) -10 yards.","(14:39) Aaron Rodgers rush to the right for 12 yards to the GB31. Tackled by Tahir Whitehead.","(14:50) Sam Martin punts for 50 yards to GB19. Micah Hyde - no return. Tackled by Johnson Bademosi.","(14:56) Matthew Stafford incomplete pass to the middle intended for Andre Roberts.","(15:00) Matthew Stafford incomplete pass to the left intended for Golden Tate.","(0:36) Zach Zenner rush to the left for a loss of 3 yards to the Det31. Tackled by Clay Matthews and Letroy Guion.","(1:00) Matthew Stafford pass to the right to Marvin Jones Jr. for 30 yards to the Det34.","(1:38) Zach Zenner rush to the left for a loss of 1 yard to the Det4. Tackled by Blake Martinez.","(1:51) Jacob Schum punts for 53 yards to Det5. No return.","(2:24) Aaron Rodgers pass to the right to Ty Montgomery for 2 yards to the GB42. Tackled by Miles Killebrew and Nevin Lawson.","(2:45) Penalty: False Start on Green Bay (Lane Taylor) -5 yards.","(3:27) Aaron Rodgers pass to the right to Ty Montgomery for 6 yards to the GB45. Tackled by DeAndre Levy and Tavon Wilson.","(4:10) Ty Montgomery rush to the right for a loss of 3 yards to the GB39. Tackled by A'Shawn Robinson.","(4:48) Ty Montgomery rush to the right for 11 yards to the GB42. Tackled by Tavon Wilson.","(5:26) Aaron Rodgers rush up the middle for 4 yards to the GB31. Tackled by A'Shawn Robinson and Kerry Hyder.","(6:00) Aaron Ripkowski rush up the middle for 5 yards to the GB27. Tackled by Miles Killebrew.","(6:06) Aaron Rodgers incomplete pass to the right intended for Geronimo Allison.","(6:34) Aaron Ripkowski rush up the middle for 7 yards to the GB22. Tackled by Glover Quin.","(6:47) Sam Martin punts for 56 yards to GB9. Micah Hyde return for 6 yards to GB15. Tackled by Zach Zenner.","(7:19) Matthew Stafford sacked at Det35 for a loss of 10 yards by Nick Perry.","(7:50) Matthew Stafford pass to the right to Eric Ebron for 5 yards to the Det45. Tackled by Micah Hyde.","(7:56) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(8:38) Matthew Stafford pass to the left to Zach Zenner for 6 yards to the Det40. Tackled by Ha Ha Clinton-Dix.","(9:18) Zach Zenner rush to the left for 5 yards to the Det34. Tackled by Letroy Guion.","(9:23) Mason Crosby kicks off to the Det17. Andre Roberts return for 12 yards to Det29. Tackled by Marwin Evans.","(9:23) Mason Crosby extra point is good.","(9:27) Aaron Rodgers pass to the right to Davante Adams for 3 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Green Bay (Davante Adams) -15 yards.","(10:13) Aaron Rodgers pass to the right to Jordy Nelson for 16 yards to the Det3. Tackled by Darius Slay.","(10:41) Aaron Rodgers pass to the right to Jordy Nelson for 20 yards to the Det19. Tackled by DeAndre Levy.","(11:03) Penalty: False Start on Green Bay (Bryan Bulaga) -5 yards.","(11:41) Aaron Ripkowski rush to the left for 4 yards to the Det34. Tackled by A'Shawn Robinson.","(12:10) Aaron Rodgers rush to the left for 5 yards to the Det38. Tackled by DeAndre Levy.","(12:40) Aaron Rodgers pass to the left to Jordy Nelson for 6 yards to the Det43. Tackled by Glover Quin.","(13:09) Aaron Rodgers pass to the right to Geronimo Allison for 11 yards to the Det49. Tackled by Don Carey.","(13:57) Aaron Rodgers rush to the left for 3 yards to the GB40. Tackled by Tahir Whitehead.","(14:32) Aaron Rodgers pass to the right to Davante Adams for 7 yards to the GB37. Tackled by Don Carey.","(15:00) Ty Montgomery rush to the left for 5 yards to the GB30. Tackled by Don Carey and Tahir Whitehead.","(15:00) Sam Martin kicks off to the endzone. Touchback.","(0:03) Mason Crosby 53 yard field goal attempt is GOOD. Holder: Jacob Schum.","(0:06) Aaron Rodgers incomplete pass to the right intended for Jared Cook.","(0:06) Green Bay Packers timeout.","(0:10) Aaron Rodgers pass to the right to Jared Cook for 6 yards to the Det35. Tackled by Darius Slay.","(0:15) Aaron Rodgers incomplete pass to the right intended for Geronimo Allison.","(0:23) Aaron Rodgers pass to the right to Geronimo Allison for 39 yards to the Det41. Tackled by Darius Slay.","(0:23) Penalty: Delay of Game on Green Bay (Aaron Rodgers) -5 yards.","(0:23) Sam Martin kicks off to the endzone. Touchback.","(0:23) Matt Prater extra point is good.","(0:26) Matthew Stafford pass to the right to Golden Tate for 3 yards for a TOUCHDOWN.","(0:26) Detroit Lions timeout.","(0:31) Matthew Stafford pass to the left to Anquan Boldin for 10 yards to the GB3. Tackled by Jake Ryan and Morgan Burnett.","(0:31) Detroit Lions timeout.","(0:37) Matthew Stafford pass to the right to Marvin Jones Jr. for 5 yards to the GB13. Tackled by Damarious Randall.","(0:37) Detroit Lions timeout.","(0:39) Zach Zenner rush to the right for 6 yards to the GB18. Tackled by Kentrell Brice.","(1:04) Matthew Stafford pass to the middle to Zach Zenner for 5 yards to the GB24. Tackled by Jake Ryan.","(1:34) Zach Zenner rush to the left for 4 yards to the GB29. Tackled by Jake Ryan and Dean Lowry.","(1:42) Matthew Stafford pass to the right to Zach Zenner for 14 yards to the GB33. Tackled by Damarious Randall.","(1:49) Matthew Stafford pass to the middle to Anquan Boldin for 11 yards to the GB47. Tackled by Damarious Randall.","(1:54) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by Clay Matthews.","(2:00) Matthew Stafford pass to the right to Marvin Jones Jr. for 9 yards to the Det42. Tackled by Damarious Randall.","(2:00) Two Minute Warning.","(2:31) Zach Zenner rush to the left for 2 yards to the Det33. Tackled by Ha Ha Clinton-Dix.","(2:40) Jacob Schum punts for 28 yards to Det31. No return.","(3:01) Aaron Rodgers pass to the left to Aaron Ripkowski for 8 yards to the GB41. Tackled by Glover Quin.","(3:30) Aaron Rodgers rush to the right for 4 yards to the GB33. Tackled by Khyri Thornton.","(4:07) Christine Michael rush up the middle for 1 yard to the GB29. Tackled by Tyrunn Walker and Ezekiel Ansah.","(4:33) Aaron Rodgers pass to the left to Davante Adams for 3 yards to the GB38. Tackled by Glover Quin. Penalty: Holding on Green Bay (Jeff Janis) -10 yards.","(5:00) Aaron Rodgers pass to the right to Christine Michael for 10 yards to the GB35. Tackled by Tahir Whitehead.","(5:00) Sam Martin kicks off to the endzone. Touchback.","(5:00) Matt Prater extra point is good.","(5:03) Zach Zenner rush to the right for 1 yard for a TOUCHDOWN.","(5:07) Matthew Stafford incomplete pass to the right intended for Anquan Boldin.","(5:46) Matthew Stafford pass to the right to Anquan Boldin for 1 yard to the GB1. Tackled by Micah Hyde.","(6:33) Matthew Stafford pass to the left to Eric Ebron for 7 yards to the GB2. Tackled by Ha Ha Clinton-Dix.","(6:55) Penalty: Offside on Green Bay (Datone Jones) 5 yards.","(7:32) Zach Zenner rush to the left for no gain to the GB14. Tackled by Kenny Clark.","(7:59) Zach Zenner rush up the middle for 13 yards to the GB14. Tackled by Morgan Burnett.","(8:29) Golden Tate rush to the left for 7 yards to the GB27. Tackled by Jake Ryan.","(8:59) Matthew Stafford pass to the right to TJ Jones for 35 yards to the GB34. Tackled by Ha Ha Clinton-Dix.","(9:32) Matthew Stafford sacked at Det31 for a loss of 5 yards by Blake Martinez.","(10:12) Zach Zenner rush to the right for no gain to the Det36. Tackled by Mike Daniels.","(10:41) Matthew Stafford pass to the right to Zach Zenner for 16 yards to the Det36. Tackled by Jake Ryan.","(10:47) Mason Crosby kicks off to the Det-4. Andre Roberts return for 24 yards to Det20. Tackled by Marwin Evans.","(10:47) Mason Crosby extra point is good.","(10:54) Aaron Rodgers pass to the middle to Aaron Ripkowski for 7 yards for a TOUCHDOWN.","(11:35) Aaron Ripkowski rush to the right for 2 yards to the Det7. Tackled by Anthony Zettel.","(11:56) Penalty: Holding on Detroit (Don Carey) 5 yards.","(12:30) Aaron Rodgers pass to the right to Richard Rodgers for 14 yards to the Det14. Tackled by Tahir Whitehead.","(13:02) Aaron Ripkowski rush up the middle for 5 yards to the Det28. Tackled by Tavon Wilson and Josh Bynes.","(13:39) Aaron Rodgers pass to the left to Jared Cook for 24 yards to the Det33. Tackled by Darius Slay.","(14:03) Aaron Rodgers pass to the left to Jared Cook for 11 yards to the GB43. Tackled by Glover Quin.","(14:18) Penalty: False Start on Green Bay (David Bakhtiari) -5 yards.","(14:50) Aaron Ripkowski rush to the left for 8 yards to the GB37. Tackled by Tahir Whitehead.","(14:56) Aaron Rodgers incomplete pass to the middle intended for Jared Cook defensed by Glover Quin.","(15:00) 39 yard field goal attempt by Matt Prater is NO GOOD. Holder: Sam Martin.","(0:27) Matthew Stafford pass to the left to Golden Tate for 11 yards to the GB20. Tackled by Mike Daniels.","(1:03) Zach Zenner rush up the middle for 2 yards to the GB31. Tackled by Mike Daniels.","(1:27) Penalty: Pass Interference on Detroit (Golden Tate) -10 yards.","(2:02) Zach Zenner rush to the right for 3 yards to the GB23. Tackled by Nick Perry and Dean Lowry.","(2:36) Matthew Stafford pass to the left to Golden Tate for 17 yards to the GB26. Tackled by Ladarius Gunter.","(2:41) Matthew Stafford incomplete pass to the right intended for Zach Zenner.","(3:16) Zach Zenner rush up the middle for 1 yard to the GB43. Tackled by Morgan Burnett.","(3:50) Matthew Stafford pass to the left to Golden Tate for 17 yards to the GB44. Tackled by Ladarius Gunter.","(4:25) Zach Zenner rush to the left for 4 yards to the Det39. Tackled by Ladarius Gunter.","(4:55) Zach Zenner rush up the middle for no gain to the Det35. Tackled by Datone Jones.","(5:29) Matthew Stafford pass to the right to Marvin Jones Jr. for 9 yards to the Det35. Tackled by Quinten Rollins.","(6:19) Zach Zenner rush to the right for 15 yards to the Det26. Tackled by Ha Ha Clinton-Dix and Damarious Randall.","(6:26) Jacob Schum punts for 44 yards to Det11. No return.","(6:30) Aaron Rodgers incomplete pass to the middle intended for Ty Montgomery defensed by Kerry Hyder.","(6:39) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(6:43) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(7:03) Penalty: False Start on Green Bay (Bryan Bulaga) -5 yards.","(7:40) Aaron Ripkowski rush to the left for 15 yards to the GB50. Tackled by Glover Quin.","(8:18) Aaron Rodgers pass to the right to Jordy Nelson for 8 yards to the GB35. Tackled by Darius Slay.","(8:29) Sam Martin punts for 40 yards to GB33. Micah Hyde return for 4 yards to GB37. Tackled by Don Muhlbach. Penalty: Illegal Block on Green Bay (Damarious Randall) -10 yards.","(8:36) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(8:57) Penalty: False Start on Detroit (Graham Glasgow) -5 yards.","(9:29) Zach Zenner rush to the left for 2 yards to the Det32. Tackled by Joe Thomas.","(9:59) Zach Zenner rush up the middle for 4 yards to the Det30. Tackled by Datone Jones.","(10:24) Matthew Stafford pass to the right to Eric Ebron for 13 yards to the Det26. Tackled by Damarious Randall.","(10:32) Jacob Schum punts for 43 yards to Det13. No return.","(10:37) Aaron Rodgers incomplete pass to the left intended for Jared Cook.","(11:22) Aaron Rodgers sacked at GB44 for a loss of 5 yards by Tavon Wilson.","(11:59) Aaron Ripkowski rush to the left for 5 yards to the GB49. Tackled by Haloti Ngata and Ezekiel Ansah.","(12:36) Aaron Ripkowski rush up the middle for 10 yards to the GB44. Tackled by Tavon Wilson.","(13:27) Aaron Rodgers rush to the right for 5 yards to the GB34. Tackled by Miles Killebrew.","(14:10) Ty Montgomery rush to the right for 4 yards to the GB29. Tackled by Darius Slay.","(14:22) Sam Martin punts for 54 yards to GB15. Micah Hyde return for 10 yards to GB25. Tackled by Clay Harbor.","(14:26) Matthew Stafford incomplete pass to the left intended for Golden Tate defensed by Joe Thomas.","(14:32) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(15:00) Zach Zenner rush up the middle for 6 yards to the Det31. Tackled by Kentrell Brice.","(15:00) Mason Crosby kicks off to the endzone. Touchback."]