["(0:35) Trevone Boykin rush up the middle for a loss of 1 yard to the SF28.","(1:14) Trevone Boykin rush up the middle for a loss of 2 yards to the SF27.","(2:00) Trevone Boykin rush to the right for 11 yards to the SF25. Tackled by Antoine Bethea.","(2:00) Two Minute Warning.","(2:20) Marcel Reece rush up the middle for no gain to the SF36. Tackled by Ahmad Brooks.","(2:27) Trevone Boykin pass to the left to Marcel Reece for 19 yards to the SF36. Tackled by Michael Wilhoite.","(3:08) Alex Collins rush to the right for 4 yards to the Sea45. Tackled by Keith Reaser.","(3:08) Penalty: False Start on Seattle (Germain Ifedi) -5 yards.","(3:08) San Francisco 49ers timeout.","(3:19) Trevone Boykin pass to the right to Luke Willson for 7 yards to the Sea46. Tackled by Jaquiski Tartt.","(4:05) Trevone Boykin pass to the left to Tanner McEvoy for 7 yards to the Sea39. Tackled by Dontae Johnson.","(4:45) Alex Collins rush to the left for 2 yards to the Sea32. Tackled by Carl Bradford.","(4:52) Trevone Boykin pass to the left to Tanner McEvoy for 9 yards to the Sea30. Tackled by Dontae Johnson.","(5:32) Alex Collins rush up the middle for 2 yards to the Sea21. Tackled by Chris Jones and Michael Wilhoite.","(5:37) Trevone Boykin incomplete pass to the right intended for Kasen Williams.","(5:42) Phil Dawson kicks off to the Sea4. Paul Richardson return for 10 yards to Sea14. Tackled by Carl Bradford. Penalty: Offside on San Francisco (Jaquiski Tartt) 5 yards.","(5:42) Phil Dawson extra point is good. Penalty: Disqualification on Seattle (Jarran Reed) 15 yards.","(5:51) Colin Kaepernick pass to the right to Garrett Celek for 9 yards for a TOUCHDOWN.","(6:16) Raheem Mostert rush up the middle for 6 yards to the Sea9. Tackled by Frank Clark.","(6:38) Penalty: Holding on San Francisco (Joshua Garnett) -10 yards.","(7:21) Colin Kaepernick pass to the left to Jeremy Kerley for 27 yards to the Sea5. Tackled by Bobby Wagner.","(7:22) San Francisco 49ers timeout.","(8:04) Shaun Draughn rush up the middle for 3 yards to the Sea32. Tackled by Cassius Marsh.","(8:18) Jon Ryan punts for 43 yards to SF36. Jeremy Kerley return for a loss of 4 yards to SF32. Lateral to Raheem Mostert for 33 yards to the Sea35. Tackled by Dewey McDonald and Jon Ryan.","(8:20) Trevone Boykin incomplete pass to the left intended for Paul Richardson.","(9:03) Trevone Boykin sacked at Sea21 for a loss of 5 yards. FUMBLE, recovered by Sea (Trevone Boykin).","(9:29) Trevone Boykin rush to the right for a loss of 1 yard to the Sea26. Tackled by Carl Bradford.","(10:15) Alex Collins rush up the middle for 17 yards to the Sea27. Tackled by Antoine Bethea and Jaquiski Tartt.","(10:52) Alex Collins rush up the middle for 4 yards to the Sea10. Tackled by Antoine Bethea.","(11:01) Bradley Pinion punts for 50 yards to Sea6. No return.","(11:42) Colin Kaepernick pass to the right to Chris Harper for 7 yards to the SF44. Tackled by Richard Sherman.","(12:22) Shaun Draughn rush up the middle for a loss of 2 yards to the SF37. Tackled by Ahtyba Rubin and Bobby Wagner.","(12:56) Shaun Draughn rush to the left for 1 yard to the SF39. Tackled by Ahtyba Rubin.","(13:33) Shaun Draughn rush to the right for 10 yards to the SF38. Tackled by K.J. Wright.","(14:08) Colin Kaepernick pass to the middle to Shaun Draughn for 3 yards to the SF28. Tackled by Tony McDaniel.","(14:08) Steven Hauschka kicks off to the endzone. Touchback.","(14:12) Steven Hauschka 28 yard field goal attempt is GOOD. Holder: Jon Ryan.","(14:53) Russell Wilson pass to the left to Paul Richardson for 11 yards to the SF10. Tackled by Tramaine Brock.","(14:53) Seattle Seahawks timeout.","(15:00) Russell Wilson incomplete pass to the left intended for Paul Richardson.","(0:16) Russell Wilson sacked at SF21 for a loss of 6 yards. FUMBLE, recovered by Sea (Russell Wilson).","(0:56) Paul Richardson rush to the right for 5 yards to the SF15. Tackled by Michael Wilhoite.","(1:35) Russell Wilson pass to the right to J.D. McKissic for 6 yards to the SF20. Tackled by Keith Reaser.","(2:23) Alex Collins rush to the right for 26 yards to the SF26. Tackled by Antoine Bethea and Tramaine Brock.","(2:32) Russell Wilson incomplete pass to the right intended for Paul Richardson.","(3:06) Russell Wilson pass to the left to Brandon Williams for 20 yards to the Sea48. Tackled by Antoine Bethea.","(3:14) Bradley Pinion punts for 53 yards to Sea28. No return.","(3:51) Colin Kaepernick sacked at SF19 for a loss of 7 yards by Bobby Wagner.","(3:59) Colin Kaepernick incomplete pass to the middle intended for Aaron Burbridge defensed by Bobby Wagner.","(4:33) Shaun Draughn rush up the middle for 4 yards to the SF26. Tackled by Tony McDaniel.","(4:59) Penalty: Illegal Formation on San Francisco -5 yards.","(5:04) Jon Ryan kicks off to the SF15. Jeremy Kerley return for 12 yards to SF27. Tackled by Kevin Pierre-Louis.","(5:06) Jon Ryan rush up the middle for no gain to the Sea14. FUMBLE, recovered by Sea. Safety.","(5:15) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(5:20) Russell Wilson incomplete pass to the left intended for Jermaine Kearse defensed by Dontae Johnson.","(6:03) Alex Collins rush to the left for no gain to the Sea14. Tackled by Gerald Hodges Jr. and DeForest Buckner.","(6:11) Bradley Pinion punts for 42 yards to Sea14. No return.","(6:52) Colin Kaepernick pass to the right to Chris Harper for 13 yards to the SF44. Tackled by Steven Terrell.","(7:28) Shaun Draughn rush up the middle for a loss of 5 yards to the SF31. Tackled by Michael Bennett.","(8:05) Shaun Draughn rush up the middle for 1 yard to the SF36. Tackled by Tony McDaniel.","(8:14) Steven Hauschka kicks off to the SF9. Raheem Mostert return for 26 yards to SF35. Tackled by Jeremy Lane and Neiko Thorpe.","(8:19) Steven Hauschka 33 yard field goal attempt is GOOD. Holder: Jon Ryan.","(8:23) Russell Wilson incomplete pass to the right intended for Doug Baldwin.","(8:29) Russell Wilson incomplete pass to the right intended for Jimmy Graham.","(9:09) Thomas Rawls rush up the middle for a loss of 2 yards to the SF15. Tackled by Aaron Lynch.","(9:26) Russell Wilson pass to the right to Jimmy Graham for 10 yards to the SF13. Tackled by Aaron Lynch.","(10:01) Russell Wilson pass to the left to Jermaine Kearse for 36 yards to the SF23.","(10:08) Bradley Pinion punts for 50 yards to Sea41. No return.","(10:50) Colin Kaepernick sacked at SF9 for a loss of 10 yards by Michael Bennett.","(10:56) Colin Kaepernick incomplete pass to the right intended for Shaun Draughn.","(11:38) Shaun Draughn rush to the right for a loss of 5 yards to the SF19. Tackled by K.J. Wright.","(11:46) Jon Ryan punts for 37 yards to SF24. No return.","(11:46) San Francisco 49ers timeout.","(11:49) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(11:49) Seattle Seahawks timeout.","(12:23) Russell Wilson pass to the left to J.D. McKissic for 10 yards to the Sea39. Tackled by Dontae Johnson.","(12:49) Russell Wilson pass to the left to Paul Richardson for 3 yards to the Sea39. Tackled by Jaquiski Tartt. Penalty: Holding on Seattle (Doug Baldwin) -10 yards.","(12:54) Russell Wilson incomplete pass to the right intended for Jimmy Graham defensed by Dontae Johnson.","(13:33) Russell Wilson pass to the right to Luke Willson for 8 yards to the Sea36. Tackled by Gerald Hodges Jr. and Dontae Johnson.","(14:18) Russell Wilson pass to the right to Doug Baldwin for 3 yards to the Sea28. Tackled by Keith Reaser and Antoine Bethea.","(14:55) Thomas Rawls rush up the middle for 2 yards to the Sea25. Tackled by Ahmad Brooks.","(15:00) Phil Dawson kicks off to the Sea1. J.D. McKissic return for 22 yards to Sea23. Tackled by Jaquiski Tartt.","(0:02) Colin Kaepernick rush up the middle for a loss of 2 yards to the SF19.","(0:02) Seattle Seahawks timeout.","(0:04) Shaun Draughn rush up the middle for a loss of 2 yards to the SF21. Tackled by Frank Clark.","(0:08) Colin Kaepernick incomplete pass to the right intended for Shaun Draughn.","(0:28) Colin Kaepernick pass to the middle to Shaun Draughn for 9 yards to the SF23. Tackled by K.J. Wright.","(0:35) Jon Ryan punts for 40 yards to SF14. No return.","(0:36) San Francisco 49ers timeout.","(1:09) Russell Wilson rush to the left for 4 yards to the Sea46. Tackled by Ahmad Brooks.","(1:30) Russell Wilson pass to the right to Jimmy Graham for 5 yards to the Sea42. Tackled by Michael Wilhoite.","(1:38) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(1:47) Bradley Pinion punts for 47 yards to Sea31. Richard Sherman return for 6 yards to Sea37. Tackled by Jaquiski Tartt.","(1:48) Seattle Seahawks timeout.","(2:00) Colin Kaepernick sacked at SF22 for a loss of 7 yards by Frank Clark. FUMBLE, recovered by SF (Colin Kaepernick).","(2:00) Two Minute Warning.","(2:13) Shaun Draughn rush up the middle for 6 yards to the SF29. Tackled by K.J. Wright.","(2:52) Shaun Draughn rush to the right for 2 yards to the SF23. Tackled by Jarran Reed.","(3:00) Steven Hauschka kicks off to the SF2. JaCorey Shepherd return for 19 yards to SF21. Tackled by Cassius Marsh.","(3:00) Steven Hauschka extra point is BLOCKED.","(3:03) Thomas Rawls rush to the left for 1 yard for a TOUCHDOWN.","(3:26) Russell Wilson pass to the right to Jimmy Graham for 42 yards to the SF1. Tackled by Antoine Bethea.","(3:34) Russell Wilson incomplete pass to the right intended for Doug Baldwin.","(4:09) Russell Wilson pass to the left to Doug Baldwin for 41 yards to the SF43. Tackled by Rashard Robinson.","(4:50) Thomas Rawls rush up the middle for 7 yards to the Sea16. Tackled by Glenn Dorsey.","(4:58) Bradley Pinion punts for 47 yards to Sea9. No return.","(5:02) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley defensed by Jeremy Lane.","(5:35) Colin Kaepernick pass to the left to Jeremy Kerley for 3 yards to the SF44. Tackled by K.J. Wright.","(5:40) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(6:15) Shaun Draughn rush up the middle for 6 yards to the SF41. Tackled by Bobby Wagner.","(6:45) Colin Kaepernick pass to the left to Rod Streater for 5 yards to the SF35. Tackled by Deshawn Shead.","(6:55) Steven Hauschka kicks off to the SF2. JaCorey Shepherd return for 28 yards to SF30. Tackled by Steven Terrell and Kelcie McCray.","(6:55) Steven Hauschka extra point is good.","(6:59) Russell Wilson pass to the right to Luke Willson for 11 yards for a TOUCHDOWN.","(7:44) Russell Wilson pass to the right to Alex Collins for 4 yards to the SF11. Tackled by Michael Wilhoite.","(7:55) DuJuan Harris rush up the middle for a loss of 6 yards to the SF42. Tackled by Ahtyba Rubin. FUMBLE, recovered by Sea (Frank Clark) and returned for 27 yards. Tackled by DuJuan Harris.","(8:33) Shaun Draughn rush up the middle for 5 yards to the SF48. Tackled by Ahtyba Rubin.","(9:11) Colin Kaepernick pass to the right to Aaron Burbridge for 24 yards to the SF43. Tackled by Steven Terrell.","(9:47) Shaun Draughn rush to the left for no gain to the SF19. Tackled by Bobby Wagner.","(10:26) Colin Kaepernick sacked at SF19 for no gain by Bobby Wagner.","(10:32) Steven Hauschka kicks off to the SF10. Raheem Mostert return for 9 yards to SF19. Tackled by Cassius Marsh and Dewey McDonald.","(10:37) Steven Hauschka 32 yard field goal attempt is GOOD. Holder: Jon Ryan.","(10:43) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(10:43) Seattle Seahawks timeout.","(11:30) Russell Wilson rush to the left for no gain to the SF14. Tackled by Gerald Hodges Jr..","(12:03) Thomas Rawls rush up the middle for 1 yard to the SF14. Tackled by Chris Jones.","(12:37) Russell Wilson pass to the left to Paul Richardson for 18 yards to the SF15. Tackled by Rashard Robinson.","(13:14) Russell Wilson pass to the left to Paul Richardson for 8 yards to the SF33. Tackled by Rashard Robinson.","(13:47) Thomas Rawls rush to the left for 4 yards to the SF41. Tackled by Ahmad Brooks.","(14:18) Russell Wilson pass to the left to Jermaine Kearse for 8 yards to the SF45. Tackled by Tramaine Brock.","(14:56) Russell Wilson pass to the right to Marcel Reece for 7 yards to the Sea47. Tackled by Gerald Hodges Jr..","(14:56) Bradley Pinion kicks off to the Sea3, out of bounds. No return.","(14:56) Phil Dawson extra point is good.","(15:00) Shaun Draughn rush up the middle for 1 yard for a TOUCHDOWN.","(0:38) Shaun Draughn rush up the middle for no gain to the Sea1. Tackled by Kam Chancellor.","(0:38) San Francisco 49ers timeout.","(1:20) DuJuan Harris rush up the middle for no gain to the Sea1. Tackled by K.J. Wright and Kam Chancellor.","(1:53) DuJuan Harris rush to the right for 2 yards to the Sea1. Tackled by Bobby Wagner.","(2:11) Penalty: Offside on Seattle (Michael Bennett) 4 yards.","(2:46) Shaun Draughn rush to the left for 7 yards to the Sea7. Tackled by Kam Chancellor and Bobby Wagner.","(3:20) Shaun Draughn rush to the right for 6 yards to the Sea14. Tackled by Bobby Wagner.","(3:46) Colin Kaepernick pass to the left to Jeremy Kerley for 3 yards to the Sea20. Tackled by Kam Chancellor.","(4:23) Shaun Draughn rush up the middle for 1 yard to the Sea23. Tackled by Tony McDaniel.","(4:45) Colin Kaepernick pass to the middle to Jeremy Kerley for 6 yards to the Sea24. Tackled by Richard Sherman.","(5:24) Colin Kaepernick rush to the right for 3 yards to the Sea30.","(5:44) Penalty: Illegal Shift on San Francisco -5 yards.","(6:20) Colin Kaepernick pass to the right to Chris Harper for 5 yards to the Sea28. Tackled by Kam Chancellor.","(7:00) Colin Kaepernick pass to the left to Shaun Draughn for 27 yards to the Sea33. Tackled by Steven Terrell.","(7:35) Colin Kaepernick pass to the right to Jeremy Kerley for 8 yards to the SF40. Tackled by Jeremy Lane.","(8:06) Colin Kaepernick rush up the middle for 11 yards to the SF32. Tackled by Jarran Reed.","(8:19) Jon Ryan punts for 64 yards to SF9. Jeremy Kerley return for 12 yards to SF21. Tackled by Brandon Williams.","(8:27) Russell Wilson incomplete pass to the right.","(9:06) Thomas Rawls rush up the middle for no gain to the Sea27. Tackled by DeForest Buckner.","(9:35) J.D. McKissic rush up the middle for 2 yards to the Sea27. Tackled by Ronald Blair.","(9:35) Bradley Pinion kicks off to the endzone. Touchback.","(9:35) Phil Dawson extra point is good.","(9:41) Shaun Draughn rush to the right for 1 yard for a TOUCHDOWN.","(10:18) DuJuan Harris rush to the left for 3 yards to the Sea1. Tackled by Bobby Wagner and Cassius Marsh.","(10:52) Colin Kaepernick pass to the middle to Shaun Draughn for 29 yards to the Sea4. Tackled by Jeremy Lane.","(11:25) Shaun Draughn rush up the middle for 1 yard to the Sea33. Tackled by Frank Clark.","(11:51) Colin Kaepernick pass to the right to Jeremy Kerley for 14 yards to the Sea34. Tackled by Kam Chancellor.","(12:28) Colin Kaepernick rush to the right for 4 yards to the Sea48. Tackled by Bobby Wagner.","(13:03) Colin Kaepernick pass to the middle to DeAndre Smelter for 23 yards to the SF48. Tackled by Kam Chancellor.","(13:03) Steven Hauschka kicks off to the endzone. Touchback.","(13:08) Steven Hauschka 31 yard field goal attempt is GOOD. Holder: Jon Ryan.","(13:11) Russell Wilson incomplete pass to the left intended for Jimmy Graham defensed by Jaquiski Tartt.","(13:43) Russell Wilson pass to the left to Jimmy Graham for 7 yards to the SF13. Tackled by Rashard Robinson.","(14:19) Thomas Rawls rush up the middle for 1 yard to the SF20. Tackled by Ahmad Brooks and DeForest Buckner.","(14:25) Colin Kaepernick rush up the middle for no gain to the SF25. FUMBLE, recovered by Sea (Bobby Wagner). Tackled by Colin Kaepernick.","(15:00) Colin Kaepernick sacked at SF25 for no gain by K.J. Wright.","(15:00) Steven Hauschka kicks off to the endzone. Touchback."]