["(0:14) Jameis Winston rush up the middle for a loss of 1 yard to the Car41.","(0:17) Graham Gano onside kickoff to the Car40. Onside kick recovered by receiving team by Cameron Lynch.","(0:17) Tampa Bay Buccaneers timeout.","(0:17) Cam Newton 2 pt conversion pass is NO GOOD - intended for Greg Olsen.","(0:17) Tampa Bay Buccaneers timeout.","(0:22) Cam Newton pass to the left to Kelvin Benjamin for 5 yards for a TOUCHDOWN.","(0:46) Cam Newton pass to the middle to Kelvin Benjamin for 13 yards to the TB5. Tackled by Lavonte David.","(0:46) Carolina Panthers timeout.","(1:13) Cam Newton rush up the middle for a loss of 2 yards to the TB18. Tackled by Lavonte David.","(1:13) Carolina Panthers timeout.","(1:20) Cam Newton incomplete pass to the right intended for Brenton Bersin defensed by Brent Grimes.","(1:24) Cam Newton incomplete pass to the right intended for Mike Tolbert defensed by Kwon Alexander.","(2:00) Cam Newton pass to the middle to Greg Olsen for 3 yards to the TB16. Tackled by Bradley McDougald.","(2:00) Two Minute Warning.","(2:12) Fozzy Whittaker rush up the middle for no gain to the TB19. Tackled by Gerald McCoy and Kwon Alexander.","(2:19) Cam Newton incomplete pass to the right intended for Brenton Bersin defensed by Brent Grimes.","(2:57) Fozzy Whittaker rush to the right for 8 yards to the TB19. Tackled by Bradley McDougald.","(3:07) Cam Newton pass to the left to Kelvin Benjamin for 47 yards to the TB27. Tackled by Brent Grimes.","(3:13) Roberto Aguayo kicks off to the Car-5. Damiere Byrd return for 31 yards to Car26. Tackled by Chris Conte.","(3:13) Roberto Aguayo extra point is good.","(3:21) Jameis Winston pass to the left to Mike Evans for 10 yards for a TOUCHDOWN.","(3:27) Jameis Winston incomplete pass to the left intended for Mike Evans defensed by Kurt Coleman.","(3:34) Jameis Winston pass to the left to Adam Humphries for 17 yards to the Car10. Tackled by Daryl Worley.","(4:02) Jameis Winston pass to the middle to Russell Shepard for 9 yards to the Car27. Tackled by Thomas Davis.","(4:46) Jacquizz Rodgers rush to the right for 2 yards to the Car36. Tackled by Shaq Thompson.","(5:13) Jameis Winston pass to the right to Mike Evans for 16 yards to the Car38. Tackled by Michael Griffin.","(5:47) Jacquizz Rodgers rush to the right for no gain to the TB46. Tackled by Michael Griffin.","(6:05) Jameis Winston pass to the left to Russell Shepard for 20 yards to the TB46. Tackled by Kurt Coleman.","(6:10) 36 yard field goal attempt by Graham Gano is NO GOOD. Holder: Michael Palardy.","(6:51) Mike Tolbert rush up the middle for 5 yards to the TB18. Tackled by Ryan Russell and Kwon Alexander.","(7:23) Penalty: Holding on Carolina (Mike Remmers) -10 yards.","(8:08) Jonathan Stewart rush to the right for 2 yards to the TB13. Tackled by Lavonte David.","(8:51) Jonathan Stewart rush to the right for a loss of 1 yard to the TB15. Tackled by Kwon Alexander.","(9:24) Mike Tolbert rush to the left for 14 yards to the TB14. Tackled by Bradley McDougald.","(9:59) Mike Tolbert rush to the left for 5 yards to the TB28. Tackled by Noah Spence.","(10:42) Cam Newton pass to the middle to Kelvin Benjamin for 13 yards to the TB33. Tackled by Javien Elliott.","(11:22) Jonathan Stewart rush to the left for 3 yards to the TB46. Tackled by Gerald McCoy.","(11:55) Jonathan Stewart rush to the right for 2 yards to the TB49. Tackled by Bradley McDougald and Brent Grimes.","(12:04) Roberto Aguayo 48 yard field goal attempt is BLOCKED by Kawann Short. Return blocked field goal by Shaq Thompson to the Car49. Tackled by Bryan Anger.","(13:04) Penalty: False Start on Tampa Bay (Donovan Smith) -5 yards.","(13:04) Jameis Winston sacked at Car25 for a loss of 7 yards by Kony Ealy.","(13:40) Jameis Winston pass to the right to Adam Humphries for 6 yards to the Car18. Tackled by James Bradberry.","(14:20) Jacquizz Rodgers rush to the right for no gain to the Car24. Tackled by David Mayo and Star Lotulelei.","(15:00) Jacquizz Rodgers rush up the middle for 17 yards to the Car24. Tackled by Kurt Coleman.","(0:06) Cam Newton pass intended for Greg Olsen INTERCEPTED by Keith Tandy and returned for 28 yards. Tackled by Ed Dickson. Penalty: Horse Collar Tackle on Carolina (Ed Dickson) 15 yards.","(0:45) Cam Newton pass to the left to Damiere Byrd for 16 yards to the Car43. Tackled by Vernon Hargreaves III.","(1:06) Cam Newton pass to the left to Corey Brown for 17 yards to the Car27. Tackled by Kwon Alexander.","(1:51) Jonathan Stewart rush to the right for no gain to the Car10. Tackled by Kwon Alexander and Daryl Smith.","(2:00) Bryan Anger punts for 43 yards to Car10. No return.","(2:25) Jameis Winston sacked at TB47 for a loss of 7 yards by Mario Addison.","(2:31) Jameis Winston incomplete pass to the right intended for Russell Shepard.","(3:05) Jacquizz Rodgers rush to the left for 4 yards to the Car46. Tackled by Kawann Short.","(3:15) Michael Palardy punts for 42 yards to Car50. Adam Humphries - no return. Tackled by Jared Norris.","(3:56) Cam Newton sacked at Car8 for a loss of 10 yards by Lavonte David.","(4:30) Jonathan Stewart rush to the right for a loss of 1 yard to the Car18. Tackled by Keith Tandy and Gerald McCoy.","(4:38) Tampa Bay Buccaneers timeout.","(4:38) Cam Newton incomplete pass to the right intended for Ted Ginn Jr. defensed by Chris Conte. Penalty: Delay of Game on Tampa Bay (Chris Conte) 5 yards.","(4:44) Bryan Anger punts for 46 yards to Car14. No return.","(4:50) Jameis Winston incomplete pass to the left intended for Adam Humphries.","(4:56) Jameis Winston incomplete pass to the left intended for Mike Evans defensed by James Bradberry.","(5:27) Peyton Barber rush to the right for 4 yards to the TB40. Tackled by Shaq Thompson.","(6:04) Peyton Barber rush to the right for 6 yards to the TB36. Tackled by David Mayo.","(6:37) Peyton Barber rush up the middle for 5 yards to the TB30. Tackled by Kurt Coleman.","(6:37) Graham Gano kicks off to the endzone. Touchback.","(6:42) Graham Gano 54 yard field goal attempt is GOOD. Holder: Michael Palardy.","(6:50) Cam Newton incomplete pass to the left.","(7:33) Cam Newton pass to the right to Corey Brown for 3 yards to the TB36. Tackled by Brent Grimes.","(7:39) Cam Newton incomplete pass to the left intended for Ed Dickson.","(8:22) Cam Newton pass to the left to Ted Ginn Jr. for 39 yards to the TB39. Tackled by Keith Tandy.","(8:22) Carolina Panthers timeout.","(9:03) Jonathan Stewart rush up the middle for 2 yards to the Car22. Tackled by Noah Spence.","(9:45) Jonathan Stewart rush to the right for 6 yards to the Car20. Tackled by Keith Tandy.","(9:54) Bryan Anger punts for 53 yards to Car14. No return.","(10:00) Jameis Winston incomplete pass to the left intended for Russell Shepard defensed by Shaq Thompson.","(10:05) Jameis Winston incomplete pass to the left intended for Russell Shepard.","(10:39) Jacquizz Rodgers rush up the middle for no gain to the TB33. Tackled by Mario Addison and David Mayo.","(11:07) Jameis Winston pass to the right to Adam Humphries for 14 yards to the TB33. Tackled by James Bradberry.","(11:40) Jacquizz Rodgers rush to the right for 3 yards to the TB19. Tackled by Kurt Coleman.","(12:14) Jameis Winston pass to the left to Jacquizz Rodgers for 4 yards to the TB16. Tackled by David Mayo.","(12:24) Michael Palardy punts for 31 yards to TB12. No return.","(12:30) Cam Newton incomplete pass to the right intended for Kelvin Benjamin defensed by Brent Grimes.","(13:04) Fozzy Whittaker rush to the left for 1 yard to the TB43. Tackled by DaVonte Lambert and Robert Ayers Jr..","(13:40) Jonathan Stewart rush to the right for 1 yard to the TB44. Tackled by Kwon Alexander.","(14:12) Jonathan Stewart rush to the right for 13 yards to the TB45. Tackled by Keith Tandy.","(14:19) Roberto Aguayo kicks off to the Car7. Fozzy Whittaker return for 35 yards to Car42. Tackled by Alterraun Verner.","(14:19) Roberto Aguayo extra point is good.","(14:27) Cam Newton pass intended for Ted Ginn Jr. INTERCEPTED by Brent Grimes and returned for 31 yards for a TOUCHDOWN.","(15:00) Jonathan Stewart rush to the right for 3 yards to the Car28. Tackled by Clinton McDonald.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback.","(0:02) 58 yard field goal attempt by Graham Gano is NO GOOD. Holder: Michael Palardy.  Missed field goal returned by Adam Humphries to the Car33. Tackled by Ed Dickson.","(0:02) Tampa Bay Buccaneers timeout.","(0:02) Carolina Panthers timeout.","(0:17) Cam Newton rush to the right for 3 yards to the TB40. Tackled by Gerald McCoy.","(0:24) Cam Newton incomplete pass to the left intended for Brenton Bersin defensed by Javien Elliott.","(0:31) Cam Newton pass to the right to Greg Olsen for 6 yards to the TB43. Tackled by Keith Tandy.","(0:31) Carolina Panthers timeout.","(0:37) Cam Newton pass to the left to Kelvin Benjamin for 7 yards to the TB49. Tackled by Keith Tandy and Lavonte David.","(0:40) Cam Newton pass to the left to Kelvin Benjamin for 8 yards to the Car44. Tackled by Vernon Hargreaves III.","(0:46) 46 yard field goal attempt by Roberto Aguayo is NO GOOD. Holder: Bryan Anger.","(0:51) Jameis Winston incomplete pass to the left intended for Mike Evans.","(0:51) Tampa Bay Buccaneers timeout.","(1:32) Jameis Winston pass to the left to Mike Evans for 5 yards to the Car27. Tackled by James Bradberry.","(2:00) Jameis Winston pass to the left to Adam Humphries for no gain to the Car32. Tackled by Leonard Johnson.","(2:00) Tampa Bay Buccaneers timeout.","(2:25) Two Minute Warning.","(2:25) Jacquizz Rodgers rush to the right for 3 yards to the Car32. Tackled by James Bradberry.","(3:07) Jacquizz Rodgers rush to the left for no gain to the Car35. Tackled by Michael Griffin and Shaq Thompson.","(3:35) Jameis Winston pass to the right to Adam Humphries for 9 yards to the Car35. Tackled by Michael Griffin.","(4:11) Jameis Winston rush up the middle for 9 yards to the Car44. Tackled by Thomas Davis.","(4:48) Peyton Barber rush to the right for 1 yard to the TB47. Tackled by Kony Ealy and Kyle Love.","(5:22) Jameis Winston pass to the left to Freddie Martino for 9 yards to the TB46. Tackled by Daryl Worley and Kurt Coleman.","(5:59) Jameis Winston pass to the left to Adam Humphries for 3 yards to the TB37. Tackled by Daryl Worley.","(6:30) Jameis Winston pass to the middle to Luke Stocker for 1 yard to the TB34. Tackled by David Mayo.","(7:09) Jameis Winston pass to the left to Adam Humphries for 8 yards to the TB33. Tackled by Mario Addison.","(7:36) Peyton Barber rush up the middle for 3 yards to the TB25. Tackled by David Mayo and Star Lotulelei.","(7:48) Cam Newton pass intended for Corey Brown INTERCEPTED by Keith Tandy. No return. Tackled by Corey Brown.","(7:56) Cam Newton incomplete pass to the middle intended for Jonathan Stewart defensed by Robert Ayers Jr..","(8:28) Jonathan Stewart rush to the right for 4 yards to the Car35. Tackled by Daryl Smith and Kwon Alexander. Penalty: Illegal Block on Carolina (Kelvin Benjamin) -10 yards.","(8:56) Cam Newton pass to the right to Ted Ginn Jr. for no gain to the Car31. Tackled by Brent Grimes.","(9:36) Cam Newton rush up the middle for 5 yards to the Car31. Tackled by Keith Tandy.","(10:17) Jonathan Stewart rush to the left for 1 yard to the Car26. Tackled by DaVonte Lambert.","(10:41) Ted Ginn Jr. rush to the right for 7 yards to the Car25. Tackled by Bradley McDougald.","(10:54) Bryan Anger punts for 52 yards to Car18. Ted Ginn Jr. - no return. Tackled by Chris Conte.","(11:00) Penalty: False Start on Tampa Bay (Austin Johnson) -5 yards.","(11:00) Jameis Winston incomplete pass to the left intended for Mike Evans.","(11:35) Jacquizz Rodgers rush to the left for 1 yard to the TB35. Tackled by Larry Webster.","(11:44) Jameis Winston incomplete pass to the left intended for Alan Cross.","(11:52) Michael Palardy punts for 44 yards to TB34. No return.","(12:31) Cam Newton sacked at Car22 for a loss of 8 yards by Robert Ayers Jr..","(12:38) Cam Newton incomplete pass to the left intended for Ted Ginn Jr..","(13:14) Jonathan Stewart rush to the left for 2 yards to the Car30. Tackled by Kwon Alexander and Noah Spence.","(13:27) Jameis Winston sacked at Car30 for no gain by Wes Horton. FUMBLE, recovered by Car (Vernon Butler). Tackled by Kevin Pamphile.","(14:04) Jacquizz Rodgers rush to the left for a loss of 1 yard to the Car30. Tackled by David Mayo and Star Lotulelei.","(14:39) Jameis Winston pass to the right to Mike Evans for 22 yards to the Car29. Tackled by Kurt Coleman.","(15:00) Jameis Winston pass to the left to Mike Evans for 12 yards to the TB49. Tackled by Kurt Coleman.","(0:09) Jacquizz Rodgers rush to the left for 1 yard to the TB37. Tackled by Kawann Short.","(0:15) 45 yard field goal attempt by Graham Gano is NO GOOD. Holder: Michael Palardy.","(1:16) Cam Newton pass to the left to Ted Ginn Jr. for 8 yards to the TB27. Tackled by Kwon Alexander.","(1:59) Jonathan Stewart rush to the right for 3 yards to the TB35. Tackled by Gerald McCoy and Clinton McDonald.","(2:08) Penalty: Pass Interference on Carolina (Greg Olsen) -10 yards.","(2:53) Cam Newton sacked at TB28 for a loss of 12 yards by Lavonte David.","(2:58) Jameis Winston pass intended for Adam Humphries INTERCEPTED by James Bradberry and returned for 5 yards.","(2:58) Penalty: False Start on Tampa Bay (Kevin Pamphile) -5 yards.","(3:12) Michael Palardy punts for 47 yards to TB26. Adam Humphries return for 7 yards to TB33. Tackled by Travell Dixon. Penalty: Illegal Block on Tampa Bay (Josh Robinson) -10 yards.","(3:17) Cam Newton incomplete pass to the left intended for Brenton Bersin.","(3:58) Fozzy Whittaker rush to the left for no gain to the Car27. Tackled by Robert Ayers Jr. and Vernon Hargreaves III.","(4:43) Cam Newton pass to the left to Jonathan Stewart for 7 yards to the Car27. Tackled by Keith Tandy.","(5:24) Cam Newton pass to the middle to Brenton Bersin for 10 yards to the Car20. Tackled by Keith Tandy and Kwon Alexander.","(6:04) Jonathan Stewart rush to the left for no gain to the Car10. Tackled by Keith Tandy.","(6:39) Jonathan Stewart rush to the right for 2 yards to the Car10. Tackled by Gerald McCoy and DaVonte Lambert.","(6:46) Bryan Anger punts for 35 yards to Car8. No return.","(6:52) Jameis Winston incomplete pass to the left intended for Adam Humphries defensed by Kawann Short.","(6:59) Jameis Winston incomplete pass to the left intended for Mike Evans.","(7:23) Jacquizz Rodgers rush to the left for no gain to the Car43. Tackled by Shaq Thompson.","(7:55) Jacquizz Rodgers rush to the right for 26 yards to the Car43. Tackled by Michael Griffin.","(8:22) Jameis Winston pass to the right to Adam Humphries for 6 yards to the TB31. Tackled by Michael Griffin.","(8:22) Graham Gano kicks off to the endzone. Touchback.","(8:22) Graham Gano extra point is good.","(8:26) Jonathan Stewart rush to the right for 2 yards for a TOUCHDOWN.","(9:12) Jonathan Stewart rush to the right for 8 yards to the TB2. Tackled by Daryl Smith and Bradley McDougald.","(9:42) Jonathan Stewart rush to the right for 13 yards to the TB10. Tackled by Keith Tandy.","(10:10) Cam Newton pass to the right to Ted Ginn Jr. for 22 yards to the TB23. Tackled by Vernon Hargreaves III.","(10:30) Ted Ginn Jr. rush to the left for 17 yards to the TB45. Tackled by Vernon Hargreaves III.","(11:02) Cam Newton pass to the left to Greg Olsen for 13 yards to the Car38. Tackled by Bradley McDougald and Keith Tandy.","(11:02) Roberto Aguayo kicks off to the endzone. Touchback.","(11:05) Roberto Aguayo 33 yard field goal attempt is GOOD. Holder: Bryan Anger.","(11:11) Jameis Winston incomplete pass to the left intended for Russell Shepard.","(11:47) Jameis Winston pass to the right to Adam Humphries for 3 yards to the Car15. Tackled by James Bradberry.","(12:28) Jacquizz Rodgers rush to the right for no gain to the Car18. Tackled by Kyle Love.","(13:07) Jameis Winston rush to the right for 10 yards to the Car18. Tackled by Kyle Love.","(13:40) Jacquizz Rodgers rush to the right for 3 yards to the Car28. Tackled by Michael Griffin.","(14:10) Jameis Winston pass to the left to Adam Humphries for 28 yards to the Car31. Tackled by Michael Griffin.","(14:15) Jameis Winston incomplete pass to the right intended for Russell Shepard defensed by Daryl Worley.","(14:21) Jameis Winston incomplete pass to the right intended for Mike Evans.","(15:00) Jacquizz Rodgers rush to the left for 16 yards to the TB41. Tackled by James Bradberry.","(15:00) Graham Gano kicks off to the endzone. Touchback."]