["(0:34) Sean Mannion rush to the right for a loss of 1 yard to the LA17. Tackled by D.J. Swearinger and Sio Moore. FUMBLE, recovered by LA (Malcolm Brown).","(1:14) Malcolm Brown rush to the right for 4 yards to the LA18. Tackled by Rodney Gunter.","(1:46) Malcolm Brown rush to the right for no gain to the LA14. Tackled by Kareem Martin.","(1:54) Drew Stanton pass intended for Brittan Golden INTERCEPTED by T.J. McDonald. No return. Tackled by Brittan Golden.","(2:00) Drew Stanton incomplete pass to the middle intended for Darren Fells.","(2:00) Two Minute Warning.","(2:29) Drew Stanton pass to the left to Brittan Golden for no gain to the LA35. Tackled by Mike Jordan.","(3:11) Kerwynn Williams rush to the left for 2 yards to the LA35. Tackled by Mike Jordan.","(4:01) Drew Stanton pass to the right to Jeremy Ross for 8 yards to the LA37. Tackled by Trumaine Johnson.","(4:46) Kerwynn Williams rush to the left for 5 yards to the LA45. Tackled by Alec Ogletree.","(4:53) Sean Mannion incomplete pass to the left intended for Brian Quick defensed by Marcus Cooper.","(5:32) Malcolm Brown rush to the right for no gain to the LA50. Tackled by Kareem Martin.","(6:11) Malcolm Brown rush to the right for 4 yards to the LA50. Tackled by Justin Bethel.","(6:54) Todd Gurley rush to the right for 5 yards to the LA46. Tackled by Kareem Martin and Kevin Minter.","(7:29) Todd Gurley rush to the left for 8 yards to the LA41. Tackled by Sio Moore.","(8:06) Todd Gurley rush to the right for 8 yards to the LA33. Tackled by Sio Moore.","(8:06) Chandler Catanzaro kicks off to the endzone. Touchback.","(8:06) Chandler Catanzaro extra point is good.","(8:15) Sean Mannion pass intended for Pharoh Cooper INTERCEPTED by Justin Bethel and returned for 66 yards for a TOUCHDOWN.","(8:46) Penalty: False Start on Los Angeles (Tim Barnes) -5 yards.","(9:28) Sean Mannion pass to the left to Lance Kendricks for 9 yards to the Ari29. Tackled by Marcus Cooper and Kevin Minter.","(10:13) Sean Mannion pass to the middle to Pharoh Cooper for 3 yards to the Ari38. Tackled by Justin Bethel.","(10:17) Sean Mannion incomplete pass to the right intended for Lance Kendricks.","(10:26) Penalty: Pass Interference on Arizona (Patrick Peterson) 21 yards.","(11:04) Todd Gurley rush to the left for 6 yards to the LA38. Tackled by Rodney Gunter.","(11:35) Sean Mannion pass to the right to Pharoh Cooper for 7 yards to the LA32. Tackled by Justin Bethel.","(11:35) Chandler Catanzaro kicks off to the endzone. Touchback.","(11:35) Chandler Catanzaro extra point is good.","(11:40) Carson Palmer pass to the right to Larry Fitzgerald for 5 yards for a TOUCHDOWN.","(12:19) Andre Ellington rush to the left for 3 yards to the LA5. Tackled by Michael Brockers.","(12:26) Carson Palmer incomplete pass to the middle intended for John Brown.","(12:31) Penalty: Leaping on Los Angeles (Cody Davis) 8 yards.","(12:35) Carson Palmer incomplete pass to the right intended for J.J. Nelson.","(13:18) Kerwynn Williams rush to the right for 3 yards to the LA16. Tackled by Mark Barron.","(13:23) Carson Palmer incomplete pass to the middle intended for Kerwynn Williams.","(13:33) Jared Goff pass to the left to Tavon Austin for 10 yards to the LA19. Tackled by Sio Moore. FUMBLE, recovered by Ari (Justin Bethel). Tackled by Pharoh Cooper.","(14:10) Jared Goff sacked at LA9 for a loss of 13 yards by D.J. Swearinger.","(14:17) Matt Wile punts for 47 yards to LA22. Tavon Austin - no return.","(14:24) Carson Palmer incomplete pass to the left intended for John Brown.","(15:00) Penalty: Holding on Arizona (Earl Watford) -10 yards.","(0:35) Andre Ellington rush to the left for no gain to the Ari41. Tackled by Mark Barron.","(1:18) Andre Ellington rush to the right for 3 yards to the Ari41. Tackled by Ethan Westbrooks.","(2:06) Carson Palmer pass to the right to Jeremy Ross for 15 yards to the Ari38. Tackled by Mark Barron.","(2:50) Kerwynn Williams rush to the left for 3 yards to the Ari23. Tackled by Ethan Westbrooks.","(3:00) Johnny Hekker punts for 43 yards to Ari20. No return.","(3:04) Jared Goff incomplete pass to the middle intended for Pharoh Cooper defensed by Chandler Jones.","(3:04) Los Angeles Rams timeout.","(3:57) Jared Goff sacked at LA37 for a loss of 8 yards by Markus Golden and Rodney Gunter. FUMBLE, recovered by LA (Greg Robinson).","(4:00) Jared Goff incomplete pass to the right intended for Tavon Austin defensed by Markus Golden.","(4:42) Jared Goff pass to the right to Brian Quick for 10 yards to the LA45. Tackled by Marcus Cooper.","(5:19) Todd Gurley rush to the left for 8 yards to the LA35. Tackled by Sio Moore.","(5:41) Penalty: False Start on Los Angeles (Nicholas Grigsby) -5 yards.","(6:01) Johnny Hekker pass to the left to Chase Reynolds for 4 yards to the LA32. Tackled by Christian Bryant.","(6:44) Jared Goff pass to the left to Pharoh Cooper for 23 yards to the LA28. Tackled by Harlan Miller.","(7:30) Jared Goff pass to the right to Todd Gurley for a loss of 6 yards to the LA5. Tackled by Kevin Minter.","(8:13) Jared Goff sacked at LA11 for a loss of 8 yards by Calais Campbell.","(8:17) Chandler Catanzaro kicks off to the LA-6. Pharoh Cooper return for 25 yards to LA19. Tackled by Scooby Wright III and Harlan Miller.","(8:17) Chandler Catanzaro extra point is good.","(8:22) Kerwynn Williams rush up the middle for 1 yard for a TOUCHDOWN.","(8:27) Carson Palmer incomplete pass to the right intended for Jermaine Gresham.","(9:02) Andre Ellington rush to the right for 3 yards to the LA1. Tackled by T.J. McDonald and Alec Ogletree.","(9:14) Los Angeles Rams timeout.","(9:14) Carson Palmer pass to the left to J.J. Nelson for 32 yards to the LA4.","(9:14) Arizona Cardinals timeout.","(9:39) Carson Palmer pass to the left to Andre Ellington for 4 yards to the LA36. Tackled by E.J. Gaines.","(9:39) Arizona Cardinals timeout.","(10:22) Kerwynn Williams rush up the middle for 2 yards to the LA40. Tackled by Eugene Sims.","(11:04) Kerwynn Williams rush to the left for no gain to the LA42. Tackled by Blake Countess and Maurice Alexander.","(11:44) Kerwynn Williams rush to the right for 15 yards to the LA42. Tackled by Trumaine Johnson.","(11:54) Johnny Hekker punts for 47 yards to Ari48. Patrick Peterson return for a loss of 5 yards to Ari43. Tackled by Mike Thomas. FUMBLE, recovered by Ari (Patrick Peterson).","(12:18) Jared Goff sacked at LA5 for a loss of 13 yards by Chandler Jones. FUMBLE, recovered by LA.","(12:25) Jared Goff incomplete pass to the left intended for Tavon Austin.","(13:05) Todd Gurley rush to the left for no gain to the LA18. Tackled by D.J. Swearinger.","(13:11) Chandler Catanzaro kicks off to the LA13. Pharoh Cooper return for 5 yards to LA18. Tackled by Hakeem Valles.","(13:11) Chandler Catanzaro extra point is good.","(13:20) Carson Palmer pass to the left to Darren Fells for 37 yards for a TOUCHDOWN.","(13:33) Johnny Hekker punts for 44 yards to Ari46. Patrick Peterson return for 17 yards to LA37. Tackled by Chase Reynolds.","(14:09) Jared Goff sacked at LA10 for a loss of 14 yards by Calais Campbell and Chandler Jones.","(14:52) Todd Gurley rush to the left for no gain to the LA24. Tackled by Corey Peters.","(14:56) Jared Goff incomplete pass to the right intended for Brian Quick.","(15:00) Chandler Catanzaro kicks off to the LA-5. Pharoh Cooper return for 29 yards to LA24. Tackled by Patrick Peterson.","(0:01) Chandler Catanzaro 47 yard field goal attempt is GOOD. Holder: Matt Wile.","(0:07) Carson Palmer pass to the right to Andre Ellington for 4 yards to the LA44. Tackled by Trumaine Johnson. Penalty: Unnecessary Roughness on Los Angeles (Trumaine Johnson) 15 yards.","(0:07) Arizona Cardinals timeout.","(0:13) Carson Palmer pass to the right to Larry Fitzgerald for 5 yards to the LA48. Tackled by Maurice Alexander.","(0:26) Carson Palmer pass to the middle to John Brown for 9 yards to the Ari47. Tackled by Blake Countess.","(0:26) Arizona Cardinals timeout.","(0:34) Carson Palmer pass to the left to J.J. Nelson for 16 yards to the Ari38. Tackled by Alec Ogletree.","(0:34) Los Angeles Rams timeout.","(0:40) Carson Palmer sacked at Ari22 for a loss of 3 yards by William Hayes.","(0:48) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(0:48) Greg Zuerlein kicks off to the endzone. Touchback.","(0:53) Greg Zuerlein 36 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(1:00) Jared Goff pass to the left to Todd Gurley for 14 yards to the Ari18. Tackled by Kevin Minter.","(1:06) Jared Goff pass to the right to Lance Kendricks for 3 yards to the Ari32. Tackled by Justin Bethel.","(1:12) Penalty: Holding on Los Angeles (Jamon Brown) -10 yards.","(1:59) Todd Gurley rush to the left for a loss of 6 yards to the Ari25. Tackled by Justin Bethel.","(1:59) Two Minute Warning.","(2:06) Matt Wile punt blocked by Chase Reynolds. Returned by Kerwynn Williams to the Ari19. Tackled by Blake Countess.","(2:10) Carson Palmer incomplete pass to the right intended for Jermaine Gresham.","(2:13) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(2:34) Andre Ellington rush to the left for 7 yards to the Ari32. Tackled by Alec Ogletree.","(2:34) Greg Zuerlein kicks off to the endzone. Touchback.","(2:39) Greg Zuerlein 37 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(2:46) Jared Goff incomplete pass to the left intended for Brian Quick defensed by Marcus Cooper.","(3:33) Tavon Austin rush to the right for a loss of 1 yard to the Ari19. Tackled by Harlan Miller.","(4:11) Jared Goff pass to the left to Tavon Austin for 8 yards to the Ari18. Tackled by Patrick Peterson.","(4:48) Jared Goff pass to the right to Mike Thomas for 15 yards to the Ari26. Tackled by Harlan Miller.","(5:29) Todd Gurley rush to the right for 2 yards to the Ari41. Tackled by Josh Mauro.","(5:39) Penalty: Illegal Motion on Los Angeles (Jared Goff) -5 yards.","(6:27) Jared Goff pass to the right to Todd Gurley for 29 yards to the Ari38. Tackled by Harlan Miller.","(7:04) Tavon Austin rush to the left for 3 yards to the LA33. Tackled by Justin Bethel.","(7:42) Todd Gurley rush to the right for 5 yards to the LA30. Tackled by Sio Moore.","(7:42) Chandler Catanzaro kicks off to the endzone. Touchback.","(7:42) Chandler Catanzaro extra point is good.","(7:47) Carson Palmer pass to the left to Jeremy Ross for 4 yards for a TOUCHDOWN.","(8:32) Kerwynn Williams rush up the middle for a loss of 1 yard to the LA4. Tackled by William Hayes.","(9:08) Carson Palmer pass to the left to J.J. Nelson for 20 yards to the LA3. Tackled by Maurice Alexander.","(9:41) Kerwynn Williams rush to the left for 21 yards to the LA23. Tackled by E.J. Gaines.","(9:47) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald.","(10:11) Penalty: Offside on Los Angeles (Alec Ogletree) 5 yards.","(10:46) Carson Palmer pass to the right to John Brown for 16 yards to the LA49.","(10:55) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(11:03) Johnny Hekker punts for 47 yards to Ari35. No return.","(11:35) Jared Goff pass to the right to Paul McRoberts for 6 yards to the LA18. Tackled by Brandon Williams.","(11:39) Jared Goff incomplete pass to the left intended for Brian Quick.","(12:17) Malcolm Brown rush to the right for 3 yards to the LA12. Tackled by Calais Campbell and Kevin Minter.","(12:25) Chandler Catanzaro kicks off to the LA-5. Pharoh Cooper return for 14 yards to LA9. Tackled by Justin Bethel.","(12:30) Chandler Catanzaro 34 yard field goal attempt is GOOD. Holder: Matt Wile.","(12:35) Carson Palmer incomplete pass to the right intended for J.J. Nelson.","(13:17) Kerwynn Williams rush to the right for 4 yards to the LA16. Tackled by Mark Barron.","(13:22) Carson Palmer incomplete pass to the middle intended for J.J. Nelson.","(13:58) Carson Palmer pass to the right to Jeremy Ross for 10 yards to the LA20. Tackled by Blake Countess.","(14:32) Kerwynn Williams rush up the middle for 5 yards to the LA30. Tackled by Blake Countess.","(14:51) Pharoh Cooper pass intended for Todd Gurley INTERCEPTED by Harlan Miller and returned for 52 yards. Tackled by Todd Gurley and Pharoh Cooper.","(15:00) Carson Palmer pass intended for J.J. Nelson INTERCEPTED by Maurice Alexander and returned for 19 yards. Tackled by J.J. Nelson.","(0:25) Andre Ellington rush to the right for 2 yards to the Ari32. Tackled by T.J. McDonald.","(0:33) Carson Palmer incomplete pass to the left intended for Andre Ellington.","(0:37) Penalty: Pass Interference on Los Angeles (Dominique Easley) 3 yards.","(1:13) Andre Ellington rush to the left for no gain to the Ari27. Tackled by Morgan Fox.","(1:28) Johnny Hekker punts for 73 yards to Ari13. Patrick Peterson return for 14 yards to Ari27. Tackled by Cory Littleton.","(1:28) Penalty: False Start on Los Angeles (Jake McQuaide) -5 yards.","(2:14) Jared Goff sacked at LA19 for a loss of 10 yards by Markus Golden.","(2:39) Jared Goff pass to the left to Todd Gurley for no gain to the LA29. Tackled by D.J. Swearinger.","(3:23) Todd Gurley rush to the left for 3 yards to the LA29. Tackled by D.J. Swearinger.","(3:36) Matt Wile punts for 54 yards to LA8. Tavon Austin return for 18 yards to LA26. Tackled by Aaron Brewer.","(4:10) Carson Palmer pass to the right to Larry Fitzgerald for no gain to the Ari38. Tackled by T.J. McDonald.","(4:39) David Johnson rush to the left for a loss of 3 yards to the Ari38. Tackled by Eugene Sims.","(5:13) Carson Palmer pass to the right to J.J. Nelson for 7 yards to the Ari41. Tackled by Trumaine Johnson.","(5:43) Carson Palmer pass to the middle to David Johnson for 17 yards to the Ari34. Tackled by Blake Countess and T.J. McDonald.","(5:54) Johnny Hekker punts for 37 yards to Ari17. No return.","(6:29) Jared Goff pass to the left to Pharoh Cooper for 3 yards to the LA46. Tackled by D.J. Swearinger.","(6:36) Jared Goff incomplete pass to the left intended for Brian Quick.","(7:10) Todd Gurley rush to the left for 3 yards to the LA43. Tackled by Sio Moore.","(7:17) Penalty: Roughing Passer on Arizona (Kevin Minter) 15 yards.","(7:51) Todd Gurley rush to the right for no gain to the LA25. Tackled by Josh Mauro.","(8:07) Matt Wile punts for 46 yards to LA25. Tavon Austin - no return. FUMBLE, recovered by LA (Tavon Austin).","(8:11) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald defensed by Aaron Donald.","(8:17) Carson Palmer incomplete pass to the left intended for David Johnson.","(8:54) David Johnson rush to the left for 2 yards to the Ari29. Tackled by Dominique Easley.","(9:04) Johnny Hekker punts for 46 yards to Ari32. Patrick Peterson - no return. Tackled by Cory Littleton. Penalty: Illegal Fair Catch on Arizona (Patrick Peterson) -5 yards.","(9:20) Jared Goff sacked at LA22 for a loss of 6 yards by Markus Golden.","(9:59) Todd Gurley rush to the right for a loss of 2 yards to the LA28. Tackled by Josh Mauro.","(10:34) Jared Goff pass to the left to Brian Quick for 5 yards to the LA30. Tackled by Marcus Cooper.","(10:34) Chandler Catanzaro kicks off to the endzone. Touchback.","(10:39) Chandler Catanzaro 32 yard field goal attempt is GOOD. Holder: Matt Wile.","(10:44) Carson Palmer incomplete pass to the left intended for Brittan Golden.","(10:49) Carson Palmer incomplete pass to the left intended for J.J. Nelson defensed by Mark Barron.","(11:28) David Johnson rush to the left for 1 yard to the LA14. Tackled by Cam Thomas and Blake Countess.","(12:06) Carson Palmer pass to the middle to Larry Fitzgerald for 11 yards to the LA15. Tackled by Maurice Alexander.","(12:46) Carson Palmer pass to the left to David Johnson for 9 yards to the LA26. Tackled by Blake Countess and Mark Barron.","(13:21) David Johnson rush up the middle for a loss of 1 yard to the LA35. Tackled by T.J. McDonald.","(13:55) Carson Palmer pass to the right to Larry Fitzgerald for 22 yards to the LA34. Tackled by Trumaine Johnson.","(14:24) Carson Palmer pass to the left to David Johnson for 12 yards to the Ari44. Tackled by E.J. Gaines.","(15:00) David Johnson rush to the left for 7 yards to the Ari32. Tackled by Blake Countess and Maurice Alexander.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback."]