["(0:00) Eli Manning 2 pt rush attempt.","(0:06) Kirk Cousins pass to the middle to Jordan Reed for 5 yards to the Was11. FUMBLE, recovered by NYG (Trevin Wade) and returned for 11 yards for a TOUCHDOWN.","(0:18) Brad Wing punts for 34 yards to Was5. Jamison Crowder return for 1 yard to Was6. Tackled by Zak DeOssie.","(0:18) New York Giants timeout.","(1:03) Rashad Jennings rush up the middle for 5 yards to the Was39. Tackled by Ricky Jean Francois and Will Blackmon.","(1:03) Washington Redskins timeout.","(1:08) Rashad Jennings rush to the right for 2 yards to the Was44. Tackled by Preston Smith and Duke Ihenacho.","(1:08) Washington Redskins timeout.","(1:12) Rashad Jennings rush up the middle for 1 yard to the Was46. Tackled by Josh Norman.","(1:27) Kirk Cousins pass intended for Pierre Garcon INTERCEPTED by Dominique Rodgers-Cromartie and returned for 28 yards.","(1:27) Washington Redskins timeout.","(1:37) Kirk Cousins pass to the right to Chris Thompson for 11 yards to the NYG43. Tackled by Leon Hall and Trevin Wade.","(2:00) Kirk Cousins pass to the right to Chris Thompson for 7 yards to the Was46. Tackled by Leon Hall.","(2:00) Two Minute Warning.","(2:08) Kirk Cousins pass to the right to Pierre Garcon for 3 yards to the Was39. Tackled by Trevin Wade.","(2:12) Kirk Cousins pass to the right to DeSean Jackson for 11 yards to the Was36.","(2:12) Robbie Gould kicks off to the endzone. Touchback.","(2:17) Robbie Gould 40 yard field goal attempt is GOOD. Holder: Brad Wing.","(2:24) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(3:11) Rashad Jennings rush to the right for no gain to the Was22. Tackled by Chris Baker and Trent Murphy.","(3:58) Paul Perkins rush to the left for 3 yards to the Was22. Tackled by Ricky Jean Francois and Preston Smith.","(4:02) Eli Manning pass to the left to Tavarres King for 44 yards to the Was25. Tackled by Will Blackmon.","(4:40) Eli Manning pass to the left to Victor Cruz for 6 yards to the NYG31. Tackled by Greg Toler and Will Blackmon.","(5:26) Eli Manning pass to the right to Will Tye for 5 yards to the NYG25. Tackled by Mason Foster.","(6:01) Paul Perkins rush to the left for no gain to the NYG20. Tackled by Mason Foster.","(6:13) Tress Way punts for 59 yards to NYG10. Dwayne Harris return for 10 yards to NYG20. Tackled by Deshazor Everett.","(6:21) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(6:26) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(6:35) Kirk Cousins incomplete pass to the right intended for Vernon Davis defensed by Jonathan Casillas.","(6:44) Brad Wing punts for 49 yards to Was31. No return.","(7:23) Eli Manning sacked at NYG20 for a loss of 9 yards by Cullen Jenkins.","(8:05) Paul Perkins rush up the middle for 4 yards to the NYG29. Tackled by Duke Ihenacho.","(8:13) Eli Manning incomplete pass to the right intended for Victor Cruz.","(8:13) Dustin Hopkins kicks off to the endzone. Touchback.","(8:13) Dustin Hopkins extra point is good.","(8:17) Kirk Cousins pass to the right to Jordan Reed for 1 yard for a TOUCHDOWN.","(8:42) Kirk Cousins pass to the right to Pierre Garcon for 21 yards to the NYG3. Tackled by Landon Collins. Penalty: Unsports. Conduct on New York (Landon Collins) 2 yards.","(8:48) Kirk Cousins incomplete pass to the right intended for Chris Thompson.","(9:10) Penalty: Holding on Washington (Morgan Moses) -10 yards.","(9:43) Rob Kelley rush to the right for 3 yards to the NYG14. Tackled by Dominique Rodgers-Cromartie and Jonathan Casillas.","(10:14) Kirk Cousins pass to the left to Vernon Davis for 18 yards to the NYG17. Tackled by Eli Apple.","(10:55) Kirk Cousins pass to the right to Maurice Harris for 15 yards to the NYG35. Tackled by Eli Apple.","(11:32) Rob Kelley rush to the right for 6 yards to the Was50. Tackled by Keenan Robinson.","(12:12) Rob Kelley rush up the middle for 5 yards to the Was44. Tackled by Jonathan Casillas and Robert Thomas.","(12:44) Kirk Cousins pass to the right to Jamison Crowder for 11 yards to the Was39.","(12:50) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(13:27) Chris Thompson rush to the left for 4 yards to the Was28. Tackled by Keenan Robinson.","(13:35) Brad Wing punts for 42 yards to Was24. No return.","(14:24) Paul Perkins rush to the left for 1 yard to the NYG34. Tackled by Mason Foster.","(15:00) Paul Perkins rush to the left for 1 yard to the NYG33. Tackled by Trent Murphy and Will Compton.","(0:25) Sterling Shepard rush to the right for 7 yards to the NYG32. Tackled by Mason Foster.","(0:25) Dustin Hopkins kicks off to the endzone. Touchback.","(0:30) Dustin Hopkins 32 yard field goal attempt is GOOD. Holder: Tress Way.","(1:14) Kirk Cousins pass to the right to Chris Thompson for no gain to the NYG14. Tackled by Jonathan Casillas and Landon Collins.","(1:24) Kirk Cousins incomplete pass to the left.","(2:02) Rob Kelley rush to the right for 2 yards to the NYG14. Tackled by Damon Harrison.","(2:36) Kirk Cousins pass to the right to Vernon Davis for 31 yards to the NYG16. Tackled by Landon Collins.","(2:48) Brad Wing punts for 55 yards to Was34. Jamison Crowder return for 19 yards to NYG47. Tackled by Zak DeOssie.","(3:23) Rashad Jennings rush to the right for 4 yards to the NYG11. Tackled by Trent Murphy.","(3:28) Eli Manning incomplete pass to the middle intended for Will Tye.","(4:06) Rashad Jennings rush up the middle for 2 yards to the NYG7. Tackled by Ricky Jean Francois.","(4:13) Kirk Cousins pass intended for Maurice Harris INTERCEPTED by Dominique Rodgers-Cromartie. No return.","(5:01) Kirk Cousins pass to the left to Pierre Garcon for 49 yards to the NYG23. Tackled by Trevin Wade and Dominique Rodgers-Cromartie.","(5:36) Rob Kelley rush to the right for 1 yard to the Was28. Tackled by Olivier Vernon.","(6:09) Rob Kelley rush to the right for 7 yards to the Was27. Tackled by Keenan Robinson.","(6:19) Brad Wing punts for 51 yards to Was0. Touchback.","(6:54) Eli Manning pass to the right to Victor Cruz for 1 yard to the NYG49. Tackled by Bashaud Breeland.","(7:31) Rashad Jennings rush up the middle for 2 yards to the NYG48. Tackled by Ziggy Hood and Chris Baker.","(7:43) Penalty: Holding on New York (Ereck Flowers) -10 yards.","(8:18) Rashad Jennings rush to the left for 5 yards to the Was44. Tackled by Mason Foster.","(8:33) Tress Way punts for 49 yards to NYG45. Dwayne Harris return for 6 yards to Was49. Tackled by Terence Garvin and Duke Ihenacho.","(9:09) Kirk Cousins sacked at Was6 for a loss of 10 yards by Leon Hall and Devon Kennard.","(9:47) Chris Thompson rush to the right for no gain to the Was16. Tackled by Eli Apple and Jonathan Casillas.","(9:54) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(9:58) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by Mason Foster.","(10:45) Paul Perkins rush to the left for 1 yard to the Was16. Tackled by Mason Foster and Lynden Trail.","(11:29) Rashad Jennings rush up the middle for 3 yards to the Was17. Tackled by Chris Baker and Ricky Jean Francois.","(12:04) Rashad Jennings rush up the middle for 4 yards to the Was20. Tackled by Duke Ihenacho.","(12:38) Eli Manning pass to the left to Sterling Shepard for 12 yards to the Was24. Tackled by Greg Toler.","(13:08) Paul Perkins rush to the left for 14 yards to the Was36. Tackled by Duke Ihenacho.","(13:30) Penalty: Holding on New York (Larry Donnell) -10 yards.","(13:48) Paul Perkins rush to the left for 8 yards to the NYG45. Tackled by Duke Ihenacho. Penalty: Unsports. Conduct on Washington (Josh Norman) 15 yards.","(14:28) Paul Perkins rush to the left for 5 yards to the NYG37. Tackled by Mason Foster and Duke Ihenacho.","(15:00) Paul Perkins rush to the left for 7 yards to the NYG32. Tackled by Ziggy Hood and Preston Smith.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback.","(0:01) 57 yard field goal attempt by Dustin Hopkins is NO GOOD. Holder: Tress Way.","(0:01) Washington Redskins timeout.","(0:08) Kirk Cousins pass to the right to DeSean Jackson for 23 yards to the NYG39. Tackled by Trevin Wade.","(0:08) Washington Redskins timeout.","(0:15) Kirk Cousins pass to the middle to Chris Thompson for 9 yards to the Was38. Tackled by Keenan Robinson.","(0:39) Kirk Cousins pass to the left to Chris Thompson for 2 yards to the Was29. FUMBLE, recovered by Was (Chris Thompson).","(0:39) New York Giants timeout.","(0:49) Brad Wing punts for 40 yards to Was16. Jamison Crowder return for 11 yards to Was27. Tackled by Mark Herzlich and Devon Kennard.","(0:54) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(0:59) Eli Manning incomplete pass to the left intended for Victor Cruz.","(1:06) Eli Manning pass to the middle to Odell Beckham Jr. for 1 yard to the NYG44. Tackled by Bashaud Breeland.","(1:12) Eli Manning pass to the left to Odell Beckham Jr. for 8 yards to the NYG43. Tackled by Josh Norman.","(1:30) Eli Manning pass to the left to Bobby Rainey for 3 yards to the NYG35. Tackled by Duke Ihenacho.","(1:41) Tress Way punts for 52 yards to NYG27. Dwayne Harris return for 5 yards to NYG32. Tackled by Duke Ihenacho.","(1:41) New York Giants timeout.","(1:50) Kirk Cousins sacked at Was21 for a loss of 9 yards by Dominique Rodgers-Cromartie.","(2:00) Kirk Cousins incomplete pass to the middle intended for Chris Thompson defensed by Jonathan Casillas.","(2:00) Two Minute Warning.","(2:40) Rob Kelley rush to the left for 2 yards to the Was30. Tackled by Jonathan Casillas.","(2:53) Brad Wing punts for 44 yards to Was19. Jamison Crowder return for 9 yards to Was28. Tackled by Deontae Skinner.","(3:26) Paul Perkins rush to the right for 6 yards to the NYG37. Tackled by Bashaud Breeland.","(3:48) Penalty: Illegal Use of Hands on New York (Marshall Newhouse) -10 yards.","(3:53) Eli Manning incomplete pass to the middle intended for Paul Perkins.","(4:32) Paul Perkins rush to the left for 2 yards to the NYG41. Tackled by Duke Ihenacho and Ziggy Hood.","(5:03) Eli Manning pass to the right to Will Tye for 24 yards to the NYG39. Tackled by Will Blackmon.","(5:03) New York Giants timeout.","(5:50) Paul Perkins rush up the middle for 6 yards to the NYG15. Tackled by Matt Ioannidis.","(6:29) Paul Perkins rush to the right for no gain to the NYG9. Tackled by Ricky Jean Francois.","(6:37) Tress Way punts for 32 yards to NYG9. No return.","(6:44) Kirk Cousins incomplete pass to the right intended for Jordan Reed.","(7:23) Rob Kelley rush up the middle for 3 yards to the NYG41. Tackled by Johnathan Hankins.","(8:08) Kirk Cousins pass to the right to Jordan Reed for 5 yards to the NYG44. Tackled by Keenan Robinson.","(8:39) Kirk Cousins pass to the right to Jordan Reed for 21 yards to the NYG49. Tackled by Keenan Robinson and Leon Hall.","(8:49) Kirk Cousins incomplete pass to the right intended for Pierre Garcon defensed by Janoris Jenkins.","(9:20) Kirk Cousins pass to the right to Jamison Crowder for 5 yards to the Was30. Tackled by Eli Apple.","(9:20) Robbie Gould kicks off to the endzone. Touchback.","(9:20) Robbie Gould extra point is good.","(9:24) Rashad Jennings rush up the middle for 2 yards for a TOUCHDOWN.","(9:48) Rashad Jennings rush to the left for 2 yards to the Was2. Tackled by Ricky Jean Francois and Chris Baker.","(10:05) Eli Manning pass to the left to Odell Beckham Jr. for 8 yards to the Was7. Tackled by Josh Norman. Penalty: Unnecessary Roughness on Washington (Josh Norman) 3 yards.","(10:45) Rashad Jennings rush to the right for 4 yards to the Was15. Tackled by Ricky Jean Francois.","(11:23) Eli Manning pass to the left to Sterling Shepard for 14 yards to the Was19. Tackled by Mason Foster.","(12:03) Rashad Jennings rush to the left for 2 yards to the Was33. Tackled by Trent Murphy and Greg Toler.","(12:41) Rashad Jennings rush to the left for 6 yards to the Was35. Tackled by Will Compton and Josh Norman.","(13:10) Eli Manning pass to the middle to Odell Beckham Jr. for 12 yards to the Was41. Tackled by Josh Norman.","(13:51) Rashad Jennings rush up the middle for 2 yards to the NYG47. Tackled by Bashaud Breeland.","(14:28) Rashad Jennings rush to the left for 4 yards to the NYG45. Tackled by Mason Foster.","(15:00) Eli Manning pass to the right to Odell Beckham Jr. for 15 yards to the NYG41. Tackled by Mason Foster.","(0:01) Tress Way punts for 56 yards to NYG14. Dwayne Harris return for 12 yards to NYG26. Tackled by Martrell Spaight and Terence Garvin.","(0:37) Kirk Cousins sacked at Was30 for a loss of 12 yards by Landon Collins and Olivier Vernon.","(0:37) Penalty: False Start on Washington (Pierre Garcon) -5 yards.","(0:44) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(1:21) Chris Thompson rush up the middle for 1 yard to the Was47. Tackled by Landon Collins and Jay Bromley.","(1:30) Kirk Cousins pass to the right to Pierre Garcon for 23 yards to the Was46.","(2:12) Rob Kelley rush to the right for a loss of 2 yards to the Was23. Tackled by Landon Collins.","(2:12) Robbie Gould kicks off to the endzone. Touchback.","(2:16) Robbie Gould 22 yard field goal attempt is GOOD. Holder: Brad Wing.","(2:57) Eli Manning pass to the middle to Will Tye for 10 yards to the Was4. Tackled by Will Compton and Mason Foster.","(3:04) Eli Manning incomplete pass to the right. Penalty: Intentional Grounding on New York (Eli Manning) -10 yards.","(3:40) Paul Perkins rush to the right for no gain to the Was4. Tackled by Mason Foster.","(4:05) Eli Manning pass to the left to Sterling Shepard for 4 yards to the Was4. Tackled by Bashaud Breeland.","(4:52) Eli Manning pass to the right to Rashad Jennings for 5 yards to the Was8. Tackled by Ricky Jean Francois and Duke Ihenacho.","(5:32) Rashad Jennings rush up the middle for 2 yards to the Was13. Tackled by Mason Foster.","(6:21) Paul Perkins rush to the left for 22 yards to the Was15. Tackled by Mason Foster and Will Blackmon.","(6:56) Paul Perkins rush to the left for 4 yards to the Was37. Tackled by Mason Foster.","(7:03) Eli Manning incomplete pass to the left intended for Sterling Shepard defensed by Josh Norman.","(7:39) Paul Perkins rush to the right for 7 yards to the Was41. Tackled by Will Blackmon and Mason Foster.","(8:23) Paul Perkins rush to the right for 4 yards to the Was48. Tackled by Duke Ihenacho.","(8:52) Eli Manning pass to the right to Will Tye for 8 yards to the NYG48. Tackled by Mason Foster.","(9:04) Tress Way punts for 45 yards to NYG38. Dwayne Harris return for 2 yards to NYG40. Tackled by Dashaun Phillips and Derek Carrier.","(9:44) Kirk Cousins pass to the left to Chris Thompson for 8 yards to the Was17. Tackled by Devon Kennard.","(10:26) Rob Kelley rush to the left for 5 yards to the Was9. Tackled by Damon Harrison and Jonathan Casillas.","(11:10) Kirk Cousins sacked at Was4 for a loss of 10 yards by Damon Harrison.","(11:26) Brad Wing punts for 48 yards to Was23. Jamison Crowder - no return. Tackled by Bobby Rainey. Penalty: Holding on Washington (Dashaun Phillips) -9 yards.","(11:31) Eli Manning incomplete pass to the left intended for Paul Perkins defensed by Ziggy Hood.","(12:11) Paul Perkins rush to the left for 4 yards to the NYG29. Tackled by Chris Baker.","(12:46) Paul Perkins rush to the left for 3 yards to the NYG25. Tackled by Preston Smith.","(12:57) Tress Way punts for 55 yards to NYG11. Dwayne Harris return for 11 yards to NYG22. Tackled by Deshazor Everett.","(13:35) Rob Kelley rush to the right for no gain to the Was34. Tackled by Kelvin Sheppard and Andrew Adams.","(14:15) Kirk Cousins pass to the left to Jordan Reed for 8 yards to the Was34. Tackled by Keenan Robinson and Landon Collins.","(15:00) Rob Kelley rush to the left for 1 yard to the Was26. Tackled by Damon Harrison and Landon Collins.","(15:00) Robbie Gould kicks off to the endzone. Touchback."]