["(0:29) Ronnie Hillman rush to the left for 2 yards to the SD23. Tackled by Daniel Sorensen.","(0:48) Ronnie Hillman rush up the middle for 17 yards to the SD21. Tackled by Kenneth Acker.","(1:00) Dustin Colquitt punts for 44 yards to SD4. No return.","(1:11) Penalty: Illegal Formation on Kansas City -5 yards.","(1:11) Kansas City Chiefs timeout.","(1:56) Knile Davis rush up the middle for 2 yards to the SD43. Tackled by Kyle Emanuel and Joshua Perry.","(1:56) Two Minute Warning.","(2:02) Knile Davis rush to the left for a loss of 1 yard to the SD45. Tackled by Dwight Lowery.","(2:02) San Diego Chargers timeout.","(2:07) Knile Davis rush up the middle for 2 yards to the SD44. Tackled by Joey Bosa.","(2:08) Josh Lambo onside kickoff to the SD46. Onside kick recovered by receiving team by Chris Conley.","(2:08) Josh Lambo extra point is good.","(2:13) Philip Rivers pass to the right to Hunter Henry for 12 yards for a TOUCHDOWN.","(2:20) Philip Rivers pass to the left to Ronnie Hillman for 19 yards to the KC12. Tackled by Terrance Mitchell.","(2:24) Philip Rivers incomplete pass to the left intended for Ronnie Hillman.","(2:31) Philip Rivers pass to the left to Dontrelle Inman for 18 yards to the KC31. Tackled by Steven Nelson.","(2:40) Philip Rivers incomplete pass to the left intended for Isaiah Burse.","(3:10) Philip Rivers pass to the right to Dontrelle Inman for 19 yards to the KC49. Tackled by Phillip Gaines.","(3:16) Philip Rivers incomplete pass to the right intended for Antonio Gates defensed by Ramik Wilson.","(3:22) Penalty: Illegal Shift on San Diego (Isaiah Burse) -5 yards.","(3:45) Philip Rivers pass to the left to Antonio Gates for 8 yards to the SD37. Tackled by Eric Murray and Ramik Wilson.","(4:16) Philip Rivers rush up the middle for 1 yard to the SD29. Tackled by Ramik Wilson.","(4:24) Philip Rivers pass to the right to Tyrell Williams for 17 yards to the SD28. Tackled by Phillip Gaines.","(4:31) Cairo Santos kicks off to the SD1. Isaiah Burse return for 20 yards to SD21. Tackled by James O'Shaughnessy. Penalty: Unnecessary Roughness on San Diego (Kyle Emanuel) -10 yards.","(4:35) Cairo Santos 37 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(4:35) San Diego Chargers timeout.","(4:40) Alex Smith pass to the middle to Tyreek Hill for 4 yards to the SD19. Tackled by Jatavis Brown.","(5:25) Tyreek Hill rush to the right for a loss of 3 yards to the SD23. Tackled by Trevor Williams.","(6:00) Knile Davis rush up the middle for 2 yards to the SD20. Tackled by Jatavis Brown.","(6:42) Alex Smith pass to the left to Tyreek Hill for 10 yards to the SD22. Tackled by Jatavis Brown.","(7:25) Alex Smith rush to the right for a loss of 4 yards to the SD32. Tackled by Melvin Ingram.","(8:06) Knile Davis rush to the left for 5 yards to the SD28. Tackled by Dwight Lowery.","(8:53) Alex Smith pass to the left to Jeremy Maclin for 12 yards to the SD33. Tackled by Casey Hayward.","(9:36) Charcandrick West rush to the right for 1 yard to the SD45. Tackled by Adrian Phillips and Melvin Ingram.","(10:18) Charcandrick West rush to the right for 4 yards to the SD46. Tackled by Corey Liuget.","(10:19) Josh Lambo onside kickoff to the SD50. Onside kick recovered by receiving team by Daniel Sorensen.","(10:22) Josh Lambo 29 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(10:28) Philip Rivers incomplete pass to the middle intended for Antonio Gates defensed by Daniel Sorensen.","(10:36) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(11:13) Andre Williams rush up the middle for a loss of 3 yards to the KC11. Tackled by Chris Jones.","(11:58) Andre Williams rush to the right for 14 yards to the KC8. Tackled by Chris Jones and Rakeem Nunez-Roches.","(12:38) Philip Rivers pass to the right to Antonio Gates for 20 yards to the KC22. Tackled by Steven Nelson.","(12:43) Philip Rivers incomplete pass to the middle intended for Andre Williams.","(13:24) Andre Williams rush up the middle for 5 yards to the KC42. Tackled by Ramik Wilson.","(14:04) Andre Williams rush to the right for 6 yards to the KC47. Tackled by Ramik Wilson.","(14:25) Penalty: Offside on Kansas City (Chris Jones) 5 yards.","(14:49) Philip Rivers pass to the left to Tyrell Williams for 6 yards to the SD42. Tackled by Marcus Peters.","(14:54) Philip Rivers incomplete pass to the left intended for Geremy Davis defensed by Marcus Peters.","(15:00) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(0:22) Andre Williams rush up the middle for 6 yards to the SD36. Tackled by Rakeem Nunez-Roches.","(0:53) Andre Williams rush up the middle for 5 yards to the SD30. Tackled by Kendall Reyes.","(0:59) Cairo Santos kicks off to the SD3. Isaiah Burse return for 22 yards to SD25. Tackled by Daniel Sorensen.","(0:59) Cairo Santos extra point is good.","(1:20) Drew Kaser punts for 49 yards to KC5. Tyreek Hill return for 95 yards for a TOUCHDOWN.","(1:51) Philip Rivers pass to the left to Ronnie Hillman for 10 yards to the SD46. Tackled by Ramik Wilson.","(1:57) Philip Rivers incomplete pass to the left intended for Isaiah Burse.","(2:23) Penalty: False Start on San Diego (Kenny Wiggins) -5 yards.","(3:06) Andre Williams rush to the left for a loss of 2 yards to the SD41. Tackled by Ramik Wilson.","(3:48) Philip Rivers pass to the right to Tyrell Williams for 18 yards to the SD43. Tackled by Daniel Sorensen.","(3:48) Cairo Santos kicks off to the endzone. Touchback.","(3:48) Cairo Santos extra point is good.","(3:53) Alex Smith pass to the right to Charcandrick West for 2 yards for a TOUCHDOWN.","(3:53) San Diego Chargers timeout.","(3:57) Alex Smith incomplete pass to the middle intended for Demetrius Harris.","(4:02) Alex Smith incomplete pass to the left intended for Tyreek Hill.","(4:24) Alex Smith rush up the middle for 4 yards to the SD5. Tackled by Jatavis Brown. Penalty: Holding on San Diego (Robert McClain) 3 yards.","(4:46) Penalty: False Start on Kansas City (James O'Shaughnessy) -6 yards.","(5:09) Penalty: Offside on San Diego (Corey Liuget) 3 yards.","(5:48) Charcandrick West rush up the middle for 4 yards to the SD6. Tackled by Kyle Emanuel.","(6:28) Alex Smith pass to the left to Anthony Sherman for 2 yards to the SD10. Tackled by Casey Hayward.","(7:01) Alex Smith pass to the right to Chris Conley for 9 yards to the SD12. Tackled by Trevor Williams.","(7:40) Alex Smith rush to the right for 4 yards to the SD21. Tackled by Joshua Perry.","(8:22) Charcandrick West rush to the left for 1 yard to the SD25. Tackled by Casey Hayward and Damion Square.","(9:00) Alex Smith pass to the right to Chris Conley for 15 yards to the SD26. Tackled by Trevor Williams.","(9:40) Charcandrick West rush to the right for a loss of 1 yard to the SD41. Tackled by Melvin Ingram.","(10:23) Alex Smith pass to the right to Tyreek Hill for 20 yards to the SD40. Tackled by Adrian Phillips.","(10:23) Josh Lambo kicks off to the KC2, out of bounds. No return.","(10:23) Josh Lambo extra point is good.","(10:43) Alex Smith pass intended for Knile Davis INTERCEPTED by Jahleel Addae defensed by Melvin Ingram and returned for 90 yards for a TOUCHDOWN.","(11:40) Penalty: Encroachment on San Diego (Damion Square) 5 yards.","(11:40) Charcandrick West rush up the middle for 2 yards to the SD16. Tackled by Jatavis Brown.","(12:19) Tyreek Hill rush to the right for 20 yards to the SD18. Tackled by Kyle Emanuel and Dwight Lowery.","(13:00) Charcandrick West rush to the left for 14 yards to the SD38. Tackled by Joshua Perry.","(13:37) Alex Smith pass to the middle to Jeremy Maclin for 8 yards to the KC48. Tackled by Casey Hayward.","(14:19) Charcandrick West rush to the right for no gain to the KC40. Tackled by Joey Bosa and Damion Square.","(14:53) Alex Smith pass to the left to Tyreek Hill for 6 yards to the KC40. Tackled by Trevor Williams.","(15:00) Josh Lambo kicks off to the KC-5. De'Anthony Thomas return for 34 yards to KC29. Tackled by Jahleel Addae and Adrian Phillips. Penalty: Offside on San Diego (Korey Toomer) 5 yards.","(0:05) Cairo Santos 25 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(0:12) Alex Smith pass to the left to Chris Conley for 17 yards to the SD7. Tackled by Trovon Reed.","(0:12) Kansas City Chiefs timeout.","(0:17) Charcandrick West rush up the middle for 13 yards to the SD24. Tackled by Jahleel Addae and Kyle Emanuel.","(0:26) Alex Smith rush to the right for 3 yards to the SD42. Tackled by Kyle Emanuel. Penalty: Illegal Contact on San Diego (Trovon Reed) 5 yards.","(0:30) Alex Smith pass to the left to Chris Conley for 14 yards to the SD45. Tackled by Trovon Reed.","(0:30) Penalty: Offside on San Diego (Melvin Ingram) 4 yards.","(0:30) Kansas City Chiefs timeout.","(0:34) Alex Smith pass to the middle to Charcandrick West for 6 yards to the KC37. Tackled by Dwight Lowery.","(0:51) Alex Smith pass to the middle to Tyreek Hill for 6 yards to the KC31. Tackled by Jatavis Brown.","(1:10) Charcandrick West rush up the middle for 5 yards to the KC25. Tackled by Trevor Williams.","(1:17) Philip Rivers pass intended for Isaiah Burse INTERCEPTED by Daniel Sorensen. No return. Touchback.","(2:00) Ronnie Hillman rush up the middle for 3 yards to the KC18. Tackled by Dontari Poe and Rakeem Nunez-Roches.","(2:00) Two Minute Warning.","(2:09) Ronnie Hillman rush up the middle for 10 yards to the KC21. Tackled by Daniel Sorensen and Marcus Peters.","(2:47) Andre Williams rush to the right for 3 yards to the KC31. Tackled by Dontari Poe and Ron Parker.","(3:23) Philip Rivers pass to the left to Antonio Gates for 23 yards to the KC34. Tackled by Daniel Sorensen.","(3:57) Ronnie Hillman rush to the right for 3 yards to the SD43. Tackled by Chris Jones.","(4:06) Philip Rivers incomplete pass to the right.","(4:50) Philip Rivers pass to the left to Tyrell Williams for 6 yards to the SD40. Tackled by Terrance Mitchell.","(5:29) Andre Williams rush up the middle for 4 yards to the SD34. Tackled by Ramik Wilson.","(6:09) Andre Williams rush to the right for 5 yards to the SD30. Tackled by Ramik Wilson.","(6:09) Cairo Santos kicks off to the endzone. Touchback.","(6:09) Cairo Santos extra point is good.","(6:14) Alex Smith pass to the right to Charcandrick West for 4 yards for a TOUCHDOWN.","(6:55) Charcandrick West rush up the middle for 2 yards to the SD4. Tackled by Ryan Carrethers and Joshua Perry.","(7:33) Charcandrick West rush up the middle for 2 yards to the SD6. Tackled by Joshua Perry and Corey Liuget.","(8:18) Alex Smith rush to the right for 9 yards to the SD8. Tackled by Dwight Lowery.","(8:23) Penalty: Holding on San Diego (Trevor Williams) 5 yards.","(8:27) Alex Smith incomplete pass to the left intended for Tyreek Hill.","(8:27) Kansas City Chiefs timeout.","(8:32) Alex Smith incomplete pass to the left intended for Travis Kelce.","(9:14) Alex Smith pass to the middle to Travis Kelce for 8 yards to the SD22. Tackled by Kyle Emanuel.","(9:58) Tyreek Hill rush to the left for a loss of 2 yards to the SD30. Tackled by Corey Liuget and Korey Toomer.","(10:35) Charcandrick West rush up the middle for 6 yards to the SD28. Tackled by Jatavis Brown.","(10:43) Philip Rivers pass intended for Dontrelle Inman INTERCEPTED by Marcus Peters and returned for 16 yards. Tackled by Tyrell Williams.","(10:48) Philip Rivers incomplete pass to the left intended for Hunter Henry defensed by Ron Parker.","(11:28) Andre Williams rush up the middle for 2 yards to the SD40. Tackled by Jarvis Jenkins.","(12:11) Andre Williams rush to the left for 7 yards to the SD38. Tackled by Ramik Wilson.","(12:52) Andre Williams rush up the middle for 6 yards to the SD31. Tackled by Eric Berry and Ramik Wilson.","(12:53) Cairo Santos kicks off to the endzone. Touchback.","(12:53) Cairo Santos extra point is good.","(12:58) Alex Smith rush to the left for 5 yards for a TOUCHDOWN.","(13:36) Alex Smith pass to the left to Albert Wilson for 42 yards to the SD5. Tackled by Jahleel Addae.","(14:12) Alex Smith pass to the right to Charcandrick West for 18 yards to the SD47. Tackled by Dwight Lowery.","(14:49) Alex Smith pass to the middle to Jeremy Maclin for 10 yards to the KC35. Tackled by Casey Hayward.","(14:49) Josh Lambo kicks off to the endzone. Touchback.","(14:49) Josh Lambo extra point is good.","(14:55) Philip Rivers pass to the left to Antonio Gates for 2 yards for a TOUCHDOWN.","(15:00) Penalty: Holding on Kansas City (Ron Parker) 3 yards.","(0:09) Philip Rivers pass to the right to Dontrelle Inman for 12 yards to the KC5. Tackled by Ron Parker.","(0:50) Andre Williams rush up the middle for 5 yards to the KC17. Tackled by Ramik Wilson.","(1:18) Philip Rivers pass to the left to Antonio Gates for 2 yards to the KC22. Tackled by Steven Nelson.","(2:00) Philip Rivers pass to the right to Dontrelle Inman for 2 yards to the KC24. Tackled by Marcus Peters.","(2:40) Andre Williams rush up the middle for 5 yards to the KC26. Tackled by Ramik Wilson.","(3:15) Philip Rivers pass to the left to Tyrell Williams for 17 yards to the KC31. Tackled by Terrance Mitchell.","(3:15) San Diego Chargers timeout.","(3:20) Philip Rivers incomplete pass to the right intended for Ronnie Hillman.","(3:46) Philip Rivers pass to the right to Hunter Henry for 12 yards to the KC48. Tackled by Frank Zombo.","(4:28) Ronnie Hillman rush to the left for 3 yards to the SD40. Tackled by Ramik Wilson.","(5:14) Andre Williams rush up the middle for 13 yards to the SD37. Tackled by Eric Berry and Ron Parker.","(5:20) Cairo Santos kicks off to the SD1. Isaiah Burse return for 15 yards to SD24. Tackled by Daniel Sorensen.","(5:23) Cairo Santos 35 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(6:04) Alex Smith sacked at SD16 for a loss of 2 yards by Joey Bosa.","(6:10) Alex Smith incomplete pass to the right intended for Jeremy Maclin.","(6:55) Charcandrick West rush up the middle for a loss of 4 yards to the SD14. Tackled by Joey Bosa.","(7:37) Alex Smith pass to the left to Jeremy Maclin for 23 yards to the SD10. Tackled by Casey Hayward.","(8:22) Knile Davis rush to the right for a loss of 1 yard to the SD33. Tackled by Joey Bosa.","(9:02) Charcandrick West rush to the right for 5 yards to the SD32. Tackled by Casey Hayward and Kyle Emanuel.","(9:28) Alex Smith pass to the left to Charcandrick West for 28 yards to the SD37. Tackled by Trevor Williams.","(9:32) Alex Smith incomplete pass to the left intended for Chris Conley.","(10:05) Charcandrick West rush up the middle for 4 yards to the KC35. Tackled by Corey Liuget and Joshua Perry.","(10:16) Josh Lambo kicks off to the KC4. De'Anthony Thomas return for 27 yards to KC31. Tackled by Jahleel Addae.","(10:20) Josh Lambo 35 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(10:25) Philip Rivers incomplete pass to the left intended for Ronnie Hillman.","(11:11) Ronnie Hillman rush up the middle for 3 yards to the KC17. Tackled by Tamba Hali.","(11:49) Andre Williams rush up the middle for 4 yards to the KC20. Tackled by Chris Jones.","(12:14) Philip Rivers pass to the left to Hunter Henry for 11 yards to the KC24. Tackled by Eric Berry.","(12:20) Philip Rivers incomplete pass to the left intended for Andre Williams.","(12:57) Philip Rivers pass to the middle to Hunter Henry for 8 yards to the KC35. Tackled by Frank Zombo.","(13:43) Philip Rivers pass to the left to Tyrell Williams for 6 yards to the KC43. Tackled by Terrance Mitchell.","(14:22) Andre Williams rush up the middle for 2 yards to the KC49. Tackled by Rakeem Nunez-Roches.","(14:54) Philip Rivers pass to the left to Ronnie Hillman for 21 yards to the SD49. Tackled by Terrance Smith.","(15:00) Cairo Santos kicks off to the SD-2. Isaiah Burse return for 30 yards to SD28. Tackled by Anthony Sherman."]