["(0:37) Matt Ryan rush up the middle for a loss of 1 yard to the NO47.","(0:39) Wil Lutz onside kickoff to the NO46. Onside kick recovered by receiving team by Mohamed Sanu.","(0:39) Wil Lutz extra point is good.","(0:45) Drew Brees pass to the right to Travaris Cadet for 3 yards for a TOUCHDOWN.","(0:45) Drew Brees incomplete pass to the middle.","(1:01) Drew Brees pass to the right to Michael Thomas for 9 yards to the Atl3. Tackled by Keanu Neal and De'Vondre Campbell.","(1:06) Drew Brees incomplete pass to the right intended for Coby Fleener defensed by De'Vondre Campbell.","(1:06) New Orleans Saints timeout.","(1:14) Drew Brees pass to the middle to Mark Ingram for 5 yards to the Atl12. Tackled by Deion Jones.","(1:35) Mark Ingram rush to the right for 9 yards to the Atl17. Tackled by C.J. Goodwin.","(1:39) Drew Brees incomplete pass to the left intended for Brandon Coleman.","(2:00) Drew Brees pass to the middle to Travaris Cadet for 4 yards to the Atl26. Tackled by De'Vondre Campbell.","(2:00) Two Minute Warning.","(2:12) Drew Brees pass to the right to Michael Thomas for 5 yards to the Atl30. Tackled by C.J. Goodwin.","(2:13) Atlanta Falcons timeout.","(2:20) Drew Brees pass to the right to Michael Thomas for 17 yards to the Atl35. Tackled by Jalen Collins.","(2:25) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(2:30) Drew Brees incomplete pass to the middle intended for Travaris Cadet defensed by Deion Jones.","(2:46) Drew Brees pass to the right to Coby Fleener for 5 yards to the NO48. Tackled by Deji Olatoye.","(2:47) Wil Lutz onside kickoff to the NO43. Onside kick recovered by kicking team by Brandin Cooks.","(2:47) Drew Brees 2 pt conversion pass is NO GOOD - intended for Tim Hightower.","(2:50) Mark Ingram rush to the right for 1 yard for a TOUCHDOWN.","(3:31) Mark Ingram rush to the right for 1 yard to the Atl1. Tackled by C.J. Goodwin.","(4:13) Mark Ingram rush to the right for 8 yards to the Atl2. Tackled by Ricardo Allen and De'Vondre Campbell.","(4:56) Mark Ingram rush to the right for 38 yards to the Atl10. Tackled by Ricardo Allen and Brian Poole.","(5:05) Mark Ingram rush to the right for 2 yards to the Atl48. Tackled by Sharrod Neasman.","(5:16) Matt Bosher punts for 47 yards to NO31. Tommylee Lewis return for 4 yards to NO35. Tackled by C.J. Goodwin. Penalty: Unnecessary Roughness on Atlanta (Courtney Upshaw) 15 yards.","(5:16) New Orleans Saints timeout.","(5:22) Matt Ryan pass to the right to Mohamed Sanu for a loss of 3 yards to the Atl22. Tackled by Vonn Bell.","(6:08) Devonta Freeman rush to the left for 1 yard to the Atl25. Tackled by Dannell Ellerbe and David Onyemata.","(6:52) Devonta Freeman rush to the left for 4 yards to the Atl24. Tackled by Jairus Byrd.","(6:58) Drew Brees pass intended for Michael Thomas INTERCEPTED by Jalen Collins. No return. Touchback.","(7:34) Drew Brees pass to the left to Michael Thomas for 5 yards to the Atl9. Tackled by Ricardo Allen.","(8:04) Drew Brees pass to the right to Brandon Coleman for 8 yards to the Atl14. Tackled by Brian Poole.","(8:09) Drew Brees incomplete pass to the right intended for Travaris Cadet defensed by Deion Jones.","(8:30) Drew Brees pass to the right to Willie Snead for 27 yards to the Atl22. Tackled by Keanu Neal. FUMBLE, recovered by NO (Michael Thomas).","(8:36) Drew Brees incomplete pass to the left intended for Brandin Cooks defensed by Brian Poole.","(9:16) Drew Brees pass to the left to Mark Ingram for a loss of 3 yards to the Atl49. Tackled by Jonathan Babineaux.","(9:53) Drew Brees pass to the right to Michael Thomas for 22 yards to the Atl46. Tackled by Jalen Collins.","(10:06) Matt Bosher punts for 57 yards to NO26. Tommylee Lewis return for 6 yards to NO32. Tackled by Courtney Upshaw.","(10:22) Penalty: Illegal Formation on Atlanta (LaRoy Reynolds) -5 yards.","(10:26) Matt Ryan incomplete pass to the left intended for Nick Williams defensed by De'Vante Harris.","(10:26) New Orleans Saints timeout.","(10:31) Tevin Coleman rush to the right for no gain to the Atl22. Tackled by Craig Robertson and Tyeler Davison.","(11:13) Tevin Coleman rush to the right for 4 yards to the Atl22. Tackled by David Onyemata.","(11:52) Tevin Coleman rush to the right for 9 yards to the Atl18. Tackled by Nate Stupar.","(12:35) Tevin Coleman rush to the right for 3 yards to the Atl9. Tackled by Sterling Moore.","(12:41) Wil Lutz kicks off to the Atl2. Justin Hardy return for 10 yards to Atl12. Tackled by Travaris Cadet. Penalty: Illegal Block on Atlanta (Mohamed Sanu) -6 yards.","(12:41) Mark Ingram 2 pt rush attempt.","(12:47) Drew Brees pass to the right to Michael Thomas for 14 yards for a TOUCHDOWN.","(12:52) Drew Brees incomplete pass to the right intended for Brandon Coleman defensed by Jalen Collins.","(13:31) Drew Brees pass to the right to Willie Snead for 35 yards to the Atl14. Tackled by Ricardo Allen.","(14:02) Drew Brees pass to the right to Michael Thomas for 29 yards to the Atl49. Tackled by Jalen Collins.","(14:07) Drew Brees incomplete pass to the left intended for Coby Fleener defensed by Keanu Neal defensed by Brian Poole.","(14:12) Drew Brees incomplete pass to the right intended for Brandin Cooks defensed by Robert Alford.","(14:52) Drew Brees pass to the right to Travaris Cadet for 11 yards to the NO22. Tackled by Paul Worrilow.","(15:00) Matt Bosher punts for 30 yards to NO11. No return.","(0:45) Matt Ryan pass to the right to Devonta Freeman for 18 yards to the NO41. Tackled by Jairus Byrd.","(0:45) Atlanta Falcons timeout.","(0:54) Matt Ryan incomplete pass to the right intended for Justin Hardy.","(1:38) Matt Ryan pass to the left to Tevin Coleman for 4 yards to the Atl41. Tackled by Dannell Ellerbe.","(2:17) Penalty: False Start on Atlanta (Jake Matthews) -5 yards.","(2:23) Penalty: Holding on Atlanta (Jake Matthews) -10 yards.","(3:03) Matt Ryan rush to the right for 3 yards to the NO48. Tackled by Nick Fairley and Craig Robertson.","(3:08) Penalty: Offside on New Orleans (Dannell Ellerbe) 4 yards.","(3:54) Matt Ryan pass to the left to Tevin Coleman for 4 yards to the Atl45. Tackled by Nate Stupar.","(4:25) Tevin Coleman rush to the left for 1 yard to the Atl41. Tackled by David Onyemata.","(4:39) Thomas Morstead punts for 53 yards to Atl24. Eric Weems return for 16 yards to Atl40. Tackled by Justin Drescher.","(4:43) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Jalen Collins.","(4:43) Penalty: False Start on New Orleans (Zach Strief) -5 yards.","(4:47) Drew Brees incomplete pass to the left intended for Mark Ingram.","(5:17) Mark Ingram rush to the left for 3 yards to the NO28. Tackled by Ra'Shede Hageman.","(5:17) Matt Bosher kicks off to the endzone. Touchback.","(5:22) Matt Bryant 22 yard field goal attempt is GOOD. Holder: Matt Bosher.","(5:26) Matt Ryan incomplete pass to the right intended for Julio Jones.","(5:31) Matt Ryan incomplete pass to the right intended for Justin Hardy.","(5:39) Matt Ryan incomplete pass to the right intended for Justin Hardy.","(6:01) Matt Ryan pass to the right to Nick Williams for 10 yards to the NO4. Tackled by De'Vante Harris.","(6:44) Devonta Freeman rush to the left for 1 yard to the NO14. Tackled by Paul Kruger.","(7:26) Devonta Freeman rush to the right for 2 yards to the NO15. Tackled by Craig Robertson and David Onyemata.","(7:54) Matt Ryan pass to the left to Julio Jones for 11 yards to the NO17. Tackled by B.W. Webb.","(8:22) Matt Ryan pass to the right to Devonta Freeman for 8 yards to the NO28. Tackled by Vonn Bell.","(8:27) Matt Ryan incomplete pass to the middle intended for Tevin Coleman defensed by Tyeler Davison.","(8:55) Tevin Coleman rush to the right for 25 yards to the NO36. Tackled by Vonn Bell.","(9:36) Matt Ryan pass to the middle to Julio Jones for 23 yards to the Atl39. Tackled by Sterling Moore.","(10:16) Matt Ryan pass to the left to Julio Jones for 15 yards to the Atl16. Tackled by Dannell Ellerbe.","(10:23) Matt Ryan incomplete pass to the right intended for Julio Jones defensed by Sterling Moore.","(10:34) Thomas Morstead punts for 55 yards to Atl1. No return.","(11:09) Drew Brees pass to the left to Mark Ingram for 7 yards to the NO44. Tackled by Deion Jones.","(11:45) Drew Brees sacked at NO37 for a loss of 8 yards by Grady Jarrett.","(11:45) Atlanta Falcons timeout.","(12:16) Mark Ingram rush to the right for 1 yard to the NO45. Tackled by Ra'Shede Hageman.","(12:54) Drew Brees pass to the middle to Willie Snead for 20 yards to the NO44. Tackled by Robert Alford.","(13:04) Matt Bosher punts for 51 yards to NO24. No return.","(13:44) Matt Ryan sacked at Atl25 for a loss of 8 yards by Nick Fairley.","(14:25) Matt Ryan pass to the left to Justin Hardy for 6 yards to the Atl33. Tackled by B.W. Webb.","(15:00) Devonta Freeman rush to the left for 2 yards to the Atl27. Tackled by Craig Robertson.","(15:00) Wil Lutz kicks off to the endzone. Touchback.","(0:28) Drew Brees sacked at NO24 for a loss of 1 yard by Vic Beasley Jr..","(0:32) Drew Brees incomplete pass to the right intended for Coby Fleener.","(0:32) Matt Bosher kicks off to the endzone. Touchback.","(0:32) Matt Bryant extra point is good.","(0:36) Matt Ryan pass to the right to Justin Hardy for 7 yards for a TOUCHDOWN.","(0:36) New Orleans Saints timeout.","(0:41) Devonta Freeman rush to the right for 1 yard to the NO7. Tackled by Cameron Jordan.","(1:19) Matt Ryan pass to the right to Devonta Freeman for 7 yards to the NO8. Tackled by Sterling Moore.","(1:58) Matt Ryan pass to the right to Mohamed Sanu for 15 yards to the NO15. Tackled by Sterling Moore and Vonn Bell.","(1:58) Two Minute Warning.","(2:03) Devonta Freeman rush to the left for 2 yards to the NO35. Tackled by Craig Robertson. Penalty: Holding on New Orleans (Nick Fairley) 5 yards.","(2:53) Matt Ryan pass to the right to Justin Hardy for 17 yards to the NO37. Tackled by Roman Harper.","(2:57) Matt Ryan incomplete pass to the left intended for Levine Toilolo.","(2:57) New Orleans Saints timeout.","(3:04) Devonta Freeman rush to the right for 2 yards to the Atl46. Tackled by Vonn Bell.","(3:40) Matt Ryan pass to the right to Aldrick Robinson for 19 yards to the Atl44.","(3:40) Wil Lutz kicks off to the endzone. Touchback.","(3:44) Wil Lutz 40 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(4:28) Drew Brees pass to the left to Brandin Cooks for 3 yards to the Atl22. Tackled by Keanu Neal.","(5:04) Mark Ingram rush to the left for 1 yard to the Atl25. Tackled by Ra'Shede Hageman.","(5:08) Drew Brees incomplete pass to the left intended for Michael Thomas.","(5:48) Drew Brees pass to the right to Michael Thomas for 25 yards to the Atl26. Tackled by Paul Worrilow.","(6:15) Mark Ingram rush to the right for 17 yards to the NO49. Tackled by Ricardo Allen.","(6:51) Mark Ingram rush to the left for 7 yards to the NO32. Tackled by Jalen Collins.","(6:51) Matt Bosher kicks off to the endzone. Touchback.","(6:51) Matt Bryant extra point is good.","(6:58) Matt Ryan pass to the right to Mohamed Sanu for 10 yards for a TOUCHDOWN.","(7:23) Penalty: False Start on Atlanta (Jake Matthews) -5 yards.","(8:00) Tevin Coleman rush to the left for no gain to the NO5. Tackled by Craig Robertson.","(8:33) Matt Ryan pass to the middle to Levine Toilolo for 18 yards to the NO5. Tackled by Craig Robertson.","(9:01) Matt Ryan pass to the left to Mohamed Sanu for 10 yards to the NO23. Tackled by Dannell Ellerbe.","(9:40) Tevin Coleman rush to the right for 2 yards to the NO33. Tackled by Cameron Jordan.","(10:20) Devonta Freeman rush to the left for 2 yards to the NO35. Tackled by Nick Fairley.","(10:47) Matt Ryan pass to the left to Aldrick Robinson for 17 yards to the NO37. Tackled by B.W. Webb.","(11:23) Devonta Freeman rush to the left for 3 yards to the Atl46. Tackled by Nate Stupar.","(11:54) Matt Ryan pass to the middle to Julio Jones for 18 yards to the Atl43. Tackled by Jairus Byrd.","(12:32) Devonta Freeman rush to the right for 1 yard to the Atl25. Tackled by Dannell Ellerbe.","(12:45) Thomas Morstead punts for 57 yards to Atl16. Eric Weems return for 8 yards to Atl24. Tackled by Nate Stupar and Sam Barrington.","(12:50) Drew Brees incomplete pass to the right intended for Willie Snead defensed by Deion Jones.","(13:35) Drew Brees pass to the left to Brandin Cooks for 4 yards to the NO27. Tackled by Robert Alford.","(14:17) Drew Brees pass to the left to Mark Ingram for a loss of 2 yards to the NO23. Tackled by Paul Worrilow.","(14:17) Matt Bosher kicks off to the endzone. Touchback.","(14:17) Matt Bryant extra point is good.","(14:22) Matt Ryan pass to the left to Julio Jones for 1 yard for a TOUCHDOWN.","(15:00) Matt Ryan pass to the left to Julio Jones for 7 yards to the NO1. Tackled by Vonn Bell and Jairus Byrd.","(15:00) Penalty: False Start on Atlanta (Andy Levitre) -5 yards.","(0:38) Matt Ryan pass to the right to Julio Jones for 21 yards to the NO3. Tackled by Roman Harper.","(0:38) Atlanta Falcons timeout.","(0:44) Matt Ryan incomplete pass to the left intended for Levine Toilolo defensed by Dannell Ellerbe.","(0:52) Penalty: Pass Interference on New Orleans (Roman Harper) 46 yards.","(0:52) Penalty: Offside on New Orleans (Sheldon Rankins) 5 yards.","(0:52) Wil Lutz kicks off to the endzone. Touchback.","(0:52) Wil Lutz extra point is good.","(0:56) Tim Hightower rush to the left for 2 yards for a TOUCHDOWN.","(1:02) Drew Brees incomplete pass to the right intended for John Phillips.","(1:28) Mark Ingram rush to the right for 6 yards to the Atl4. Tackled by Paul Worrilow. Penalty: Holding on Atlanta (Jonathan Babineaux) 2 yards.","(1:59) Tim Hightower rush to the right for 25 yards to the Atl20. Tackled by Deion Jones. Penalty: Unsports. Conduct on Atlanta (Courtney Upshaw) 10 yards.","(2:32) Drew Brees pass to the right to Michael Thomas for 20 yards to the Atl45. Tackled by Ricardo Allen.","(3:10) Tim Hightower rush to the left for 2 yards to the NO35. Tackled by Paul Worrilow.","(3:42) Drew Brees pass to the left to Coby Fleener for 8 yards to the NO33. Tackled by Jalen Collins.","(3:42) Matt Bosher kicks off to the endzone. Touchback.","(3:42) Matt Bryant extra point is good.","(3:53) Devonta Freeman rush to the right for 75 yards for a TOUCHDOWN.","(3:53) Wil Lutz kicks off to the endzone. Touchback.","(3:57) Wil Lutz 19 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(4:01) Drew Brees incomplete pass to the left intended for Coby Fleener defensed by Ricardo Allen.","(4:46) Mark Ingram rush to the right for no gain to the Atl1. Tackled by LaRoy Reynolds.","(4:46) Atlanta Falcons timeout.","(5:18) Mark Ingram rush to the right for 4 yards to the Atl1. Tackled by Keanu Neal.","(6:07) Drew Brees pass to the right to Coby Fleener for 25 yards to the Atl5. Tackled by Robert Alford.","(6:48) Mark Ingram rush to the left for 1 yard to the Atl30. Tackled by Brian Poole.","(7:27) Drew Brees pass to the middle to Michael Thomas for 10 yards to the Atl31. Tackled by Deion Jones.","(7:59) Mark Ingram rush to the left for 3 yards to the Atl41. Tackled by Courtney Upshaw.","(8:49) Penalty: False Start on New Orleans (John Phillips) -5 yards.","(8:49) Drew Brees pass to the right to Brandin Cooks for 12 yards to the Atl39. Tackled by Keanu Neal.","(9:31) Drew Brees pass to the right to Mark Ingram for 14 yards to the NO49. Tackled by Deion Jones.","(10:06) Mark Ingram rush to the right for a loss of 1 yard to the NO35. Tackled by Jonathan Babineaux.","(10:11) Drew Brees incomplete pass to the right intended for Michael Thomas.","(10:43) Mark Ingram rush to the right for 2 yards to the NO36. Tackled by Grady Jarrett and Tyson Jackson.","(11:22) Drew Brees pass to the right to Mark Ingram for 8 yards to the NO34. Tackled by De'Vondre Campbell.","(11:55) Mark Ingram rush to the right for 1 yard to the NO26. Tackled by Deion Jones and Grady Jarrett.","(11:55) Matt Bosher kicks off to the endzone. Touchback.","(11:55) Matt Bryant extra point is good.","(12:01) Matt Ryan pass to the left to Tevin Coleman for 7 yards for a TOUCHDOWN.","(12:46) Matt Ryan pass to the middle to Devonta Freeman for 35 yards to the NO7. Tackled by Roman Harper.","(13:23) Matt Ryan pass to the left to Justin Hardy for 13 yards to the NO42. Tackled by B.W. Webb.","(14:06) Matt Ryan pass to the right to Devonta Freeman for 13 yards to the Atl45. Tackled by Dannell Ellerbe.","(14:21) Thomas Morstead punts for 59 yards to Atl17. Eric Weems return for 15 yards to Atl32. Tackled by Chris Banjo.","(14:25) Drew Brees incomplete pass to the right intended for Coby Fleener.","(14:57) Mark Ingram rush to the left for a loss of 1 yard to the NO24. Tackled by Vic Beasley Jr. and Courtney Upshaw.","(15:00) Drew Brees incomplete pass to the left intended for Mark Ingram.","(15:00) Matt Bosher kicks off to the endzone. Touchback."]