["(0:15) Matt Cassel rush up the middle for a loss of 1 yard to the Hou27.","(0:23) Brock Osweiler incomplete pass to the right intended for Will Fuller V defensed by Brian Orakpo.","(0:29) Brock Osweiler sacked at Hou27 for a loss of 6 yards by Jurrell Casey.","(0:35) Brock Osweiler incomplete pass to the left intended for Will Fuller V.","(0:36) Brock Osweiler incomplete pass to the middle.","(0:53) Brock Osweiler pass to the right to Wendall Williams for 15 yards to the Hou33. Tackled by Valentino Blake.","(1:05) Brett Kern punts for 42 yards to Hou19. Tyler Ervin return for a loss of 1 yard to Hou18. Tackled by Phillip Supernaw.","(1:12) Derrick Henry rush to the left for 2 yards to the Ten39. Tackled by Denzel Rice.","(1:12) Tennessee Titans timeout.","(2:00) Derrick Henry rush to the left for 1 yard to the Ten37. Tackled by Max Bullough.","(2:00) Two Minute Warning.","(2:25) Derrick Henry rush to the right for a loss of 2 yards to the Ten36. Tackled by Brian Peters.","(2:33) Derrick Henry rush to the left for 14 yards to the Ten38. Tackled by Denzel Rice.","(2:33) Houston Texans timeout.","(2:56) Derrick Henry rush to the right for 8 yards to the Ten24. Tackled by Eddie Pleasant.","(2:56) Houston Texans timeout.","(3:04) Derrick Henry rush to the right for 4 yards to the Ten16. Tackled by Christian Covington and Brennan Scarlett.","(3:04) Houston Texans timeout.","(3:10) Derrick Henry rush up the middle for 1 yard to the Ten12. Tackled by D.J. Reader.","(3:11) Nick Novak kicks off to the Ten11. Antonio Andrews - no return. Tackled by Akeem Hunt.","(3:11) Nick Novak extra point is good.","(3:18) Brock Osweiler rush up the middle for 1 yard for a TOUCHDOWN.","(4:04) Alfred Blue rush to the right for no gain to the Ten1. Tackled by Kevin Byard.","(4:32) Brock Osweiler pass to the right to Keith Mumphery for 4 yards to the Ten1. Tackled by Wesley Woodyard.","(4:37) Brock Osweiler incomplete pass to the right intended for Stephen Anderson.","(5:32) Alfred Blue rush to the left for 2 yards to the Ten5. Tackled by Jurrell Casey.","(6:10) Tennessee Titans timeout.","(6:10) Brock Osweiler pass to the left to Ryan Griffin for 9 yards to the Ten7. Tackled by Da'Norris Searcy.","(6:15) Brock Osweiler incomplete pass to the middle intended for Wendall Williams defensed by Da'Norris Searcy.","(6:20) Brock Osweiler incomplete pass to the left intended for Jonathan Grimes.","(6:45) Brock Osweiler pass to the left to Wendall Williams for 26 yards to the Ten16.","(6:51) Brock Osweiler incomplete pass to the middle intended for Wendall Williams.","(7:20) Jonathan Grimes rush up the middle for 4 yards to the Ten42. Tackled by Antwaun Woods.","(7:41) Brock Osweiler pass to the right to Jonathan Grimes for 9 yards to the Ten46. Tackled by Kevin Byard.","(8:05) Brock Osweiler pass to the middle to Jonathan Grimes for 11 yards to the Hou45. Tackled by Avery Williamson and Sean Spence.","(8:30) Brock Osweiler pass to the middle to Keith Mumphery for 9 yards to the Hou34. Tackled by Avery Williamson.","(8:30) Ryan Succop kicks off to the endzone. Touchback.","(8:34) Ryan Succop 35 yard field goal attempt is GOOD. Holder: Brett Kern.","(9:23) Matt Cassel sacked at Hou17 for a loss of 2 yards by Christian Covington.","(10:08) Matt Cassel sacked at Hou15 for a loss of 4 yards by Ufomba Kamalu.","(10:08) Penalty: Offside on Houston (Eddie Pleasant) 5 yards.","(10:10) Matt Cassel incomplete pass to the right intended for Delanie Walker.","(10:28) Penalty: Holding on Tennessee (Dennis Kelly) -10 yards.","(11:16) Matt Cassel pass to the left to Delanie Walker for 6 yards to the Hou6. Tackled by Denzel Rice.","(11:58) Matt Cassel pass to the left to Rishard Matthews for 7 yards to the Hou12. Tackled by Denzel Rice.","(12:41) DeMarco Murray rush up the middle for a loss of 2 yards to the Hou19. Tackled by Brennan Scarlett and Max Bullough.","(13:28) Matt Cassel pass to the right to Rishard Matthews for 50 yards to the Hou17. Tackled by Robert Nelson Jr..","(13:34) Matt Cassel incomplete pass to the right intended for Rishard Matthews defensed by D.J. Reader.","(14:22) Matt Cassel sacked at Ten33 for a loss of 7 yards by Joel Heath.","(15:00) Matt Cassel pass to the left to Rishard Matthews for 8 yards to the Ten40. Tackled by Denzel Rice.","(0:30) DeMarco Murray rush to the right for a loss of 1 yard to the Ten32. Tackled by Ufomba Kamalu.","(1:05) DeMarco Murray rush to the left for 7 yards to the Ten33. Tackled by Denzel Rice.","(1:11) Nick Novak kicks off to the Ten21. Antonio Andrews return for 5 yards to Ten26. Tackled by Don Jones.","(1:15) Nick Novak 26 yard field goal attempt is GOOD. Holder: Shane Lechler.","(1:20) Brock Osweiler incomplete pass to the left intended for Will Fuller V defensed by Brian Orakpo.","(1:20) Penalty: Delay of Game on Houston (Brock Osweiler) -5 yards.","(1:24) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(2:09) Alfred Blue rush to the right for no gain to the Ten3. Tackled by Al Woods.","(2:51) Brock Osweiler pass to the left to DeAndre Hopkins for 51 yards to the Ten3. Tackled by Wesley Woodyard.","(3:38) Brock Osweiler pass to the middle to DeAndre Hopkins for 5 yards to the Hou46. Tackled by Wesley Woodyard.","(4:14) Brock Osweiler pass to the left to DeAndre Hopkins for 9 yards to the Hou41. Tackled by Rashad Johnson.","(4:44) Brock Osweiler pass to the right to Alfred Blue for 7 yards to the Hou32. Tackled by Sean Spence.","(4:44) Ryan Succop kicks off to the endzone. Touchback.","(4:44) Ryan Succop extra point is good.","(4:49) Derrick Henry rush to the left for 2 yards for a TOUCHDOWN.","(4:55) Matt Cassel incomplete pass to the left intended for Delanie Walker.","(5:41) Derrick Henry rush up the middle for 9 yards to the Hou2. Tackled by Denzel Rice and Andre Hal.","(6:23) Matt Cassel pass to the right to Derrick Henry for 3 yards to the Hou11. Tackled by Brennan Scarlett and Denzel Rice.","(7:06) Matt Cassel pass to the middle to Delanie Walker for 15 yards to the Hou14. Tackled by Eddie Pleasant.","(7:50) Derrick Henry rush to the right for 3 yards to the Hou29. Tackled by Christian Covington.","(8:32) Derrick Henry rush to the left for no gain to the Hou32. Tackled by Corey Moore.","(9:10) Derrick Henry rush to the left for 14 yards to the Hou32. Tackled by Corey Moore.","(9:53) Derrick Henry rush to the left for 2 yards to the Hou46. Tackled by Kareem Jackson and Denzel Rice.","(10:30) DeMarco Murray rush to the right for 2 yards to the Hou48. Tackled by Christian Covington.","(10:30) Penalty: Offside on Houston (Joel Heath) 5 yards.","(10:31) Nick Novak onside kickoff to the Ten40. Onside kick recovered by receiving team by Kevin Byard. Penalty: Offside on Houston (Robert Nelson Jr.) 5 yards.","(10:31) Nick Novak extra point is good.","(10:39) Brock Osweiler pass to the middle to C.J. Fiedorowicz for 4 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Tennessee (Avery Williamson) 15 yards.","(10:48) Brock Osweiler incomplete pass to the right intended for Keith Mumphery defensed by Valentino Blake.","(10:52) Brock Osweiler incomplete pass to the left intended for C.J. Fiedorowicz defensed by Da'Norris Searcy.","(11:32) Alfred Blue rush to the left for 1 yard to the Ten4. Tackled by Wesley Woodyard and Jurrell Casey.","(12:13) Brock Osweiler pass to the right to Will Fuller V for 14 yards to the Ten5. Tackled by Derrick Morgan.","(12:53) Brock Osweiler pass to the right to DeAndre Hopkins for 27 yards to the Ten19. Tackled by Brice McCain.","(12:58) Brock Osweiler incomplete pass to the left intended for C.J. Fiedorowicz.","(13:31) Alfred Blue rush up the middle for 10 yards to the Ten46. Tackled by Da'Norris Searcy.","(13:36) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(13:48) Jonathan Grimes rush up the middle for 8 yards to the Hou39. Tackled by Da'Norris Searcy. Penalty: Holding on Tennessee (Austin Johnson) 5 yards.","(14:11) Brock Osweiler pass to the left to DeAndre Hopkins for 8 yards to the Hou31. Tackled by LeShaun Sims.","(14:50) Alfred Blue rush to the left for 4 yards to the Hou23. Tackled by DaQuan Jones and Derrick Morgan.","(14:54) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(15:00) Ryan Succop kicks off to the Hou0. Akeem Hunt return for 19 yards to Hou19. Tackled by Phillip Supernaw and Nate Palmer.","(0:23) Tom Savage rush up the middle for a loss of 1 yard to the Hou24.","(0:23) Ryan Succop kicks off to the endzone. Touchback.","(0:23) Ryan Succop extra point is good.","(0:23) Penalty: Illegal Formation on Tennessee (Al Woods) -5 yards.","(0:27) Matt Cassel pass to the right to Rishard Matthews for 2 yards for a TOUCHDOWN.","(0:57) Matt Cassel pass to the left to Rishard Matthews for 3 yards to the Hou2. Tackled by A.J. Bouye and Max Bullough.","(1:03) Penalty: Holding on Houston (Robert Nelson Jr.) 5 yards.","(1:06) Matt Cassel incomplete pass to the right intended for Rishard Matthews.","(1:26) Matt Cassel pass to the right to Rishard Matthews for 7 yards to the Hou10. Tackled by Robert Nelson Jr..","(1:55) Matt Cassel pass to the right to Rishard Matthews for 25 yards to the Hou17. Tackled by Andre Hal.","(1:55) Penalty: False Start on Tennessee (Harry Douglas) -5 yards.","(1:55) Houston Texans timeout.","(2:00) Matt Cassel pass to the left to Delanie Walker for a loss of 1 yard to the Hou37. Tackled by Brennan Scarlett.","(2:00) Two Minute Warning.","(2:31) Derrick Henry rush to the right for no gain to the Hou36. Tackled by Andre Hal.","(2:43) Shane Lechler punts for 49 yards to Ten48. Marc Mariani return for 16 yards to Hou36. Tackled by Akeem Hunt.","(2:43) Tennessee Titans timeout.","(2:51) Brock Osweiler pass to the right to Ryan Griffin for 1 yard to the Hou3. Tackled by Sean Spence.","(2:51) Houston Texans timeout.","(2:57) Brock Osweiler incomplete pass to the left intended for Will Fuller V.","(2:57) Tennessee Titans timeout.","(3:10) Brock Osweiler sacked at Hou2 for a loss of 8 yards by Jurrell Casey.","(3:20) Brett Kern punts for 48 yards to Hou10. No return.","(3:24) Matt Cassel incomplete pass to the right intended for Rishard Matthews.","(4:10) Derrick Henry rush to the left for 7 yards to the Ten42. Tackled by A.J. Bouye.","(4:19) Matt Cassel incomplete pass to the right.","(4:27) 45 yard field goal attempt by Nick Novak is NO GOOD. Holder: Shane Lechler.","(5:10) Jonathan Grimes rush up the middle for 3 yards to the Ten27. Tackled by Derrick Morgan and Avery Williamson.","(5:14) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins defensed by Jurrell Casey.","(5:44) Alfred Blue rush up the middle for 4 yards to the Ten30. Tackled by Austin Johnson.","(6:11) Alfred Blue rush up the middle for 5 yards to the Ten34. Tackled by Antwaun Woods.","(6:37) Brock Osweiler pass to the left to Alfred Blue for 6 yards to the Ten39. Tackled by Brice McCain.","(7:09) Brock Osweiler pass to the right to DeAndre Hopkins for 15 yards to the Ten45. Tackled by Da'Norris Searcy.","(7:19) Matt Cassel pass intended for Tajae Sharpe INTERCEPTED by Quintin Demps defensed by A.J. Bouye and returned for 19 yards. Tackled by Taylor Lewan.","(8:05) DeMarco Murray rush up the middle for no gain to the Hou32. Tackled by Joel Heath.","(8:42) Marc Mariani rush to the right for 15 yards to the Hou32. Tackled by Corey Moore.","(9:23) Matt Cassel pass to the left to Delanie Walker for 8 yards to the Hou47. Tackled by Eddie Pleasant.","(10:06) Matt Cassel pass to the right to Rishard Matthews for 2 yards to the Ten45. Tackled by Kareem Jackson.","(10:42) DeMarco Murray rush to the left for 2 yards to the Ten43. Tackled by Christian Covington.","(10:48) Brock Osweiler sacked at Ten40 for a loss of 6 yards by Daimion Stafford.","(11:36) Brock Osweiler pass to the left to Jonathan Grimes for 1 yard to the Ten34. Tackled by Avery Williamson.","(12:22) Jonathan Grimes rush up the middle for a loss of 2 yards to the Ten35. Tackled by Avery Williamson.","(12:22) Penalty: Offside on Tennessee (Derrick Morgan) 5 yards.","(12:27) Brock Osweiler incomplete pass to the right intended for Ryan Griffin.","(13:04) Brock Osweiler pass to the right to Keith Mumphery for 10 yards to the Ten38. Tackled by LeShaun Sims and Brice McCain.","(13:04) Houston Texans timeout.","(13:10) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(13:15) Brock Osweiler incomplete pass to the right intended for Ryan Griffin.","(13:41) Brock Osweiler pass to the left to Jonathan Grimes for 12 yards to the Ten48. Tackled by Avery Williamson.","(14:18) Jonathan Grimes rush to the right for a loss of 1 yard to the Hou40. Tackled by Wesley Woodyard.","(15:00) Tom Savage rush up the middle for 2 yards to the Hou41. Tackled by Jurrell Casey.","(0:04) Jonathan Grimes rush to the left for no gain to the Hou39. Tackled by Avery Williamson.","(0:48) Tom Savage pass to the right to C.J. Fiedorowicz for 8 yards to the Hou39. Tackled by Valentino Blake and Sean Spence.","(1:30) Jonathan Grimes rush to the right for 1 yard to the Hou31. Tackled by Derrick Morgan.","(1:49) Tom Savage pass to the right to DeAndre Hopkins for 8 yards to the Hou30. Tackled by Valentino Blake.","(1:54) Tom Savage incomplete pass to the left intended for DeAndre Hopkins.","(2:26) Jonathan Grimes rush to the right for 3 yards to the Hou22. Tackled by Austin Johnson and Jurrell Casey.","(2:38) Brett Kern punts for 44 yards to Hou12. Tyler Ervin return for 7 yards to Hou19. Tackled by Wesley Woodyard.","(2:43) Matt Cassel incomplete pass to the left intended for Delanie Walker.","(2:49) Matt Cassel incomplete pass to the right intended for Rishard Matthews.","(3:28) DeMarco Murray rush to the left for 3 yards to the Ten44. Tackled by Max Bullough.","(3:40) Shane Lechler punts for 49 yards to Ten34. Marc Mariani return for 7 yards to Ten41. Tackled by Corey Moore.","(3:45) Tom Savage incomplete pass to the left intended for C.J. Fiedorowicz.","(4:30) Alfred Blue rush to the right for 3 yards to the Hou17. Tackled by Derrick Morgan and Kevin Byard.","(4:37) Tom Savage incomplete pass to the right intended for Alfred Blue defensed by Kevin Byard.","(4:45) Brett Kern punts for 30 yards to Hou14. No return.","(5:27) Matt Cassel rush to the left for 3 yards to the Hou44. Tackled by Eddie Pleasant.","(6:12) Matt Cassel pass to the left to DeMarco Murray for a loss of 2 yards to the Hou47. Tackled by A.J. Bouye.","(6:31) Penalty: Delay of Game on Tennessee (Matt Cassel) -5 yards.","(7:17) Matt Cassel sacked at Hou40 for a loss of 4 yards by Joel Heath.","(7:53) Matt Cassel pass to the right to Rishard Matthews for 10 yards to the Hou36. Tackled by Benardrick McKinney.","(8:05) Shane Lechler punts for 44 yards to Ten36. Marc Mariani return for 18 yards to Hou46. Tackled by Corey Moore.","(8:39) Tom Savage pass to the middle to Will Fuller V for 4 yards to the Hou20. Tackled by Rashad Johnson.","(9:25) Alfred Blue rush to the left for a loss of 3 yards to the Hou16. Tackled by Antwaun Woods and Valentino Blake.","(9:49) Tom Savage pass to the left to Will Fuller V for 6 yards to the Hou19. Tackled by LeShaun Sims.","(9:57) Ryan Succop kicks off to the Hou13. Akeem Hunt return for 10 yards to Hou23. Tackled by Kalan Reed. Penalty: Illegal Block on Houston (Wendall Williams) -10 yards.","(9:57) Ryan Succop extra point is good.","(10:04) Tom Savage sacked at Hou0 for a loss of 15 yards by Sean Spence. FUMBLE, recovered by Ten (DaQuan Jones) for a TOUCHDOWN.","(10:48) Tom Savage pass to the left to Alfred Blue for a loss of 1 yard to the Hou15. Tackled by Brian Orakpo.","(11:17) Alfred Blue rush to the right for 2 yards to the Hou16. Tackled by Avery Williamson.","(11:24) Brett Kern punts for 47 yards to Hou14. No return.","(11:28) Matt Cassel incomplete pass to the right intended for Tajae Sharpe defensed by Christian Covington.","(12:13) DeMarco Murray rush up the middle for 5 yards to the Ten39. Tackled by Whitney Mercilus.","(12:55) DeMarco Murray rush to the right for 2 yards to the Ten34. Tackled by Max Bullough.","(13:34) Matt Cassel pass to the right to Delanie Walker for 7 yards to the Ten32. Tackled by Andre Hal.","(14:17) DeMarco Murray rush up the middle for 4 yards to the Ten25. Tackled by Quintin Demps.","(14:54) DeMarco Murray rush to the left for a loss of 1 yard to the Ten21. Tackled by D.J. Reader and Whitney Mercilus.","(15:00) Nick Novak kicks off to the Ten3. Marc Mariani return for 19 yards to Ten22. Tackled by Brian Peters."]