["(3:04) Landry Jones pass to the left to Cobi Hamilton for 26 yards for a TOUCHDOWN.","(3:48) Landry Jones pass to the middle to Demarcus Ayers for 6 yards to the Cle26. Tackled by Briean Boddy-Calhoun.","(4:24) Landry Jones pass to the middle to Eli Rogers for 8 yards to the Cle32. Tackled by Joe Haden.","(4:24) Pittsburgh Steelers timeout.","(4:32) Landry Jones incomplete pass to the left intended for Cobi Hamilton.","(4:37) Landry Jones incomplete pass to the right intended for Demarcus Ayers defensed by Joe Haden.","(5:12) Landry Jones pass to the right to Eli Rogers for 19 yards to the Cle40. Tackled by Joe Haden.","(5:54) Landry Jones pass to the left to Cobi Hamilton for 11 yards to the Pit41. Tackled by Christian Kirksey.","(6:37) Landry Jones pass to the left to Eli Rogers for 6 yards to the Pit30. Tackled by Christian Kirksey.","(7:17) DeAngelo Williams rush up the middle for a loss of 1 yard to the Pit24. Tackled by Jamie Meder.","(7:17) Cody Parkey kicks off to the endzone. Touchback.","(7:21) Cody Parkey 34 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(7:29) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(7:29) Cleveland Browns timeout.","(8:19) Robert Griffin III pass to the left to Andrew Hawkins for a loss of 14 yards to the Pit16. Tackled by Ryan Shazier.","(8:24) Robert Griffin III incomplete pass to the right intended for Randall Telfer.","(8:33) Robert Griffin III pass to the right to Corey Coleman for 5 yards to the Pit4. Tackled by Mike Mitchell. Penalty: Face Mask on Pittsburgh (Mike Mitchell) 2 yards.","(8:37) Robert Griffin III incomplete pass to the right intended for Isaiah Crowell.","(9:16) Isaiah Crowell rush up the middle for no gain to the Pit9. Tackled by Daniel McCullers.","(9:16) Pittsburgh Steelers timeout.","(9:19) Penalty: Holding on Pittsburgh (Ross Cockrell) 5 yards.","(9:54) Robert Griffin III pass to the right to Corey Coleman for 11 yards to the Pit14.","(10:33) Isaiah Crowell rush up the middle for 2 yards to the Pit25. Tackled by Bud Dupree and Daniel McCullers.","(10:55) Penalty: False Start on Cleveland (Terrelle Pryor Sr.) -5 yards.","(11:29) Isaiah Crowell rush up the middle for 8 yards to the Pit22. Tackled by Mike Mitchell.","(11:58) Robert Griffin III rush to the left for 9 yards to the Pit30.","(12:36) Robert Griffin III pass to the left to Corey Coleman for 10 yards to the Pit39. Tackled by Lawrence Timmons.","(13:11) George Atkinson III rush to the right for 11 yards to the Pit49. Tackled by Mike Mitchell.","(13:50) Robert Griffin III pass to the middle to Andrew Hawkins for 9 yards to the Cle40. Tackled by William Gay.","(13:54) Robert Griffin III incomplete pass to the left intended for Corey Coleman defensed by Jarvis Jones.","(14:31) Isaiah Crowell rush up the middle for 3 yards to the Cle31. Tackled by L.T. Walton and Daniel McCullers.","(14:56) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 9 yards to the Cle28. Tackled by Artie Burns.","(15:00) Chris Boswell kicks off to the Cle-5. Mario Alford return for 24 yards to Cle19. Tackled by Tyler Matakevich and Roosevelt Nix.","(0:31) DeAngelo Williams rush up the middle for a loss of 3 yards to the Pit3. Tackled by Christian Kirksey.","(0:31) Penalty: False Start on Pittsburgh (Eli Rogers) -5 yards.","(0:36) Penalty: Holding on Pittsburgh (Alejandro Villanueva) -10 yards.","(0:36) Pittsburgh Steelers timeout.","(0:44) DeAngelo Williams rush to the left for 17 yards to the Pit21. Tackled by Jamar Taylor.","(0:44) Cleveland Browns timeout.","(0:49) DeAngelo Williams rush to the right for 1 yard to the Pit4. Tackled by Danny Shelton and Xavier Cooper.","(0:49) Cleveland Browns timeout.","(0:56) DeAngelo Williams rush to the right for 1 yard to the Pit3. Tackled by Demario Davis.","(0:56) Penalty: False Start on Pittsburgh (Ramon Foster) -1 yards.","(1:04) Isaiah Crowell rush up the middle for 2 yards to the Pit3. Tackled by Jarvis Jones. FUMBLE, recovered by Pit (Mike Mitchell). Tackled by Joe Thomas.","(1:12) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 43 yards to the Pit5. Tackled by Mike Mitchell.","(1:12) Cleveland Browns timeout.","(1:31) Isaiah Crowell rush to the left for 2 yards to the Pit48. Tackled by Artie Burns.","(1:43) Jordan Berry punts for 64 yards to Cle33. Mario Alford return for 17 yards to Cle50. Tackled by Tyler Matakevich.","(1:59) Penalty: Illegal Return OOB on Pittsburgh (Cobi Hamilton) -2 yards.","(1:59) Two Minute Warning.","(2:04) Landry Jones sacked at Pit5 for a loss of 10 yards by Ed Reynolds.","(2:48) Landry Jones pass to the right to Roosevelt Nix for 2 yards to the Pit15. Tackled by Joe Schobert and Joe Haden.","(3:22) DeAngelo Williams rush up the middle for 2 yards to the Pit13. Tackled by Demario Davis.","(3:28) Cody Parkey kicks off to the Pit-1. Cobi Hamilton return for 10 yards to Pit11. Tackled by Danny Vitale.","(3:28) Cody Parkey extra point is good.","(3:33) George Atkinson III rush up the middle for 5 yards for a TOUCHDOWN.","(4:26) Isaiah Crowell rush up the middle for 67 yards to the Pit5. Tackled by Sean Davis and Artie Burns.","(5:07) Robert Griffin III sacked at Cle28 for a loss of 4 yards by Jarvis Jones.","(5:14) Chris Boswell kicks off to the Cle-4. Mario Alford return for 36 yards to Cle32. Tackled by Fitzgerald Toussaint.","(5:14) Chris Boswell extra point is good.","(5:21) Landry Jones pass to the right to Demarcus Ayers for 11 yards for a TOUCHDOWN.","(5:59) DeAngelo Williams rush to the left for no gain to the Cle11. Tackled by Jamie Collins.","(6:06) Landry Jones incomplete pass to the right intended for Jesse James defensed by Ed Reynolds.","(6:54) Landry Jones pass to the left to Darrius Heyward-Bey for 46 yards to the Cle11. Tackled by Briean Boddy-Calhoun.","(7:34) DeAngelo Williams rush to the right for 4 yards to the Pit43. Tackled by Carl Nassib.","(7:39) 49 yard field goal attempt by Cody Parkey is NO GOOD. Holder: Britton Colquitt.","(8:19) Robert Griffin III sacked at Pit31 for a loss of 8 yards by Daniel McCullers.","(8:49) Robert Griffin III rush to the right for 6 yards to the Pit23. Tackled by Javon Hargrave.","(9:27) Robert Griffin III pass to the right to Danny Vitale for a loss of 1 yard to the Pit29. Tackled by Javon Hargrave.","(10:09) Robert Griffin III pass to the right to Andrew Hawkins for 10 yards to the Pit28. Tackled by William Gay.","(10:12) Robert Griffin III incomplete pass to the left intended for Corey Coleman defensed by Artie Burns.","(10:48) George Atkinson III rush up the middle for 2 yards to the Pit38. Tackled by Ryan Shazier.","(11:30) Isaiah Crowell rush to the left for 12 yards to the Pit40. Tackled by Sean Davis.","(12:07) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 19 yards to the Cle48. Tackled by Sean Davis.","(12:47) Isaiah Crowell rush to the left for 4 yards to the Cle29. Tackled by Lawrence Timmons.","(13:21) Robert Griffin III pass to the right to Gary Barnidge for no gain to the Cle25. Tackled by Ryan Shazier.","(13:21) Chris Boswell kicks off to the endzone. Touchback.","(13:21) Chris Boswell extra point is good.","(13:25) DeAngelo Williams rush to the left for 1 yard for a TOUCHDOWN.","(13:29) Penalty: Pass Interference on Cleveland (Joe Haden) 7 yards.","(14:12) Landry Jones pass to the right to Jesse James for 2 yards to the Cle8. Tackled by Joe Haden.","(14:57) Landry Jones pass to the middle to Demarcus Ayers for 15 yards to the Cle10. Tackled by Ed Reynolds.","(15:00) Landry Jones incomplete pass to the left intended for Demarcus Ayers.","(0:21) Landry Jones pass to the right to Fitzgerald Toussaint for 15 yards to the Cle25. Tackled by Jamie Collins.","(0:59) Fitzgerald Toussaint rush up the middle for 1 yard to the Cle40. Tackled by Carl Nassib.","(1:41) Landry Jones pass to the left to Fitzgerald Toussaint for 9 yards to the Cle41. Tackled by Jamie Collins.","(2:24) DeAngelo Williams rush to the left for 8 yards to the Pit50. Tackled by Christian Kirksey.","(2:46) DeAngelo Williams rush to the right for 10 yards to the Pit42. Tackled by Ed Reynolds.","(3:22) DeAngelo Williams rush to the right for 12 yards to the Pit32. Tackled by Jamie Collins.","(3:40) Landry Jones pass intended for Demarcus Ayers INTERCEPTED by Briean Boddy-Calhoun and returned for 67 yards. Tackled by Darrius Heyward-Bey. FUMBLE, recovered by Pit (Landry Jones). Touchback.","(3:47) Landry Jones incomplete pass to the middle intended for Demarcus Ayers.","(4:15) Landry Jones pass to the right to DeAngelo Williams for a loss of 1 yard to the Pit46. Tackled by Christian Kirksey.","(4:59) Landry Jones pass to the middle to Cobi Hamilton for 17 yards to the Pit47. Tackled by Marcus Burley.","(5:40) Landry Jones pass to the right to Demarcus Ayers for 6 yards to the Pit30. Tackled by Tramon Williams.","(5:54) Britton Colquitt punts for 49 yards to Pit24. Eli Rogers return for 10 yards to Pit34. Tackled by Danny Vitale and Christian Kirksey. Penalty: Illegal Block on Pittsburgh (Tyler Matakevich) -10 yards.","(5:59) Robert Griffin III incomplete pass to the right intended for Corey Coleman defensed by Ross Cockrell.","(6:11) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(6:54) George Atkinson III rush up the middle for 1 yard to the Cle27. Tackled by Lawrence Timmons and Sean Davis.","(7:26) Isaiah Crowell rush up the middle for 6 yards to the Cle26. Tackled by Lawrence Timmons and Jarvis Jones.","(7:57) Isaiah Crowell rush up the middle for 5 yards to the Cle20. Tackled by Lawrence Timmons and Bud Dupree.","(8:05) Jordan Berry punts for 43 yards to Cle15. No return.","(8:37) Fitzgerald Toussaint rush to the right for 12 yards to the Pit42. Tackled by Briean Boddy-Calhoun and Jamie Collins.","(9:22) Demarcus Ayers rush to the left for a loss of 12 yards to the Pit30. Tackled by Emmanuel Ogbah.","(9:58) DeAngelo Williams rush to the right for 3 yards to the Pit42. Tackled by Jamie Collins and Danny Shelton.","(10:05) Britton Colquitt punts for 42 yards to Pit39. No return.","(10:48) Robert Griffin III pass to the left to Corey Coleman for 7 yards to the Cle19. Tackled by Artie Burns.","(11:29) Robert Griffin III sacked at Cle12 for a loss of 7 yards by Bud Dupree. FUMBLE, recovered by Cle (Cameron Erving).","(12:02) Robert Griffin III pass to the right to Isaiah Crowell for 1 yard to the Cle19. Tackled by Ross Cockrell.","(12:14) Jordan Berry punts for 41 yards to Cle18. No return.","(12:49) Landry Jones sacked at Pit41 for a loss of 6 yards by Carl Nassib.","(12:54) Landry Jones incomplete pass to the left intended for DeAngelo Williams.","(13:37) DeAngelo Williams rush up the middle for 3 yards to the Pit47. Tackled by Jamie Collins.","(14:23) Landry Jones pass to the right to DeAngelo Williams for 17 yards to the Pit44. Tackled by Christian Kirksey.","(15:00) DeAngelo Williams rush up the middle for 2 yards to the Pit27. Tackled by Danny Shelton and Demario Davis.","(15:00) Cody Parkey kicks off to the endzone. Touchback.","(0:31) George Atkinson III rush to the left for 2 yards to the Cle27. Tackled by Bud Dupree and Ryan Shazier.","(0:31) Chris Boswell kicks off to the endzone. Touchback.","(0:31) Chris Boswell extra point is good.","(0:39) Landry Jones pass to the right to DeAngelo Williams for 11 yards for a TOUCHDOWN.","(0:42) Landry Jones incomplete pass to the right intended for Demarcus Ayers.","(1:08) Landry Jones pass to the right to Jesse James for 14 yards to the Cle11. Tackled by Jamie Collins.","(1:08) Pittsburgh Steelers timeout.","(1:13) DeAngelo Williams rush up the middle for 3 yards to the Cle25. Tackled by Jamie Collins.","(1:50) Landry Jones pass to the right to Eli Rogers for 5 yards to the Cle28. Tackled by Jamie Collins.","(1:56) Landry Jones incomplete pass to the left intended for Darrius Heyward-Bey.","(1:56) Two Minute Warning.","(2:01) DeAngelo Williams rush to the left for 4 yards to the Cle33. Tackled by Jamie Meder.","(2:06) Robert Griffin III rush up the middle for no gain to the Pit47. FUMBLE, recovered by Pit (Sean Davis). Tackled by Robert Griffin III.","(2:14) Jordan Berry punts for 46 yards to Pit47. No return.","(2:18) Landry Jones incomplete pass to the left intended for Demarcus Ayers.","(2:54) DeAngelo Williams rush up the middle for no gain to the Pit1. Tackled by Demario Davis.","(2:54) Pittsburgh Steelers timeout.","(3:39) DeAngelo Williams rush up the middle for no gain to the Pit1. Tackled by Jamar Taylor.","(3:46) Robert Griffin III pass intended for Rashard Higgins INTERCEPTED by Ryan Shazier. No return. Tackled by Seth DeValve. Penalty: Unnecessary Roughness on Pittsburgh (Johnny Maxey) -1 yards.","(4:12) Isaiah Crowell rush up the middle for 16 yards to the Pit17. Tackled by William Gay.","(4:38) George Atkinson III rush up the middle for 10 yards to the Pit33. Tackled by Ryan Shazier.","(5:16) Robert Griffin III pass to the left to Gary Barnidge for 15 yards to the Pit43. Tackled by Arthur Moats.","(5:52) Robert Griffin III pass to the left to Ricardo Louis for 6 yards to the Cle42. Tackled by Sean Davis and Artie Burns.","(6:37) Isaiah Crowell rush up the middle for 5 yards to the Cle36. Tackled by Bud Dupree.","(7:16) Isaiah Crowell rush to the right for a loss of 1 yard to the Cle31. Tackled by L.T. Walton.","(7:25) Jordan Berry punts for 40 yards to Cle32. No return.","(7:30) Landry Jones incomplete pass to the left intended for Darrius Heyward-Bey defensed by Briean Boddy-Calhoun.","(8:12) DeAngelo Williams rush to the right for 1 yard to the Pit28. Tackled by Xavier Cooper and Demario Davis.","(8:18) Landry Jones incomplete pass to the left intended for Demarcus Ayers.","(8:59) Landry Jones pass to the left to Eli Rogers for 11 yards to the Pit27.","(9:15) Demarcus Ayers rush to the right for no gain to the Pit16. Tackled by Joe Haden.","(9:21) Cody Parkey kicks off to the Pit1. Cobi Hamilton return for 15 yards to Pit16. Tackled by Tank Carder.","(9:21) Cody Parkey extra point is good.","(9:25) Robert Griffin III pass to the right to Gary Barnidge for 4 yards for a TOUCHDOWN.","(10:05) George Atkinson III rush up the middle for 3 yards to the Pit4. Tackled by Ryan Shazier.","(10:29) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 7 yards to the Pit7. Tackled by Artie Burns.","(11:07) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 7 yards to the Pit14. Tackled by Artie Burns.","(11:40) Isaiah Crowell rush up the middle for 1 yard to the Pit21. Tackled by Daniel McCullers.","(12:16) Robert Griffin III pass to the left to Isaiah Crowell for 13 yards to the Pit22. Tackled by Lawrence Timmons.","(12:55) Isaiah Crowell rush up the middle for a loss of 1 yard to the Pit35. Tackled by Johnny Maxey.","(13:35) Robert Griffin III pass to the middle to Ricardo Louis for 16 yards to the Pit34. Tackled by William Gay.","(14:20) Robert Griffin III pass to the right to Andrew Hawkins for 3 yards to the Cle50. Tackled by Bud Dupree.","(15:00) Robert Griffin III pass to the left to Isaiah Crowell for 2 yards to the Cle47. Tackled by Jarvis Jones.","(0:03) Robert Griffin III pass to the left to Gary Barnidge for 12 yards to the Cle45. Tackled by Sean Davis.","(0:14) Jordan Berry punts for 51 yards to Cle34. Mario Alford return for 9 yards to Cle43. Tackled by Roosevelt Nix. Penalty: Holding on Cleveland (Briean Boddy-Calhoun) -10 yards.","(0:48) Fitzgerald Toussaint rush to the right for 1 yard to the Pit15. Tackled by Christian Kirksey.","(1:26) Landry Jones pass to the left to Demarcus Ayers for 6 yards to the Pit14. Tackled by Christian Kirksey.","(2:10) DeAngelo Williams rush to the right for 1 yard to the Pit8. Tackled by Christian Kirksey.","(2:19) Britton Colquitt punts for 48 yards to Pit14. Eli Rogers - no return. FUMBLE, recovered by Pit. Penalty: Holding on Pittsburgh (Roosevelt Nix) -7 yards.","(2:58) Robert Griffin III sacked at Cle38 for a loss of 7 yards by Sean Davis.","(3:01) Robert Griffin III incomplete pass to the left intended for Terrelle Pryor Sr..","(3:01) Cleveland Browns timeout.","(3:44) Isaiah Crowell rush to the right for 2 yards to the Cle45. Tackled by L.T. Walton.","(4:33) Robert Griffin III rush up the middle for 19 yards to the Cle43. Tackled by Mike Mitchell.","(5:17) Robert Griffin III rush to the right for a loss of 2 yards to the Cle24. Tackled by Ross Cockrell.","(5:38) Robert Griffin III pass to the right to Terrelle Pryor Sr. for 6 yards to the Cle26. Tackled by Ross Cockrell and Bud Dupree.","(5:48) Jordan Berry punts for 43 yards to Cle30. Mario Alford - no return. Tackled by Darrius Heyward-Bey and Jordan Dangerfield. Penalty: Holding on Cleveland (Tracy Howard) -10 yards.","(6:21) Landry Jones sacked at Pit27 for a loss of 8 yards by Christian Kirksey.","(7:01) DeAngelo Williams rush to the right for 1 yard to the Pit35. Tackled by Ed Reynolds and Christian Kirksey.","(7:09) Landry Jones incomplete pass to the left intended for Darrius Heyward-Bey defensed by Jamar Taylor.","(7:43) Landry Jones pass to the right to Eli Rogers for 12 yards to the Pit34. Tackled by Joe Schobert.","(7:48) Cody Parkey kicks off to the Pit3. Cobi Hamilton return for 19 yards to Pit22. Tackled by Seth DeValve.","(7:48) Cody Parkey extra point is good.","(7:57) Robert Griffin III pass to the right to Seth DeValve for 12 yards for a TOUCHDOWN.","(8:37) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 3 yards to the Pit12. Tackled by Ryan Shazier.","(9:14) Isaiah Crowell rush to the left for 13 yards to the Pit15. Tackled by Mike Mitchell.","(9:48) Robert Griffin III pass to the right to Gary Barnidge for 9 yards to the Pit28. Tackled by Ryan Shazier.","(10:23) Isaiah Crowell rush up the middle for 6 yards to the Pit37. Tackled by Sean Davis.","(10:54) Duke Johnson Jr. rush up the middle for 4 yards to the Pit43. Tackled by Sean Davis.","(11:35) Robert Griffin III pass to the left to Andrew Hawkins for 1 yard to the Pit47. Tackled by William Gay and Artie Burns.","(12:06) Robert Griffin III pass to the right to Corey Coleman for 7 yards to the Pit48. Tackled by Ross Cockrell.","(12:14) Jordan Berry punts for 40 yards to Cle45. No return.","(12:43) Landry Jones sacked at Pit15 for a loss of 10 yards by Demario Davis.","(13:23) DeAngelo Williams rush to the right for a loss of 3 yards to the Pit25. Tackled by Demario Davis.","(13:59) Landry Jones pass to the left to Roosevelt Nix for 3 yards to the Pit28. Tackled by Jamar Taylor.","(14:11) Britton Colquitt punts for 51 yards to Pit20. Eli Rogers return for 5 yards to Pit25. Tackled by Ibraheim Campbell and Joe Schobert.","(14:16) Robert Griffin III incomplete pass to the right intended for Corey Coleman defensed by William Gay.","(14:51) Corey Coleman rush to the left for 9 yards to the Cle29. Tackled by Mike Mitchell.","(14:55) Penalty: False Start on Cleveland (Seth DeValve) -5 yards.","(15:00) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(15:00) Chris Boswell kicks off to the endzone. Touchback."]