["(0:34) Andy Dalton rush up the middle for a loss of 1 yard to the Cin26.","(1:08) Andy Dalton rush up the middle for a loss of 1 yard to the Cin27.","(1:53) Cedric Peerman rush to the right for 2 yards to the Cin28. Tackled by Brennen Beyer.","(2:00) Ryan Mallett pass intended for Breshad Perriman INTERCEPTED by KeiVarae Russell. No return.","(2:00) Two Minute Warning.","(2:20) Ryan Mallett pass to the left to Kenneth Dixon for 12 yards to the Bal37. Tackled by Darqueze Dennard and Nick Vigil.","(2:20) Randy Bullock kicks off to the endzone. Touchback.","(2:20) Randy Bullock extra point is good.","(2:23) Rex Burkhead rush to the right for 5 yards for a TOUCHDOWN.","(2:23) Baltimore Ravens timeout.","(2:29) Rex Burkhead rush to the left for a loss of 1 yard to the Bal5. Tackled by Brennen Beyer and Michael Pierce.","(3:15) Rex Burkhead rush to the right for 9 yards to the Bal4. Tackled by Brennen Beyer.","(3:15) Baltimore Ravens timeout.","(3:23) Cedric Peerman rush to the left for 2 yards to the Bal13. Tackled by Brandon Williams.","(4:07) Rex Burkhead rush to the right for 5 yards to the Bal15. Tackled by C.J. Mosley and Za'Darius Smith.","(4:44) Rex Burkhead rush to the left for 5 yards to the Bal20. Tackled by Albert McClellan and Michael Pierce.","(4:49) Joe Flacco incomplete pass to the right intended for Breshad Perriman defensed by Dre Kirkpatrick.","(5:29) Joe Flacco pass to the middle to Breshad Perriman for 5 yards to the Bal25. Tackled by Nick Vigil.","(5:35) Joe Flacco incomplete pass to the middle intended for Steve Smith Sr..","(5:39) Joe Flacco incomplete pass to the middle intended for Steve Smith Sr. defensed by Karlos Dansby.","(5:46) Kevin Huber punts for 63 yards to Bal0. Touchback.","(6:30) Andy Dalton rush up the middle for 5 yards to the Cin37. Tackled by Matt Judon and Patrick Onwuasor.","(6:37) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(7:19) Rex Burkhead rush to the right for a loss of 1 yard to the Cin32. Tackled by Eric Weddle and Michael Pierce.","(7:58) Andy Dalton pass to the right to Brandon LaFell for 13 yards to the Cin33.","(8:32) Rex Burkhead rush to the right for 4 yards to the Cin20. Tackled by Michael Pierce and Patrick Onwuasor.","(8:37) Justin Tucker kicks off to the Cin2. Alex Erickson return for 14 yards to Cin16. Tackled by Nick Boyle.","(8:37) Justin Tucker extra point is good.","(8:41) Kenneth Dixon rush to the left for 1 yard for a TOUCHDOWN.","(9:17) Kenneth Dixon rush to the right for no gain to the Cin1. Tackled by Domata Peko.","(9:31) Joe Flacco pass to the middle to Breshad Perriman for 39 yards to the Cin1. Tackled by Derron Smith.","(9:58) Joe Flacco pass to the right to Kyle Juszczyk for 4 yards to the Cin40. Tackled by Karlos Dansby.","(10:24) Joe Flacco pass to the middle to Dennis Pitta for 5 yards to the Cin44. Tackled by George Iloka.","(10:57) Joe Flacco pass to the left to Dennis Pitta for 7 yards to the Cin49. Tackled by Michael Johnson.","(11:22) Joe Flacco pass to the left to Kenneth Dixon for 1 yard to the Bal44. Tackled by Nick Vigil.","(11:49) Joe Flacco pass to the left to Breshad Perriman for 13 yards to the Bal43. Tackled by Adam Jones.","(11:59) Kevin Huber punts for 48 yards to Bal13. Michael Campanaro return for 17 yards to Bal30. Tackled by Clark Harris.","(12:05) Andy Dalton incomplete pass to the left.","(12:09) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(12:45) Rex Burkhead rush to the right for no gain to the Cin39. Tackled by Timmy Jernigan.","(13:30) Rex Burkhead rush to the right for 10 yards to the Cin39. Tackled by Matt Judon and Patrick Onwuasor.","(13:42) Sam Koch punts for 46 yards to Cin14. Adam Jones return for 15 yards to Cin29. Tackled by Darren Waller.","(14:17) Joe Flacco pass to the left to Dennis Pitta for 8 yards to the Bal40. Tackled by Darqueze Dennard.","(14:25) Joe Flacco incomplete pass to the right. Penalty: Intentional Grounding on Baltimore (Joe Flacco) -15 yards.","(14:50) Joe Flacco pass to the left to Dennis Pitta for 7 yards to the Bal47. Tackled by Adam Jones.","(15:00) Kevin Huber punts for 47 yards to Bal31. Michael Campanaro return for 9 yards to Bal40. Tackled by Clark Harris.","(0:21) Andy Dalton sacked at Cin22 for a loss of 8 yards by Elvis Dumervil.","(1:01) Cedric Peerman rush to the right for 3 yards to the Cin30. Tackled by Eric Weddle and Patrick Onwuasor.","(1:37) Cedric Peerman rush to the left for no gain to the Cin27. Tackled by Michael Pierce.","(2:17) Andy Dalton pass to the left to Rex Burkhead for 13 yards to the Cin27. Tackled by Shareece Wright.","(2:54) Rex Burkhead rush to the left for 6 yards to the Cin14. Tackled by C.J. Mosley and Shareece Wright.","(2:57) Joe Flacco incomplete pass to the right intended for Dennis Pitta defensed by Nick Vigil.","(3:02) Joe Flacco incomplete pass to the left intended for Alex Lewis.","(3:41) Joe Flacco pass to the middle to Breshad Perriman for 5 yards to the Cin8. Tackled by Karlos Dansby.","(4:13) Joe Flacco pass to the right to Terrance West for 3 yards to the Cin13. Tackled by Dre Kirkpatrick and Wallace Gilberry.","(4:55) Joe Flacco pass to the left to Steve Smith Sr. for 7 yards to the Cin16. Tackled by Adam Jones.","(5:21) Joe Flacco pass to the right to Mike Wallace for 6 yards to the Cin23. Tackled by Dre Kirkpatrick.","(5:47) Joe Flacco pass to the right to Mike Wallace for 10 yards to the Cin29. Tackled by Dre Kirkpatrick.","(6:05) Kenneth Dixon rush to the right for 11 yards to the Cin29. Tackled by George Iloka. Penalty: Holding on Baltimore (James Hurst) -10 yards.","(6:58) Joe Flacco pass to the left to Dennis Pitta for 8 yards to the Cin40. Tackled by Karlos Dansby.","(7:02) Joe Flacco incomplete pass to the middle intended for Dennis Pitta.","(7:31) Joe Flacco pass to the right to Steve Smith Sr. for 14 yards to the Cin48. Tackled by Shawn Williams.","(7:36) Joe Flacco incomplete pass to the left intended for Kamar Aiken.","(8:01) Kenneth Dixon rush to the right for 4 yards to the Bal38. Tackled by Vincent Rey and Karlos Dansby.","(8:11) Kevin Huber punts for 52 yards to Bal22. Michael Campanaro return for 12 yards to Bal34. Tackled by Trevor Roach.","(8:15) Andy Dalton incomplete pass to the left intended for Cody Core.","(8:20) Andy Dalton incomplete pass to the middle intended for Brandon LaFell.","(8:46) Rex Burkhead rush to the left for 2 yards to the Cin26. Tackled by Elvis Dumervil.","(9:11) Rex Burkhead rush to the right for 4 yards to the Cin24. Tackled by Michael Pierce.","(9:35) Andy Dalton pass to the right to Brandon LaFell for 7 yards to the Cin20. Tackled by Elvis Dumervil and C.J. Mosley.","(9:50) Sam Koch punts for 68 yards to Cin13. Alex Erickson - no return. FUMBLE, recovered by Cin (Alex Erickson).","(10:26) Joe Flacco sacked at Bal19 for a loss of 12 yards by Wallace Gilberry.","(10:54) Joe Flacco pass to the right to Terrance West for 8 yards to the Bal31. Tackled by Karlos Dansby and Dre Kirkpatrick.","(10:58) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(11:23) Joe Flacco pass to the right to Dennis Pitta for 5 yards to the Bal23. Tackled by George Iloka and Karlos Dansby.","(11:51) Terrance West rush to the right for 1 yard to the Bal18. Tackled by Vincent Rey.","(12:15) Joe Flacco pass to the right to Dennis Pitta for 8 yards to the Bal17. Tackled by George Iloka.","(12:22) Kevin Huber punts for 37 yards to Bal9. No return.","(12:25) Andy Dalton incomplete pass to the left intended for Brandon LaFell.","(12:58) Rex Burkhead rush to the left for 4 yards to the Bal46. Tackled by Albert McClellan.","(13:35) Rex Burkhead rush to the right for 2 yards to the Cin50. Tackled by Albert McClellan.","(14:02) Andy Dalton pass to the middle to Brandon LaFell for 12 yards to the Cin48. Tackled by Tavon Young and Matt Judon.","(14:07) Andy Dalton incomplete pass to the right intended for Cedric Peerman.","(14:33) Rex Burkhead rush to the right for 3 yards to the Cin36. Tackled by C.J. Mosley and Tavon Young.","(15:00) Rex Burkhead rush to the right for 8 yards to the Cin33. Tackled by Lardarius Webb.","(15:00) Justin Tucker kicks off to the endzone. Touchback.","(0:03) Randy Bullock kicks off to the Bal20. Nick Boyle - no return.","(0:07) Randy Bullock 24 yard field goal attempt is GOOD. Holder: Kevin Huber.","(0:08) Andy Dalton incomplete pass to the middle.","(0:30) Andy Dalton pass to the right to Tyler Boyd for 13 yards to the Bal6. Tackled by Tavon Young.","(0:30) Penalty: False Start on Cincinnati (Andrew Whitworth) -5 yards.","(0:30) Cincinnati Bengals timeout.","(0:38) Andy Dalton pass to the left to Cody Core for 31 yards to the Bal14. Tackled by Chris Lewis-Harris and Lardarius Webb.","(1:05) Andy Dalton pass to the middle to Rex Burkhead for 12 yards to the Bal45. Tackled by Patrick Onwuasor and C.J. Mosley.","(1:30) Andy Dalton rush up the middle for 1 yard to the Cin43. Tackled by Terrell Suggs.","(2:00) Andy Dalton pass to the left to Cody Core for 19 yards to the Cin42. Tackled by C.J. Mosley.","(2:00) Two Minute Warning.","(2:28) Rex Burkhead rush to the right for 3 yards to the Cin23. Tackled by C.J. Mosley and Lawrence Guy.","(2:35) Joe Flacco pass intended for Dennis Pitta INTERCEPTED by Shawn Williams. No return. Touchback.","(2:35) Cincinnati Bengals timeout.","(3:13) Joe Flacco pass to the middle to Kamar Aiken for 13 yards to the Cin2. Tackled by Shawn Williams.","(3:44) Joe Flacco pass to the right to Dennis Pitta for 9 yards to the Cin15. Tackled by George Iloka and Josh Shaw.","(4:20) Terrance West rush to the left for 4 yards to the Cin24. Tackled by Vincent Rey.","(4:47) Joe Flacco pass to the right to Mike Wallace for 11 yards to the Cin28. Tackled by Dre Kirkpatrick.","(5:16) Kenneth Dixon rush to the right for 5 yards to the Cin39. Tackled by Vincent Rey.","(5:41) Joe Flacco pass to the right to Kenneth Dixon for 6 yards to the Cin44. Tackled by Karlos Dansby.","(5:59) Joe Flacco pass to the right to Dennis Pitta for 10 yards to the Bal50. Tackled by Vincent Rey and George Iloka.","(6:09) Penalty: Unnecessary Roughness on Cincinnati (Shawn Williams) 15 yards.","(6:09) Randy Bullock kicks off to the endzone. Touchback.","(6:13) Randy Bullock 23 yard field goal attempt is GOOD. Holder: Kevin Huber.","(6:20) Andy Dalton incomplete pass to the right.","(6:54) Rex Burkhead rush to the right for 5 yards to the Bal5. Tackled by Za'Darius Smith and Lardarius Webb.","(6:59) Andy Dalton incomplete pass to the left intended for Brandon LaFell defensed by Eric Weddle.","(7:32) Rex Burkhead rush to the left for 4 yards to the Bal20. Tackled by Jerraud Powers. Penalty: Unnecessary Roughness on Baltimore (Albert McClellan) 10 yards.","(8:04) Cedric Peerman rush to the right for 4 yards to the Bal24. Tackled by Michael Pierce.","(8:34) Andy Dalton pass to the left to Cody Core for 22 yards to the Bal28. Tackled by C.J. Mosley and Eric Weddle.","(9:15) Cedric Peerman rush to the left for 4 yards to the Cin50. Tackled by C.J. Mosley.","(9:39) Andy Dalton pass to the right to Brandon LaFell for 17 yards to the Cin46. Tackled by Jerraud Powers and C.J. Mosley.","(10:05) Andy Dalton pass to the left to C.J. Uzomah for 5 yards to the Cin29. Tackled by Lardarius Webb.","(10:43) Andy Dalton pass to the left to Brandon LaFell for 3 yards to the Cin24. Tackled by Jerraud Powers.","(11:06) Rex Burkhead rush to the right for 3 yards to the Cin21. Tackled by Brandon Williams.","(11:12) Sam Koch punts for 26 yards to Cin18. No return.","(11:48) Joe Flacco pass to the left to Kyle Juszczyk for a loss of 3 yards to the Cin44. Tackled by Vincent Rey.","(11:52) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(11:57) Joe Flacco incomplete pass to the right intended for Kenneth Dixon.","(12:32) Joe Flacco pass to the left to Dennis Pitta for 16 yards to the Cin41. Tackled by Nick Vigil.","(12:36) Joe Flacco incomplete pass to the right intended for Terrance West defensed by Will Clarke.","(13:11) Kenneth Dixon rush to the left for a loss of 2 yards to the Bal43. Tackled by Karlos Dansby.","(13:42) Joe Flacco pass to the right to Steve Smith Sr. for 13 yards to the Bal45. Tackled by Shawn Williams.","(13:42) Cincinnati Bengals timeout.","(13:47) Joe Flacco incomplete pass to the right intended for Dennis Pitta.","(14:18) Joe Flacco pass to the right to Dennis Pitta for 8 yards to the Bal32. Tackled by Nick Vigil.","(14:24) Joe Flacco incomplete pass to the right.","(14:56) Kenneth Dixon rush to the right for 3 yards to the Bal24. Tackled by Shawn Williams.","(15:00) Randy Bullock kicks off to the Bal2. Chris Moore return for 19 yards to Bal21. Tackled by James Wright.","(15:00) Randy Bullock extra point is good.","(0:02) Andy Dalton pass to the right to C.J. Uzomah for 1 yard for a TOUCHDOWN.","(0:06) Penalty: Pass Interference on Baltimore (Lardarius Webb) 6 yards.","(0:48) Baltimore Ravens timeout.","(0:48) Rex Burkhead rush to the left for 6 yards to the Bal7. Tackled by Albert McClellan and Matt Judon.","(1:21) Rex Burkhead rush to the left for 4 yards to the Bal13. Tackled by C.J. Mosley and Eric Weddle.","(1:58) Andy Dalton pass to the right to Tyler Boyd for 26 yards to the Bal17. Tackled by Lardarius Webb.","(2:33) Tyler Boyd rush to the right for 15 yards to the Bal43. Tackled by Lardarius Webb.","(3:12) Rex Burkhead rush to the right for 2 yards to the Cin42. Tackled by Za'Darius Smith.","(3:12) Justin Tucker kicks off to the Cin7, out of bounds. No return.","(3:17) Justin Tucker 30 yard field goal attempt is GOOD. Holder: Sam Koch.","(4:01) Terrance West rush to the left for a loss of 1 yard to the Cin12. Tackled by Karlos Dansby.","(4:43) Joe Flacco pass to the right to Terrance West for 3 yards to the Cin11. Tackled by Josh Shaw and George Iloka.","(5:19) Joe Flacco pass to the left to Mike Wallace for 6 yards to the Cin14. Tackled by Adam Jones.","(5:53) Michael Campanaro rush to the right for 10 yards to the Cin20. Tackled by Shawn Williams.","(6:29) Terrance West rush up the middle for 11 yards to the Cin30. Tackled by Karlos Dansby and Shawn Williams.","(6:59) Kenneth Dixon rush to the right for 12 yards to the Cin41. Tackled by Shawn Williams.","(7:28) Joe Flacco pass to the right to Kamar Aiken for 9 yards to the Bal47. Tackled by Dre Kirkpatrick and Nick Vigil.","(8:06) Joe Flacco sacked at Bal38 for a loss of 3 yards by Geno Atkins and Pat Sims.","(8:39) Joe Flacco pass to the left to Terrance West for 3 yards to the Bal41. Tackled by Karlos Dansby and Adam Jones.","(9:14) Kenneth Dixon rush to the left for 4 yards to the Bal38. Tackled by George Iloka.","(9:47) Kenneth Dixon rush to the left for 6 yards to the Bal34. Tackled by Vincent Rey and Darqueze Dennard.","(10:17) Terrance West rush to the left for 3 yards to the Bal28. Tackled by Adam Jones.","(10:17) Randy Bullock kicks off to the endzone. Touchback.","(10:17) Randy Bullock extra point is good.","(10:23) Rex Burkhead rush to the left for 5 yards for a TOUCHDOWN.","(11:00) Andy Dalton pass to the right to Brandon LaFell for 3 yards to the Bal5. Tackled by Jerraud Powers and C.J. Mosley.","(11:32) Andy Dalton pass to the left to Cody Core for 10 yards to the Bal8. Tackled by Shareece Wright.","(12:02) Rex Burkhead rush to the right for 3 yards to the Bal18. Tackled by Tavon Young.","(12:33) Andy Dalton pass to the right to Brandon LaFell for 12 yards to the Bal21.","(13:05) Rex Burkhead rush to the right for 2 yards to the Bal33. Tackled by Patrick Onwuasor and Brandon Williams.","(13:39) Rex Burkhead rush to the left for 17 yards to the Bal35. Tackled by Shareece Wright and Lardarius Webb.","(14:06) Andy Dalton pass to the left to C.J. Uzomah for 7 yards to the Cin48. Tackled by Terrell Suggs.","(14:15) Sam Koch punts for 35 yards to Cin41. No return.","(14:50) Joe Flacco sacked at Bal24 for a loss of 1 yard by Carlos Dunlap and Michael Johnson.","(14:55) Joe Flacco incomplete pass to the middle intended for Dennis Pitta defensed by Vincent Rey.","(15:00) Joe Flacco incomplete pass to the left intended for Darren Waller.","(15:00) Randy Bullock kicks off to the endzone. Touchback."]