["(0:09) Blake Bortles pass to the right to Marqise Lee for 18 yards to the Jax43. Tackled by Akeem Ayers and Darryl Morris.","(0:09) Pat McAfee kicks off to the endzone. Touchback.","(0:09) Adam Vinatieri extra point is good.","(0:09) Penalty: False Start on Indianapolis (Joe Reitz) -5 yards.","(0:14) Andrew Luck pass to the right to Jack Doyle for 1 yard for a TOUCHDOWN.","(0:14) Andrew Luck incomplete pass to the middle.","(0:28) Andrew Luck pass to the right to Phillip Dorsett for 9 yards to the Jax1. Tackled by Telvin Smith and Paul Posluszny.","(0:28) Penalty: Offside on Jacksonville (Tyson Alualu) 5 yards.","(0:40) Andrew Luck pass to the middle to Robert Turbin for 14 yards to the Jax15. Tackled by Josh Johnson.","(0:40) Andrew Luck incomplete pass to the middle.","(0:57) Andrew Luck pass to the right to Phillip Dorsett for 19 yards to the Jax29. Tackled by Jalen Ramsey.","(1:18) Andrew Luck pass to the left to Chester Rogers for 18 yards to the Jax48. Tackled by Tashaun Gipson.","(1:33) Andrew Luck pass to the middle to Jack Doyle for 9 yards to the Ind34. Tackled by Paul Posluszny.","(1:33) Jason Myers kicks off to the endzone. Touchback.","(1:38) Jason Myers 41 yard field goal attempt is GOOD. Holder: Brad Nortman.","(1:38) Indianapolis Colts timeout.","(1:43) Corey Grant rush to the left for no gain to the Ind23. Tackled by Zach Kerr and T.Y. McGill.","(1:43) Indianapolis Colts timeout.","(1:49) Corey Grant rush to the left for 1 yard to the Ind23. Tackled by Erik Walden and Zach Kerr.","(1:49) Indianapolis Colts timeout.","(1:54) Corey Grant rush up the middle for 6 yards to the Ind24. Tackled by Akeem Ayers.","(2:00) Pat McAfee punt blocked by Dan Skuta. Antonio Morrison incomplete pass to the middle intended for Pat McAfee.","(2:00) Two Minute Warning.","(2:40) Andrew Luck sacked at Ind30 for a loss of 7 yards by Malik Jackson.","(2:47) Andrew Luck incomplete pass to the left intended for Chester Rogers.","(3:25) Andrew Luck sacked at Ind37 for a loss of 7 yards by Malik Jackson.","(3:30) 54 yard field goal attempt by Jason Myers is NO GOOD. Holder: Brad Nortman.","(3:36) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(4:14) Corey Grant rush to the left for a loss of 2 yards to the Ind36. Tackled by T.Y. McGill.","(4:49) Blake Bortles pass to the right to Allen Robinson for 15 yards to the Ind34. Tackled by Vontae Davis.","(4:56) Corey Grant rush to the left for 1 yard to the Ind39. Tackled by Robert Mathis. Penalty: Holding on Jacksonville (Alex Ellis) -10 yards.","(5:30) Blake Bortles pass to the left to Allen Robinson for 12 yards to the Ind40. Tackled by Mike Adams.","(5:36) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Vontae Davis.","(6:16) Corey Grant rush to the right for 4 yards to the Jax48. Tackled by Antonio Morrison and Trent Cole.","(6:43) Blake Bortles pass to the right to Marqise Lee for 9 yards to the Jax44. Tackled by Chris Milton.","(7:19) Blake Bortles rush to the left for 3 yards to the Jax35. Tackled by Vontae Davis.","(7:23) Andrew Luck rush up the middle for no gain to the Jax29. FUMBLE, recovered by Jax (Sen'Derrick Marks). Tackled by Ryan Kelly.","(8:05) Frank Gore rush up the middle for a loss of 1 yard to the Jax29. Tackled by Dan Skuta.","(8:43) Andrew Luck pass to the right to Chester Rogers for 21 yards to the Jax28.","(9:23) Andrew Luck pass to the left to Robert Turbin for 4 yards to the Jax49. Tackled by Telvin Smith.","(9:49) Penalty: Holding on Indianapolis (Jonotthan Harrison) -10 yards.","(10:30) Andrew Luck pass to the left to T.Y. Hilton for 9 yards to the Jax43. Tackled by Jalen Ramsey.","(10:34) Andrew Luck incomplete pass to the middle intended for Jack Doyle defensed by Paul Posluszny.","(11:13) Frank Gore rush to the left for 1 yard to the Ind48. Tackled by Abry Jones.","(11:53) Andrew Luck pass to the left to T.Y. Hilton for 13 yards to the Ind47. Tackled by Jalen Ramsey.","(11:58) Blake Bortles sacked at Ind34 for a loss of 10 yards by Robert Mathis. FUMBLE, recovered by Ind (Robert Mathis). Tackled by A.J. Cann.","(12:04) Blake Bortles incomplete pass to the right intended for Marqise Lee defensed by Chris Milton.","(12:42) Corey Grant rush to the left for 2 yards to the Ind24. Tackled by Zach Kerr and Antonio Morrison.","(13:12) Blake Bortles pass to the middle to Bryan Walters for 12 yards to the Ind26. Tackled by Antonio Morrison.","(13:44) Corey Grant rush to the left for 3 yards to the Ind38. Tackled by Erik Walden.","(14:23) Corey Grant rush to the left for 6 yards to the Ind41. Tackled by Edwin Jackson.","(14:55) Blake Bortles pass to the left to Allen Robinson for 7 yards to the Ind47. Tackled by Mike Adams.","(15:00) Penalty: Illegal Contact on Indianapolis (Vontae Davis) 5 yards.","(0:07) Blake Bortles pass to the left to Marqise Lee for 22 yards to the Jax41. Tackled by Antonio Morrison.","(0:12) Pat McAfee kicks off to the Jax3. Bryan Walters return for 16 yards to Jax19. Tackled by Josh McNary.","(0:12) Adam Vinatieri extra point is good.","(0:19) Andrew Luck pass to the right to Dwayne Allen for 15 yards for a TOUCHDOWN.","(0:48) Penalty: Too Many Men on Field on Jacksonville (Myles Jack) 6 yards.","(1:22) Frank Gore rush up the middle for 4 yards to the Jax21. Tackled by Prince Amukamara and Paul Posluszny.","(2:02) Frank Gore rush to the right for 5 yards to the Jax25. Tackled by Sen'Derrick Marks.","(2:38) Robert Turbin rush up the middle for 3 yards to the Jax30. Tackled by Davon House and Johnathan Cyprien.","(3:04) Andrew Luck pass to the right to Chester Rogers for 12 yards to the Jax33. Tackled by Davon House.","(3:49) Andrew Luck rush to the right for 12 yards to the Jax45. Tackled by Josh Johnson.","(3:53) Andrew Luck incomplete pass to the left intended for Chester Rogers defensed by Prince Amukamara.","(4:29) Penalty: Face Mask on Indianapolis (Chester Rogers) -15 yards.","(4:36) Penalty: Holding on Jacksonville (Myles Jack) 5 yards.","(4:52) Andrew Luck pass to the left to T.Y. Hilton for 11 yards to the Jax47. Tackled by Telvin Smith.","(4:57) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(5:46) Andrew Luck pass to the right to Frank Gore for 7 yards to the Ind42. Tackled by Paul Posluszny.","(6:21) Frank Gore rush up the middle for 3 yards to the Ind35. Tackled by Telvin Smith.","(6:55) Andrew Luck pass to the left to Phillip Dorsett for 21 yards to the Ind32. Tackled by Prince Amukamara.","(7:04) Brad Nortman punts for 48 yards to Ind11. No return.","(8:07) Penalty: Delay of Game on Jacksonville (Blake Bortles) -5 yards.","(8:07) Joe Banyard rush to the right for no gain to the Jax46. Tackled by Matthias Farley.","(8:32) Denard Robinson rush to the right for 7 yards to the Jax46. Tackled by Hassan Ridgeway.","(9:08) Blake Bortles pass to the right to Corey Grant for 2 yards to the Jax39. Tackled by Matthias Farley.","(9:44) Corey Grant rush to the right for 4 yards to the Jax37. Tackled by David Parry.","(10:16) Blake Bortles pass to the right to Marqise Lee for 8 yards to the Jax33. Tackled by Antonio Morrison.","(10:16) Pat McAfee kicks off to the endzone. Touchback.","(10:16) Adam Vinatieri extra point is good.","(10:22) Robert Turbin rush to the left for 7 yards for a TOUCHDOWN.","(11:02) Andrew Luck pass to the left to Erik Swoope for 22 yards to the Jax7. Tackled by Johnathan Cyprien.","(11:46) Frank Gore rush up the middle for 18 yards to the Jax29. Tackled by Tashaun Gipson and Paul Posluszny.","(12:19) Frank Gore rush up the middle for 8 yards to the Jax47. Tackled by Prince Amukamara and Tashaun Gipson.","(12:51) Andrew Luck pass to the left to T.Y. Hilton for 28 yards to the Ind45. Tackled by Tashaun Gipson.","(13:00) Brad Nortman punts for 38 yards to Ind17. No return.","(13:03) Blake Bortles incomplete pass to the right intended for Allen Robinson.","(13:06) Blake Bortles incomplete pass to the right intended for Ben Koyack.","(13:43) Blake Bortles pass to the middle to Ben Koyack for 8 yards to the Jax45. Tackled by Edwin Jackson.","(14:20) Blake Bortles pass to the right to Allen Robinson for 6 yards to the Jax37. Tackled by Vontae Davis.","(14:25) Blake Bortles incomplete pass to the right intended for Allen Robinson.","(15:00) Corey Grant rush up the middle for 6 yards to the Jax31. Tackled by Edwin Jackson.","(15:00) Pat McAfee kicks off to the endzone. Touchback.","(0:19) Andrew Luck sacked at Ind14 for a loss of 6 yards by Sen'Derrick Marks and Dante Fowler Jr..","(0:24) 30 yard field goal attempt by Jason Myers is NO GOOD. Holder: Brad Nortman.","(0:28) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(0:34) Blake Bortles pass to the left to Ben Koyack for 3 yards to the Ind12. Tackled by Edwin Jackson.","(0:37) Blake Bortles incomplete pass to the right intended for Allen Robinson.","(0:37) Jacksonville Jaguars timeout.","(0:44) Blake Bortles pass to the right to Bryan Walters for 5 yards to the Ind15. Tackled by Darryl Morris.","(0:44) Jacksonville Jaguars timeout.","(0:51) Blake Bortles pass to the right to Bryan Walters for 6 yards to the Ind20. Tackled by Darryl Morris.","(1:17) Corey Grant rush to the right for a loss of 1 yard to the Ind26. Tackled by Antonio Morrison.","(1:24) Blake Bortles pass to the right to Bryan Walters for 23 yards to the Ind25. Tackled by Darryl Morris.","(2:00) Denard Robinson rush to the left for 2 yards to the Ind48. Tackled by David Parry.","(2:00) Two Minute Warning.","(2:05) Denard Robinson rush to the right for 4 yards to the Jax50. Tackled by Henry Anderson.","(2:35) Blake Bortles pass to the left to Marqise Lee for 18 yards to the Jax46. Tackled by Mike Adams.","(2:41) Pat McAfee kicks off to the Jax5. Bryan Walters return for 23 yards to Jax28. Tackled by Chris Carter.","(2:46) Adam Vinatieri 45 yard field goal attempt is GOOD. Holder: Pat McAfee.","(2:50) Andrew Luck incomplete pass to the right intended for Robert Turbin defensed by Telvin Smith.","(3:27) Andrew Luck pass to the right to Frank Gore for 7 yards to the Jax27. Tackled by Tyson Alualu.","(3:31) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(4:09) Andrew Luck pass to the right to T.Y. Hilton for 15 yards to the Jax34. Tackled by Jalen Ramsey.","(4:45) Frank Gore rush to the left for 1 yard to the Jax49. Tackled by Telvin Smith.","(5:22) Andrew Luck pass to the left to Dwayne Allen for 6 yards to the Ind50. Tackled by Johnathan Cyprien.","(5:45) Andrew Luck pass to the left to T.Y. Hilton for 19 yards to the Ind44. Tackled by Telvin Smith.","(5:45) Jason Myers kicks off to the endzone. Touchback.","(5:45) Jason Myers extra point is good.","(5:57) Corey Grant rush up the middle for 57 yards for a TOUCHDOWN.","(6:33) Corey Grant rush up the middle for 5 yards to the Jax43. Tackled by Erik Walden and David Parry.","(6:39) 48 yard field goal attempt by Adam Vinatieri is NO GOOD. Holder: Pat McAfee.","(7:22) Andrew Luck sacked at Jax30 for a loss of 11 yards by Yannick Ngakoue.","(7:28) Andrew Luck incomplete pass to the left intended for T.Y. Hilton defensed by Jalen Ramsey.","(8:05) Frank Gore rush up the middle for 3 yards to the Jax19. Tackled by Telvin Smith.","(8:12) Blake Bortles sacked at Jax22 for a loss of 3 yards by Erik Walden. FUMBLE, recovered by Ind (Zach Kerr). Tackled by A.J. Cann.","(8:18) Blake Bortles incomplete pass to the left intended for Bronson Hill defensed by Henry Anderson.","(8:52) Bronson Hill rush to the left for 7 yards to the Jax25. Tackled by David Parry and Mike Adams.","(9:00) Andrew Luck pass intended for T.Y. Hilton INTERCEPTED by Telvin Smith. No return. Tackled by Jack Doyle.","(9:29) Andrew Luck pass to the right to Chester Rogers for 21 yards to the Jax31. Tackled by Tashaun Gipson and Josh Johnson.","(10:08) Frank Gore rush to the left for 2 yards to the Ind48. Tackled by Yannick Ngakoue.","(10:47) Andrew Luck pass to the middle to Dwayne Allen for 13 yards to the Ind46. Tackled by Johnathan Cyprien.","(11:25) Frank Gore rush to the right for 3 yards to the Ind33. Tackled by Abry Jones.","(11:58) Frank Gore rush up the middle for 10 yards to the Ind30. Tackled by Johnathan Cyprien.","(12:03) Andrew Luck incomplete pass to the left intended for T.Y. Hilton defensed by Myles Jack.","(12:12) Brad Nortman punts for 50 yards to Ind0. Touchback.","(12:18) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(12:31) Penalty: False Start on Jacksonville (Kelvin Beachum) -5 yards.","(13:10) Blake Bortles rush up the middle for 2 yards to the Ind45. Tackled by Darryl Morris.","(13:45) Bronson Hill rush up the middle for 4 yards to the Ind47. Tackled by Henry Anderson.","(14:28) Bryan Walters rush to the right for 4 yards to the Jax49. Tackled by Darryl Morris and Antonio Morrison.","(15:00) Blake Bortles pass to the left to Bryan Walters for 7 yards to the Jax45. Tackled by Mike Adams.","(0:33) Blake Bortles pass to the left to Bryan Walters for 11 yards to the Jax38. Tackled by Edwin Jackson.","(0:41) Pat McAfee punts for 50 yards to Jax27. No return.","(0:46) Andrew Luck incomplete pass to the left intended for Jack Doyle defensed by Johnathan Cyprien.","(1:28) Andrew Luck rush to the left for 5 yards to the Ind23. Tackled by Telvin Smith.","(2:05) Frank Gore rush up the middle for 2 yards to the Ind18. Tackled by Prince Amukamara and Sheldon Day.","(2:13) Brad Nortman punts for 52 yards to Ind16. No return.","(2:21) Blake Bortles incomplete pass to the middle intended for Allen Robinson defensed by Vontae Davis.","(3:04) Blake Bortles pass to the right to Tony Washington for 9 yards to the Jax32. Tackled by Robert Mathis.","(3:09) Blake Bortles incomplete pass to the left intended for Denard Robinson.","(3:42) Blake Bortles pass to the left to Corey Grant for 13 yards to the Jax23. Tackled by T.J. Green.","(4:22) Corey Grant rush to the left for 2 yards to the Jax10. Tackled by David Parry and Antonio Morrison.","(4:37) Pat McAfee punts for 57 yards to Jax16. Bryan Walters - no return. Tackled by Chris Carter and Matt Overton. Penalty: Holding on Jacksonville (Dan Skuta) -8 yards.","(4:44) Andrew Luck incomplete pass to the right intended for Chester Rogers.","(5:25) Frank Gore rush to the right for a loss of 4 yards to the Ind27. Tackled by Paul Posluszny.","(5:57) Frank Gore rush up the middle for 6 yards to the Ind31. Tackled by Telvin Smith.","(5:57) Jason Myers kicks off to the endzone. Touchback.","(5:57) Jason Myers extra point is good.","(6:03) Blake Bortles pass to the middle to Ben Koyack for 14 yards for a TOUCHDOWN.","(6:42) Blake Bortles pass to the right to Bryan Walters for 8 yards to the Ind14. Tackled by Charles James and Chris Milton.","(7:19) Blake Bortles pass to the left to Marqise Lee for 11 yards to the Ind22. Tackled by Chris Milton.","(7:56) Corey Grant rush to the right for 14 yards to the Ind33. Tackled by T.J. Green.","(8:32) Blake Bortles pass to the right to Bryan Walters for 12 yards to the Ind47. Tackled by Charles James.","(9:02) Blake Bortles rush to the left for 16 yards to the Jax41. Tackled by Edwin Jackson.","(9:06) Blake Bortles incomplete pass to the right intended for Bryan Walters.","(9:14) Pat McAfee punts for 45 yards to Jax25. No return.","(9:19) Andrew Luck incomplete pass to the middle intended for Jack Doyle defensed by Dante Fowler Jr..","(10:00) Robert Turbin rush up the middle for 5 yards to the Ind30. Tackled by Abry Jones.","(10:05) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(10:05) Jason Myers kicks off to the endzone. Touchback.","(10:11) Jason Myers 47 yard field goal attempt is GOOD. Holder: Brad Nortman.","(10:50) Joe Banyard rush up the middle for 7 yards to the Ind29. Tackled by Trent Cole and T.J. Green.","(11:29) Denard Robinson rush up the middle for 4 yards to the Ind36. Tackled by Henry Anderson.","(11:54) Penalty: Holding on Jacksonville (Jermey Parnell) -10 yards.","(12:00) Blake Bortles incomplete pass to the left intended for Allen Robinson defensed by Vontae Davis.","(12:21) Blake Bortles pass to the right to Allen Robinson for 42 yards to the Ind30. Tackled by Darryl Morris and Mike Adams.","(12:59) Corey Grant rush to the left for 14 yards to the Jax28. Tackled by Darryl Morris.","(13:35) Corey Grant rush to the left for no gain to the Jax14. Tackled by Vontae Davis and Erik Walden.","(13:45) Pat McAfee punts for 51 yards to Jax16. Bryan Walters return for a loss of 2 yards to Jax14. Tackled by Chris Milton.","(13:49) Andrew Luck incomplete pass to the right intended for Robert Turbin.","(14:27) Andrew Luck pass to the right to Phillip Dorsett for 7 yards to the Ind33. Tackled by Prince Amukamara.","(15:00) Frank Gore rush to the left for 1 yard to the Ind26. Tackled by Johnathan Cyprien and Tashaun Gipson.","(15:00) Jason Myers kicks off to the endzone. Touchback."]