["(0:18) Lance Dunbar rush to the left for 4 yards to the Dal50. Tackled by Bryan Braman.","(0:23) Mark Sanchez incomplete pass to the middle intended for Lance Dunbar.","(0:45) Lance Dunbar rush up the middle for 10 yards to the Dal46. Tackled by Malcolm Jenkins.","(0:53) Mark Sanchez pass to the left to Lance Dunbar for 5 yards to the Dal36. Tackled by Nolan Carroll. FUMBLE, recovered by Dal (Lance Dunbar).","(1:17) Lance Dunbar rush to the left for 6 yards to the Dal31. Tackled by Destiny Vaeao.","(1:23) Caleb Sturgis kicks off to the Dal5. Lucky Whitehead return for 20 yards to Dal25. Tackled by Najee Goode.","(1:23) Caleb Sturgis extra point is good.","(1:26) Terrell Watson rush up the middle for 1 yard for a TOUCHDOWN.","(1:26) Dallas Cowboys timeout.","(1:31) Terrell Watson rush up the middle for 2 yards to the Dal1. Tackled by Maliek Collins.","(1:31) Dallas Cowboys timeout.","(1:39) Terrell Watson rush up the middle for 4 yards to the Dal3. Tackled by Randy Gregory and Leon McFadden.","(1:50) Chris Jones punt blocked by Steven Means. Returned by Najee Goode to the Dal7. Tackled by Gavin Escobar.","(1:50) Two Minute Warning.","(2:05) Mark Sanchez sacked at Dal2 for a loss of 19 yards by Connor Barwin.","(2:09) Mark Sanchez incomplete pass to the right intended for Terrance Williams.","(2:13) Mark Sanchez incomplete pass to the left intended for Lance Dunbar.","(2:18) Caleb Sturgis kicks off to the Dal1. Lucky Whitehead return for 20 yards to Dal21. Tackled by Rodney McLeod.","(2:21) Caleb Sturgis 33 yard field goal attempt is GOOD. Holder: Donnie Jones.","(2:25) Carson Wentz incomplete pass to the left intended for Byron Marshall.","(3:07) Terrell Watson rush to the left for 7 yards to the Dal15. Tackled by Leon McFadden.","(3:52) Terrell Watson rush up the middle for a loss of 1 yard to the Dal22. Tackled by Richard Ash.","(4:40) Byron Marshall rush to the left for 8 yards to the Dal21. Tackled by Jeff Heath.","(5:25) Byron Marshall rush to the left for 4 yards to the Dal29. Tackled by Richard Ash.","(6:05) Byron Marshall rush to the left for 8 yards to the Dal33. Tackled by Damien Wilson.","(6:46) Byron Marshall rush up the middle for 2 yards to the Dal41. Tackled by David Irving.","(7:28) Terrell Watson rush to the right for 8 yards to the Dal43. Tackled by Damien Wilson.","(7:28) Penalty: Offside on Dallas (David Irving) 5 yards.","(7:31) Carson Wentz incomplete pass to the left intended for Bryce Treggs.","(8:00) Carson Wentz pass to the left to Paul Turner for 19 yards to the Phi44. Tackled by Damien Wilson.","(8:48) Carson Wentz pass to the right to Zach Ertz for 8 yards to the Phi25. Tackled by Byron Jones.","(9:29) Carson Wentz sacked at Phi17 for a loss of 8 yards by Randy Gregory.","(10:09) Carson Wentz pass to the left to Zach Ertz for 15 yards to the Phi25. Tackled by Jeff Heath and Kavon Frazier.","(10:16) Chris Jones punts for 43 yards to Phi10. No return.","(11:01) Mark Sanchez pass to the right to Lance Dunbar for 5 yards to the Dal47. Tackled by Leodis McKelvin and Nigel Bradham.","(11:39) Mark Sanchez pass to the middle to Gavin Escobar for 7 yards to the Dal42. Tackled by Jordan Hicks.","(12:16) Alfred Morris rush to the right for a loss of 4 yards to the Dal35. Tackled by Brandon Graham.","(12:21) 49 yard field goal attempt by Caleb Sturgis is NO GOOD. Holder: Donnie Jones.","(12:26) Carson Wentz incomplete pass to the left intended for Zach Ertz.","(13:11) Carson Wentz pass to the left to Zach Ertz for 3 yards to the Dal31. Tackled by J.J. Wilcox and Leon McFadden.","(13:16) Carson Wentz incomplete pass to the left intended for Bryce Treggs.","(13:46) Carson Wentz pass to the left to Zach Ertz for 17 yards to the Dal34. Tackled by J.J. Wilcox.","(14:12) Byron Marshall rush to the left for 12 yards to the Dal41. Tackled by Randy Gregory. Penalty: Holding on Philadelphia (Dorial Green-Beckham) -10 yards.","(14:18) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(15:00) Carson Wentz pass to the left to Zach Ertz for 13 yards to the Phi47. Tackled by Byron Jones.","(0:22) Byron Marshall rush to the left for 3 yards to the Phi34. Tackled by Mark Nzeocha.","(0:52) Carson Wentz pass to the left to Brent Celek for 9 yards to the Phi31. Tackled by Benson Mayowa.","(1:01) Chris Jones punts for 38 yards to Phi22. No return.","(1:44) Mark Sanchez sacked at Dal40 for a loss of 6 yards by Vinny Curry.","(2:30) Mark Sanchez pass to the right to Alfred Morris for 3 yards to the Dal46. Tackled by Destiny Vaeao.","(3:03) Alfred Morris rush up the middle for 2 yards to the Dal43. Tackled by Beau Allen.","(3:41) Mark Sanchez pass to the left to Cole Beasley for 12 yards to the Dal41. Tackled by Fletcher Cox.","(4:21) Alfred Morris rush to the right for 1 yard to the Dal29. Tackled by Fletcher Cox.","(4:56) Mark Sanchez pass to the left to Brice Butler for 3 yards to the Dal28. Tackled by Nolan Carroll.","(4:56) Caleb Sturgis kicks off to the endzone. Touchback.","(4:56) Caleb Sturgis extra point is good.","(5:02) Carson Wentz pass to the left to Zach Ertz for 20 yards for a TOUCHDOWN.","(5:38) Carson Wentz pass to the right to Trey Burton for 6 yards to the Dal20. Tackled by Byron Jones.","(6:05) Carson Wentz pass to the left to Byron Marshall for 4 yards to the Dal26. Tackled by Leon McFadden.","(6:33) Carson Wentz pass to the right to Trey Burton for 9 yards to the Dal30. Tackled by Andrew Gachkar.","(7:01) Carson Wentz pass to the middle to Zach Ertz for 9 yards to the Dal39. Tackled by Mark Nzeocha.","(7:31) Carson Wentz pass to the left to Zach Ertz for 6 yards to the Dal48. Tackled by Byron Jones.","(7:41) Penalty: Roughing Passer on Dallas (Randy Gregory) 15 yards.","(8:28) Carson Wentz pass to the left to Terrell Watson for 5 yards to the Phi31. Tackled by J.J. Wilcox.","(8:32) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(9:09) Carson Wentz pass to the right to Dorial Green-Beckham for 15 yards to the Phi26. Tackled by Jeff Heath.","(9:13) Carson Wentz incomplete pass to the right intended for Paul Turner defensed by Anthony Brown.","(9:18) Dan Bailey kicks off to the Phi-2. Byron Marshall return for 13 yards to Phi11. Tackled by Jeff Heath and Kavon Frazier.","(9:20) Dan Bailey 23 yard field goal attempt is GOOD. Holder: Chris Jones.","(9:27) Mark Sanchez incomplete pass to the left intended for Lance Dunbar.","(9:27) Dallas Cowboys timeout.","(10:14) Darren McFadden rush up the middle for no gain to the Phi5. Tackled by Vinny Curry.","(10:47) Mark Sanchez pass to the right to Lucky Whitehead for 8 yards to the Phi5. Tackled by Rodney McLeod.","(10:52) Penalty: Pass Interference on Philadelphia (Nolan Carroll) 17 yards.","(11:24) Mark Sanchez pass to the right to Cole Beasley for 33 yards to the Phi30. Tackled by Jalen Mills.","(12:05) Darren McFadden rush to the right for 1 yard to the Dal37. Tackled by Stephen Tulloch.","(12:39) Darren McFadden rush to the right for 7 yards to the Dal36. Tackled by Jalen Mills.","(12:48) Donnie Jones punts for 47 yards to Dal29. No return.","(13:24) Byron Marshall rush up the middle for 12 yards to the Phi24. Tackled by Anthony Hitchens.","(13:41) Penalty: False Start on Philadelphia (Trey Burton) -5 yards.","(14:17) Carson Wentz sacked at Phi17 for a loss of 5 yards by Jack Crawford.","(14:55) Byron Marshall rush to the left for a loss of 6 yards to the Phi22. Tackled by Jack Crawford.","(14:55) Penalty: Offside on Dallas (Jack Crawford) 5 yards.","(15:00) Dan Bailey kicks off to the Phi0. Byron Marshall return for 23 yards to Phi23. Tackled by Mark Nzeocha.","(0:04) Mark Sanchez rush up the middle for a loss of 1 yard to the Dal37.","(0:07) Caleb Sturgis kicks off to the Dal33. Gavin Escobar return for 5 yards to Dal38. Tackled by Kamu Grugier-Hill.","(0:07) Caleb Sturgis extra point is good.","(0:10) Carson Wentz pass to the left to Zach Ertz for 6 yards for a TOUCHDOWN.","(0:14) Carson Wentz incomplete pass to the left intended for Darren Sproles.","(0:14) Dallas Cowboys timeout.","(0:24) Carson Wentz rush to the left for 13 yards to the Dal6.","(0:28) Carson Wentz incomplete pass to the right intended for Zach Ertz.","(0:48) Carson Wentz pass to the left to Darren Sproles for a loss of 1 yard to the Dal19. Tackled by Damien Wilson.","(1:07) Carson Wentz pass to the left to Trey Burton for 12 yards to the Dal18. Tackled by Orlando Scandrick.","(1:07) Philadelphia Eagles timeout.","(1:13) Carson Wentz pass to the right to Zach Ertz for 4 yards to the Dal30. Tackled by Anthony Hitchens.","(1:34) Darren Sproles rush to the right for 3 yards to the Dal34. Tackled by Byron Jones.","(1:57) Carson Wentz pass to the middle to Trey Burton for 12 yards to the Dal37. Tackled by Damien Wilson and Orlando Scandrick.","(1:57) Two Minute Warning.","(2:02) Mark Sanchez pass intended for Gavin Escobar INTERCEPTED by Jordan Hicks and returned for 2 yards. Tackled by Alfred Morris.","(2:16) Donnie Jones punts for 53 yards to Dal46. Lucky Whitehead return for 3 yards to Dal49. Tackled by Terrence Brooks.","(2:52) Carson Wentz pass to the left to Darren Sproles for a loss of 6 yards to the Phi1. Tackled by Damien Wilson.","(3:34) Terrell Watson rush to the left for 3 yards to the Phi7. Tackled by Randy Gregory.","(4:14) Terrell Watson rush up the middle for 3 yards to the Phi4. Tackled by Jack Crawford.","(4:20) Chris Jones punts for 66 yards to Phi1. No return.","(4:36) Mark Sanchez sacked at Dal33 for no gain by Marcus Smith.","(5:16) Mark Sanchez rush up the middle for 1 yard to the Dal33.","(5:53) Alfred Morris rush to the right for a loss of 3 yards to the Dal32. Tackled by Brandon Graham.","(5:57) Carson Wentz incomplete pass to the middle intended for Trey Burton.","(6:02) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(6:40) Byron Marshall rush to the left for 1 yard to the Dal34. Tackled by Byron Jones.","(6:49) Carson Wentz incomplete pass to the middle intended for Dorial Green-Beckham.","(6:54) Mark Sanchez pass intended for Alfred Morris INTERCEPTED by Jordan Hicks and returned for 2 yards. Tackled by Mark Sanchez.","(7:00) Mark Sanchez incomplete pass to the right intended for Brice Butler.","(7:25) Mark Sanchez pass to the left to Lance Dunbar for 9 yards to the Dal48.","(7:25) Dallas Cowboys timeout.","(7:30) Mark Sanchez incomplete pass to the right intended for Gavin Escobar.","(8:02) Alfred Morris rush to the left for 1 yard to the Dal39. Tackled by Bennie Logan.","(8:12) Donnie Jones punts for 48 yards to Dal26. Lucky Whitehead return for 12 yards to Dal38. Tackled by Bryan Braman.","(8:47) Darren Sproles rush to the right for a loss of 4 yards to the Phi26. Tackled by David Irving.","(9:32) Byron Marshall rush to the right for a loss of 2 yards to the Phi30. Tackled by Damien Wilson.","(10:11) Darren Sproles rush to the left for 7 yards to the Phi32. Tackled by Randy Gregory.","(10:11) Dan Bailey kicks off to the endzone. Touchback.","(10:11) Dan Bailey extra point is good.","(10:15) Tony Romo pass to the left to Terrance Williams for 3 yards for a TOUCHDOWN.","(10:20) Penalty: Pass Interference on Philadelphia (Nolan Carroll) 29 yards.","(10:52) Tony Romo pass to the middle to Darren McFadden for 11 yards to the Phi32. Tackled by Rodney McLeod.","(11:31) Darren McFadden rush to the left for 24 yards to the Phi43. Tackled by Nolan Carroll.","(12:08) Tony Romo pass to the right to Terrance Williams for 15 yards to the Dal33. Tackled by Jordan Hicks.","(12:55) Darren McFadden rush to the left for a loss of 1 yard to the Dal18. Tackled by Beau Allen.","(13:00) Tony Romo incomplete pass to the right intended for Terrance Williams.","(13:11) Donnie Jones punts for 52 yards to Dal11. Lucky Whitehead return for 8 yards to Dal19. Tackled by Kamu Grugier-Hill.","(13:21) Carson Wentz incomplete pass to the middle intended for Paul Turner.","(13:26) Carson Wentz incomplete pass to the middle intended for Brent Celek.","(14:10) Terrell Watson rush up the middle for 1 yard to the Phi37. Tackled by Andrew Gachkar.","(14:48) Carson Wentz pass to the right to Darren Sproles for 11 yards to the Phi36. Tackled by Barry Church.","(14:51) Carson Wentz incomplete pass to the right intended for Darren Sproles.","(14:51) Dan Bailey kicks off to the endzone. Touchback.","(14:55) Dan Bailey 49 yard field goal attempt is GOOD. Holder: Chris Jones.","(15:00) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(0:33) Dak Prescott pass to the right to Jason Witten for 10 yards to the Phi31. Tackled by Jordan Hicks.","(0:39) Dak Prescott incomplete pass to the right intended for Cole Beasley.","(0:43) Penalty: Illegal Formation on Dallas (Emmett Cleary) -5 yards.","(1:21) Alfred Morris rush to the left for 2 yards to the Phi36. Tackled by Marcus Smith.","(2:02) Alfred Morris rush to the left for 9 yards to the Phi38. Tackled by Jordan Hicks.","(2:40) Dak Prescott pass to the left to Terrance Williams for 15 yards to the Phi47. Tackled by Rodney McLeod.","(3:18) Alfred Morris rush to the right for 4 yards to the Dal38. Tackled by Jalen Mills and Leodis McKelvin.","(3:57) Dak Prescott rush to the left for 9 yards to the Dal34.","(3:57) Caleb Sturgis kicks off to the endzone. Touchback.","(4:00) Caleb Sturgis 22 yard field goal attempt is GOOD. Holder: Donnie Jones.","(4:04) Carson Wentz incomplete pass to the right intended for Zach Ertz defensed by Byron Jones.","(4:52) Carson Wentz pass to the right to Trey Burton for no gain to the Dal3. Tackled by Randy Gregory.","(5:33) Darren Sproles rush up the middle for 4 yards to the Dal3. Tackled by Damien Wilson and Barry Church.","(6:13) Darren Sproles rush to the right for 11 yards to the Dal7. Tackled by Barry Church.","(7:01) Carson Wentz pass to the left to Paul Turner for 11 yards to the Dal18. Tackled by Orlando Scandrick.","(7:43) Darren Sproles rush up the middle for a loss of 4 yards to the Dal29. Tackled by Randy Gregory.","(8:24) Carson Wentz pass to the left to Zach Ertz for 15 yards to the Dal25. Tackled by Barry Church.","(9:00) Darren Sproles rush to the left for 7 yards to the Dal40. Tackled by Anthony Hitchens.","(9:35) Nelson Agholor rush to the left for a loss of 1 yard to the Dal47. Tackled by Andrew Gachkar.","(10:02) Carson Wentz pass to the left to Zach Ertz for 14 yards to the Dal46. Tackled by Andrew Gachkar.","(10:43) Darren Sproles rush to the left for 2 yards to the Phi40. Tackled by Brandon Carr.","(11:18) Carson Wentz pass to the middle to Zach Ertz for 9 yards to the Phi38. Tackled by Andrew Gachkar and Anthony Hitchens.","(11:44) Penalty: Encroachment on Dallas (David Irving) 5 yards.","(12:15) Darren Sproles rush up the middle for 6 yards to the Phi24. Tackled by Barry Church.","(12:25) Chris Jones punts for 48 yards to Phi18. No return.","(12:29) Dak Prescott incomplete pass to the right.","(12:32) Dak Prescott incomplete pass to the right intended for Darren McFadden defensed by Rodney McLeod.","(13:14) Darren McFadden rush to the right for a loss of 4 yards to the Dal34. Tackled by Malcolm Jenkins.","(13:40) Dak Prescott pass to the right to Cole Beasley for 4 yards to the Dal38.","(14:27) Dak Prescott pass to the right to Darren McFadden for 8 yards to the Dal34. Tackled by Jordan Hicks.","(15:00) Darren McFadden rush to the right for 1 yard to the Dal26. Tackled by Fletcher Cox.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback."]