["(0:42) Damien Williams rush to the left for no gain to the NE33. Tackled by Vincent Valentine.","(1:24) Damien Williams rush to the left for 5 yards to the NE33. Tackled by Shea McClellin.","(2:00) Kenyan Drake rush up the middle for 2 yards to the NE38. Tackled by Malcom Brown.","(2:00) Two Minute Warning.","(2:32) Kenyan Drake rush to the left for 4 yards to the NE40. Tackled by Chris Long.","(2:43) Ryan Allen punts for 56 yards to Mia42. Jakeem Grant return for 14 yards to NE44. Tackled by Nate Ebner.","(2:49) Jimmy Garoppolo incomplete pass to the right intended for Julian Edelman.","(3:31) LeGarrette Blount rush to the left for a loss of 2 yards to the NE2. Tackled by Tony Lippett and Kiko Alonso.","(3:43) LeGarrette Blount rush up the middle for 2 yards to the NE8. Tackled by Kiko Alonso and Neville Hewitt. Penalty: Face Mask on New England (LeGarrette Blount) -4 yards.","(3:54) Matt Darr punts for 48 yards to NE6. No return.","(4:00) Matt Moore incomplete pass to the right intended for DeVante Parker defensed by Eric Rowe.","(4:13) Matt Moore incomplete pass to the left intended for Kenny Stills.","(4:49) Kenyan Drake rush to the right for 2 yards to the Mia46. Tackled by Kyle Van Noy.","(5:02) Matt Moore pass to the right to Jarvis Landry for 9 yards to the Mia44. Tackled by Logan Ryan.","(5:29) Kenyan Drake rush to the left for 2 yards to the Mia35. Tackled by Alan Branch.","(5:33) Stephen Gostkowski kicks off to the Mia12. Kenyan Drake return for 21 yards to Mia33. Tackled by Duron Harmon.","(5:33) Tom Brady 2 pt conversion pass to Julian Edelman is GOOD. Penalty: Face Mask on Miami (Tony Lippett) 15 yards.","(5:34) LeGarrette Blount rush to the right for 1 yard for a TOUCHDOWN.","(6:17) LeGarrette Blount rush up the middle for 1 yard to the Mia1. Tackled by Ndamukong Suh and Spencer Paysinger.","(7:00) LeGarrette Blount rush to the left for 5 yards to the Mia2. Tackled by Tony Lippett and Kiko Alonso.","(7:32) James White rush to the left for 2 yards to the Mia7. Tackled by Bobby McCain.","(8:03) Tom Brady pass to the left to Chris Hogan for 3 yards to the Mia9. Tackled by Bobby McCain.","(8:35) Dion Lewis rush to the right for 6 yards to the Mia12. Tackled by Ndamukong Suh.","(8:55) Matt Moore pass to the left to Damien Williams for a loss of 4 yards to the NE13. Tackled by Devin McCourty. FUMBLE, recovered by NE (Shea McClellin) and returned for 69 yards. Tackled by Damien Williams.","(9:34) Matt Moore pass to the right to Kenny Stills for 2 yards to the NE9. Tackled by Malcolm Butler.","(10:06) Penalty: Illegal Motion on Miami (Jarvis Landry) -5 yards.","(10:45) Matt Moore pass to the middle to DeVante Parker for 18 yards to the NE6. Tackled by Patrick Chung.","(11:19) Matt Moore pass to the left to Jarvis Landry for 10 yards to the NE24. Tackled by Malcolm Butler and Logan Ryan.","(12:02) Matt Moore pass to the right to Jarvis Landry for 4 yards to the NE34. Tackled by Rob Ninkovich and Malcolm Butler.","(12:34) Jay Ajayi rush to the right for 11 yards to the NE38. Tackled by Devin McCourty.","(12:38) Matt Moore incomplete pass to the left intended for Jarvis Landry defensed by Chris Long.","(13:18) Matt Moore pass to the right to Jarvis Landry for 13 yards to the NE49. Tackled by Rob Ninkovich.","(13:57) Matt Moore pass to the right to Kenny Stills for 6 yards to the Mia38. Tackled by Logan Ryan.","(14:00) Ryan Allen punts for 48 yards to Mia32. No return.","(14:34) James White rush up the middle for 7 yards to the NE20. Tackled by Spencer Paysinger.","(14:44) Tom Brady incomplete pass to the right intended for Julian Edelman defensed by Ndamukong Suh.","(15:00) Penalty: Holding on New England (Joe Thuney) -10 yards.","(0:34) Dion Lewis rush to the left for a loss of 1 yard to the NE23. Tackled by Jordan Phillips.","(1:28) Penalty: False Start on New England (Cameron Fleming) -5 yards.","(1:28) Tom Brady pass to the left to Michael Floyd for 13 yards to the NE29. Tackled by Tony Lippett and Michael Thomas.","(1:32) Tom Brady incomplete pass to the right intended for Martellus Bennett.","(1:40) Matt Darr punts for 38 yards to NE16. No return.","(1:43) Matt Moore incomplete pass to the left intended for DeVante Parker defensed by Rob Ninkovich.","(2:28) Matt Moore pass to the left to Jay Ajayi for 3 yards to the Mia46. Tackled by Eric Rowe.","(3:03) Jay Ajayi rush up the middle for 2 yards to the Mia43. Tackled by Malcom Brown.","(3:16) Ryan Allen punts for 42 yards to Mia41. Jakeem Grant - no return. Tackled by Jonathan Jones. FUMBLE, recovered by Mia (Jakeem Grant).","(3:50) Tom Brady pass to the left to Julian Edelman for 9 yards to the NE17. Tackled by Jason Jones.","(3:56) Tom Brady incomplete pass to the left intended for Michael Floyd defensed by Jordan Phillips.","(4:23) LeGarrette Blount rush up the middle for a loss of 1 yard to the NE8. Tackled by Jordan Phillips.","(4:44) Matt Darr punts for 53 yards to NE19. Julian Edelman - no return. Tackled by Mike Hull. Penalty: Holding on New England (Geneo Grissom) -10 yards.","(5:20) Matt Moore pass to the middle to DeVante Parker for 2 yards to the Mia28. Tackled by Logan Ryan.","(5:57) Jay Ajayi rush to the right for no gain to the Mia26. Tackled by Alan Branch.","(6:37)  FUMBLE, recovered by Mia (Matt Moore). Matt Moore pass to the right to DeVante Parker for 4 yards to the Mia26. Tackled by Elandon Roberts.","(6:41) Stephen Gostkowski kicks off to the Mia3. Jakeem Grant return for 19 yards to Mia22. Tackled by Kyle Van Noy.","(6:41) Stephen Gostkowski extra point is good.","(7:05) Tom Brady pass to the left to Julian Edelman for 77 yards for a TOUCHDOWN.","(7:40) Tom Brady pass to the right to Julian Edelman for 7 yards to the NE23. Tackled by Bobby McCain and Bacarri Rambo.","(8:16) Penalty: Holding on New England (Shaq Mason) -10 yards.","(8:35) Tom Brady pass to the left to James White for 6 yards to the NE26. Tackled by Spencer Paysinger.","(8:39) Andrew Franks kicks off to the NE8. Dion Lewis return for 12 yards to NE20. Tackled by Trevor Reilly.","(8:39) Andrew Franks extra point is good.","(8:46) Matt Moore pass to the right to Kenny Stills for 25 yards for a TOUCHDOWN.","(9:27) Jay Ajayi rush to the left for no gain to the NE25. Tackled by Trey Flowers.","(10:10) Matt Moore pass to the left to Jarvis Landry for 7 yards to the NE25. Tackled by Dont'a Hightower.","(10:43) Matt Moore pass to the left to Kenny Stills for 8 yards to the NE32. Tackled by Logan Ryan.","(10:48) Matt Moore incomplete pass to the middle intended for Jarvis Landry defensed by Alan Branch.","(11:23) Jay Ajayi rush to the right for 8 yards to the NE40. Tackled by Devin McCourty.","(11:55) Penalty: Illegal Shift on Miami -5 yards.","(12:38) Matt Moore pass to the right to Damien Williams for 16 yards to the NE43. Tackled by Devin McCourty.","(13:22) Jay Ajayi rush to the right for 3 yards to the Mia41. Tackled by Logan Ryan and Trey Flowers.","(13:54) Jay Ajayi rush to the left for 3 yards to the Mia38. Tackled by Malcom Brown.","(14:25) Matt Moore pass to the middle to DeVante Parker for 7 yards to the Mia35. Tackled by Devin McCourty.","(14:32) Matt Moore incomplete pass to the left intended for Jarvis Landry.","(15:00) Jay Ajayi rush to the right for 3 yards to the Mia28. Tackled by Trey Flowers.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback.","(0:04) 52 yard field goal attempt by Stephen Gostkowski is NO GOOD. Holder: Ryan Allen.","(0:08) Tom Brady pass to the right to Julian Edelman for 1 yard to the Mia34. Tackled by Michael Thomas.","(0:13) Tom Brady pass to the left to James White for 8 yards to the Mia35. Tackled by Spencer Paysinger.","(0:13) New England Patriots timeout.","(0:19) Tom Brady pass to the left to Julian Edelman for 14 yards to the Mia43. Tackled by Kiko Alonso.","(0:23) Tom Brady incomplete pass to the right intended for Martellus Bennett.","(0:28) Andrew Franks kicks off to the NE28. James Develin return for 15 yards to NE43. Tackled by Neville Hewitt.","(0:28) Andrew Franks extra point is good.","(0:36) Matt Moore pass to the left to Jarvis Landry for 8 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Miami (Jarvis Landry) -15 yards.","(0:36) Miami Dolphins timeout.","(0:42) Matt Moore pass to the left to Jarvis Landry for 5 yards to the NE8. Tackled by Devin McCourty.","(1:01) Matt Moore pass to the right to Jay Ajayi for 11 yards to the NE13. Tackled by Elandon Roberts.","(1:01) Miami Dolphins timeout.","(1:06) Matt Moore pass to the right to Jarvis Landry for 6 yards to the NE24. Tackled by Devin McCourty and Eric Rowe.","(1:15) Matt Moore pass to the left to Damien Williams for 11 yards to the NE30. Tackled by Malcolm Butler.","(1:54) Jay Ajayi rush to the right for no gain to the NE41. Tackled by Elandon Roberts and Jabaal Sheard.","(2:00) Matt Moore pass to the right to Jay Ajayi for 6 yards to the NE41. Tackled by Logan Ryan.","(2:00) Two Minute Warning.","(2:29) Jay Ajayi rush to the right for 8 yards to the NE47. Tackled by Shea McClellin and Malcolm Butler.","(2:50) Jay Ajayi rush to the right for 6 yards to the Mia45. Tackled by Elandon Roberts.","(3:21) Matt Moore pass to the right to Jarvis Landry for 14 yards to the Mia39. Tackled by Shea McClellin and Patrick Chung.","(3:21) Stephen Gostkowski kicks off to the endzone. Touchback.","(3:25) Stephen Gostkowski 26 yard field goal attempt is GOOD. Holder: Ryan Allen.","(3:31) Tom Brady incomplete pass to the right intended for Julian Edelman.","(4:14) Tom Brady pass to the right to Dion Lewis for no gain to the Mia8. Tackled by Kiko Alonso.","(4:53) Dion Lewis rush to the left for a loss of 1 yard to the Mia8. Tackled by Michael Thomas.","(5:07) Penalty: Encroachment on Miami (Ndamukong Suh) 5 yards.","(5:50) Tom Brady pass to the left to Chris Hogan for 5 yards to the Mia12. Tackled by Bobby McCain.","(6:25) Tom Brady pass to the right to Michael Floyd for 9 yards to the Mia17.","(7:01) Dion Lewis rush up the middle for 3 yards to the Mia26. Tackled by Cameron Wake.","(7:10) Penalty: Pass Interference on Miami (Bobby McCain) 8 yards.","(7:47) Tom Brady pass to the left to James White for 7 yards to the Mia37. Tackled by Mike Hull.","(8:26) LeGarrette Blount rush to the left for no gain to the Mia44. Tackled by Tony Lippett and Ndamukong Suh.","(9:06) Tom Brady pass to the left to Martellus Bennett for 20 yards to the Mia44. Tackled by Neville Hewitt.","(9:43) Dion Lewis rush to the left for 12 yards to the NE36. Tackled by Bacarri Rambo.","(9:54) Tom Brady incomplete pass to the right intended for Matt Lengel.","(10:35) Tom Brady pass to the right to Julian Edelman for 9 yards to the NE24. Tackled by Xavien Howard.","(11:19) LeGarrette Blount rush to the left for no gain to the NE15. Tackled by Ndamukong Suh.","(11:40) LeGarrette Blount rush to the left for 5 yards to the NE15. Tackled by Mike Hull.","(11:48) Matt Darr punts for 34 yards to NE20. No return. Penalty: Holding on New England (Justin Coleman) -10 yards.","(12:03) Matt Moore incomplete pass to the middle intended for Kenny Stills.","(12:35) Jakeem Grant rush to the left for 1 yard to the Mia46. Tackled by Elandon Roberts and Patrick Chung.","(13:11) Jay Ajayi rush to the left for 5 yards to the Mia45. Tackled by Elandon Roberts.","(13:51) Matt Moore pass to the middle to DeVante Parker for 14 yards to the Mia40. Tackled by Malcolm Butler.","(13:58) Matt Moore incomplete pass to the right intended for Kenny Stills.","(14:22) Penalty: False Start on Miami (Dion Sims) -5 yards.","(14:56) Jay Ajayi rush to the right for 6 yards to the Mia31. Tackled by Rob Ninkovich.","(14:56) Stephen Gostkowski kicks off to the endzone. Touchback.","(15:00) Stephen Gostkowski 40 yard field goal attempt is GOOD. Holder: Ryan Allen.","(0:15) Tom Brady pass to the left to Chris Hogan for 13 yards to the Mia22. Tackled by Bobby McCain.","(0:51) Dion Lewis rush to the right for 4 yards to the Mia35. Tackled by Neville Hewitt and Donald Butler.","(0:59) Tom Brady incomplete pass to the left intended for Julian Edelman defensed by Bobby McCain. Penalty: Unsports. Conduct on New England (Julian Edelman) -15 yards.","(2:04) Tom Brady pass to the right to Julian Edelman for 14 yards to the Mia24. Tackled by Donald Butler.","(2:04) Dion Lewis rush to the right for 8 yards to the Mia38. Tackled by Xavien Howard.","(2:26) Tom Brady pass to the left to Chris Hogan for 6 yards to the Mia46. Tackled by Tony Lippett.","(2:54) LeGarrette Blount rush to the left for 4 yards to the NE48. Tackled by Neville Hewitt.","(3:14) Matt Moore pass intended for Dion Sims INTERCEPTED by Logan Ryan. No return. Tackled by Dion Sims.","(3:44) Jay Ajayi rush to the left for 2 yards to the Mia27. Tackled by Elandon Roberts.","(3:44) Stephen Gostkowski kicks off to the endzone. Touchback.","(3:44) Stephen Gostkowski extra point is good.","(3:56) Tom Brady pass to the left to Michael Floyd for 14 yards for a TOUCHDOWN.","(4:27) LeGarrette Blount rush to the right for 3 yards to the Mia14. Tackled by Terrence Fede.","(4:57) LeGarrette Blount rush to the right for 9 yards to the Mia17. Tackled by Tony Lippett and Terrence Fede.","(5:35) LeGarrette Blount rush up the middle for 19 yards to the Mia26. Tackled by Bacarri Rambo.","(5:43) Tom Brady incomplete pass to the right intended for Julian Edelman.","(5:51) Matt Darr punts for 33 yards to NE45. No return. Penalty: Holding on Miami (Neville Hewitt) 10 yards.","(6:00) Matt Moore incomplete pass to the right intended for Damien Williams.","(6:22) Penalty: False Start on Miami (Ja'Wuan James) -5 yards.","(7:05) Jay Ajayi rush up the middle for 1 yard to the Mia27. Tackled by Trey Flowers.","(7:28) Jay Ajayi rush up the middle for 1 yard to the Mia26. Tackled by Trey Flowers.","(7:28) Stephen Gostkowski kicks off to the endzone. Touchback.","(7:28) Stephen Gostkowski extra point is good.","(7:35) Tom Brady pass to the right to Martellus Bennett for 2 yards for a TOUCHDOWN.","(8:06) Dion Lewis rush up the middle for 4 yards to the Mia2. Tackled by Tony Lippett and Michael Thomas.","(8:46) Dion Lewis rush to the left for 8 yards to the Mia6. Tackled by Andre Branch and Bacarri Rambo.","(9:23) Tom Brady pass to the middle to Martellus Bennett for 11 yards to the Mia14. Tackled by Bacarri Rambo.","(9:56) Dion Lewis rush up the middle for 4 yards to the Mia25. Tackled by Jason Jones.","(10:28) Tom Brady pass to the middle to Matt Lengel for 4 yards to the Mia29. Tackled by Spencer Paysinger.","(11:05) LeGarrette Blount rush to the left for 5 yards to the Mia33. Tackled by Tony Lippett and Terrence Fede.","(11:47) Tom Brady pass to the left to Julian Edelman for 20 yards to the Mia38. Tackled by Spencer Paysinger.","(12:38) Julian Edelman rush to the left for 6 yards to the NE42. Tackled by Bobby McCain.","(13:01) Dion Lewis rush to the left for 1 yard to the NE36. Tackled by Bacarri Rambo and Donald Butler.","(13:40) Tom Brady rush to the right for 6 yards to the NE35. Tackled by Xavien Howard.","(13:40) New England Patriots timeout.","(14:40) Tom Brady pass to the right to James White for no gain to the NE29. Tackled by Bacarri Rambo.","(15:00) Tom Brady pass to the left to Dion Lewis for 4 yards to the NE29. Tackled by Spencer Paysinger and Andre Branch.","(15:00) Andrew Franks kicks off to the endzone. Touchback."]