["(0:35) Derek Carr rush up the middle for a loss of 1 yard to the Hou21.","(0:58) Derek Carr rush up the middle for a loss of 1 yard to the Hou20.","(1:04) Latavius Murray rush to the left for 6 yards to the Hou33. Tackled by Corey Moore. Penalty: Unnecessary Roughness on Houston (Vince Wilfork) 14 yards.","(1:04) Oakland Raiders timeout.","(1:10) Latavius Murray rush to the right for 3 yards to the Hou39. Tackled by D.J. Reader.","(1:56) Latavius Murray rush up the middle for 2 yards to the Hou42. Tackled by Whitney Mercilus.","(1:56) Houston Texans timeout.","(2:00) Latavius Murray rush up the middle for 4 yards to the Hou44. Tackled by Brian Cushing.","(2:00) Two Minute Warning.","(2:16) Derek Carr pass to the right to Jalen Richard for 29 yards to the Hou48. Tackled by Benardrick McKinney.","(3:02) Latavius Murray rush to the left for 3 yards to the Oak23. Tackled by Quintin Demps.","(3:13) Shane Lechler punts for 51 yards to Oak5. TJ Carrie return for 15 yards to Oak20. Tackled by Don Jones.","(3:19) Brock Osweiler pass to the left to Keith Mumphery for 4 yards to the Hou44. Tackled by DJ Hayden.","(3:25) Brock Osweiler sacked at Hou40 for a loss of 4 yards by Bruce Irvin.","(4:00) Lamar Miller rush to the right for 5 yards to the Hou44. Tackled by Bruce Irvin.","(4:32) Brock Osweiler pass to the left to DeAndre Hopkins for 8 yards to the Hou39. Tackled by DJ Hayden.","(4:38) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(4:43) Brock Osweiler pass to the right to C.J. Fiedorowicz for 6 yards to the Hou31. Tackled by Malcolm Smith.","(4:43) Sebastian Janikowski kicks off to the endzone. Touchback.","(4:43) Sebastian Janikowski extra point is good.","(4:51) Derek Carr pass to the left to Amari Cooper for 35 yards for a TOUCHDOWN.","(5:03) Derek Carr pass to the left to Latavius Murray for 39 yards to the Hou35. Tackled by Quintin Demps.","(5:07) Derek Carr incomplete pass to the left intended for Michael Crabtree.","(5:47) Latavius Murray rush up the middle for 3 yards to the Oak26. Tackled by Whitney Mercilus.","(6:15) Derek Carr pass to the right to Amari Cooper for 8 yards to the Oak23.","(6:15) Houston Texans timeout.","(6:31) Akeem Hunt rush to the left for no gain to the Oak15. Tackled by Malcolm Smith.","(7:07) Lamar Miller rush to the left for 1 yard to the Oak15. Tackled by Malcolm Smith.","(7:34) Lamar Miller rush to the left for 3 yards to the Oak16. Tackled by Stacy McGee.","(7:34) Oakland Raiders timeout.","(8:14) Lamar Miller rush to the right for 5 yards to the Oak19. Tackled by Reggie Nelson.","(8:44) Brock Osweiler pass to the right to DeAndre Hopkins for 9 yards to the Oak24. Tackled by DJ Hayden.","(8:44) Houston Texans timeout.","(9:20) Lamar Miller rush up the middle for 4 yards to the Oak33. Tackled by Malcolm Smith.","(9:26) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(10:04) Brock Osweiler pass to the left to C.J. Fiedorowicz for 14 yards to the Oak37. Tackled by Bruce Irvin.","(10:35) Lamar Miller rush to the right for 5 yards to the Hou49. Tackled by Malcolm Smith.","(10:44) Sebastian Janikowski kicks off to the Hou5. Akeem Hunt return for 39 yards to Hou44. Tackled by TJ Carrie.","(10:44) Sebastian Janikowski extra point is good.","(10:57) Derek Carr pass to the right to Jamize Olawale for 75 yards for a TOUCHDOWN.","(10:57) Nick Novak kicks off to the endzone. Touchback.","(10:59) Nick Novak 28 yard field goal attempt is GOOD. Holder: Shane Lechler.","(11:07) Brock Osweiler incomplete pass to the right intended for Lamar Miller.","(11:51) Brock Osweiler pass to the middle to Keith Mumphery for 8 yards to the Oak11. Tackled by Dan Williams.","(12:12) Penalty: Delay of Game on Houston (Brock Osweiler) -5 yards.","(13:01) Brock Osweiler pass to the left to Braxton Miller for 6 yards to the Oak14. Tackled by Sean Smith.","(13:43) Lamar Miller rush up the middle for 5 yards to the Oak20. Tackled by Karl Joseph.","(14:27) Lamar Miller rush up the middle for 3 yards to the Oak25. Tackled by Justin Ellis.","(15:00) Brock Osweiler pass to the right to Lamar Miller for 5 yards to the Oak28. Tackled by Malcolm Smith.","(0:30) Brock Osweiler pass to the right to C.J. Fiedorowicz for 20 yards to the Oak33. Tackled by Karl Joseph and Cory James.","(1:08) Brock Osweiler rush to the right for 10 yards to the Hou47. Tackled by Cory James.","(1:11) Brock Osweiler incomplete pass to the left intended for Braxton Miller.","(1:57) Brock Osweiler pass to the middle to Will Fuller for 17 yards to the Hou37. Tackled by Bruce Irvin.","(2:39) Akeem Hunt rush up the middle for a loss of 5 yards to the Hou20. Tackled by Stacy McGee.","(2:39) Sebastian Janikowski kicks off to the endzone. Touchback.","(2:42) Sebastian Janikowski 20 yard field goal attempt is GOOD. Holder: Marquette King.","(2:46) Derek Carr incomplete pass to the left intended for DeAndre Washington.","(3:27) Derek Carr pass to the left to Seth Roberts for 6 yards to the Hou2. Tackled by Max Bullough.","(3:31) Derek Carr incomplete pass to the left intended for Clive Walford defensed by Corey Moore.","(3:39) Penalty: Pass Interference on Houston (A.J. Bouye) 24 yards.","(3:47) Derek Carr incomplete pass to the middle intended for Michael Crabtree.","(4:27) Derek Carr pass to the middle to Latavius Murray for 7 yards to the Hou32. Tackled by Benardrick McKinney.","(4:36) Penalty: False Start on Oakland (Rodney Hudson) -5 yards.","(5:08) Derek Carr pass to the right to Clive Walford for 11 yards to the Hou49. Tackled by Johnathan Joseph. Penalty: Unnecessary Roughness on Houston (Johnathan Joseph) 15 yards.","(5:52) Jalen Richard rush up the middle for 4 yards to the Oak40. Tackled by Jadeveon Clowney.","(6:36) Derek Carr pass to the right to Amari Cooper for a loss of 1 yard to the Oak36. Tackled by Benardrick McKinney.","(7:19) Derek Carr pass to the right to Michael Crabtree for 6 yards to the Oak37. Tackled by Benardrick McKinney.","(7:59) DeAndre Washington rush to the left for no gain to the Oak31. Tackled by Jadeveon Clowney.","(8:32) Derek Carr pass to the right to Jamize Olawale for 6 yards to the Oak31. Tackled by Andre Hal.","(8:32) Nick Novak kicks off to the endzone. Touchback.","(8:32) Nick Novak extra point is good.","(8:37) Lamar Miller rush to the left for 1 yard for a TOUCHDOWN.","(8:42) Penalty: Pass Interference on Oakland (DJ Hayden) 6 yards.","(9:19) Lamar Miller rush to the left for 2 yards to the Oak7. Tackled by Sean Smith.","(9:50) Brock Osweiler pass to the middle to Braxton Miller for no gain to the Oak9. Tackled by Perry Riley Jr..","(10:32) Lamar Miller rush up the middle for 3 yards to the Oak9. Tackled by Shilique Calhoun.","(10:56) Brock Osweiler pass to the right to Ryan Griffin for 8 yards to the Oak12.","(11:37) Brock Osweiler pass to the middle to Braxton Miller for 6 yards to the Oak20. Tackled by David Amerson.","(12:27) Brock Osweiler pass to the right to Lamar Miller for 4 yards to the Oak26. Tackled by Bruce Irvin.","(12:52) Lamar Miller rush to the left for 4 yards to the Oak30. Tackled by Karl Joseph.","(13:39) Brock Osweiler pass to the left to Ryan Griffin for 20 yards to the Oak34. Tackled by Karl Joseph.","(14:21) Jay Prosch rush up the middle for 2 yards to the Hou46. Tackled by Dan Williams.","(14:44) Brock Osweiler rush to the left for 9 yards to the Hou44. Tackled by Karl Joseph.","(14:47) Brock Osweiler incomplete pass to the left intended for Ryan Griffin.","(14:51) Brock Osweiler incomplete pass to the middle intended for C.J. Fiedorowicz.","(15:00) Derek Carr pass intended for Amari Cooper INTERCEPTED by A.J. Bouye. No return. Tackled by Amari Cooper.","(15:00) Nick Novak kicks off to the endzone. Touchback.","(0:02) Brock Osweiler sacked at Hou33 for a loss of 9 yards by Khalil Mack.","(0:09) Brock Osweiler incomplete pass to the right intended for Will Fuller defensed by David Amerson.","(0:16) Brock Osweiler pass to the right to Braxton Miller for 1 yard to the Hou42. Tackled by Malcolm Smith.","(0:21) Derek Carr incomplete pass to the right intended for Michael Crabtree defensed by Johnathan Joseph.","(1:02) Latavius Murray rush up the middle for 1 yard to the Hou41. Tackled by Jadeveon Clowney.","(1:27) Derek Carr pass to the middle to Latavius Murray for 8 yards to the Hou42. Tackled by Kareem Jackson.","(1:31) Derek Carr incomplete pass to the left intended for Seth Roberts.","(1:38) Brock Osweiler pass intended for Ryan Griffin INTERCEPTED by Malcolm Smith. No return. Tackled by Ryan Griffin.","(1:47) Marquette King punts for 49 yards to Hou25. No return.","(1:47) Houston Texans timeout.","(1:54) Jamize Olawale rush to the left for a loss of 3 yards to the Oak26. Tackled by Jadeveon Clowney.","(2:00) Derek Carr incomplete pass to the left intended for Seth Roberts.","(2:00) Two Minute Warning.","(2:04) Penalty: Offside on Houston (Jadeveon Clowney) 5 yards.","(2:26) Derek Carr pass to the right to Michael Crabtree for 4 yards to the Oak24. FUMBLE, recovered by Oak (Michael Crabtree).","(2:35) Shane Lechler punts for 60 yards to Oak0. Touchback.","(2:40) Brock Osweiler incomplete pass to the middle intended for DeAndre Hopkins defensed by DJ Hayden.","(3:26) Akeem Hunt rush to the right for no gain to the Hou40. Tackled by Bruce Irvin.","(4:09) Lamar Miller rush up the middle for 1 yard to the Hou40. Tackled by Dan Williams.","(4:42) Brock Osweiler pass to the left to DeAndre Hopkins for 13 yards to the Hou39. Tackled by DJ Hayden.","(5:17) Lamar Miller rush to the right for 3 yards to the Hou26. Tackled by Justin Ellis and David Amerson.","(5:43) Brock Osweiler pass to the right to C.J. Fiedorowicz for 14 yards to the Hou23. Tackled by Karl Joseph.","(6:20) Lamar Miller rush up the middle for a loss of 2 yards to the Hou9. Tackled by Denico Autry.","(6:31) Marquette King punts for 59 yards to Hou10. Braxton Miller return for 1 yard to Hou11. Tackled by Andre Holmes.","(6:37) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(7:21) Derek Carr pass to the left to Jalen Richard for 4 yards to the Oak31. Tackled by Benardrick McKinney.","(7:59) Jalen Richard rush to the left for 2 yards to the Oak27. Tackled by Christian Covington.","(7:59) Nick Novak kicks off to the endzone. Touchback.","(7:59) Nick Novak extra point is good.","(8:04) Brock Osweiler pass to the left to Braxton Miller for 12 yards for a TOUCHDOWN.","(8:28) Penalty: False Start on Houston (Greg Mancz) -5 yards.","(9:19) Brock Osweiler pass to the middle to Brock Osweiler for a loss of 6 yards to the Oak7. Tackled by Denico Autry.","(9:44) Lamar Miller rush to the right for 33 yards to the Oak1. Tackled by Karl Joseph.","(9:44) Oakland Raiders timeout.","(10:24) Lamar Miller rush to the right for 7 yards to the Oak34. Tackled by Bruce Irvin.","(10:55) Brock Osweiler pass to the middle to C.J. Fiedorowicz for 18 yards to the Oak41. Tackled by Karl Joseph.","(10:55) Houston Texans timeout.","(11:43) Lamar Miller rush to the left for 8 yards to the Hou41. Tackled by Karl Joseph.","(11:52) Brock Osweiler incomplete pass to the middle intended for C.J. Fiedorowicz defensed by Reggie Nelson.","(11:57) Penalty: Holding on Oakland (DJ Hayden) 5 yards.","(12:43) Lamar Miller rush to the left for 3 yards to the Hou28. Tackled by Malcolm Smith.","(12:48) Brock Osweiler incomplete pass to the left intended for Will Fuller defensed by Shilique Calhoun.","(12:48) Sebastian Janikowski kicks off to the endzone. Touchback.","(12:51) Sebastian Janikowski 19 yard field goal attempt is GOOD. Holder: Marquette King.","(12:55) Derek Carr incomplete pass to the right intended for Clive Walford.","(13:37) Jamize Olawale rush up the middle for no gain to the Hou1. Tackled by A.J. Bouye.","(14:20) Latavius Murray rush up the middle for 3 yards to the Hou1. Tackled by John Simon.","(14:47) Derek Carr pass to the right to Amari Cooper for 15 yards to the Hou4. Tackled by Johnathan Joseph and A.J. Bouye.","(14:54) Sebastian Janikowski kicks off to the Hou8. Tyler Ervin - no return. FUMBLE, recovered by Oak (Taiwan Jones).","(14:54) Sebastian Janikowski extra point is good.","(15:00) Derek Carr pass to the middle to Jalen Richard for 17 yards for a TOUCHDOWN.","(0:11) Derek Carr pass to the right to Latavius Murray for no gain to the Hou17. Tackled by Johnathan Joseph and Kareem Jackson.","(0:52) Latavius Murray rush up the middle for 3 yards to the Hou17. Tackled by Benardrick McKinney.","(0:59) Penalty: Pass Interference on Houston (Johnathan Joseph) 33 yards.","(1:24) Penalty: False Start on Oakland (Donald Penn) -5 yards.","(2:06) Latavius Murray rush to the left for 3 yards to the Hou48. Tackled by Quintin Demps.","(2:50) Latavius Murray rush up the middle for 2 yards to the Oak49. Tackled by Benardrick McKinney.","(3:37) Latavius Murray rush to the left for no gain to the Oak47. Tackled by Brian Cushing.","(4:16) Derek Carr pass to the left to Jamize Olawale for 9 yards to the Oak47. Tackled by Benardrick McKinney.","(4:29) Derek Carr pass to the right to Clive Walford for 17 yards to the Oak38.","(4:41) Shane Lechler punts for 45 yards to Oak9. TJ Carrie return for 12 yards to Oak21. Tackled by Corey Moore.","(5:04) Braxton Miller rush to the right for 1 yard to the Hou46. Tackled by Khalil Mack.","(5:39) Lamar Miller rush to the right for 4 yards to the Hou45. Tackled by Khalil Mack.","(6:13) Brock Osweiler pass to the right to DeAndre Hopkins for 4 yards to the Hou41. Tackled by David Amerson.","(6:24) Marquette King punts for 51 yards to Hou28. Tyler Ervin return for 9 yards to Hou37. Tackled by Daren Bates and Nate Allen.","(7:07) Derek Carr pass to the right to Latavius Murray for 5 yards to the Oak21. Tackled by Whitney Mercilus.","(7:52) Jalen Richard rush up the middle for a loss of 4 yards to the Oak16. Tackled by Jadeveon Clowney.","(8:34) Derek Carr pass to the right to Michael Crabtree for a loss of 5 yards to the Oak20. Tackled by Andre Hal.","(8:34) Nick Novak kicks off to the endzone. Touchback.","(8:37) Nick Novak 32 yard field goal attempt is GOOD. Holder: Shane Lechler.","(8:44) Brock Osweiler incomplete pass to the right intended for Braxton Miller.","(9:20) Akeem Hunt rush to the left for a loss of 2 yards to the Oak14. Tackled by Bruce Irvin.","(10:00) Akeem Hunt rush to the left for 5 yards to the Oak12. Tackled by Karl Joseph.","(10:32) Brock Osweiler pass to the left to Stephen Anderson for 14 yards to the Oak17. Tackled by Reggie Nelson.","(11:17) Lamar Miller rush up the middle for 2 yards to the Oak31. Tackled by Cory James.","(11:50) Lamar Miller rush to the left for 3 yards to the Oak33. Tackled by Perry Riley Jr. and Malcolm Smith.","(12:33) Brock Osweiler pass to the left to DeAndre Hopkins for 24 yards to the Oak36.","(13:19) Lamar Miller rush to the right for 3 yards to the Hou40. Tackled by David Amerson and Jihad Ward.","(13:23) Brock Osweiler incomplete pass to the middle intended for C.J. Fiedorowicz.","(13:46) Brock Osweiler pass to the right to C.J. Fiedorowicz for 10 yards to the Hou37. Tackled by Malcolm Smith.","(14:26) Lamar Miller rush up the middle for a loss of 2 yards to the Hou27. Tackled by Perry Riley Jr. and Bruce Irvin.","(15:00) Brock Osweiler pass to the left to Ryan Griffin for 4 yards to the Hou29. Tackled by Bruce Irvin.","(15:00) Sebastian Janikowski kicks off to the endzone. Touchback."]