["(0:39) Andrew Luck rush up the middle for a loss of 1 yard to the Ind32.","(1:19) Andrew Luck rush up the middle for a loss of 1 yard to the Ind33.","(2:00) Andrew Luck rush up the middle for a loss of 1 yard to the Ind34.","(2:00) Two Minute Warning.","(2:35) Andrew Luck pass to the right to T.Y. Hilton for 11 yards to the Ind35. Tackled by Avery Williamson.","(2:35) Tennessee Titans timeout.","(2:39) Frank Gore rush to the right for no gain to the Ind24. Tackled by Wesley Woodyard and Avery Williamson.","(2:39) Tennessee Titans timeout.","(2:42) Frank Gore rush to the right for 5 yards to the Ind24. Tackled by Brian Orakpo.","(2:45) DeMarco Murray rush to the left for no gain to the Ind19. Tackled by Clayton Geathers.","(3:30) Marcus Mariota pass to the left to Kendall Wright for 8 yards to the Ind19. Tackled by Vontae Davis and Darius Butler.","(3:35) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe.","(3:41) Marcus Mariota rush to the left for 4 yards to the Ind17. Tackled by Vontae Davis. Penalty: Holding on Tennessee (Anthony Fasano) -10 yards.","(3:47) Marcus Mariota pass to the left to Rishard Matthews for 7 yards to the Ind21. Tackled by Rashaan Melvin.","(4:22) Marcus Mariota pass to the right to Harry Douglas for 3 yards to the Ind28. Tackled by Rashaan Melvin.","(4:22) Indianapolis Colts timeout.","(4:22) Tennessee Titans timeout.","(5:04) Marcus Mariota pass to the left to Rishard Matthews for 2 yards to the Ind31. Tackled by Mike Adams.","(5:17) Penalty: Offside on Indianapolis (Henry Anderson) 5 yards.","(5:54) Marcus Mariota sacked at Ind38 for no gain by Edwin Jackson.","(6:33) DeMarco Murray rush to the left for 2 yards to the Ind38. Tackled by Arthur Jones.","(6:37) Penalty: Pass Interference on Indianapolis (Vontae Davis) 19 yards.","(7:06) DeMarco Murray rush to the right for 2 yards to the Ind49. Tackled by D'Qwell Jackson and Edwin Jackson. Penalty: Holding on Tennessee (Quinton Spain) -10 yards.","(7:32) Marcus Mariota pass to the left to Rishard Matthews for 11 yards to the Ten49. Tackled by Vontae Davis.","(7:38) Marcus Mariota incomplete pass to the right intended for Rishard Matthews defensed by Rashaan Melvin.","(7:44) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe defensed by Rashaan Melvin.","(7:53) Andrew Luck pass intended for T.Y. Hilton INTERCEPTED by Brice McCain. No return. Tackled by T.Y. Hilton.","(8:03) Brett Kern punts for 46 yards to Ind37. Chester Rogers return for 2 yards to Ind39. Tackled by Wesley Woodyard.","(8:40) Marcus Mariota sacked at Ten17 for a loss of 12 yards by D'Qwell Jackson.","(9:20) DeMarco Murray rush to the right for 3 yards to the Ten29. Tackled by Arthur Jones.","(9:26) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(10:02) DeMarco Murray rush to the right for 8 yards to the Ten26. Tackled by D'Qwell Jackson.","(10:44) DeMarco Murray rush to the right for 5 yards to the Ten18. Tackled by Rashaan Melvin.","(10:50) Pat McAfee kicks off to the Ten2. Marc Mariani return for 11 yards to Ten13. Tackled by Erik Swoope and Josh McNary.","(10:55) Adam Vinatieri 49 yard field goal attempt is GOOD. Holder: Pat McAfee.","(11:00) Andrew Luck incomplete pass to the middle intended for T.Y. Hilton defensed by Brice McCain.","(11:46) Andrew Luck sacked at Ten31 for a loss of 6 yards by Austin Johnson and Derrick Morgan.","(11:50) Andrew Luck incomplete pass to the left intended for Phillip Dorsett.","(12:14) Andrew Luck pass to the right to T.Y. Hilton for 50 yards to the Ten25. Tackled by Daimion Stafford.","(12:14) Ryan Succop kicks off to the endzone. Touchback.","(12:19) Ryan Succop 47 yard field goal attempt is GOOD. Holder: Brett Kern.","(13:06) Marcus Mariota pass to the right to Kendall Wright for 8 yards to the Ind29. Tackled by Darius Butler and T.J. Green.","(13:12) Marcus Mariota incomplete pass to the right intended for Delanie Walker defensed by Clayton Geathers.","(13:33) DeMarco Murray rush to the right for 4 yards to the Ind27. Tackled by Arthur Jones. Penalty: Tripping on Tennessee (Ben Jones) -10 yards.","(14:15) DeMarco Murray rush up the middle for 6 yards to the Ind31. Tackled by Arthur Jones.","(14:19) Penalty: Pass Interference on Indianapolis (Rashaan Melvin) 11 yards.","(15:00) Marcus Mariota rush to the right for 4 yards to the Ind48. Tackled by Rashaan Melvin.","(0:41) DeMarco Murray rush up the middle for 4 yards to the Ten48. Tackled by Lavar Edwards.","(1:22) Marcus Mariota pass to the middle to Rishard Matthews for 15 yards to the Ten44. Tackled by Rashaan Melvin.","(1:59) Marcus Mariota rush to the left for 12 yards to the Ten29. Tackled by Edwin Jackson.","(2:38) DeMarco Murray rush to the left for a loss of 1 yard to the Ten17. Tackled by Erik Walden.","(3:07) DeMarco Murray rush up the middle for 7 yards to the Ten13. Tackled by Rashaan Melvin. Penalty: Illegal Use of Hands on Indianapolis (Arthur Jones) 5 yards.","(3:15) Pat McAfee punts for 43 yards to Ten12. No return. Penalty: Holding on Tennessee (Karl Klug) -6 yards.","(4:02) Frank Gore rush up the middle for no gain to the Ind45. Tackled by Derrick Morgan.","(4:36) Frank Gore rush to the right for 4 yards to the Ind45. Tackled by Kevin Byard.","(4:42) Andrew Luck incomplete pass to the right intended for Dwayne Allen defensed by Jurrell Casey.","(5:20) Penalty: Too Many Men on Field on Tennessee 5 yards.","(5:47) Andrew Luck pass to the right to Donte Moncrief for 15 yards to the Ind36. Tackled by Perrish Cox.","(5:55) Andrew Luck incomplete pass to the right intended for Donte Moncrief.","(6:30) Frank Gore rush to the right for 4 yards to the Ind21. Tackled by DaQuan Jones.","(6:35) Ryan Succop kicks off to the Ind5. Jordan Todman return for 22 yards to Ind27. Tackled by Antonio Andrews. Penalty: Holding on Indianapolis (Josh McNary) -10 yards.","(6:35) Ryan Succop extra point is good.","(6:43) Marcus Mariota pass to the right to Tajae Sharpe for 34 yards for a TOUCHDOWN.","(7:03) Marcus Mariota rush to the left for 3 yards to the Ind34. Tackled by Clayton Geathers.","(7:45) DeMarco Murray rush up the middle for 6 yards to the Ind37. Tackled by Mike Adams.","(8:22) Marcus Mariota pass to the middle to Kendall Wright for 21 yards to the Ind43. Tackled by D'Qwell Jackson.","(9:04) Marcus Mariota pass to the right to Tajae Sharpe for 5 yards to the Ten36. Tackled by Rashaan Melvin.","(9:46) Marcus Mariota pass to the right to DeMarco Murray for 2 yards to the Ten31. Tackled by Rashaan Melvin.","(10:14) Marcus Mariota pass to the right to Tajae Sharpe for 14 yards to the Ten29. Tackled by Rashaan Melvin.","(10:52) Marcus Mariota pass to the right to Rishard Matthews for 7 yards to the Ten15. Tackled by Rashaan Melvin.","(11:25) DeMarco Murray rush up the middle for 6 yards to the Ten8. Tackled by David Parry.","(11:36) Pat McAfee punts for 40 yards to Ten1. Valentino Blake return for 1 yard to Ten2. Tackled by Edwin Jackson.","(11:42) Andrew Luck incomplete pass to the right intended for Donte Moncrief.","(11:47) Andrew Luck incomplete pass to the left intended for Jack Doyle.","(11:54) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(12:00) Valentino Blake rush up the middle for a loss of 2 yards to the Ten41. Tackled by Clayton Geathers and Hassan Ridgeway.","(12:06) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(12:44) DeMarco Murray rush to the left for 7 yards to the Ten43. Tackled by Mike Adams.","(13:21) DeMarco Murray rush to the left for 1 yard to the Ten36. Tackled by Clayton Geathers.","(13:29) Pat McAfee punts for 49 yards to Ten35. No return.","(13:35) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(14:20) Andrew Luck sacked at Ind16 for a loss of 5 yards by Derrick Morgan.","(14:56) Frank Gore rush to the left for 2 yards to the Ind21. Tackled by Brian Orakpo.","(15:00) Ryan Succop kicks off to the Ind2. Jordan Todman return for 17 yards to Ind19. Tackled by Daimion Stafford.","(0:20) Andrew Luck rush up the middle for a loss of 1 yard to the Ind24.","(0:20) Ryan Succop kicks off to the endzone. Touchback.","(0:20) Ryan Succop extra point is good.","(0:26) Marcus Mariota pass to the right to DeMarco Murray for 3 yards for a TOUCHDOWN.","(0:26) Indianapolis Colts timeout.","(0:30) Marcus Mariota incomplete pass to the left intended for Kendall Wright.","(0:30) Tennessee Titans timeout.","(0:32) DeMarco Murray rush up the middle for a loss of 2 yards to the Ind3. Tackled by Erik Walden and Mike Adams.","(0:39) Marcus Mariota pass to the right to Rishard Matthews for 16 yards to the Ind1. Tackled by Darius Butler.","(0:47) Marcus Mariota incomplete pass to the left.","(1:04) Marcus Mariota pass to the left to Tajae Sharpe for 15 yards to the Ind17. Tackled by D'Qwell Jackson.","(1:10) Marcus Mariota incomplete pass to the right.","(1:29) Marcus Mariota pass to the left to Kendall Wright for 15 yards to the Ind32. Tackled by Darius Butler.","(1:48) Marcus Mariota pass to the right to Delanie Walker for 7 yards to the Ind47. Tackled by Clayton Geathers.","(1:58) Marcus Mariota rush to the left for 6 yards to the Ten46. Tackled by Clayton Geathers.","(1:58) Two Minute Warning.","(2:03) Tennessee Titans timeout.","(2:03) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(2:13) Marcus Mariota pass to the right to Rishard Matthews for 8 yards to the Ten40. Tackled by Rashaan Melvin.","(2:18) 42 yard field goal attempt by Adam Vinatieri is NO GOOD. Holder: Pat McAfee.","(2:18) Penalty: Offside on Tennessee (Valentino Blake) 5 yards.","(2:24) Andrew Luck incomplete pass to the middle intended for Dwayne Allen.","(3:09) Andrew Luck rush up the middle for 2 yards to the Ten29. Tackled by Aaron Wallace.","(3:53) Frank Gore rush to the right for 2 yards to the Ten31. Tackled by Avery Williamson.","(4:27) Andrew Luck rush to the left for 13 yards to the Ten33. Tackled by Brian Orakpo.","(4:31) Andrew Luck incomplete pass to the right intended for Donte Moncrief.","(4:36) Andrew Luck incomplete pass to the left intended for Jordan Todman defensed by Brian Orakpo.","(4:36) Indianapolis Colts timeout.","(5:26) Andrew Luck pass to the middle to T.Y. Hilton for 14 yards to the Ten46. Tackled by Jurrell Casey.","(6:06) Andrew Luck pass to the left to Frank Gore for 12 yards to the Ind40. Tackled by Rashad Johnson and Wesley Woodyard.","(6:46) Frank Gore rush to the right for 8 yards to the Ind28. Tackled by Aaron Wallace.","(7:19) Frank Gore rush to the right for 4 yards to the Ind20. Tackled by Karl Klug.","(7:27) Brett Kern punts for 26 yards to Ind16. No return.","(7:53) Marcus Mariota pass to the right to Delanie Walker for 10 yards to the Ind27. Tackled by Mike Adams. Penalty: Unsports. Conduct on Tennessee (Delanie Walker) -15 yards.","(8:33) Marcus Mariota sacked at Ind37 for a loss of 4 yards by David Parry.","(9:15) Marcus Mariota sacked at Ind33 for a loss of 12 yards by Erik Walden.","(9:37) Marcus Mariota pass to the left to Delanie Walker for 14 yards to the Ind21. Tackled by Vontae Davis.","(10:08) DeMarco Murray rush up the middle for 3 yards to the Ind35. Tackled by D'Qwell Jackson.","(10:28) Marcus Mariota pass to the left to Rishard Matthews for 35 yards to the Ind38. Tackled by Clayton Geathers.","(10:35) Pat McAfee kicks off to the Ten4. Marc Mariani return for 23 yards to Ten27. Tackled by Matthias Farley.","(10:35) Adam Vinatieri extra point is good.","(10:43) Andrew Luck pass to the right to T.Y. Hilton for 2 yards for a TOUCHDOWN.","(11:23) Andrew Luck pass to the middle to Frank Gore for 1 yard to the Ten2. Tackled by Valentino Blake.","(12:08) Frank Gore rush up the middle for 5 yards to the Ten3. Tackled by Valentino Blake and Karl Klug.","(12:51) Andrew Luck pass to the right to Donte Moncrief for 3 yards to the Ten8. Tackled by Daimion Stafford.","(13:11) Andrew Luck pass to the left to Phillip Dorsett for 50 yards to the Ten11. Tackled by Jason McCourty.","(13:53) Frank Gore rush to the right for 2 yards to the Ind39. Tackled by Jurrell Casey.","(14:21) Andrew Luck pass to the left to Donte Moncrief for 17 yards to the Ind37.","(15:00) Frank Gore rush up the middle for a loss of 1 yard to the Ind20. Tackled by Wesley Woodyard and Derrick Morgan.","(0:23) Andrew Luck rush to the left for 1 yard to the Ind21. Tackled by Brian Orakpo.","(0:33) Brett Kern punts for 57 yards to Ind0. Touchback.","(0:39) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(0:57) Penalty: False Start on Tennessee (Quinton Spain) -5 yards.","(1:34) Marcus Mariota pass to the middle to Delanie Walker for 5 yards to the Ten48. Tackled by D'Qwell Jackson and Edwin Jackson.","(2:05) DeMarco Murray rush up the middle for 4 yards to the Ten43. Tackled by David Parry.","(2:21) Marcus Mariota pass to the right to Rishard Matthews for 21 yards to the Ten39. Tackled by Clayton Geathers.","(2:21) Penalty: False Start on Tennessee (Taylor Lewan) -5 yards.","(2:26) Marcus Mariota incomplete pass to the left intended for Delanie Walker defensed by D'Qwell Jackson.","(2:32) Pat McAfee kicks off to the Ten5. Marc Mariani return for 18 yards to Ten23. Tackled by Chris Carter.","(2:32) Adam Vinatieri extra point is good.","(2:37) Andrew Luck pass to the right to Donte Moncrief for 2 yards for a TOUCHDOWN.","(3:13) Robert Turbin rush up the middle for 3 yards to the Ten2. Tackled by Avery Williamson.","(3:46) Andrew Luck pass to the left to Frank Gore for 49 yards to the Ten5. Tackled by Avery Williamson.","(4:29) Andrew Luck pass to the left to Frank Gore for 9 yards to the Ind46. Tackled by Sean Spence and Rashad Johnson.","(5:10) Frank Gore rush up the middle for 1 yard to the Ind37. Tackled by Austin Johnson and Wesley Woodyard.","(5:44) Andrew Luck pass to the right to Jack Doyle for 7 yards to the Ind36. Tackled by Avery Williamson.","(6:27) Frank Gore rush up the middle for 4 yards to the Ind29. Tackled by Brian Orakpo.","(6:41) Brett Kern punts for 55 yards to Ind25. Chester Rogers return for 10 yards to Ind35. Tackled by Jalston Fowler. Penalty: Illegal Block on Indianapolis (Erik Swoope) -10 yards.","(7:24) Marcus Mariota sacked at Ten20 for a loss of 8 yards by Robert Mathis.","(7:59) DeMarco Murray rush up the middle for no gain to the Ten28. Tackled by Arthur Jones and D'Qwell Jackson.","(8:32) DeMarco Murray rush to the left for 1 yard to the Ten28. Tackled by Clayton Geathers.","(8:39) Pat McAfee kicks off to the Ten8. Marc Mariani return for 19 yards to Ten27. Tackled by Edwin Jackson and Josh Ferguson.","(8:39) Adam Vinatieri extra point is good.","(8:39) Penalty: Offside on Tennessee (Kevin Byard) 5 yards.","(9:13) Robert Turbin rush up the middle for 1 yard for a TOUCHDOWN.","(9:13) Frank Gore rush to the right for no gain to the Ten1. Tackled by Angelo Blackson and Wesley Woodyard.","(9:58) Andrew Luck rush to the right for 10 yards to the Ten1. Tackled by Jurrell Casey and Avery Williamson.","(10:40) Frank Gore rush up the middle for 4 yards to the Ten11. Tackled by Kevin Byard and Da'Norris Searcy.","(10:46) Penalty: Pass Interference on Tennessee (Jason McCourty) 33 yards.","(11:22) Frank Gore rush to the left for 4 yards to the Ten48. Tackled by Avery Williamson.","(11:43) Penalty: False Start on Indianapolis (Dwayne Allen) -5 yards.","(12:30) Andrew Luck pass to the right to T.Y. Hilton for 20 yards to the Ten47. Tackled by Da'Norris Searcy.","(12:35) Andrew Luck incomplete pass to the left intended for Phillip Dorsett.","(12:58) Penalty: False Start on Indianapolis (Joe Haeg) -5 yards.","(13:38) Frank Gore rush to the right for 2 yards to the Ind38. Tackled by Avery Williamson.","(13:45) Brett Kern punts for 35 yards to Ind36. No return.","(13:49) Marcus Mariota incomplete pass to the right intended for Kendall Wright defensed by Vontae Davis.","(14:20) Marcus Mariota pass to the left to DeMarco Murray for 4 yards to the Ten29. Tackled by Edwin Jackson.","(14:55) DeMarco Murray rush up the middle for 4 yards to the Ten25. Tackled by Arthur Jones and D'Qwell Jackson.","(15:00) Pat McAfee kicks off to the Ten6. Marc Mariani return for 15 yards to Ten21. Tackled by Antonio Morrison."]