["(0:05) Jared Goff incomplete pass to the left.","(0:10) Jared Goff pass to the right to Lance Kendricks for 5 yards to the Mia47. Tackled by Kiko Alonso.","(0:15) Jared Goff incomplete pass to the left intended for Kenny Britt.","(0:19) Jared Goff incomplete pass to the right intended for Brian Quick.","(0:19) Los Angeles Rams timeout.","(0:29) Jared Goff pass to the right to Kenny Britt for 7 yards to the LA48. Tackled by Spencer Paysinger.","(0:36) Andrew Franks kicks off to the LA-3. Benny Cunningham return for 44 yards to LA41. Tackled by Lafayette Pitts and Bobby McCain.","(0:36) Andrew Franks extra point is good.","(0:40) Ryan Tannehill pass to the right to DeVante Parker for 9 yards for a TOUCHDOWN.","(0:40) Miami Dolphins timeout.","(0:50) Ryan Tannehill pass to the right to Jay Ajayi for 8 yards to the LA9. Tackled by Mark Barron.","(1:20) Jay Ajayi rush to the left for 9 yards to the LA17. Tackled by T.J. McDonald and Alec Ogletree.","(1:26) Ryan Tannehill pass to the right to DeVante Parker for 9 yards to the LA26. Tackled by Trumaine Johnson.","(2:00) Ryan Tannehill pass to the right to DeVante Parker for 12 yards to the LA35. Tackled by Mark Barron.","(2:00) Two Minute Warning.","(2:04) Jay Ajayi rush up the middle for a loss of 2 yards to the LA47. Tackled by William Hayes.","(2:11) Ryan Tannehill pass to the right to Kenny Stills for 15 yards to the Mia40. Tackled by Trumaine Johnson. Penalty: Roughing Passer on Los Angeles (Aaron Donald) 15 yards.","(2:18) Johnny Hekker punts for 44 yards to Mia25. No return.","(2:18) Los Angeles Rams timeout.","(3:10) Jared Goff pass to the left to Brian Quick for 6 yards to the LA31. Tackled by Tony Lippett.","(3:10) Miami Dolphins timeout.","(3:16) Todd Gurley rush to the left for no gain to the LA25. Tackled by Spencer Paysinger and Bacarri Rambo.","(3:16) Penalty: False Start on Los Angeles (Lance Kendricks) -5 yards.","(4:02) Todd Gurley rush up the middle for 5 yards to the LA30. Tackled by Neville Hewitt.","(4:02) Andrew Franks kicks off to the endzone. Touchback.","(4:02) Andrew Franks extra point is good.","(4:13) Ryan Tannehill pass to the left to Jarvis Landry for 10 yards for a TOUCHDOWN.","(4:45) Ryan Tannehill pass to the middle to Jay Ajayi for 1 yard to the LA10. Tackled by Mark Barron.","(4:51) Ryan Tannehill pass to the left to DeVante Parker for 12 yards to the LA11. Tackled by Lamarcus Joyner.","(5:14) Ryan Tannehill pass to the left to DeVante Parker for 15 yards to the LA23. Tackled by Maurice Alexander and Alec Ogletree.","(5:34) Ryan Tannehill pass to the left to Jarvis Landry for 12 yards to the Mia47. Tackled by Alec Ogletree. Penalty: Unnecessary Roughness on Los Angeles (Alec Ogletree) 15 yards.","(6:02) Ryan Tannehill pass to the middle to Jarvis Landry for 5 yards to the Mia35. Tackled by Lamarcus Joyner.","(6:06) Ryan Tannehill incomplete pass to the right intended for Jay Ajayi defensed by Aaron Donald.","(6:40) Ryan Tannehill pass to the right to Kenny Stills for 7 yards to the Mia30. Tackled by Mark Barron.","(6:45) 48 yard field goal attempt by Greg Zuerlein is NO GOOD. Holder: Johnny Hekker. Penalty: Unsports. Conduct on Miami (Leon Orr) 15 yards.","(6:45) Los Angeles Rams timeout.","(7:32) Jared Goff pass to the left to Kenny Britt for 6 yards to the Mia30. Tackled by Byron Maxwell.","(8:15) Todd Gurley rush to the left for no gain to the Mia36. Tackled by Bacarri Rambo and Andre Branch.","(9:00) Todd Gurley rush to the right for 3 yards to the Mia36. Tackled by Ndamukong Suh.","(9:43) Jared Goff pass to the left to Lance Kendricks for 3 yards to the Mia39. Tackled by Isa Abdul-Quddus.","(10:26) Jared Goff pass to the left to Kenny Britt for 7 yards to the Mia42. Tackled by Byron Maxwell.","(11:07) Todd Gurley rush to the right for 1 yard to the Mia49. Tackled by Jordan Phillips.","(11:15) Matt Darr punts for 43 yards to Mia50. No return.","(11:55) Ryan Tannehill sacked at Mia7 for a loss of 10 yards by Dominique Easley.","(12:01) Ryan Tannehill incomplete pass to the right intended for Dion Sims defensed by Mark Barron.","(12:04) Ryan Tannehill incomplete pass to the right intended for Kenny Stills.","(12:13) Johnny Hekker punts for 45 yards to Mia17. No return.","(12:51) Jared Goff pass to the right to Benny Cunningham for a loss of 3 yards to the LA38. Tackled by Ndamukong Suh and Andre Branch.","(13:24) Jared Goff rush to the left for 4 yards to the Mia49. Tackled by Spencer Paysinger. Penalty: Illegal Block on Los Angeles (Greg Robinson) -10 yards.","(14:06) Todd Gurley rush to the left for no gain to the LA47. Tackled by Earl Mitchell.","(14:11) Jared Goff incomplete pass to the left intended for Todd Gurley.","(14:25) Matt Darr punts for 53 yards to LA36. Tavon Austin return for 11 yards to LA47. Tackled by Walt Aikens.","(15:00) Ryan Tannehill pass to the right to DeVante Parker for 1 yard to the Mia11. Tackled by Trumaine Johnson.","(0:23) Ryan Tannehill sacked at Mia10 for a loss of 3 yards by Dominique Easley.","(1:32) Jay Ajayi rush to the left for no gain to the Mia13. Tackled by Mark Barron and Dominique Easley.","(1:39) Greg Zuerlein kicks off to the Mia-5. Kenyan Drake return for 18 yards to Mia13. Tackled by Malcolm Brown.","(1:43) Greg Zuerlein 46 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(2:30) Jared Goff rush to the left for 2 yards to the Mia28. Tackled by Kiko Alonso.","(2:30) Penalty: False Start on Los Angeles (Tim Barnes) -5 yards.","(2:33) Jared Goff incomplete pass to the right intended for Benny Cunningham.","(3:20) Jared Goff rush to the right for 6 yards to the Mia25. Tackled by Kiko Alonso.","(4:00) Jared Goff pass to the left to Pharoh Cooper for 10 yards to the Mia31. Tackled by Byron Maxwell and Andre Branch.","(4:44) Todd Gurley rush to the right for 1 yard to the Mia41. Tackled by Isa Abdul-Quddus and Kiko Alonso.","(5:32) Jared Goff pass to the right to Tavon Austin for 21 yards to the Mia42. Tackled by Isa Abdul-Quddus and Tony Lippett.","(6:20) Todd Gurley rush to the left for 3 yards to the LA37. Tackled by Neville Hewitt.","(7:00) Todd Gurley rush to the left for 8 yards to the LA34. Tackled by Bacarri Rambo and Kiko Alonso.","(7:44) Todd Gurley rush to the left for 3 yards to the LA26. Tackled by Ndamukong Suh and Jason Jones.","(8:01) Penalty: Holding on Los Angeles (Marqui Christian) -10 yards.","(8:08) Miami Dolphins timeout.","(8:08) Ryan Tannehill incomplete pass to the left intended for DeVante Parker defensed by E.J. Gaines.","(8:12) Ryan Tannehill incomplete pass to the left intended for Kenny Stills defensed by Lamarcus Joyner.","(8:56) Jay Ajayi rush to the right for a loss of 2 yards to the Mia20. Tackled by Alec Ogletree and Ethan Westbrooks.","(9:26) Ryan Tannehill rush to the right for 10 yards to the Mia22. Tackled by T.J. McDonald.","(9:34) Johnny Hekker punts for 36 yards to Mia12. No return.","(9:34) Penalty: Delay of Game on Los Angeles (Johnny Hekker) -5 yards.","(9:40) Jared Goff incomplete pass to the right intended for Lance Kendricks.","(9:44) Jared Goff incomplete pass to the middle intended for Todd Gurley.","(10:30) Benny Cunningham rush up the middle for 1 yard to the Mia43. Tackled by Ndamukong Suh.","(10:35) Penalty: Pass Interference on Miami (Byron Maxwell) 6 yards.","(11:22) Todd Gurley rush to the right for a loss of 2 yards to the LA50. Tackled by Byron Maxwell.","(11:55) Penalty: Offside on Miami (Cameron Wake) 5 yards.","(12:34) Todd Gurley rush to the left for 3 yards to the LA47. Tackled by Neville Hewitt.","(12:54) Penalty: Face Mask on Miami (Kiko Alonso) 15 yards.","(13:05) Ryan Tannehill pass intended for DeVante Parker INTERCEPTED by Maurice Alexander. No return. Touchback.","(13:14) Jared Goff pass to the middle to Lance Kendricks for 10 yards to the LA34. Tackled by Kiko Alonso. FUMBLE, recovered by Mia (Kiko Alonso). Tackled by Kenny Britt.","(13:20) Jared Goff incomplete pass to the right intended for Lance Kendricks.","(13:28) Matt Darr punts for 48 yards to LA24. No return.","(13:36) Ryan Tannehill incomplete pass to the left intended for Kenny Stills.","(14:21) Ryan Tannehill pass to the left to MarQueis Gray for 5 yards to the Mia28. Tackled by E.J. Gaines.","(15:00) Jay Ajayi rush to the left for a loss of 2 yards to the Mia23. Tackled by Aaron Donald and Michael Brockers.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback.","(0:10) Jared Goff rush up the middle for a loss of 1 yard to the LA30.","(0:17) Matt Darr punts for 35 yards to LA31. No return.","(0:17) Los Angeles Rams timeout.","(0:22) Jay Ajayi rush up the middle for 2 yards to the Mia34. Tackled by Alec Ogletree and Mark Barron.","(0:22) Los Angeles Rams timeout.","(0:36) Jay Ajayi rush up the middle for 8 yards to the Mia32. Tackled by Alec Ogletree.","(1:13) Ryan Tannehill sacked at Mia24 for a loss of 10 yards by Robert Quinn.","(1:19) Ryan Tannehill pass to the right to Dion Sims for 7 yards to the Mia34. Tackled by Mark Barron.","(1:48) Ryan Tannehill pass to the left to Dion Sims for 4 yards to the Mia27. Tackled by Alec Ogletree.","(2:00) Johnny Hekker punts for 52 yards to Mia23. No return.","(2:00) Two Minute Warning.","(2:32) Jared Goff sacked at LA25 for a loss of 9 yards by Cameron Wake and Ndamukong Suh.","(2:39) Jared Goff incomplete pass to the right intended for Tavon Austin defensed by Tony Lippett.","(3:22) Benny Cunningham rush to the left for 6 yards to the LA34. Tackled by Spencer Paysinger.","(4:02) Jared Goff pass to the left to Lance Kendricks for 20 yards to the LA28. Tackled by Bacarri Rambo.","(4:49) Todd Gurley rush up the middle for a loss of 1 yard to the LA8. Tackled by Earl Mitchell.","(5:34) Jared Goff pass to the right to Tyler Higbee for 1 yard to the LA9. Tackled by Isa Abdul-Quddus.","(5:42) Matt Darr punts for 40 yards to LA8. No return.","(5:48) Ryan Tannehill incomplete pass to the middle intended for Kenny Stills.","(5:54) Ryan Tannehill incomplete pass to the right intended for Kenny Stills defensed by Trumaine Johnson.","(6:33) Jay Ajayi rush to the left for a loss of 1 yard to the LA48. Tackled by Ethan Westbrooks.","(7:09) Ryan Tannehill rush to the left for 9 yards to the LA47. Tackled by Josh Forrest.","(7:50) Jay Ajayi rush up the middle for 2 yards to the Mia44. Tackled by Aaron Donald and Maurice Alexander.","(8:29) Ryan Tannehill pass to the left to DeVante Parker for 9 yards to the Mia42. Tackled by E.J. Gaines.","(9:18) Jay Ajayi rush to the right for 11 yards to the Mia33. Tackled by Maurice Alexander.","(9:53) Jay Ajayi rush to the left for 9 yards to the Mia22. Tackled by Mark Barron.","(10:02) Johnny Hekker punts for 40 yards to Mia13. No return.","(10:44) Jared Goff pass to the left to Kenny Britt for 4 yards to the LA47. Tackled by Spencer Paysinger.","(11:28) Tavon Austin rush up the middle for 1 yard to the LA43. Tackled by Isa Abdul-Quddus.","(12:03) Todd Gurley rush to the right for 3 yards to the LA42. Tackled by Neville Hewitt.","(12:19) Matt Darr punts for 48 yards to LA42. Pharoh Cooper return for a loss of 3 yards to LA39. Tackled by Michael Thomas.","(12:55) Ryan Tannehill sacked at Mia10 for a loss of 7 yards by Lamarcus Joyner.","(13:39) Ryan Tannehill pass to the left to Kenny Stills for 3 yards to the Mia17. Tackled by Maurice Alexander.","(14:21) Jay Ajayi rush up the middle for 2 yards to the Mia14. Tackled by Mark Barron and Josh Forrest.","(14:27) Johnny Hekker punts for 61 yards to Mia11. Jarvis Landry return for 1 yard to Mia12. Tackled by Bradley Marquez.","(14:49) Los Angeles Rams timeout.","(14:49) Jared Goff pass to the right to Brian Quick for 9 yards to the LA28. Tackled by Isa Abdul-Quddus.","(14:53) Jared Goff incomplete pass to the right intended for Tyler Higbee.","(15:00) Jared Goff incomplete pass to the left intended for Kenny Britt defensed by Byron Maxwell.","(0:26) Todd Gurley rush up the middle for 18 yards to the LA19. Tackled by Bacarri Rambo.","(1:08) Todd Gurley rush to the right for a loss of 1 yard to the LA1. Tackled by Jason Jones and Ndamukong Suh.","(1:18) Matt Darr punts for 39 yards to LA2. No return.","(1:26) Penalty: Delay of Game on Miami (Ryan Tannehill) -5 yards.","(2:23) Ryan Tannehill pass to the right to Jarvis Landry for a loss of 3 yards to the LA36. Tackled by Trumaine Johnson.","(3:08) Ryan Tannehill pass to the left to Jay Ajayi for a loss of 2 yards to the LA33. Tackled by Alec Ogletree.","(3:47) Kenyan Drake rush up the middle for 2 yards to the LA31. Tackled by Dominique Easley and Mark Barron.","(3:52) Penalty: Holding on Miami (Ja'Wuan James) -11 yards.","(4:43) Jay Ajayi rush to the left for 36 yards to the LA22. Tackled by Alec Ogletree.","(5:21) Ryan Tannehill pass to the left to DeVante Parker for 12 yards to the Mia42. Tackled by E.J. Gaines.","(5:55) Jay Ajayi rush to the left for no gain to the Mia30. Tackled by Cam Thomas.","(6:03) Johnny Hekker punts for 40 yards to Mia30. No return.","(6:08) Jared Goff incomplete pass to the right intended for Brian Quick.","(6:48) Jared Goff pass to the left to Brian Quick for 6 yards to the LA30. Tackled by Tony Lippett.","(7:28) Todd Gurley rush to the right for a loss of 3 yards to the LA24. Tackled by Jordan Phillips.","(7:45) Matt Darr punts for 46 yards to LA20. Tavon Austin return for 7 yards to LA27. Tackled by Damien Williams.","(8:25) Ryan Tannehill pass to the middle to Jarvis Landry for 4 yards to the Mia34. Tackled by Lamarcus Joyner.","(9:10) Jay Ajayi rush to the right for 1 yard to the Mia30. Tackled by T.J. McDonald.","(9:47) Jay Ajayi rush to the right for 4 yards to the Mia29. Tackled by Alec Ogletree.","(9:47) Greg Zuerlein kicks off to the endzone. Touchback.","(9:47) Greg Zuerlein extra point is good.","(9:54) Todd Gurley rush to the right for 24 yards for a TOUCHDOWN.","(10:35) Jared Goff pass to the right to Kenny Britt for 19 yards to the Mia24. Tackled by Byron Maxwell.","(11:16) Jared Goff pass to the right to Tyler Higbee for 3 yards to the Mia43. Tackled by Isa Abdul-Quddus.","(11:42) Tavon Austin rush to the right for 7 yards to the LA39. Tackled by Kiko Alonso. Penalty: Face Mask on Miami (Kiko Alonso) 15 yards.","(11:54) Matt Darr punts for 54 yards to LA20. Tavon Austin return for 12 yards to LA32. Tackled by Michael Thomas.","(11:59) Ryan Tannehill incomplete pass to the right intended for Damien Williams.","(12:45) Ryan Tannehill pass to the middle to Kenny Stills for 8 yards to the Mia26. Tackled by Alec Ogletree.","(13:11) Penalty: Pass Interference on Miami (DeVante Parker) -10 yards.","(13:51) Ryan Tannehill pass to the left to Dion Sims for 9 yards to the Mia28. Tackled by Mark Barron.","(13:57) Johnny Hekker punts for 46 yards to Mia19. No return.","(14:09) Jared Goff incomplete pass to the right.","(14:50) Todd Gurley rush up the middle for 2 yards to the LA35. Tackled by Cameron Wake.","(14:54) Jared Goff incomplete pass to the right intended for Lance Kendricks defensed by Ndamukong Suh.","(14:54) Penalty: False Start on Los Angeles (Lance Kendricks) -5 yards.","(15:00) Andrew Franks kicks off to the LA-4. Benny Cunningham return for 42 yards to LA38. Tackled by Andrew Franks."]