["(0:34) Tom Brady rush up the middle for a loss of 1 yard to the SF4.","(1:23) LeGarrette Blount rush to the right for a loss of 1 yard to the SF3. Tackled by Nick Bellore and Jaquiski Tartt.","(1:23) San Francisco 49ers timeout.","(1:28) LeGarrette Blount rush up the middle for 1 yard to the SF2. Tackled by Gerald Hodges Jr..","(1:34) LeGarrette Blount rush to the right for 1 yard to the SF6. Tackled by Tony Jerod-Eddie and Gerald Hodges Jr.. Penalty: Unnecessary Roughness on San Francisco (Eli Harold) 3 yards.","(1:34) San Francisco 49ers timeout.","(1:40) LeGarrette Blount rush to the right for 11 yards to the SF7. Tackled by Eric Reid.","(1:40) San Francisco 49ers timeout.","(1:51) LeGarrette Blount rush to the right for 18 yards to the SF18. Tackled by Glenn Dorsey.","(1:55) Two Minute Warning. Penalty: Offside on San Francisco (Eli Harold) 5 yards.","(2:01) LeGarrette Blount rush up the middle for 7 yards to the SF41. Tackled by Tank Carradine.","(2:06) Phil Dawson onside kickoff to the SF50. Danny Amendola return for 2 yards to SF48. Tackled by Rod Streater.","(2:06) Phil Dawson extra point is good.","(2:10) Colin Kaepernick pass to the right to Shaun Draughn for 13 yards for a TOUCHDOWN.","(2:10) New England Patriots timeout.","(2:35) Colin Kaepernick pass to the right to Garrett Celek for 11 yards to the NE13. Tackled by Patrick Chung and Shea McClellin.","(3:14) Colin Kaepernick pass to the right to Carlos Hyde for 3 yards to the NE24. Tackled by Logan Ryan and Patrick Chung.","(3:21) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(3:51) Colin Kaepernick pass to the middle to Chris Harper for 16 yards to the NE27. Tackled by Malcolm Butler.","(3:56) Colin Kaepernick incomplete pass to the middle intended for Rod Streater.","(3:59) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(4:25) Carlos Hyde rush to the right for 4 yards to the NE43. Tackled by Dont'a Hightower and Kyle Van Noy.","(5:03) Colin Kaepernick pass to the left to Carlos Hyde for 9 yards to the NE47. Tackled by Devin McCourty.","(5:35) Colin Kaepernick rush up the middle for 14 yards to the SF44. Tackled by Eric Rowe.","(6:03) Colin Kaepernick pass to the middle to Quinton Patton for 10 yards to the SF30. Tackled by Devin McCourty.","(6:11) Penalty: False Start on San Francisco (Trenton Brown) -5 yards.","(6:11) Colin Kaepernick incomplete pass to the middle intended for Jeremy Kerley defensed by Alan Branch.","(6:11) Stephen Gostkowski kicks off to the endzone. Touchback.","(6:16) Stephen Gostkowski 38 yard field goal attempt is GOOD. Holder: Ryan Allen.","(6:52) Tom Brady pass to the right to Danny Amendola for a loss of 3 yards to the SF20. Tackled by Tramaine Brock.","(6:57) Tom Brady incomplete pass to the right intended for Julian Edelman.","(7:01) Tom Brady incomplete pass to the left intended for Malcolm Mitchell.","(7:39) Julian Edelman rush to the left for 7 yards to the SF17. Tackled by Jimmie Ward.","(8:14) Julian Edelman rush to the left for 5 yards to the SF24. Tackled by Eric Reid.","(8:44) LeGarrette Blount rush to the left for 20 yards to the SF29. Tackled by Jimmie Ward.","(9:15) Tom Brady pass to the left to Julian Edelman for 21 yards to the SF49. Tackled by Eric Reid.","(9:22) Bradley Pinion punts for 44 yards to NE30. No return.","(9:27) Colin Kaepernick incomplete pass to the right intended for Quinton Patton defensed by Logan Ryan.","(9:33) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley.","(10:06) Carlos Hyde rush up the middle for 1 yard to the SF26. Tackled by Trey Flowers and Kyle Van Noy.","(10:06) Stephen Gostkowski kicks off to the endzone. Touchback.","(10:06) Stephen Gostkowski extra point is good.","(10:16) Tom Brady pass to the right to Malcolm Mitchell for 56 yards for a TOUCHDOWN.","(10:19) Tom Brady incomplete pass to the right intended for Martellus Bennett.","(10:55) LeGarrette Blount rush to the right for 2 yards to the NE44. Tackled by Tank Carradine.","(11:26) Penalty: Offside on San Francisco (Ahmad Brooks) 5 yards.","(11:53) Tom Brady pass to the right to James White for 7 yards to the NE37. Tackled by Ronald Blair.","(12:01) Tom Brady incomplete pass to the left intended for Julian Edelman defensed by Keith Reaser.","(12:08) Bradley Pinion punts for 43 yards to NE30. No return.","(12:13) Colin Kaepernick incomplete pass to the left intended for Vance McDonald.","(12:56) Colin Kaepernick rush to the right for a loss of 3 yards to the SF27. Tackled by Trey Flowers.","(13:02) Colin Kaepernick incomplete pass to the right intended for Vance McDonald.","(13:11) Ryan Allen punts for 48 yards to SF21. Jeremy Kerley return for 9 yards to SF30. Tackled by Jonathan Jones and Nate Ebner.","(13:16) Tom Brady incomplete pass to the right intended for Julian Edelman.","(13:21) Tom Brady incomplete pass to the left intended for Dion Lewis.","(13:57) LeGarrette Blount rush to the left for 1 yard to the NE31. Tackled by Eli Harold and DeForest Buckner.","(14:07) Bradley Pinion punts for 41 yards to NE30. Cyrus Jones - no return. Tackled by Shayne Skov.","(14:12) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley defensed by Eric Rowe.","(14:47) Carlos Hyde rush to the left for 4 yards to the SF29. Tackled by Alan Branch.","(14:55) Colin Kaepernick incomplete pass to the right intended for Aaron Burbridge.","(14:55) Stephen Gostkowski kicks off to the endzone. Touchback.","(14:55) Stephen Gostkowski extra point is good.","(15:00) Tom Brady pass to the left to Danny Amendola for 5 yards for a TOUCHDOWN.","(0:13) Dion Lewis rush up the middle for 4 yards to the SF5. Tackled by Nick Bellore.","(0:51) Tom Brady pass to the right to Julian Edelman for 13 yards to the SF9. Tackled by Nick Bellore.","(0:57) Tom Brady incomplete pass to the right intended for Danny Amendola.","(1:30) Tom Brady pass to the left to Malcolm Mitchell for 8 yards to the SF22. Tackled by Jimmie Ward.","(1:58) Tom Brady pass to the left to Martellus Bennett for 14 yards to the SF30. Tackled by Eric Reid.","(2:44) Tom Brady pass to the right to James White for 14 yards to the SF44.","(3:28) Tom Brady pass to the middle to Malcolm Mitchell for 21 yards to the NE42. Tackled by Antoine Bethea.","(3:35) Tom Brady incomplete pass to the left intended for Julian Edelman.","(4:16) Dion Lewis rush to the right for 1 yard to the NE21. Tackled by Tank Carradine and Keith Reaser.","(4:24) Bradley Pinion punts for 45 yards to NE0. Touchback.","(4:29) Colin Kaepernick incomplete pass to the right intended for Vance McDonald.","(5:10) Carlos Hyde rush up the middle for 1 yard to the NE45. Tackled by Chris Long and Devin McCourty.","(5:15)  FUMBLE, recovered by SF (Colin Kaepernick). Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley.","(5:51) Colin Kaepernick pass to the right to Vance McDonald for 24 yards to the NE46. Tackled by Duron Harmon.","(6:23) Carlos Hyde rush up the middle for 5 yards to the SF30. Tackled by Patrick Chung.","(6:57) Carlos Hyde rush up the middle for 5 yards to the SF25. Tackled by Alan Branch.","(7:07) Ryan Allen punts for 47 yards to SF0. Touchback.","(7:11) Tom Brady incomplete pass to the middle intended for Julian Edelman defensed by Jimmie Ward.","(7:14) Tom Brady incomplete pass to the left intended for Julian Edelman defensed by Nick Bellore.","(7:41) LeGarrette Blount rush up the middle for 3 yards to the SF47. Tackled by Quinton Dial.","(8:23) Penalty: Holding on San Francisco (Rashard Robinson) 5 yards. Penalty: Unsports. Conduct on San Francisco 15 yards.","(9:00) Dion Lewis rush up the middle for 1 yard to the NE30. Tackled by Ronald Blair.","(9:33) Tom Brady rush to the right for 3 yards to the NE29. Tackled by Nick Bellore.","(10:05) LeGarrette Blount rush to the left for no gain to the NE26. Tackled by Eli Harold.","(10:46) Tom Brady pass to the left to Dion Lewis for 8 yards to the NE26. Tackled by Quinton Dial.","(10:58) Bradley Pinion punts for 49 yards to NE12. Danny Amendola return for 16 yards to NE28. Tackled by Shayne Skov. Penalty: Illegal Block on New England (Nate Ebner) -10 yards.","(11:02) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley defensed by Logan Ryan.","(11:41) Colin Kaepernick rush to the right for 4 yards to the SF39. Tackled by Devin McCourty.","(12:23) Colin Kaepernick pass to the right to Vance McDonald for 4 yards to the SF35. Tackled by Dont'a Hightower.","(12:58) Carlos Hyde rush to the right for 2 yards to the SF31. Tackled by Dont'a Hightower.","(13:28) Carlos Hyde rush up the middle for 9 yards to the SF29. Tackled by Patrick Chung.","(13:35) Ryan Allen punts for 50 yards to SF20. Jeremy Kerley - no return. FUMBLE, recovered by SF.","(14:13) Tom Brady pass to the left to James White for 8 yards to the NE30. Tackled by Keith Reaser.","(14:21) Tom Brady incomplete pass to the left intended for Julian Edelman.","(14:46) LeGarrette Blount rush to the left for no gain to the NE22. Tackled by Nick Bellore.","(15:00) Phil Dawson kicks off to the NE2. Cyrus Jones return for 20 yards to NE22. Tackled by Michael Wilhoite.","(0:01) Tom Brady pass to the left to James White for 25 yards to the SF16. Tackled by Rashard Robinson.","(0:02) Tom Brady incomplete pass to the middle.","(0:13) Tom Brady pass to the middle to Julian Edelman for 4 yards to the SF41. Tackled by Nick Bellore.","(0:13) New England Patriots timeout.","(0:21) Tom Brady rush up the middle for 3 yards to the SF45. Tackled by DeForest Buckner and Eli Harold.","(0:27) Dion Lewis rush to the left for 12 yards to the SF48. Tackled by Antoine Bethea.","(0:27) San Francisco 49ers timeout.","(0:48) Tom Brady pass to the left to James White for no gain to the NE40. Tackled by Eric Reid.","(1:11) LeGarrette Blount rush up the middle for 1 yard to the NE40. Tackled by Ahmad Brooks.","(1:43) LeGarrette Blount rush up the middle for 7 yards to the NE39. Tackled by Tramaine Brock.","(1:53) Bradley Pinion punts for 31 yards to NE24. Danny Amendola - no return. FUMBLE, recovered by NE (Danny Amendola). Penalty: Offside on San Francisco (Ahmad Brooks) 5 yards.","(2:00) Two Minute Warning.","(2:29) Colin Kaepernick pass to the left to Shaun Draughn for 4 yards to the SF45. Tackled by Patrick Chung.","(3:20) Colin Kaepernick sacked at SF40 for no gain by Rob Ninkovich. FUMBLE, recovered by SF (Trenton Brown).","(4:00) Carlos Hyde rush to the left for 1 yard to the SF40. Tackled by Vincent Valentine.","(4:07) Ryan Allen punts for 33 yards to SF39. No return.","(4:43) Tom Brady sacked at NE28 for a loss of 7 yards by Ahmad Brooks.","(4:46) Tom Brady incomplete pass to the right intended for Julian Edelman.","(4:46) Penalty: False Start on New England (Nate Solder) -5 yards.","(4:48) Tom Brady incomplete pass to the right intended for Julian Edelman.","(4:56) Phil Dawson kicks off to the NE11. James Develin return for 14 yards to NE25. Tackled by JaCorey Shepherd and Blake Bell. Penalty: Illegal Block on San Francisco (Rod Streater) 15 yards.","(4:56) Phil Dawson extra point is good.","(5:03) Colin Kaepernick pass to the right to Vance McDonald for 18 yards for a TOUCHDOWN.","(5:13) Penalty: Holding on New England (Logan Ryan) 5 yards.","(5:46) Carlos Hyde rush to the right for 1 yard to the NE23. Tackled by Trey Flowers and Alan Branch.","(5:46) New England Patriots timeout.","(6:20) Colin Kaepernick pass to the left to Garrett Celek for 19 yards to the NE24. Tackled by Shea McClellin.","(6:56) Colin Kaepernick rush up the middle for 17 yards to the NE43. Tackled by Devin McCourty.","(7:30) Colin Kaepernick pass to the left to Carlos Hyde for 12 yards to the SF40. Tackled by Logan Ryan.","(7:59) Carlos Hyde rush up the middle for 6 yards to the SF28. Tackled by Patrick Chung.","(8:38) Colin Kaepernick pass to the left to Quinton Patton for 7 yards to the SF22. Tackled by Eric Rowe.","(9:13) Carlos Hyde rush up the middle for 7 yards to the SF15. Tackled by Malcom Brown.","(9:21) Ryan Allen punts for 38 yards to SF8. No return.","(9:27) Tom Brady pass to the left to Julian Edelman for 9 yards to the SF46. Tackled by Nick Bellore.","(9:31) Tom Brady incomplete pass to the right. Penalty: Intentional Grounding on New England (Tom Brady) -10 yards.","(9:38) Penalty: Holding on New England (Nate Solder) -10 yards.","(9:48) Penalty: Offside on San Francisco (Jimmie Ward) 5 yards.","(10:26) LeGarrette Blount rush to the right for 4 yards to the SF40. Tackled by Antoine Bethea.","(11:01) Tom Brady pass to the left to Malcolm Mitchell for 13 yards to the SF44. Tackled by Jimmie Ward.","(11:44) Tom Brady pass to the right to Dion Lewis for 9 yards to the NE43. Tackled by DeForest Buckner.","(12:18) Dion Lewis rush to the left for 5 yards to the NE34. Tackled by Michael Wilhoite and Ronald Blair.","(12:26) Bradley Pinion punts for 37 yards to NE29. No return.","(12:55) Colin Kaepernick sacked at SF34 for a loss of 8 yards by Kyle Van Noy.","(13:34) DuJuan Harris rush to the left for 2 yards to the SF42. Tackled by Chris Long and Elandon Roberts.","(13:40) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(14:06) Carlos Hyde rush up the middle for 12 yards to the SF40. Tackled by Duron Harmon.","(14:43) Colin Kaepernick pass to the left to Garrett Celek for 11 yards to the SF28. Tackled by Patrick Chung.","(14:53) Stephen Gostkowski kicks off to the SF7. JaCorey Shepherd return for 10 yards to SF17. Tackled by Patrick Chung.","(14:53) Stephen Gostkowski extra point is good.","(15:00) Tom Brady pass to the left to James White for 9 yards for a TOUCHDOWN.","(0:15) LeGarrette Blount rush to the left for 2 yards to the SF9. Tackled by Glenn Dorsey.","(0:43) Tom Brady pass to the right to Julian Edelman for 6 yards to the SF11. Tackled by Jimmie Ward.","(1:17) LeGarrette Blount rush to the left for 3 yards to the SF17. Tackled by Eli Harold.","(1:45) Tom Brady pass to the right to Julian Edelman for 13 yards to the SF20. Tackled by Eric Reid.","(2:36) LeGarrette Blount rush up the middle for 44 yards to the SF33. Tackled by Antoine Bethea.","(2:41) Phil Dawson kicks off to the NE10. Cyrus Jones return for 13 yards to NE23. Tackled by Michael Wilhoite.","(2:45) Phil Dawson 33 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(3:30) Colin Kaepernick sacked at NE15 for a loss of 9 yards by Dont'a Hightower. FUMBLE, recovered by SF (Colin Kaepernick).","(4:15) DuJuan Harris rush to the left for 1 yard to the NE6. Tackled by Devin McCourty.","(4:56) Carlos Hyde rush to the left for a loss of 4 yards to the NE7. Tackled by Vincent Valentine.","(5:38) Carlos Hyde rush to the right for 13 yards to the NE3. Tackled by Duron Harmon.","(6:09) Carlos Hyde rush to the right for 11 yards to the NE16. Tackled by Duron Harmon. FUMBLE, recovered by SF (Carlos Hyde).","(6:48) Colin Kaepernick pass to the right to Shaun Draughn for 26 yards to the NE27. Tackled by Dont'a Hightower.","(7:19) DuJuan Harris rush up the middle for no gain to the SF47. Tackled by Logan Ryan.","(8:01) DuJuan Harris rush to the left for 1 yard to the SF47. Tackled by Dont'a Hightower.","(8:39) Colin Kaepernick pass to the left to Chris Harper for 19 yards to the SF46. Tackled by Duron Harmon.","(9:12) Carlos Hyde rush to the left for 1 yard to the SF27. Tackled by Rob Ninkovich.","(9:35) Penalty: False Start on San Francisco (Daniel Kilgore) -5 yards.","(10:10) Carlos Hyde rush to the left for 6 yards to the SF31. Tackled by Trey Flowers and Shea McClellin.","(10:10) Stephen Gostkowski kicks off to the endzone. Touchback.","(10:10) Stephen Gostkowski extra point is NO GOOD.","(10:16) Tom Brady pass to the right to Julian Edelman for 4 yards for a TOUCHDOWN.","(11:03) Tom Brady rush up the middle for 7 yards to the SF4. Tackled by Eric Reid.","(11:43) LeGarrette Blount rush to the right for no gain to the SF11. Tackled by Glenn Dorsey.","(11:43) New England Patriots timeout.","(12:23) Tom Brady pass to the left to Dion Lewis for 9 yards to the SF11. Tackled by Jaquiski Tartt.","(12:59) Tom Brady pass to the left to Julian Edelman for 7 yards to the SF20. Tackled by DeForest Buckner.","(13:03) Tom Brady incomplete pass to the right intended for Dion Lewis defensed by Quinton Dial.","(13:20) Bradley Pinion punts for 43 yards to NE43. Danny Amendola return for 30 yards to SF27. Tackled by Blake Bell.","(13:50) Colin Kaepernick sacked at SF14 for a loss of 12 yards by Patrick Chung.","(14:22) Carlos Hyde rush to the left for 1 yard to the SF26. Tackled by Shea McClellin.","(15:00) Colin Kaepernick sacked at SF25 for no gain by Malcolm Butler.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback."]