["(0:32) Derek Carr rush up the middle for a loss of 1 yard to the Jax29.","(1:06) Derek Carr rush up the middle for a loss of 1 yard to the Jax28.","(1:20) Blake Bortles pass intended for Allen Robinson INTERCEPTED by Reggie Nelson and returned for 40 yards. Tackled by Marqise Lee.","(1:25) Blake Bortles incomplete pass to the right intended for Chris Ivory.","(1:29) Penalty: Pass Interference on Oakland (Malcolm Smith) 17 yards.","(1:59) Blake Bortles pass to the left to Chris Ivory for no gain to the Jax33. Tackled by Malcolm Smith.","(1:59) Two Minute Warning.","(2:08) Penalty: Holding on Jacksonville (Kelvin Beachum) -10 yards.","(2:35) Blake Bortles pass to the right to Marqise Lee for 18 yards to the Jax43. Tackled by Karl Joseph.","(2:35) Sebastian Janikowski kicks off to the endzone. Touchback.","(2:35) Sebastian Janikowski extra point is good. Penalty: Offside on Jacksonville (Peyton Thompson) 5 yards.","(2:39) Latavius Murray rush up the middle for 9 yards for a TOUCHDOWN.","(2:45) Derek Carr pass to the right to Amari Cooper for 18 yards to the Jax9. Tackled by Davon House.","(3:30) Latavius Murray rush up the middle for 4 yards to the Jax27. Tackled by Tashaun Gipson.","(3:30) Jacksonville Jaguars timeout.","(3:35) Latavius Murray rush up the middle for 4 yards to the Jax31. Tackled by Johnathan Cyprien.","(3:49)  FUMBLE, recovered by Oak (Marquette King). Marquette King rush to the right for 27 yards to the Jax35.","(3:49) Derek Carr pass to the left to Seth Roberts for 3 yards to the Jax47. Tackled by Davon House. Penalty: Unnecessary Roughness on Oakland (Donald Penn) -15 yards.","(3:49) Penalty: False Start on Oakland (Rodney Hudson) -5 yards.","(3:49) Oakland Raiders timeout.","(3:49) Jacksonville Jaguars timeout.","(3:54) Latavius Murray rush up the middle for 1 yard to the Jax45. Tackled by Abry Jones.","(3:54) Jacksonville Jaguars timeout.","(4:12) Latavius Murray rush up the middle for 2 yards to the Jax46. Tackled by Dan Skuta.","(4:12) Jason Myers onside kickoff to the Jax48. No return.","(4:12) Oakland Raiders timeout.","(4:12) Jason Myers extra point is good.","(4:17) Blake Bortles pass to the middle to Julius Thomas for 9 yards for a TOUCHDOWN.","(4:21) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Denico Autry.","(4:57) Blake Bortles pass to the middle to Arrelious Benn for 39 yards to the Oak9. Tackled by Karl Joseph.","(5:03) Penalty: False Start on Jacksonville (Kelvin Beachum) -5 yards.","(5:03) Penalty: Holding on Jacksonville (Kelvin Beachum) -10 yards.","(5:05) Blake Bortles incomplete pass to the right intended for Allen Hurns.","(5:35) Blake Bortles pass to the middle to Marqise Lee for 21 yards to the Oak33.","(5:39) Blake Bortles incomplete pass to the right intended for T.J. Yeldon.","(5:42) Blake Bortles incomplete pass to the left intended for Arrelious Benn defensed by Sean Smith.","(6:08) Blake Bortles pass to the left to Marqise Lee for 9 yards to the Jax46. Tackled by Malcolm Smith.","(6:41) Blake Bortles pass to the right to Allen Hurns for 7 yards to the Jax37. Tackled by David Amerson.","(6:47) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(7:15) Blake Bortles pass to the middle to Allen Hurns for 13 yards to the Jax30. Tackled by DJ Hayden.","(7:26) Marquette King punts for 56 yards to Jax11. Rashad Greene Sr. return for 6 yards to Jax17. Tackled by Johnny Holton.","(8:01) Derek Carr pass to the right to Latavius Murray for a loss of 2 yards to the Oak33. Tackled by Telvin Smith.","(8:39) Latavius Murray rush up the middle for a loss of 4 yards to the Oak35. Tackled by Paul Posluszny.","(9:21) Latavius Murray rush up the middle for 7 yards to the Oak39. Tackled by Jalen Ramsey.","(9:33) Brad Nortman punts for 44 yards to Oak16. Jalen Richard return for 16 yards to Oak32. Tackled by Jarrod Wilson.","(9:38) Blake Bortles incomplete pass to the left intended for Allen Hurns.","(10:09) Blake Bortles pass to the left to Allen Robinson for 4 yards to the Jax40. Tackled by DJ Hayden.","(10:29) Blake Bortles incomplete pass to the left intended for Marcedes Lewis defensed by Malcolm Smith.","(11:00) Blake Bortles pass to the middle to Marcedes Lewis for 11 yards to the Jax36. Tackled by Malcolm Smith.","(11:27) Blake Bortles pass to the left to Marqise Lee for 12 yards to the Jax25. Tackled by Sean Smith.","(11:33) Sebastian Janikowski kicks off to the Jax3. Marqise Lee return for 10 yards to Jax13. Tackled by Andre Holmes.","(11:33) Sebastian Janikowski 52 yard field goal attempt is GOOD. Holder: Marquette King. Penalty: Disqualification on Jacksonville (Malik Jackson) 15 yards.","(12:19) Derek Carr pass to the left to Michael Crabtree for 6 yards to the Jax34. Tackled by Tashaun Gipson.","(13:06) Jalen Richard rush to the right for 1 yard to the Jax40. Tackled by Tyson Alualu.","(13:50) Derek Carr pass to the right to Amari Cooper for 1 yard to the Jax41. Tackled by Dante Fowler Jr..","(14:16) Derek Carr pass to the left to Seth Roberts for 10 yards to the Oak38. Tackled by Yannick Ngakoue. Penalty: Roughing Passer on Jacksonville (Malik Jackson) 15 yards. Penalty: Unsports. Conduct on Jacksonville (Malik Jackson) 5 yards.","(15:00) Derek Carr pass to the left to Jalen Richard for no gain to the Oak28. Tackled by Dante Fowler Jr..","(0:17) Latavius Murray rush up the middle for no gain to the Oak28. Tackled by Myles Jack.","(0:33) Penalty: Holding on Oakland (Shilique Calhoun) -10 yards.","(1:10) Blake Bortles pass to the left to Rashad Greene Sr. for 5 yards to the Jax20. Tackled by Malcolm Smith.","(1:48) T.J. Yeldon rush up the middle for 2 yards to the Jax30. Tackled by Khalil Mack. Penalty: Unsports. Conduct on Jacksonville (Marqise Lee) -15 yards.","(2:28) Blake Bortles pass to the middle to Chris Ivory for 3 yards to the Jax28. Tackled by Darius Latham.","(2:28) Sebastian Janikowski kicks off to the endzone. Touchback.","(2:31) Sebastian Janikowski 44 yard field goal attempt is GOOD. Holder: Marquette King.","(3:10) Derek Carr pass to the left to Andre Holmes for 5 yards to the Jax25. Tackled by Prince Amukamara.","(3:14) Derek Carr incomplete pass to the left intended for DeAndre Washington.","(4:02) Johnny Holton rush to the left for a loss of 4 yards to the Jax30. Tackled by Telvin Smith.","(4:45) DeAndre Washington rush up the middle for 6 yards to the Jax26. Tackled by Tyson Alualu.","(4:45) Penalty: Offside on Jacksonville (Jared Odrick) 5 yards.","(4:55) Brad Nortman punts for 42 yards to Jax47. Jalen Richard return for 10 yards to Jax37. Tackled by Jarrod Wilson and Peyton Thompson.","(5:27) Blake Bortles sacked at Jax5 for a loss of 7 yards by Khalil Mack.","(5:56) Blake Bortles pass to the right to T.J. Yeldon for 4 yards to the Jax12.","(6:37) T.J. Yeldon rush up the middle for 2 yards to the Jax8. Tackled by Dan Williams.","(6:54) Marquette King punts for 60 yards to Jax13. Rashad Greene Sr. - no return. Tackled by Johnny Holton. Penalty: Holding on Jacksonville (Jalen Ramsey) -7 yards.","(6:54) Penalty: False Start on Oakland (Shilique Calhoun) -5 yards.","(6:58) Derek Carr incomplete pass to the left intended for Seth Roberts.","(7:27) Penalty: Holding on Oakland (Kelechi Osemele) -10 yards.","(8:01) Derek Carr rush to the right for 1 yard to the Oak42.","(8:07) Derek Carr incomplete pass to the right intended for Seth Roberts defensed by Telvin Smith.","(8:19) Brad Nortman punts for 55 yards to Oak36. Jalen Richard return for 5 yards to Oak41. Tackled by Arthur Brown.","(8:35) Blake Bortles rush up the middle for 1 yard to the Jax9. Tackled by DJ Hayden.","(9:19) Blake Bortles pass to the left to Marqise Lee for 1 yard to the Jax8. Tackled by Karl Joseph.","(9:25) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by David Amerson.","(9:38) Marquette King punts for 60 yards to Jax1. Rashad Greene Sr. return for 6 yards to Jax7. Tackled by Johnny Holton.","(9:44) Derek Carr incomplete pass to the right intended for Seth Roberts.","(10:23) Latavius Murray rush to the left for a loss of 2 yards to the Oak39. Tackled by Abry Jones.","(11:02) Derek Carr rush to the left for 5 yards to the Oak41. Tackled by Paul Posluszny.","(11:44) Latavius Murray rush up the middle for 5 yards to the Oak36. Tackled by Johnathan Cyprien.","(12:11) Derek Carr pass to the right to Amari Cooper for 6 yards to the Oak31. Tackled by Johnathan Cyprien.","(12:11) Jason Myers kicks off to the endzone. Touchback.","(12:15) Jason Myers 44 yard field goal attempt is GOOD. Holder: Brad Nortman.","(12:20) Blake Bortles incomplete pass to the left intended for Chris Ivory.","(12:56) Blake Bortles rush up the middle for 5 yards to the Oak26. Tackled by Malcolm Smith.","(13:25) Chris Ivory rush up the middle for 1 yard to the Oak31. Tackled by Darius Latham.","(13:50) Blake Bortles pass to the left to Allen Hurns for 3 yards to the Oak32. Tackled by Sean Smith.","(14:20) Blake Bortles pass to the right to Marqise Lee for 8 yards to the Oak35. Tackled by David Amerson.","(14:52) Blake Bortles pass to the right to Allen Hurns for 22 yards to the Oak43.","(15:00) Sebastian Janikowski kicks off to the Jax1. Marqise Lee return for 34 yards to Jax35. Tackled by Johnny Holton.","(0:04) Blake Bortles rush up the middle for a loss of 1 yard to the Jax26.","(0:11) Sebastian Janikowski kicks off to the Jax9. Marqise Lee return for 18 yards to Jax27. Tackled by Daren Bates.","(0:11) Sebastian Janikowski extra point is good.","(0:11) Derek Carr pass to the right to Michael Crabtree for 2 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Oakland (Michael Crabtree) -15 yards.","(0:25) Derek Carr incomplete pass to the right intended for Amari Cooper.","(0:25) Derek Carr incomplete pass to the left intended for Seth Roberts.","(0:25) Oakland Raiders timeout.","(0:39) Derek Carr pass to the right to Michael Crabtree for 56 yards to the Jax2. Tackled by Prince Amukamara.","(1:08) Derek Carr pass to the left to Clive Walford for 5 yards to the Oak42. Tackled by Paul Posluszny.","(1:12) Derek Carr incomplete pass to the right intended for Latavius Murray.","(1:41) Derek Carr pass to the middle to Latavius Murray for 6 yards to the Oak37. Tackled by Paul Posluszny.","(1:49) Derek Carr pass to the right to Michael Crabtree for 6 yards to the Oak31. Tackled by Aaron Colvin.","(1:49) Jason Myers kicks off to the endzone. Touchback.","(1:52) Jason Myers 37 yard field goal attempt is GOOD. Holder: Brad Nortman.","(2:00) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(2:00) Two Minute Warning.","(2:34) Penalty: Holding on Jacksonville (Patrick Omameh) -10 yards.","(3:11) Blake Bortles pass to the right to Julius Thomas for 4 yards to the Oak9.","(3:41) T.J. Yeldon rush up the middle for 2 yards to the Oak13. Tackled by Malcolm Smith.","(4:16) Blake Bortles pass to the left to Marqise Lee for 38 yards to the Oak15. Tackled by DJ Hayden.","(4:16) Oakland Raiders timeout.","(4:50) Blake Bortles pass to the left to Julius Thomas for 7 yards to the Jax47. Tackled by Shilique Calhoun.","(4:55) Blake Bortles incomplete pass to the left intended for Marcedes Lewis defensed by Malcolm Smith.","(5:25) T.J. Yeldon rush to the right for 15 yards to the Jax40. Tackled by David Amerson.","(5:32) Blake Bortles incomplete pass to the left intended for Julius Thomas.","(5:32) Sebastian Janikowski kicks off to the endzone. Touchback.","(5:32) Sebastian Janikowski extra point is good.","(5:37) Latavius Murray rush to the left for 2 yards for a TOUCHDOWN.","(6:15) Jamize Olawale rush up the middle for 3 yards to the Jax2. Tackled by Paul Posluszny.","(6:58) Derek Carr pass to the right to Michael Crabtree for 6 yards to the Jax5. Tackled by Prince Amukamara.","(7:47) Latavius Murray rush up the middle for 1 yard to the Jax11. Tackled by Paul Posluszny.","(8:31) Latavius Murray rush up the middle for 6 yards to the Jax12. Tackled by Aaron Colvin.","(9:15) Jamize Olawale rush up the middle for 6 yards to the Jax18. Tackled by Johnathan Cyprien.","(9:57) DeAndre Washington rush up the middle for 1 yard to the Jax24. Tackled by Johnathan Cyprien.","(10:38) Derek Carr pass to the right to DeAndre Washington for 6 yards to the Jax25. Tackled by Abry Jones.","(11:21) Latavius Murray rush up the middle for 10 yards to the Jax31. Tackled by Prince Amukamara.","(12:00) DeAndre Washington rush up the middle for 5 yards to the Jax41. Tackled by Johnathan Cyprien.","(12:38) Johnny Holton rush to the left for 29 yards to the Jax46. Tackled by Johnathan Cyprien.","(12:38) Jason Myers kicks off to the endzone. Touchback.","(12:41) Jason Myers 23 yard field goal attempt is GOOD. Holder: Brad Nortman.","(13:21) Blake Bortles pass to the right to Allen Robinson for 5 yards to the Oak5. Tackled by David Amerson.","(13:25) Blake Bortles incomplete pass to the right intended for Julius Thomas.","(13:25) Oakland Raiders timeout.","(13:58) Chris Ivory rush up the middle for a loss of 2 yards to the Oak10. Tackled by Khalil Mack.","(14:41) Chris Ivory rush up the middle for 42 yards to the Oak8. Tackled by Reggie Nelson.","(14:46) Penalty: Pass Interference on Oakland (David Amerson) 25 yards.","(14:52) Sebastian Janikowski kicks off to the endzone. Touchback.","(14:52) Penalty: Holding on Oakland (Daren Bates) -5 yards.","(14:57) Sebastian Janikowski 32 yard field goal attempt is GOOD. Holder: Marquette King.","(15:00) Derek Carr incomplete pass to the left intended for Seth Roberts.","(0:02) Jamize Olawale rush up the middle for 3 yards to the Jax14. Tackled by Yannick Ngakoue.","(0:07) Derek Carr incomplete pass to the middle intended for Latavius Murray.","(0:17) Marquette King punts for 40 yards to Jax13. Rashad Greene Sr. - no return. FUMBLE, recovered by Oak (Andre Holmes). Tackled by Jarrod Wilson.","(0:22) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(1:39) Derek Carr pass to the right to Amari Cooper for 4 yards to the Oak47. Tackled by Jalen Ramsey.","(1:39) Latavius Murray rush up the middle for 1 yard to the Oak43. Tackled by Johnathan Cyprien.","(2:00) Penalty: Offside on Jacksonville (Dante Fowler Jr.) 5 yards.","(2:43) Latavius Murray rush up the middle for 5 yards to the Oak37. Tackled by Telvin Smith.","(3:18) Derek Carr pass to the left to Michael Crabtree for 6 yards to the Oak32. Tackled by Prince Amukamara.","(3:59) Latavius Murray rush up the middle for 3 yards to the Oak26. Tackled by Paul Posluszny and Telvin Smith.","(4:40) Derek Carr pass to the left to Michael Crabtree for 3 yards to the Oak23. Tackled by Prince Amukamara.","(4:46) Blake Bortles pass intended for Marqise Lee INTERCEPTED by David Amerson. No return. Touchback.","(4:46) Jacksonville Jaguars timeout.","(5:25) Blake Bortles pass to the left to Rashad Greene Sr. for 3 yards to the Oak18. Tackled by Sean Smith.","(5:32) Blake Bortles incomplete pass to the left intended for Allen Hurns.","(6:09) Blake Bortles rush to the left for 11 yards to the Oak21.","(6:14) Blake Bortles incomplete pass to the left intended for Julius Thomas.","(6:44) Blake Bortles rush to the left for 17 yards to the Oak37. Tackled by DJ Hayden. Penalty: Holding on Oakland (DJ Hayden) 5 yards.","(7:27) T.J. Yeldon rush up the middle for 1 yard to the Jax46. Tackled by Stacy McGee.","(8:05) Chris Ivory rush up the middle for 6 yards to the Jax45. Tackled by Bruce Irvin. FUMBLE, recovered by Jax (Chris Ivory).","(8:20) Penalty: Holding on Oakland (Malcolm Smith) 5 yards.","(9:00) Chris Ivory rush up the middle for 1 yard to the Jax34. Tackled by Sean Smith.","(9:06) Sebastian Janikowski kicks off to the Jax2. Marqise Lee return for 31 yards to Jax33. Tackled by Cory James and Nate Allen.","(9:08) Sebastian Janikowski 26 yard field goal attempt is GOOD. Holder: Marquette King.","(9:13) Derek Carr incomplete pass to the left intended for Clive Walford.","(9:18) Derek Carr incomplete pass to the left intended for Latavius Murray.","(9:46) Latavius Murray rush up the middle for 5 yards to the Jax7. Tackled by Johnathan Cyprien.","(10:09) Derek Carr pass to the right to Seth Roberts for 26 yards to the Jax12. Tackled by Johnathan Cyprien.","(10:26) Penalty: Offside on Jacksonville (Sen'Derrick Marks) 5 yards.","(11:06) Derek Carr pass to the right to Michael Crabtree for 11 yards to the Jax43. Tackled by Prince Amukamara.","(11:48) Derek Carr pass to the left to Seth Roberts for 3 yards to the Oak46. Tackled by Aaron Colvin.","(11:52) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(12:21) Derek Carr pass to the right to Mychal Rivera for 13 yards to the Oak43. Tackled by Paul Posluszny.","(12:34) Brad Nortman punts for 56 yards to Oak20. Jalen Richard return for 10 yards to Oak30. Tackled by Denard Robinson.","(12:40) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(13:21) T.J. Yeldon rush up the middle for 2 yards to the Jax24. Tackled by Perry Riley Jr..","(13:26) Blake Bortles incomplete pass to the right intended for Julius Thomas defensed by Karl Joseph.","(13:37) Marquette King punts for 57 yards to Jax14. Rashad Greene Sr. return for 8 yards to Jax22. Tackled by Nate Allen and Johnny Holton.","(13:43) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(14:24) DeAndre Washington rush to the left for a loss of 2 yards to the Oak29. Tackled by Telvin Smith.","(15:00) DeAndre Washington rush to the left for 6 yards to the Oak31. Tackled by Johnathan Cyprien.","(15:00) Jason Myers kicks off to the endzone. Touchback."]