["(0:02) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald defensed by Jeremy Lane.","(0:07) Carson Palmer pass to the right to Larry Fitzgerald for 19 yards to the Ari39. Tackled by Jeremy Lane.","(0:11) 28 yard field goal attempt by Steven Hauschka is NO GOOD. Holder: Jon Ryan.","(0:54) Christine Michael rush up the middle for a loss of 1 yard to the Ari10. Tackled by Kevin Minter.","(1:04) Russell Wilson pass to the right to Doug Baldwin for 27 yards to the Ari9. Tackled by Tony Jefferson.","(1:47) Alex Collins rush up the middle for 2 yards to the Ari36. Tackled by Kevin Minter.","(1:53) Christine Michael rush to the left for 5 yards to the Ari38. Tackled by Tyrann Mathieu.","(2:00) Russell Wilson pass to the left to Jermaine Kearse for 31 yards to the Ari43. Tackled by Marcus Cooper.","(2:00) Two Minute Warning.","(2:42) Russell Wilson pass to the left to Doug Baldwin for 6 yards to the Sea26. Tackled by Deone Bucannon.","(3:19) Christine Michael rush up the middle for no gain to the Sea20. Tackled by Josh Mauro.","(3:26) 24 yard field goal attempt by Chandler Catanzaro is NO GOOD. Holder: Ryan Quigley.","(3:26) Penalty: Delay of Game on Arizona (Ryan Quigley) -5 yards.","(4:13) David Johnson rush up the middle for no gain to the Sea1. Tackled by Bobby Wagner.","(4:22) David Johnson rush to the left for 4 yards to the Sea1. Tackled by Earl Thomas.","(4:22) Arizona Cardinals timeout.","(5:15) Carson Palmer pass to the middle to J.J. Nelson for 40 yards to the Sea5. Tackled by Kelcie McCray.","(5:21) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(6:02) David Johnson rush up the middle for 3 yards to the Sea45. Tackled by Ahtyba Rubin.","(6:42) Carson Palmer pass to the right to Ifeanyi Momah for 27 yards to the Sea48. Tackled by Bobby Wagner.","(6:42) Steven Hauschka kicks off to the endzone. Touchback.","(6:46) Steven Hauschka 36 yard field goal attempt is GOOD. Holder: Jon Ryan.","(6:52) Russell Wilson incomplete pass to the right intended for Jimmy Graham.","(7:34) Russell Wilson pass to the right to Tyler Lockett for 5 yards to the Ari18. Tackled by Deone Bucannon.","(8:14) Christine Michael rush up the middle for 1 yard to the Ari23. Tackled by Markus Golden.","(8:52) Russell Wilson pass to the middle to Jimmy Graham for 14 yards to the Ari24. Tackled by Deone Bucannon.","(9:30) Christine Michael rush to the left for 6 yards to the Ari38. Tackled by Deone Bucannon.","(10:03) Russell Wilson pass to the middle to Jimmy Graham for 8 yards to the Ari44. Tackled by Kevin Minter.","(10:46) Russell Wilson pass to the right to Jimmy Graham for 13 yards to the Sea48. Tackled by Tony Jefferson.","(11:23) Christine Michael rush to the right for 10 yards to the Sea35. Tackled by Deone Bucannon.","(11:23) Chandler Catanzaro kicks off to the endzone. Touchback.","(11:28) Chandler Catanzaro 45 yard field goal attempt is GOOD. Holder: Ryan Quigley.","(11:34) Carson Palmer incomplete pass to the left intended for Michael Floyd.","(11:39) Carson Palmer incomplete pass to the left intended for J.J. Nelson defensed by Deshawn Shead.","(11:39) Arizona Cardinals timeout.","(12:21) David Johnson rush to the left for 5 yards to the Sea27. Tackled by Jeremy Lane.","(12:59) Carson Palmer pass to the right to Michael Floyd for 18 yards to the Sea32. Tackled by Jeremy Lane.","(12:59) Seattle Seahawks timeout.","(13:03) Carson Palmer incomplete pass to the left intended for David Johnson.","(13:41) David Johnson rush up the middle for no gain to the Ari50. Tackled by Tony McDaniel.","(14:19) Carson Palmer pass to the left to J.J. Nelson for 20 yards to the Ari50. Tackled by Deshawn Shead.","(15:00) David Johnson rush up the middle for 5 yards to the Ari30. Tackled by Michael Bennett.","(15:00) Steven Hauschka kicks off to the endzone. Touchback.","(0:41) C.J. Prosise rush up the middle for no gain to the Sea28. Tackled by Chandler Jones.","(0:48) Penalty: Holding on Seattle (George Fant) -10 yards.","(0:55) Penalty: Holding on Seattle (Garry Gilliam) -10 yards.","(1:03) Russell Wilson pass to the left to Jermaine Kearse for 17 yards to the Sea48. Tackled by Marcus Cooper.","(1:09) Russell Wilson pass to the right to Tyler Lockett for 8 yards to the Sea31. Tackled by Marcus Cooper.","(1:16) Ryan Quigley punts for 31 yards to Sea23. Tyler Lockett - no return. Tackled by Justin Bethel.","(1:16) Seattle Seahawks timeout.","(1:28) David Johnson rush up the middle for no gain to the Ari46. Tackled by Bobby Wagner.","(1:34) Carson Palmer pass to the left to Michael Floyd for 10 yards to the Ari46.","(2:00) David Johnson rush up the middle for a loss of 2 yards to the Ari36. Tackled by Frank Clark.","(2:00) Two Minute Warning.","(2:29) Carson Palmer pass to the right to Michael Floyd for 16 yards to the Ari38. Tackled by Richard Sherman.","(3:13) Carson Palmer sacked at Ari22 for a loss of 8 yards by Cliff Avril.","(4:00) Carson Palmer pass to the right to Larry Fitzgerald for 5 yards to the Ari30. Tackled by Jeremy Lane.","(4:00) Steven Hauschka kicks off to the endzone. Touchback.","(4:05) Steven Hauschka 40 yard field goal attempt is GOOD. Holder: Jon Ryan.","(4:10) Russell Wilson pass to the left to Tanner McEvoy for 10 yards to the Ari22. Tackled by Patrick Peterson.","(4:16) Russell Wilson incomplete pass to the middle intended for Doug Baldwin defensed by D.J. Swearinger.","(4:22) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(4:33) Penalty: Holding on Seattle (Brandon Williams) -10 yards.","(4:44) Ryan Quigley punt blocked by Tanner McEvoy. Returned by Cassius Marsh to the Ari27. Tackled by Ifeanyi Momah. Penalty: Illegal Motion on Arizona (Justin Bethel) 5 yards.","(5:21) David Johnson rush up the middle for 14 yards to the Ari38. Tackled by Kelcie McCray.","(6:06) Carson Palmer sacked at Ari24 for a loss of 9 yards by Cliff Avril.","(6:29) Penalty: Holding on Arizona (Jermaine Gresham) -10 yards.","(7:11) David Johnson rush up the middle for 4 yards to the Ari43. Tackled by Deshawn Shead.","(7:23) Jon Ryan punts for 54 yards to Ari32. Brittan Golden return for 7 yards to Ari39. Tackled by Dewey McDonald.","(7:52) Russell Wilson pass to the middle to Doug Baldwin for 13 yards to the Sea14. Tackled by Marcus Cooper.","(8:40) Russell Wilson sacked at Sea1 for a loss of 20 yards by Chandler Jones. FUMBLE, recovered by Sea (Mark Glowinski).","(9:07) Christine Michael rush up the middle for 1 yard to the Sea21. Tackled by Calais Campbell.","(9:14) Ryan Quigley punts for 44 yards to Sea0. Touchback.","(9:19) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald defensed by Richard Sherman.","(9:25) Carson Palmer incomplete pass to the right intended for David Johnson defensed by Cliff Avril.","(10:02) Carson Palmer pass to the left to Larry Fitzgerald for 5 yards to the Sea44. Tackled by Brock Coyle.","(10:13) Jon Ryan punts for 34 yards to Sea49. No return.","(10:52) Russell Wilson pass to the middle to C.J. Prosise for 9 yards to the Sea15. Tackled by D.J. Swearinger.","(11:35) Russell Wilson pass to the right to Christine Michael for a loss of 5 yards to the Sea6. Tackled by Kevin Minter.","(11:43) Russell Wilson incomplete pass to the right intended for Doug Baldwin.","(11:51) Penalty: Holding on Seattle (Bradley Sowell) -10 yards.","(12:27) Christine Michael rush up the middle for 5 yards to the Sea21. Tackled by Chandler Jones.","(13:02) Russell Wilson pass to the right to Doug Baldwin for 9 yards to the Sea16. Tackled by Marcus Cooper.","(13:10) Ryan Quigley punts for 32 yards to Sea7. No return.","(13:14) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald defensed by Earl Thomas.","(13:39) David Johnson rush to the right for 8 yards to the Sea29. Tackled by Frank Clark. Penalty: Holding on Arizona (Michael Floyd) -10 yards.","(14:22) David Johnson rush up the middle for 3 yards to the Sea37. Tackled by Ahtyba Rubin.","(15:00) David Johnson rush up the middle for 5 yards to the Sea40. Tackled by Ahtyba Rubin.","(0:32) Carson Palmer pass to the left to J.J. Nelson for 24 yards to the Sea45. Tackled by Deshawn Shead.","(1:20) David Johnson rush to the left for 3 yards to the Ari31. Tackled by Bobby Wagner.","(2:08) David Johnson rush to the right for 3 yards to the Ari28. Tackled by Cliff Avril.","(2:46) David Johnson rush up the middle for 5 yards to the Ari25. Tackled by Bobby Wagner.","(2:57) Jon Ryan punts for 53 yards to Ari22. Brittan Golden return for a loss of 2 yards to Ari20. Tackled by DeAndre Elliott.","(3:17) Russell Wilson pass to the middle to Russell Wilson for a loss of 1 yard to the Sea25. Tackled by Markus Golden. FUMBLE, recovered by Sea (Russell Wilson).","(3:57) Christine Michael rush up the middle for 4 yards to the Sea26. Tackled by Marcus Cooper.","(4:28) Russell Wilson pass to the left to Jermaine Kearse for 3 yards to the Sea22. Tackled by Marcus Cooper.","(4:34) David Johnson rush up the middle for no gain to the Sea19. Tackled by K.J. Wright and Michael Bennett.","(4:34) Seattle Seahawks timeout.","(5:05) Carson Palmer pass to the middle to David Johnson for 6 yards to the Sea19. Tackled by K.J. Wright.","(5:48) David Johnson rush to the right for 2 yards to the Sea25. Tackled by K.J. Wright.","(6:26) Carson Palmer pass to the middle to Jermaine Gresham for 6 yards to the Sea27. Tackled by Ahtyba Rubin.","(6:41) Penalty: False Start on Arizona (Jermaine Gresham) -5 yards.","(7:08) Penalty: Unnecessary Roughness on Seattle (Jeremy Lane) 15 yards.","(7:50) Carson Palmer pass to the right to David Johnson for 8 yards to the Sea43. Tackled by Tony McDaniel.","(8:32) David Johnson rush up the middle for 5 yards to the Ari49. Tackled by Deshawn Shead.","(9:09) Carson Palmer pass to the left to Larry Fitzgerald for 8 yards to the Ari44. Tackled by Deshawn Shead.","(9:28) Penalty: Encroachment on Seattle (Frank Clark) 5 yards.","(10:10) David Johnson rush up the middle for 7 yards to the Ari31. Tackled by Michael Bennett.","(10:14) Carson Palmer incomplete pass to the right intended for David Johnson.","(10:21) Jon Ryan punts for 33 yards to Ari24. No return.","(10:56) Russell Wilson pass to the middle to C.J. Prosise for 8 yards to the Sea43. Tackled by D.J. Swearinger.","(11:40) Russell Wilson pass to the left to Christine Michael for 2 yards to the Sea35. Tackled by Deone Bucannon.","(12:40) Penalty: False Start on Seattle (Bradley Sowell) -5 yards.","(12:40) Christine Michael rush to the right for a loss of 1 yard to the Sea38. Tackled by Calais Campbell.","(13:06) Penalty: Pass Interference on Seattle (Jermaine Kearse) -10 yards.","(13:42) Russell Wilson pass to the right to Jimmy Graham for 14 yards to the Sea49. Tackled by D.J. Swearinger.","(14:22) Christine Michael rush up the middle for 3 yards to the Sea35. Tackled by Patrick Peterson.","(14:54) Christine Michael rush up the middle for 4 yards to the Sea32. Tackled by Deone Bucannon.","(15:00) Chandler Catanzaro kicks off to the Sea-8. Tyler Lockett return for 36 yards to Sea28. Tackled by Tony Jefferson.","(0:17) Carson Palmer sacked at Sea32 for a loss of 7 yards by Frank Clark. FUMBLE, recovered by Ari (Earl Watford).","(0:22) Carson Palmer incomplete pass to the right intended for J.J. Nelson.","(0:30) Carson Palmer pass to the left to Ifeanyi Momah for 23 yards to the Sea25. Tackled by Deshawn Shead.","(0:34) Carson Palmer incomplete pass to the left intended for Jermaine Gresham.","(0:34) Arizona Cardinals timeout.","(0:42) Carson Palmer pass to the right to Larry Fitzgerald for 9 yards to the Sea48. Tackled by Jeremy Lane.","(1:04) David Johnson rush up the middle for 2 yards to the Ari43. Tackled by K.J. Wright.","(1:12) Carson Palmer pass to the left to Jermaine Gresham for 9 yards to the Ari41. Tackled by Bobby Wagner.","(1:18) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(1:25) Penalty: Holding on Seattle (Richard Sherman) 5 yards.","(1:29) Carson Palmer pass to the right to David Johnson for 2 yards to the Ari27. Tackled by Bobby Wagner.","(1:40) Jon Ryan punts for 58 yards to Ari18. Brittan Golden return for 7 yards to Ari25. Tackled by Neiko Thorpe.","(1:45) Russell Wilson incomplete pass to the left intended for Jimmy Graham.","(1:52) Penalty: Holding on Seattle (Garry Gilliam) -10 yards.","(2:00) Russell Wilson pass to the right to Doug Baldwin for 5 yards to the Sea34. Tackled by Marcus Cooper and Tyrann Mathieu.","(2:00) Two Minute Warning.","(2:05) Russell Wilson incomplete pass to the left intended for Jimmy Graham defensed by Tony Jefferson.","(2:39) Christine Michael rush up the middle for 6 yards to the Sea29. Tackled by Deone Bucannon.","(3:06) Christine Michael rush to the left for 6 yards to the Sea23. Tackled by Kevin Minter.","(3:11) Chandler Catanzaro kicks off to the Sea2. Tyler Lockett return for 15 yards to Sea17. Tackled by Justin Bethel.","(3:16) Chandler Catanzaro 46 yard field goal attempt is GOOD. Holder: Ryan Quigley.","(3:54) Carson Palmer pass to the middle to Larry Fitzgerald for 3 yards to the Sea28. Tackled by Richard Sherman.","(3:59) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald defensed by K.J. Wright.","(4:06) Carson Palmer incomplete pass to the left intended for David Johnson defensed by Earl Thomas.","(4:51) David Johnson rush up the middle for 3 yards to the Sea31. Tackled by Ahtyba Rubin.","(5:33) David Johnson rush up the middle for 2 yards to the Sea34. Tackled by Bobby Wagner.","(6:17) Carson Palmer pass to the left to David Johnson for 6 yards to the Sea36. Tackled by K.J. Wright.","(6:53) Carson Palmer pass to the middle to David Johnson for 5 yards to the Sea42. Tackled by Kelcie McCray.","(6:53) Arizona Cardinals timeout.","(7:41) Andre Ellington rush to the left for 2 yards to the Sea47. Tackled by Bobby Wagner.","(8:22) Andre Ellington rush up the middle for 5 yards to the Sea49. Tackled by Sealver Siliga.","(9:23) Carson Palmer pass to the middle to David Johnson for 6 yards to the Ari46. Tackled by Frank Clark.","(10:04) J.J. Nelson rush to the left for 4 yards to the Ari40. Tackled by Bobby Wagner.","(10:43) David Johnson rush to the right for 2 yards to the Ari36. Tackled by Tony McDaniel and Bobby Wagner.","(11:27) Carson Palmer pass to the right to David Johnson for 15 yards to the Ari34. Tackled by K.J. Wright.","(11:35) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(11:48) Jon Ryan punts for 45 yards to Ari11. Brittan Golden return for 8 yards to Ari19. Tackled by DeAndre Elliott.","(11:54) Russell Wilson incomplete pass to the right intended for Paul Richardson.","(11:58) Russell Wilson incomplete pass to the right intended for Jimmy Graham.","(12:04) Russell Wilson incomplete pass to the right intended for Jimmy Graham.","(12:43) Russell Wilson pass to the right to Paul Richardson for 10 yards to the Sea44. Tackled by Deone Bucannon.","(13:20) Christine Michael rush up the middle for 3 yards to the Sea34. Tackled by Kevin Minter and Deone Bucannon.","(13:20) Arizona Cardinals timeout.","(13:25) Chandler Catanzaro 39 yard field goal attempt is BLOCKED by Bobby Wagner. Return blocked field goal by Bobby Wagner to the Sea31. Tackled by Ryan Quigley.","(13:31) Carson Palmer incomplete pass to the right intended for Andre Ellington defensed by Cliff Avril.","(13:37) Carson Palmer incomplete pass to the left intended for David Johnson.","(14:21) David Johnson rush to the left for a loss of 1 yard to the Sea21. Tackled by K.J. Wright.","(15:00) David Johnson rush to the right for 5 yards to the Sea20. Tackled by Richard Sherman.","(0:29) Carson Palmer rush up the middle for 8 yards to the Sea25. Tackled by K.J. Wright.","(0:40) Jon Ryan punts for 41 yards to Sea46. Patrick Peterson return for 13 yards to Sea33. Tackled by Kelcie McCray.","(0:48) Russell Wilson incomplete pass to the right intended for C.J. Prosise.","(1:33) Russell Wilson pass to the right to Jimmy Graham for 4 yards to the Sea5. Tackled by Deone Bucannon.","(2:14) Christine Michael rush up the middle for no gain to the Sea1. Tackled by Rodney Gunter.","(2:28) Ryan Quigley punts for 53 yards to Sea1. No return.","(3:01) Carson Palmer sacked at Ari46 for a loss of 7 yards by Frank Clark and Cliff Avril.","(3:44) David Johnson rush up the middle for 3 yards to the Sea47. Tackled by Deshawn Shead.","(3:51) Carson Palmer incomplete pass to the left intended for Michael Floyd.","(4:30) Carson Palmer pass to the middle to Michael Floyd for 13 yards to the Ari50. Tackled by Bobby Wagner.","(5:15) Carson Palmer pass to the right to Larry Fitzgerald for 4 yards to the Ari37. Tackled by Bobby Wagner.","(5:55) David Johnson rush to the left for 6 yards to the Ari33. Tackled by Deshawn Shead and Jeremy Lane.","(6:35) David Johnson rush to the right for no gain to the Ari27. Tackled by Cassius Marsh.","(7:14) David Johnson rush up the middle for 5 yards to the Ari27. Tackled by Kelcie McCray.","(7:59) David Johnson rush up the middle for 9 yards to the Ari22. Tackled by Kelcie McCray.","(8:07) Jon Ryan punts for 41 yards to Ari13. No return.","(8:10) Russell Wilson incomplete pass to the right intended for Nick Vannett.","(8:50) Russell Wilson pass to the right to Christine Michael for 6 yards to the Sea46. Tackled by Deone Bucannon.","(8:56) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(9:04) Ryan Quigley punts for 36 yards to Sea40. No return.","(9:09) Carson Palmer incomplete pass to the left intended for Brittan Golden.","(9:46) David Johnson rush up the middle for 3 yards to the Ari24. Tackled by Jarran Reed.","(9:53) Carson Palmer incomplete pass to the left intended for Jermaine Gresham.","(10:05) Jon Ryan punts for 55 yards to Ari21. Brittan Golden - no return. Tackled by Neiko Thorpe.","(10:40) Russell Wilson rush to the left for a loss of 2 yards to the Sea24. Tackled by Tony Jefferson.","(11:17) Russell Wilson pass to the left to Doug Baldwin for 9 yards to the Sea26. Tackled by Deone Bucannon and Kevin Minter.","(11:24) Russell Wilson incomplete pass to the right.","(11:36) Ryan Quigley punts for 33 yards to Sea17. No return.","(12:11) Carson Palmer pass to the left to Michael Floyd for 8 yards to the Ari50. Tackled by Jeremy Lane.","(12:46) Carson Palmer pass to the left to David Johnson for 10 yards to the Ari42. Tackled by K.J. Wright.","(13:06) Penalty: Pass Interference on Arizona (Michael Floyd) -10 yards.","(13:46) Carson Palmer pass to the left to Larry Fitzgerald for no gain to the Ari42. Tackled by K.J. Wright.","(14:22) Carson Palmer pass to the left to Larry Fitzgerald for 17 yards to the Ari42. Tackled by Earl Thomas and Kelcie McCray.","(15:00) David Johnson rush to the right for no gain to the Ari25. Tackled by Deshawn Shead.","(15:00) Steven Hauschka kicks off to the endzone. Touchback."]