["(0:03) Trevor Siemian rush up the middle for a loss of 1 yard to the Den44.","(0:09) Brock Osweiler pass to the right to Jaelen Strong for 2 yards to the Den45. Tackled by Chris Harris Jr..","(0:15) Brock Osweiler incomplete pass to the left intended for C.J. Fiedorowicz defensed by T.J. Ward.","(0:19) Brock Osweiler incomplete pass to the middle intended for Alfred Blue.","(0:41) Alfred Blue rush up the middle for 6 yards to the Den47. Tackled by Corey Nelson.","(0:49) Brock Osweiler pass to the right to DeAndre Hopkins for 12 yards to the Hou47.","(1:19) Brock Osweiler pass to the left to C.J. Fiedorowicz for 8 yards to the Hou35. Tackled by T.J. Ward and Jared Crick.","(1:22) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz defensed by Jared Crick.","(1:57) Brock Osweiler pass to the right to Lamar Miller for 2 yards to the Hou27. Tackled by Corey Nelson and Shane Ray.","(1:57) Brandon McManus kicks off to the endzone. Touchback.","(2:00) Brandon McManus 32 yard field goal attempt is GOOD. Holder: Riley Dixon.","(2:00) Two Minute Warning.","(2:25) Devontae Booker rush to the right for 2 yards to the Hou14. Tackled by Brandon Dunn.","(2:25) Houston Texans timeout.","(2:31) Devontae Booker rush to the right for 1 yard to the Hou16. FUMBLE, recovered by Den (Devontae Booker).","(3:13) Devontae Booker rush up the middle for 3 yards to the Hou17. Tackled by Brandon Dunn.","(3:13) Houston Texans timeout.","(3:20) C.J. Anderson rush to the left for 8 yards to the Hou20. Tackled by Benardrick McKinney.","(4:01) C.J. Anderson rush up the middle for 3 yards to the Hou28. Tackled by D.J. Reader and John Simon.","(4:40) C.J. Anderson rush up the middle for 3 yards to the Hou31. Tackled by Christian Covington.","(4:43) Brock Osweiler incomplete pass to the right intended for Ryan Griffin defensed by Derek Wolfe.","(4:43) Houston Texans timeout.","(4:51) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by Aqib Talib.","(4:55) Brock Osweiler incomplete pass to the middle intended for Ryan Griffin.","(5:02) Brock Osweiler pass to the right to Lamar Miller for no gain to the Hou34. Tackled by Aqib Talib.","(5:22) Brock Osweiler pass to the right to DeAndre Hopkins for 7 yards to the Hou34.","(5:54) Brock Osweiler pass to the right to C.J. Fiedorowicz for 6 yards to the Hou27. Tackled by T.J. Ward.","(6:25) Brock Osweiler pass to the right to Will Fuller for 13 yards to the Hou21. Tackled by Aqib Talib and Will Parks.","(6:33) Riley Dixon punts for 36 yards to Hou8. No return.","(6:38) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(7:18) C.J. Anderson rush to the left for 2 yards to the Hou44. Tackled by Brian Cushing.","(7:57) Devontae Booker rush to the right for 6 yards to the Hou46. Tackled by Benardrick McKinney.","(8:42) Devontae Booker rush to the right for 11 yards to the Den48. Tackled by Eddie Pleasant.","(9:20) Devontae Booker rush to the right for 2 yards to the Den37. Tackled by Brian Cushing.","(9:29) Shane Lechler punts for 30 yards to Den35. No return.","(9:34) Brock Osweiler incomplete pass to the right intended for Lamar Miller.","(10:13) Lamar Miller rush up the middle for 4 yards to the Hou35. Tackled by Von Miller and Corey Nelson.","(10:20) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(11:00) Brock Osweiler pass to the right to Jaelen Strong for 8 yards to the Hou31. Tackled by Bradley Roby.","(11:31) Brock Osweiler pass to the right to Ryan Griffin for 9 yards to the Hou23. Tackled by Corey Nelson.","(11:36) Brandon McManus kicks off to the Hou-5. Will Fuller return for 19 yards to Hou14. Tackled by Corey Nelson.","(11:37) Brandon McManus 22 yard field goal attempt is GOOD. Holder: Riley Dixon.","(11:45) Trevor Siemian incomplete pass to the left intended for Jordan Norwood.","(12:25) Devontae Booker rush up the middle for 2 yards to the Hou3. Tackled by Jadeveon Clowney.","(13:02) C.J. Anderson rush to the left for 1 yard to the Hou5. Tackled by Brian Cushing.","(13:37) Trevor Siemian pass to the left to Emmanuel Sanders for 11 yards to the Hou6. Tackled by Benardrick McKinney.","(14:22) C.J. Anderson rush up the middle for 6 yards to the Hou17. Tackled by Eddie Pleasant and Brian Cushing.","(14:56) C.J. Anderson rush to the right for 2 yards to the Hou23. Tackled by A.J. Bouye.","(15:00) Brock Osweiler sacked at Hou30 for no gain. FUMBLE, recovered by Den (Chris Harris Jr.) and returned for 6 yards.","(0:07) Lamar Miller rush up the middle for 1 yard to the Hou30. Tackled by Todd Davis.","(0:40) Brock Osweiler pass to the right to Lamar Miller for 4 yards to the Hou29. Tackled by Von Miller.","(0:40) Brandon McManus kicks off to the endzone. Touchback.","(0:40) Brandon McManus extra point is good.","(0:45) Devontae Booker rush to the right for 1 yard for a TOUCHDOWN.","(1:26) Andy Janovich rush up the middle for 1 yard to the Hou1. Tackled by Jadeveon Clowney.","(1:26) Denver Broncos timeout.","(1:55) Trevor Siemian pass to the left to Emmanuel Sanders for 31 yards to the Hou2.","(2:38) Devontae Booker rush up the middle for 3 yards to the Hou33. Tackled by John Simon.","(3:15) C.J. Anderson rush to the right for 19 yards to the Hou36. Tackled by Andre Hal.","(4:07) C.J. Anderson rush up the middle for 9 yards to the Den45. Tackled by Corey Moore.","(4:37) Devontae Booker rush to the right for 8 yards to the Den36. Tackled by A.J. Bouye.","(4:46) Alfred Blue rush up the middle for 7 yards to the Den27. Tackled by T.J. Ward. FUMBLE, recovered by Den (Todd Davis) and returned for 1 yard. Tackled by DeAndre Hopkins.","(5:30) Brock Osweiler rush up the middle for 10 yards to the Den34. Tackled by Chris Harris Jr.. FUMBLE, recovered by Hou (Brock Osweiler).","(5:33) Brock Osweiler incomplete pass to the left intended for Ryan Griffin.","(6:16) Alfred Blue rush to the left for 2 yards to the Den44. Tackled by Darian Stewart and Billy Winn.","(6:53) Brock Osweiler pass to the left to DeAndre Hopkins for 2 yards to the Den46. Tackled by Chris Harris Jr..","(6:53) Denver Broncos timeout.","(7:26) Alfred Blue rush to the left for 9 yards to the Den48. Tackled by Darian Stewart and Chris Harris Jr..","(7:33) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(7:42) Riley Dixon punts for 36 yards to Hou43. No return.","(7:46) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas.","(8:26) Trevor Siemian pass to the left to Devontae Booker for 4 yards to the Den21. Tackled by A.J. Bouye.","(9:03) Devontae Booker rush to the left for 2 yards to the Den17. Tackled by Whitney Mercilus.","(9:04) Penalty: False Start on Denver (Donald Stephenson) -5 yards.","(9:09) Nick Novak kicks off to the Den1. Jordan Norwood return for 19 yards to Den20. Tackled by Jay Prosch.","(9:12) Nick Novak 29 yard field goal attempt is GOOD. Holder: Shane Lechler.","(9:19) Penalty: Offside on Denver (Aqib Talib) 5 yards.","(9:25) Brock Osweiler incomplete pass to the right intended for Alfred Blue.","(10:09) Alfred Blue rush up the middle for 6 yards to the Den16. Tackled by Todd Davis and Jared Crick.","(10:51) Brock Osweiler rush up the middle for no gain to the Den17. FUMBLE, recovered by Hou (Brock Osweiler).","(11:34) Lamar Miller rush to the left for 2 yards to the Den17. Tackled by Shane Ray and T.J. Ward.","(12:10) Lamar Miller rush to the left for 3 yards to the Den19. Tackled by Darian Stewart.","(12:49) Brock Osweiler rush up the middle for 6 yards to the Den22. Tackled by Shane Ray.","(12:56) Penalty: Pass Interference on Denver (T.J. Ward) 36 yards.","(13:24) Brock Osweiler pass to the left to C.J. Fiedorowicz for 12 yards to the Hou36. Tackled by T.J. Ward and Brandon Marshall.","(13:59) Lamar Miller rush to the left for 7 yards to the Hou24. Tackled by Chris Harris Jr..","(14:06) Riley Dixon punts for 49 yards to Hou17. No return.","(14:11) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(14:56) Trevor Siemian pass to the right to Demaryius Thomas for 9 yards to the Den34. Tackled by Johnathan Joseph.","(15:00) Trevor Siemian incomplete pass to the right intended for Devontae Booker.","(15:00) Nick Novak kicks off to the endzone. Touchback.","(0:39) C.J. Anderson rush up the middle for 4 yards to the Den44. Tackled by Jadeveon Clowney.","(0:44) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(0:44) Denver Broncos timeout.","(0:53) C.J. Anderson rush up the middle for 17 yards to the Den40. Tackled by Benardrick McKinney and A.J. Bouye.","(1:04) Shane Lechler punts for 58 yards to Den10. Jordan Norwood return for 13 yards to Den23. Tackled by Robert Nelson Jr..","(1:04) Denver Broncos timeout.","(1:11) Brock Osweiler pass to the left to Ryan Griffin for 4 yards to the Hou32. Tackled by Brandon Marshall.","(1:53) Brock Osweiler pass to the left to C.J. Fiedorowicz for 5 yards to the Hou28. Tackled by T.J. Ward.","(2:00) Penalty: Holding on Houston (Jeff Allen) -10 yards.","(2:00) Two Minute Warning.","(2:20) Alfred Blue rush up the middle for 5 yards to the Hou33. Tackled by Shane Ray and Todd Davis.","(3:29) Brock Osweiler pass to the left to Will Fuller for 7 yards to the Hou28. Tackled by Darian Stewart.","(3:58) Brock Osweiler pass to the right to DeAndre Hopkins for 8 yards to the Hou21. Tackled by Aqib Talib.","(4:04) Brandon McManus kicks off to the Hou4. Braxton Miller return for 9 yards to Hou13. Tackled by Dekoda Watson.","(4:04) Brandon McManus extra point is good.","(4:08) Trevor Siemian pass to the left to Demaryius Thomas for 4 yards for a TOUCHDOWN.","(4:46) C.J. Anderson rush up the middle for no gain to the Hou4. Tackled by Benardrick McKinney and Whitney Mercilus.","(4:51) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(5:37) Trevor Siemian pass to the left to Emmanuel Sanders for 29 yards to the Hou4. Tackled by Kareem Jackson.","(6:20) Devontae Booker rush to the right for 10 yards to the Hou33. Tackled by Whitney Mercilus.","(6:53) Devontae Booker rush up the middle for 12 yards to the Hou43. Tackled by Andre Hal and Brian Cushing.","(7:25) Devontae Booker rush to the right for 8 yards to the Den45. Tackled by Benardrick McKinney.","(7:29) Penalty: Offside on Houston (Brian Cushing) 5 yards.","(7:41) Shane Lechler punts for 48 yards to Den28. Jordan Norwood return for 4 yards to Den32. Tackled by Don Jones.","(8:16) Brock Osweiler pass to the right to Will Fuller for 2 yards to the Hou24. Tackled by Aqib Talib.","(8:58) Lamar Miller rush up the middle for 7 yards to the Hou22. Tackled by Todd Davis.","(9:06) Brock Osweiler incomplete pass to the middle intended for Will Fuller.","(9:10) Brandon McManus kicks off to the Hou1. Tyler Ervin return for 14 yards to Hou15. Tackled by Kayvon Webster.","(9:10) Brandon McManus extra point is good.","(9:15) C.J. Anderson rush to the left for 7 yards for a TOUCHDOWN.","(9:55) Trevor Siemian pass to the left to Demaryius Thomas for 8 yards to the Hou7. Tackled by A.J. Bouye.","(10:35) C.J. Anderson rush to the right for 3 yards to the Hou15. Tackled by Jadeveon Clowney and John Simon.","(11:12) Trevor Siemian pass to the right to Demaryius Thomas for 8 yards to the Hou18.","(11:52) Devontae Booker rush to the right for 4 yards to the Hou26. Tackled by Benardrick McKinney.","(12:30) Trevor Siemian pass to the left to Andy Janovich for 12 yards to the Hou30. Tackled by A.J. Bouye.","(13:10) Devontae Booker rush to the right for 6 yards to the Hou42. Tackled by Brian Cushing and Kareem Jackson.","(13:54) Trevor Siemian pass to the left to Emmanuel Sanders for 15 yards to the Hou48. Tackled by Charles James and Corey Moore.","(14:35) Trevor Siemian pass to the left to Demaryius Thomas for 11 yards to the Den37. Tackled by A.J. Bouye and Benardrick McKinney.","(15:00) Penalty: Holding on Denver (Michael Schofield) -10 yards.","(0:21) C.J. Anderson rush to the right for 11 yards to the Den36. Tackled by A.J. Bouye.","(0:21) Nick Novak kicks off to the endzone. Touchback.","(0:25) Nick Novak 43 yard field goal attempt is GOOD. Holder: Shane Lechler.","(0:30) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(1:14) Alfred Blue rush to the right for 1 yard to the Den25. Tackled by Derek Wolfe and Brandon Marshall.","(1:54) Brock Osweiler pass to the left to C.J. Fiedorowicz for 4 yards to the Den26. Tackled by Shane Ray.","(2:35) Alfred Blue rush up the middle for 3 yards to the Den30. Tackled by Brandon Marshall.","(2:39) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(3:23) Brock Osweiler pass to the left to Tyler Ervin for 9 yards to the Den33. Tackled by Dekoda Watson.","(3:56) Alfred Blue rush to the left for 17 yards to the Den42. Tackled by T.J. Ward.","(4:40) Brock Osweiler pass to the left to Will Fuller for no gain to the Hou41. Tackled by Chris Harris Jr..","(5:26) Alfred Blue rush to the right for 5 yards to the Hou41. Tackled by T.J. Ward and Sylvester Williams.","(5:35) Riley Dixon punts for 45 yards to Hou26. No return. Penalty: Holding on Denver (Casey Kreiter) 10 yards.","(6:08) C.J. Anderson rush up the middle for 12 yards to the Den29. Tackled by Andre Hal.","(6:37) Penalty: Holding on Denver (Russell Okung) -10 yards.","(6:41) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas.","(7:11) Devontae Booker rush to the right for 2 yards to the Den27. Tackled by Benardrick McKinney.","(7:11) Nick Novak kicks off to the endzone. Touchback.","(7:15) Nick Novak 43 yard field goal attempt is GOOD. Holder: Shane Lechler.","(7:19) Brock Osweiler incomplete pass to the left intended for Alfred Blue.","(8:00) Alfred Blue rush up the middle for 2 yards to the Den25. Tackled by Shaquil Barrett and Sylvester Williams.","(8:05) Brock Osweiler incomplete pass to the middle intended for Will Fuller defensed by Aqib Talib.","(8:39) Lamar Miller rush to the left for 25 yards to the Den27. Tackled by Will Parks.","(9:20) Lamar Miller rush up the middle for 6 yards to the Hou48. Tackled by Derek Wolfe.","(9:27) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(9:38) Riley Dixon punts for 43 yards to Hou41. Tyler Ervin return for 1 yard to Hou42. Tackled by Corey Nelson.","(9:58) Trevor Siemian pass to the left to Jordan Norwood for 8 yards to the Den16. Tackled by A.J. Bouye.","(10:28) Penalty: Holding on Denver (Russell Okung) -7 yards.","(11:05) Trevor Siemian pass to the right to Bennie Fowler for 7 yards to the Den15. Tackled by A.J. Bouye.","(11:12) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders defensed by A.J. Bouye.","(11:19) Shane Lechler punts for 44 yards to Den8. No return.","(11:23) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by Aqib Talib.","(12:04) Lamar Miller rush to the right for 1 yard to the Hou48. Tackled by Jared Crick and Derek Wolfe.","(12:33) Brock Osweiler pass to the left to DeAndre Hopkins for 7 yards to the Hou47. Tackled by Chris Harris Jr..","(12:44) Riley Dixon punts for 46 yards to Hou30. Tyler Ervin return for 10 yards to Hou40. Tackled by Corey Nelson.","(12:49) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders defensed by A.J. Bouye.","(13:28) Trevor Siemian pass to the right to Demaryius Thomas for no gain to the Den24. Tackled by A.J. Bouye.","(13:37) Trevor Siemian incomplete pass to the left intended for Andy Janovich.","(13:49) Shane Lechler punts for 62 yards to Den8. Jordan Norwood return for 16 yards to Den24. Tackled by Max Bullough.","(13:54) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by T.J. Ward.","(14:34) Lamar Miller rush to the right for 3 yards to the Hou30. Tackled by Darian Stewart and Darius Kilgo.","(15:00) Lamar Miller rush up the middle for 2 yards to the Hou27. Tackled by Sylvester Williams.","(15:00) Brandon McManus kicks off to the endzone. Touchback."]