["(0:09) Colin Kaepernick sacked at SF35 for a loss of 6 yards by Noah Spence.","(0:36) Shaun Draughn rush to the left for 16 yards to the SF41. Tackled by Jude Adjei-Barimah and Chris Conte.","(0:40) Colin Kaepernick incomplete pass to the right intended for Shaun Draughn defensed by Gerald McCoy.","(1:09) Colin Kaepernick pass to the right to Shaun Draughn for 9 yards to the SF25. Tackled by Brent Grimes and Bradley McDougald.","(1:18) Bryan Anger punts for 37 yards to SF16. No return.","(2:00) Peyton Barber rush to the left for a loss of 1 yard to the TB47. Tackled by Jaquiski Tartt and Eli Harold.","(2:00) Two Minute Warning.","(2:33) Peyton Barber rush to the right for 2 yards to the TB48. Tackled by Eli Harold.","(2:33) San Francisco 49ers timeout.","(2:38) Peyton Barber rush to the left for 4 yards to the TB46. Tackled by Eli Harold.","(2:38) San Francisco 49ers timeout.","(2:41) Peyton Barber rush to the right for 4 yards to the TB42. Tackled by Gerald Hodges Jr. and Eric Reid.","(2:43) San Francisco 49ers timeout.","(2:48) Peyton Barber rush to the right for 8 yards to the TB38. Tackled by Jaquiski Tartt and Eric Reid.","(2:58) Bradley Pinion punts for 40 yards to TB28. Adam Humphries - no return. FUMBLE, recovered by TB (Adam Humphries).","(3:06) Colin Kaepernick incomplete pass to the right.","(3:48) Colin Kaepernick sacked at SF32 for a loss of 4 yards by Gerald McCoy. FUMBLE, recovered by SF (Joshua Garnett).","(3:53) Colin Kaepernick incomplete pass to the left intended for Shaun Draughn.","(4:18) Colin Kaepernick pass to the left to Shaun Draughn for 3 yards to the SF36. Tackled by Lavonte David.","(4:42) Colin Kaepernick pass to the right to Jeremy Kerley for 8 yards to the SF33. Tackled by Kwon Alexander.","(4:42) Roberto Aguayo kicks off to the endzone. Touchback.","(4:42) Roberto Aguayo extra point is good.","(4:51) Peyton Barber rush to the left for 44 yards for a TOUCHDOWN.","(5:31) Jameis Winston pass to the left to Russell Shepard for 20 yards to the SF44. Tackled by Tramaine Brock.","(5:56) Jacquizz Rodgers rush to the left for 2 yards to the TB36. Tackled by DeForest Buckner and Antoine Bethea.","(6:33) Jameis Winston pass to the right to Mike Evans for 7 yards to the TB34.","(7:21) Jacquizz Rodgers rush to the left for no gain to the TB27. Tackled by Jimmie Ward and Eli Harold.","(8:03) Jacquizz Rodgers rush up the middle for 4 yards to the TB27. Tackled by Mike Purcell and Eric Reid.","(8:08) Phil Dawson kicks off to the TB6. Adam Humphries return for 17 yards to TB23. Tackled by Shayne Skov.","(8:12) Phil Dawson 28 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(8:17) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(8:59) DuJuan Harris rush to the right for a loss of 4 yards to the TB10. Tackled by Bradley McDougald.","(9:33) Colin Kaepernick pass to the left to DuJuan Harris for 4 yards to the TB6. Tackled by John Hughes III.","(10:09) Colin Kaepernick rush to the left for 17 yards to the TB10. Tackled by Bradley McDougald.","(10:15) Colin Kaepernick incomplete pass to the right intended for Garrett Celek defensed by Lavonte David.","(10:41) DuJuan Harris rush up the middle for 7 yards to the TB27. Tackled by Lavonte David.","(11:04) Colin Kaepernick rush to the right for 8 yards to the TB34. Tackled by Jude Adjei-Barimah.","(11:04) Tampa Bay Buccaneers timeout.","(11:31) DuJuan Harris rush to the left for a loss of 1 yard to the TB42. Tackled by Vernon Hargreaves III and Kwon Alexander.","(12:03) Colin Kaepernick pass to the middle to Quinton Patton for 8 yards to the TB41. Tackled by Bradley McDougald.","(12:07) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(12:59) Colin Kaepernick pass to the left to Garrett Celek for 4 yards to the TB49. Tackled by Lavonte David. FUMBLE, recovered by SF (Zane Beadles).","(13:25) Penalty: Offside on Tampa Bay (Howard Jones) 5 yards.","(14:07) DuJuan Harris rush up the middle for 2 yards to the SF42. Tackled by William Gholston.","(14:12) Colin Kaepernick incomplete pass to the right intended for Vance McDonald.","(14:17) 50 yard field goal attempt by Roberto Aguayo is NO GOOD. Holder: Bryan Anger.","(14:54) Jameis Winston pass to the right to Jacquizz Rodgers for 9 yards to the SF32. Tackled by Nick Bellore and Eli Harold.","(15:00) Jameis Winston incomplete pass to the right intended for Mike Evans.","(0:24) Penalty: Holding on Tampa Bay (Kevin Pamphile) -10 yards.","(0:50) Jacquizz Rodgers rush to the left for 8 yards to the SF31. Tackled by Michael Wilhoite.","(1:25) Jameis Winston pass to the left to Russell Shepard for 20 yards to the SF39. Tackled by Antoine Bethea.","(2:08) Jameis Winston pass to the left to Adam Humphries for 6 yards to the TB41. Tackled by Nick Bellore.","(2:36) Jacquizz Rodgers rush to the right for a loss of 3 yards to the TB35. Tackled by Antoine Bethea.","(3:15) Jacquizz Rodgers rush up the middle for 16 yards to the TB38. Tackled by Eli Harold.","(3:39) Jameis Winston pass to the right to Mike Evans for 12 yards to the TB22.","(4:04) Jacquizz Rodgers rush up the middle for 1 yard to the TB10. Tackled by DeForest Buckner.","(4:11) Bradley Pinion punts for 45 yards to TB17. No return. Penalty: Holding on Tampa Bay (Peyton Barber) -8 yards.","(4:16) Colin Kaepernick incomplete pass to the right intended for Aaron Burbridge defensed by Brent Grimes.","(4:24) Colin Kaepernick incomplete pass to the left.","(4:57) Mike Davis rush up the middle for no gain to the SF38. Tackled by Vernon Hargreaves III.","(5:31) Colin Kaepernick pass to the left to DuJuan Harris for 14 yards to the SF38. Tackled by Kwon Alexander.","(5:55) Penalty: Illegal Formation on San Francisco (Trenton Brown) -5 yards.","(5:59) Colin Kaepernick incomplete pass to the left intended for Garrett Celek.","(6:24) DuJuan Harris rush to the left for 4 yards to the SF29. Tackled by John Hughes III and Gerald McCoy.","(6:24) Roberto Aguayo kicks off to the endzone. Touchback.","(6:24) Roberto Aguayo extra point is good.","(6:30) Jameis Winston pass to the left to Mike Evans for 5 yards for a TOUCHDOWN.","(7:09) Jacquizz Rodgers rush to the right for a loss of 2 yards to the SF5. Tackled by Antoine Bethea and Ahmad Brooks.","(7:45) Jacquizz Rodgers rush up the middle for 9 yards to the SF3. Tackled by Antoine Bethea.","(7:55) Jameis Winston pass to the right to Mike Evans for 14 yards to the SF12. Tackled by Tramaine Brock.","(8:02) Jameis Winston incomplete pass to the left intended for Mike Evans.","(8:27) Peyton Barber rush to the left for 1 yard to the SF26. Tackled by Aaron Lynch.","(8:35) Colin Kaepernick sacked at SF27 for a loss of 12 yards by Jude Adjei-Barimah. FUMBLE, recovered by TB (Gerald McCoy). Tackled by Joe Staley.","(8:43) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(9:16) DuJuan Harris rush to the right for a loss of 2 yards to the SF39. Tackled by Lavonte David.","(9:51) Colin Kaepernick rush to the left for 13 yards to the SF41. Tackled by Vernon Hargreaves III.","(10:25) Mike Davis rush up the middle for 4 yards to the SF28. Tackled by Kwon Alexander.","(10:53) Colin Kaepernick rush to the right for 8 yards to the SF24. Tackled by Lavonte David.","(10:57) Roberto Aguayo kicks off to the SF-2. DuJuan Harris return for 18 yards to SF16. Tackled by Josh Robinson.","(11:02) Roberto Aguayo 37 yard field goal attempt is GOOD. Holder: Bryan Anger.","(11:07) Jameis Winston incomplete pass to the right intended for Adam Humphries.","(11:47) Jacquizz Rodgers rush up the middle for no gain to the SF19. Tackled by Gerald Hodges Jr..","(12:23) Jacquizz Rodgers rush up the middle for 6 yards to the SF19. Tackled by Arik Armstead and Nick Bellore.","(12:58) Jameis Winston pass to the right to Mike Evans for 11 yards to the SF25. Tackled by Gerald Hodges Jr..","(13:10) Bryan Anger punts for 42 yards to SF34. Aaron Burbridge - no return. FUMBLE, recovered by TB (Keith Tandy). Tackled by JaCorey Shepherd.","(13:48) Jameis Winston sacked at TB24 for a loss of 4 yards by Aaron Lynch.","(14:25) Jacquizz Rodgers rush up the middle for a loss of 2 yards to the TB28. Tackled by DeForest Buckner.","(15:00) Jacquizz Rodgers rush up the middle for 5 yards to the TB30. Tackled by Ahmad Brooks.","(15:00) Bradley Pinion kicks off to the endzone. Touchback.","(0:07) Jameis Winston rush up the middle for a loss of 1 yard to the TB15.","(0:22) Bradley Pinion punts for 57 yards to TB1. Adam Humphries return for 15 yards to TB16. FUMBLE, recovered by TB (Adam Humphries).","(0:26) Colin Kaepernick pass to the left to Shaun Draughn for 2 yards to the SF42.","(0:26) San Francisco 49ers timeout.","(0:31) Colin Kaepernick pass to the left to Quinton Patton for 2 yards to the SF40. Tackled by Kwon Alexander and William Gholston.","(0:36) Colin Kaepernick incomplete pass to the right intended for Vance McDonald defensed by Brent Grimes.","(0:36) San Francisco 49ers timeout.","(0:42) Colin Kaepernick pass to the left to Jeremy Kerley for 7 yards to the SF38. Tackled by Kwon Alexander.","(0:42) San Francisco 49ers timeout.","(0:48) Colin Kaepernick pass to the right to Shaun Draughn for 6 yards to the SF31. Tackled by Lavonte David.","(0:48) Roberto Aguayo kicks off to the endzone. Touchback.","(0:48) Roberto Aguayo extra point is good.","(0:53) Jameis Winston pass to the right to Russell Shepard for 19 yards for a TOUCHDOWN.","(0:59) Jameis Winston incomplete pass to the left intended for Russell Shepard.","(0:59) Tampa Bay Buccaneers timeout.","(1:04) Jacquizz Rodgers rush to the right for 1 yard to the SF19. Tackled by Jimmie Ward and Nick Bellore.","(1:08) Jameis Winston pass to the right to Cameron Brate for 17 yards to the SF35. Tackled by Eric Reid. Penalty: Unnecessary Roughness on San Francisco (DeForest Buckner) 15 yards.","(1:38) Jameis Winston pass to the left to Russell Shepard for 13 yards to the TB48. Tackled by Rashard Robinson.","(2:00) Jameis Winston pass to the left to Russell Shepard for 5 yards to the TB35. Tackled by Tramaine Brock.","(2:00) Two Minute Warning.","(2:29) Jacquizz Rodgers rush to the right for 7 yards to the TB30. Tackled by Eric Reid.","(2:34) Jameis Winston incomplete pass to the left intended for Mike Evans.","(2:41) Bradley Pinion punts for 33 yards to TB23. No return.","(2:44) Colin Kaepernick incomplete pass to the right intended for Rod Streater defensed by Keith Tandy.","(3:21) Colin Kaepernick pass to the right to Quinton Patton for 3 yards to the SF44. Tackled by Chris Conte.","(3:50) Mike Davis rush to the right for 4 yards to the SF41. Tackled by Bradley McDougald.","(4:24) Colin Kaepernick rush to the left for 4 yards to the SF37. Tackled by William Gholston.","(4:59) Colin Kaepernick rush to the left for 8 yards to the SF33. Tackled by William Gholston.","(4:59) Roberto Aguayo kicks off to the endzone. Touchback.","(5:04) Roberto Aguayo 38 yard field goal attempt is GOOD. Holder: Bryan Anger.","(5:27) Jameis Winston pass to the middle to Cameron Brate for 3 yards to the SF5. Tackled by Tramaine Brock. Penalty: Unsports. Conduct on Tampa Bay (Jameis Winston) -15 yards.","(6:09) Peyton Barber rush to the left for 2 yards to the SF8. Tackled by DeForest Buckner.","(6:41) Peyton Barber rush to the left for 4 yards to the SF10. Tackled by Aaron Lynch and Gerald Hodges Jr..","(7:01) Peyton Barber rush up the middle for 14 yards to the SF14. Tackled by Eric Reid.","(7:38) Jacquizz Rodgers rush to the left for 45 yards to the SF28. Tackled by Gerald Hodges Jr..","(7:44) Colin Kaepernick pass intended for Vance McDonald INTERCEPTED by Bradley McDougald. No return.","(8:20) DuJuan Harris rush up the middle for 2 yards to the TB44. Tackled by Gerald McCoy.","(8:29) Penalty: Illegal Formation on San Francisco (Trenton Brown) -5 yards.","(8:57) Colin Kaepernick pass to the left to Aaron Burbridge for 15 yards to the TB41. Tackled by Jude Adjei-Barimah.","(9:34) Colin Kaepernick rush to the left for 16 yards to the SF44.","(9:38) Colin Kaepernick incomplete pass to the right intended for Vance McDonald.","(10:14) Mike Davis rush to the left for 3 yards to the SF28. Tackled by Daryl Smith.","(10:14) Roberto Aguayo kicks off to the endzone. Touchback.","(10:14) Roberto Aguayo extra point is good.","(10:20) Jameis Winston pass to the left to Mike Evans for 4 yards for a TOUCHDOWN.","(10:58) Jacquizz Rodgers rush up the middle for 2 yards to the SF4. Tackled by Ahmad Brooks.","(11:22) Jameis Winston pass to the right to Antone Smith for 30 yards to the SF12. Tackled by Antoine Bethea. Penalty: Horse Collar Tackle on San Francisco (Antoine Bethea) 6 yards.","(11:58) Jameis Winston pass to the right to Adam Humphries for 11 yards to the SF42. Tackled by Antoine Bethea.","(12:33) Adam Humphries rush to the left for 6 yards to the TB47. Tackled by Antoine Bethea.","(13:09) Jameis Winston pass to the right to Mike Evans for 12 yards to the TB41. Tackled by Rashard Robinson.","(13:09) Tampa Bay Buccaneers timeout.","(13:15) Jameis Winston incomplete pass to the left.","(13:45) Jameis Winston pass to the left to Cameron Brate for 9 yards to the TB29. Tackled by Nick Bellore.","(14:17) Peyton Barber rush to the right for 2 yards to the TB20. Tackled by Eli Harold.","(15:00) Jacquizz Rodgers rush to the right for 7 yards to the TB18. Tackled by Ronald Blair.","(0:03) Jacquizz Rodgers rush to the right for 5 yards to the TB11. Tackled by Gerald Hodges Jr..","(0:08) Phil Dawson kicks off to the TB0. Ryan Smith return for 6 yards to TB6. Tackled by Shaun Draughn and Aaron Burbridge.","(0:08) Phil Dawson extra point is good. Penalty: Leverage on Tampa Bay (Gerald McCoy) 15 yards.","(0:16) Colin Kaepernick pass to the left to Shaun Draughn for 17 yards for a TOUCHDOWN.","(0:25) Jameis Winston pass intended for Mike Evans INTERCEPTED by Gerald Hodges Jr. defensed by Tramaine Brock and returned for 21 yards. Tackled by Ali Marpet.","(0:29) Jameis Winston incomplete pass to the right intended for Mike Evans defensed by Nick Bellore.","(1:13) Jacquizz Rodgers rush to the left for 5 yards to the TB28. Tackled by Ahmad Brooks.","(1:21) Bradley Pinion punts for 43 yards to TB23. No return.","(1:51) Colin Kaepernick sacked at SF34 for a loss of 8 yards by William Gholston.","(1:53) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley defensed by Noah Spence.","(2:37) Mike Davis rush to the right for a loss of 2 yards to the SF42. Tackled by Daryl Smith and Lavonte David.","(3:07) DuJuan Harris rush to the left for 18 yards to the SF44. Tackled by Lavonte David.","(3:37) DuJuan Harris rush to the left for 5 yards to the SF26. Tackled by Kwon Alexander and William Gholston.","(4:09) DuJuan Harris rush to the right for 5 yards to the SF21. Tackled by William Gholston.","(4:38) DuJuan Harris rush to the left for 3 yards to the SF16. Tackled by Vernon Hargreaves III.","(4:45) Bryan Anger punts for 38 yards to SF13. No return.","(5:32) Jameis Winston pass to the left to Antone Smith for 11 yards to the TB49. Tackled by Antoine Bethea.","(5:35) Jameis Winston incomplete pass to the right intended for Antone Smith.","(6:11) Jacquizz Rodgers rush up the middle for 7 yards to the TB38. Tackled by Arik Armstead.","(6:37) Penalty: Holding on Tampa Bay (Donovan Smith) -10 yards.","(7:14) Jameis Winston pass to the right to Mike Evans for 31 yards to the TB41. Tackled by Eric Reid.","(8:01) Jameis Winston sacked at TB10 for a loss of 1 yard by Ahmad Brooks and Arik Armstead.","(8:11) Bradley Pinion punts for 36 yards to TB11. No return.","(8:18) Colin Kaepernick incomplete pass to the right intended for Torrey Smith.","(8:57) Colin Kaepernick rush to the right for 3 yards to the TB47. Tackled by Jude Adjei-Barimah.","(9:02) Colin Kaepernick incomplete pass to the right intended for Vance McDonald.","(9:08) Peyton Barber rush to the left for no gain to the TB50. Tackled by Quinton Dial.","(9:54) Jacquizz Rodgers rush to the left for 1 yard to the TB50. Tackled by Tramaine Brock.","(10:33) Jacquizz Rodgers rush up the middle for 2 yards to the TB49. Tackled by Arik Armstead and DeForest Buckner.","(11:10) Antone Smith rush to the right for 6 yards to the TB47. Tackled by Tramaine Brock.","(11:43) Jacquizz Rodgers rush to the left for 12 yards to the TB41. Tackled by Gerald Hodges Jr. and DeForest Buckner.","(12:19) Jacquizz Rodgers rush to the right for 11 yards to the TB29. Tackled by Rashard Robinson.","(12:56) Jacquizz Rodgers rush to the left for 5 yards to the TB18. Tackled by Quinton Dial.","(13:02) Bradley Pinion kicks off to the TB-1. Ryan Smith return for 14 yards to TB13. Tackled by Blake Bell.","(13:02) Phil Dawson extra point is good.","(13:04) Mike Davis rush to the left for 4 yards for a TOUCHDOWN.","(13:42) Colin Kaepernick pass to the right to Torrey Smith for 17 yards to the TB4. Tackled by Jude Adjei-Barimah.","(14:04) Colin Kaepernick pass to the middle to Vance McDonald for 24 yards to the TB21. Tackled by Bradley McDougald.","(14:09) Penalty: Unnecessary Roughness on Tampa Bay (Chris Conte) 15 yards.","(14:32) Mike Davis rush up the middle for 8 yards to the SF40. Tackled by Kwon Alexander.","(15:00) Colin Kaepernick rush to the left for 7 yards to the SF32. Tackled by Kwon Alexander.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback."]