["(0:13) Ryan Tannehill rush up the middle for a loss of 1 yard to the Buf46.","(0:14) Dan Carpenter onside kickoff to the Buf47. Onside kick recovered by receiving team by Jarvis Landry.","(0:14) Tyrod Taylor 2 pt conversion pass to Reggie Bush is GOOD.","(0:19) Reggie Bush rush to the left for 1 yard for a TOUCHDOWN.","(0:25) Tyrod Taylor incomplete pass to the right. Penalty: Holding on Miami (Byron Maxwell) 1 yards.","(0:34) Tyrod Taylor incomplete pass to the right.","(0:34) Buffalo Bills timeout.","(0:40) Tyrod Taylor pass to the middle to Brandon Tate for 25 yards to the Mia2. Tackled by Michael Thomas.","(0:46) Tyrod Taylor incomplete pass to the right intended for Charles Clay.","(0:51) Tyrod Taylor incomplete pass to the left intended for Walt Powell.","(0:57) Tyrod Taylor pass to the left to Walt Powell for 13 yards to the Mia27. Tackled by Tony Lippett.","(1:05) Tyrod Taylor rush to the right for 2 yards to the Buf45. Tackled by Jason Jones. Penalty: Unnecessary Roughness on Miami (Jason Jones) 15 yards.","(1:30) Tyrod Taylor pass to the left to Nick O'Leary for 7 yards to the Buf43. Tackled by Jelani Jenkins.","(1:37) Tyrod Taylor rush to the left for 7 yards to the Buf46. Tackled by Kiko Alonso. Penalty: Holding on Buffalo (Jordan Mills) -10 yards.","(2:00) Mike Gillislee rush to the right for 5 yards to the Buf24. Tackled by Jelani Jenkins. Penalty: Taunting on Miami (Byron Maxwell) 15 yards.","(2:00) Two Minute Warning.","(2:20) Tyrod Taylor sacked at Buf19 for a loss of 6 yards by Cameron Wake and Andre Branch.","(2:24) Tyrod Taylor incomplete pass to the left intended for Charles Clay.","(2:24) Andrew Franks kicks off to the endzone. Touchback.","(2:24) Andrew Franks extra point is good.","(2:35) Ryan Tannehill pass to the right to Kenny Stills for 66 yards for a TOUCHDOWN.","(2:35) Buffalo Bills timeout.","(2:40) Jay Ajayi rush to the left for 2 yards to the Mia34. Tackled by Lorenzo Alexander.","(3:27) Damien Williams rush to the left for 2 yards to the Mia32. Tackled by Preston Brown.","(3:38) Colton Schmidt punts for 54 yards to Mia21. Jarvis Landry return for 9 yards to Mia30. Tackled by Ramon Humber and Garrison Sanborn.","(3:44) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin defensed by Isa Abdul-Quddus.","(3:44) Miami Dolphins timeout.","(3:51) Tyrod Taylor incomplete pass to the right intended for Walt Powell.","(3:56) Tyrod Taylor incomplete pass to the right intended for Charles Clay.","(3:56) Andrew Franks kicks off to the endzone. Touchback.","(3:56) Andrew Franks extra point is good.","(3:56) Penalty: False Start on Miami (Laremy Tunsil) -5 yards.","(4:12) Damien Williams rush to the left for 12 yards for a TOUCHDOWN.","(4:49) Damien Williams rush to the right for 2 yards to the Buf12. Tackled by Kyle Williams.","(5:19) Jay Ajayi rush to the right for 14 yards to the Buf14. Tackled by Corey Graham.","(5:57) Ryan Tannehill pass to the right to Jarvis Landry for 18 yards to the Buf28. Tackled by Ronald Darby.","(5:57) Miami Dolphins timeout.","(6:51) Jay Ajayi rush to the right for 1 yard to the Buf46. Tackled by Zach Brown.","(7:17) Jay Ajayi rush to the left for 2 yards to the Buf47. Tackled by Kyle Williams.","(7:45) Penalty: Face Mask on Buffalo (Jerry Hughes) 15 yards.","(7:55) Colton Schmidt punts for 57 yards to Mia28. Jarvis Landry return for 8 yards to Mia36. Tackled by Lorenzo Alexander.","(8:02) Tyrod Taylor incomplete pass to the left.","(8:42) Tyrod Taylor rush to the right for 5 yards to the Buf15. Tackled by Neville Hewitt.","(9:20) Mike Gillislee rush to the right for a loss of 10 yards to the Buf10. Tackled by Mario Williams.","(9:28) Matt Darr punts for 40 yards to Buf0. Touchback.","(9:37) Ryan Tannehill incomplete pass to the middle intended for Arian Foster.","(10:12) Ryan Tannehill pass to the right to Arian Foster for 4 yards to the Buf40. Tackled by Robert Blanton.","(10:56) Damien Williams rush to the left for no gain to the Buf44. Tackled by Corey White.","(11:37) Jay Ajayi rush to the right for 53 yards to the Buf44. Tackled by Ronald Darby.","(12:13) Jay Ajayi rush up the middle for 2 yards to the Mia3. Tackled by Jerry Hughes and Corbin Bryant.","(12:22) Colton Schmidt punts for 43 yards to Mia1. No return.","(12:31) Penalty: Delay of Game on Buffalo (Colton Schmidt) -5 yards.","(13:16) Tyrod Taylor sacked at Mia39 for a loss of 6 yards by Ndamukong Suh.","(13:23) Tyrod Taylor incomplete pass to the left intended for Justin Hunter.","(14:05) Mike Gillislee rush to the left for 4 yards to the Mia33. Tackled by Chris Jones.","(14:40) Tyrod Taylor rush to the left for 5 yards to the Mia37. Tackled by Kiko Alonso.","(15:00) Tyrod Taylor pass to the right to Marquise Goodwin for 9 yards to the Mia42.","(0:11) Mike Gillislee rush to the right for 20 yards to the Buf49. Tackled by Isa Abdul-Quddus.","(0:18) Andrew Franks kicks off to the Buf4. Brandon Tate return for 25 yards to Buf29. Tackled by Michael Thomas and Mike Hull.","(0:18) Ryan Tannehill 2 pt conversion pass to Jarvis Landry is GOOD.","(0:25) Jay Ajayi rush to the left for 4 yards for a TOUCHDOWN.","(1:01) Jay Ajayi rush to the right for 2 yards to the Buf4. Tackled by Ronald Darby.","(1:35) Ryan Tannehill rush to the left for 13 yards to the Buf6. Tackled by Robert Blanton.","(2:18) Jay Ajayi rush to the left for 7 yards to the Buf19. Tackled by Leger Douzable.","(2:49) Jay Ajayi rush up the middle for 4 yards to the Buf26. Tackled by Kyle Williams.","(3:23) Ryan Tannehill pass to the left to Jarvis Landry for 21 yards to the Buf30. Tackled by Robert Blanton.","(4:01) Arian Foster rush to the right for 3 yards to the Mia49. Tackled by Lerentee McCray.","(4:42) Ryan Tannehill pass to the right to DeVante Parker for 9 yards to the Mia46. Tackled by Ronald Darby.","(5:24) Jay Ajayi rush to the right for 2 yards to the Mia37. Tackled by Preston Brown.","(5:51) Jay Ajayi rush to the right for 10 yards to the Mia35. Tackled by Corey Graham and Lerentee McCray.","(5:51) Dan Carpenter kicks off to the endzone. Touchback.","(5:51) Dan Carpenter extra point is good.","(6:00) Tyrod Taylor pass to the right to Marquise Goodwin for 67 yards for a TOUCHDOWN.","(6:07) Matt Darr punts for 36 yards to Buf33. No return.","(6:28) Ryan Tannehill rush to the right for 2 yards to the Mia31. Tackled by Kyle Williams.","(6:56) Jay Ajayi rush up the middle for 3 yards to the Mia29. Tackled by Corey Graham.","(7:33) Ryan Tannehill sacked at Mia26 for a loss of 6 yards by Lorenzo Alexander.","(7:42) Colton Schmidt punts for 43 yards to Mia29. Jakeem Grant return for 3 yards to Mia32. Tackled by Mike Gillislee.","(8:21) Tyrod Taylor sacked at Buf28 for a loss of 4 yards by Jason Jones.","(9:01) Tyrod Taylor pass to the right to Brandon Tate for 6 yards to the Buf32. Tackled by Kiko Alonso and Byron Maxwell.","(9:41) LeSean McCoy rush to the right for a loss of 2 yards to the Buf26. Tackled by Mario Williams.","(9:41) Penalty: Encroachment on Miami (Jordan Phillips) 5 yards.","(9:48) Matt Darr punts for 42 yards to Buf23. No return.","(9:55) Ryan Tannehill incomplete pass to the left intended for Jarvis Landry defensed by Jonathan Meeks.","(10:37) Jay Ajayi rush up the middle for a loss of 2 yards to the Mia35. Tackled by Lorenzo Alexander.","(10:44) Ryan Tannehill incomplete pass to the right intended for Kenny Stills defensed by Corey Graham.","(10:58) Penalty: Holding on Buffalo (Stephon Gilmore) 5 yards.","(11:15) Penalty: Holding on Miami (Branden Albert) -10 yards.","(11:53) Jay Ajayi rush to the left for 2 yards to the Mia42. Tackled by Jerry Hughes.","(12:31) Jay Ajayi rush to the right for 9 yards to the Mia40. Tackled by Robert Blanton.","(12:53) Colton Schmidt punts for 47 yards to Mia23. Jakeem Grant return for 8 yards to Mia31. Tackled by Robert Blanton.","(13:51) Jerome Felton rush to the left for no gain to the Buf30. Tackled by Donald Butler.","(14:07) Tyrod Taylor rush up the middle for 5 yards to the Buf30. Tackled by Michael Thomas.","(14:07) Buffalo Bills timeout.","(14:53) LeSean McCoy rush to the right for 4 yards to the Buf25. Tackled by Kiko Alonso.","(15:00) Andrew Franks kicks off to the Buf-1. Reggie Bush return for 22 yards to Buf21. Tackled by Jordan Lucas and Chimdi Chekwa.","(0:41) Ryan Tannehill rush to the right for 1 yard to the Mia31. Tackled by Shaq Lawson.","(0:41) Miami Dolphins timeout.","(0:49) Jay Ajayi rush to the left for 17 yards to the Mia30. Tackled by Zach Brown.","(0:56) Colton Schmidt punts for 27 yards to Mia13. No return.","(1:04) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(1:31) Tyrod Taylor pass to the left to Walt Powell for 10 yards to the Mia40. Tackled by Tony Lippett.","(2:00) LeSean McCoy rush up the middle for a loss of 3 yards to the Buf50. Tackled by Jordan Phillips and Andre Branch.","(2:00) Two Minute Warning.","(2:35) Tyrod Taylor pass to the middle to Charles Clay for 11 yards to the Mia47. Tackled by Neville Hewitt.","(3:12) Tyrod Taylor pass to the left to Charles Clay for 18 yards to the Buf42. Tackled by Isa Abdul-Quddus.","(3:41) Mike Gillislee rush up the middle for 1 yard to the Buf24. Tackled by Donald Butler.","(3:41) Penalty: Offside on Miami (Jordan Phillips) 5 yards.","(3:47) Andrew Franks kicks off to the Buf2. Brandon Tate return for 16 yards to Buf18. Tackled by Jordan Lucas and Neville Hewitt.","(3:54) Andrew Franks 33 yard field goal attempt is GOOD. Holder: Matt Darr.","(4:31) Ryan Tannehill pass to the middle to Jarvis Landry for a loss of 1 yard to the Buf15. Tackled by Zach Brown.","(5:20) Ryan Tannehill rush up the middle for 2 yards to the Buf14. Tackled by Lorenzo Alexander.","(5:55) Ryan Tannehill pass to the right to Kenny Stills for 5 yards to the Buf16. Tackled by Ronald Darby.","(6:13) Penalty: Holding on Miami (Laremy Tunsil) -10 yards.","(6:13) Miami Dolphins timeout.","(6:53) Ryan Tannehill rush to the right for 4 yards to the Buf11. Tackled by Preston Brown.","(7:36) Ryan Tannehill pass to the left to DeVante Parker for 9 yards to the Buf15. Tackled by Stephon Gilmore.","(8:15) Jay Ajayi rush to the right for a loss of 1 yard to the Buf24. Tackled by Leger Douzable.","(8:53) Jay Ajayi rush up the middle for 14 yards to the Buf23. Tackled by Zach Brown.","(9:48) Ryan Tannehill pass to the right to Jarvis Landry for 14 yards to the Buf37. Tackled by Ronald Darby.","(10:30) Arian Foster rush to the right for 2 yards to the Mia49. Tackled by Leger Douzable and Aaron Williams.","(11:03) Jay Ajayi rush to the left for 9 yards to the Mia47. Tackled by Brandon Spikes.","(11:34) Jay Ajayi rush to the right for 11 yards to the Mia38. Tackled by Ronald Darby.","(11:47) Dan Carpenter kicks off to the Mia10. Jakeem Grant return for 17 yards to Mia27. Tackled by Robert Blanton.","(11:47) Penalty: Offside on Buffalo (Corey White) -5 yards.","(11:47) Dan Carpenter extra point is good.","(11:57) Tyrod Taylor rush to the right for 10 yards for a TOUCHDOWN.","(12:17) Tyrod Taylor pass to the left to Justin Hunter for 10 yards to the Mia10. Tackled by Tony Lippett.","(12:26) Tyrod Taylor incomplete pass to the right intended for Reggie Bush.","(12:52) LeSean McCoy rush up the middle for 3 yards to the Mia20. Tackled by Isa Abdul-Quddus.","(13:36) Tyrod Taylor pass to the middle to Reggie Bush for 13 yards to the Mia23. Tackled by Bobby McCain.","(14:08) Tyrod Taylor pass to the left to Marquise Goodwin for 2 yards to the Mia36. Tackled by Tony Lippett.","(14:37) LeSean McCoy rush to the right for 2 yards to the Mia38. Tackled by Kiko Alonso.","(14:45) Matt Darr punts for 12 yards to Mia40. No return.","(14:52) Penalty: Holding on Miami (Kenyan Drake) -10 yards.","(15:00) Ryan Tannehill incomplete pass to the left intended for Arian Foster defensed by Corey Graham.","(0:17) Arian Foster rush to the left for no gain to the Mia38. Tackled by Aaron Williams.","(0:23) Ryan Tannehill incomplete pass to the left intended for DeVante Parker.","(0:42) Ryan Tannehill pass to the left to Jarvis Landry for 26 yards to the Buf47. Tackled by Nickell Robey-Coleman and Zach Brown. Penalty: Taunting on Miami (Jarvis Landry) -15 yards.","(0:49) Dan Carpenter kicks off to the Mia4. Jakeem Grant return for 23 yards to Mia27. Tackled by Robert Blanton.","(0:53) Dan Carpenter 29 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(0:58) Tyrod Taylor incomplete pass to the right intended for Justin Hunter.","(1:05) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(1:42) LeSean McCoy rush to the right for 2 yards to the Mia10. Tackled by Kiko Alonso.","(2:12) Tyrod Taylor pass to the right to Justin Hunter for 15 yards to the Mia12.","(2:48) LeSean McCoy rush to the left for 3 yards to the Mia27. Tackled by Ndamukong Suh and Michael Thomas.","(3:01) Matt Darr punts for 45 yards to Buf40. Brandon Tate return for 30 yards to Mia30. Tackled by Walt Aikens.","(3:13) Ryan Tannehill incomplete pass to the left intended for Kenny Stills defensed by Corey Graham.","(3:50) Jay Ajayi rush to the left for 3 yards to the Mia15. Tackled by Leger Douzable.","(4:22) Jay Ajayi rush to the left for no gain to the Mia12. Tackled by Zach Brown.","(4:49) Colton Schmidt punts for 45 yards to Mia22. Jakeem Grant - no return. Tackled by Mike Gillislee. Penalty: Holding on Miami (Walt Aikens) -10 yards.","(5:14) Tyrod Taylor sacked at Buf33 for a loss of 5 yards by Cameron Wake.","(5:48) Penalty: Delay of Game on Buffalo (Tyrod Taylor) -5 yards.","(6:18) Tyrod Taylor rush to the left for 1 yard to the Buf43. Tackled by Neville Hewitt.","(6:51) LeSean McCoy rush to the left for 2 yards to the Buf42. Tackled by Donald Butler.","(7:28) Tyrod Taylor pass to the right to Marquise Goodwin for 15 yards to the Buf40. Tackled by Byron Maxwell.","(7:28) Andrew Franks kicks off to the endzone. Touchback.","(7:32) Andrew Franks 36 yard field goal attempt is GOOD. Holder: Matt Darr.","(7:40) Ryan Tannehill incomplete pass to the left intended for Kenny Stills defensed by Stephon Gilmore.","(8:19) Jay Ajayi rush up the middle for 12 yards to the Buf18. Tackled by Corey Graham.","(8:23) Ryan Tannehill incomplete pass to the right intended for Damien Williams.","(8:50) Penalty: Holding on Miami (Mike Pouncey) -10 yards.","(9:26) Ryan Tannehill pass to the left to Kenny Stills for 11 yards to the Buf20. Tackled by Corey Graham.","(10:07) Jay Ajayi rush to the right for 4 yards to the Buf31. Tackled by Zach Brown.","(10:13) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry defensed by Jerry Hughes.","(10:49) Ryan Tannehill pass to the middle to Kenny Stills for 14 yards to the Buf35. Tackled by Aaron Williams.","(10:55) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry.","(11:12) Penalty: False Start on Miami (Jermon Bushrod) -5 yards.","(11:48) Ryan Tannehill pass to the left to Jay Ajayi for 2 yards to the Buf44. Tackled by Zach Brown.","(12:31) Ryan Tannehill pass to the left to DeVante Parker for 2 yards to the Buf46. Tackled by Preston Brown.","(13:07) Jay Ajayi rush to the left for 9 yards to the Buf48. Tackled by Corey Graham.","(13:34) Jay Ajayi rush to the right for 11 yards to the Mia43. Tackled by Corey Graham.","(14:15) Ryan Tannehill pass to the right to Kenny Stills for 4 yards to the Mia32. Tackled by Ronald Darby.","(14:53) Jay Ajayi rush to the right for 10 yards to the Mia28. Tackled by Preston Brown and Aaron Williams.","(15:00) Dan Carpenter kicks off to the Mia-1. Jakeem Grant return for 19 yards to Mia18. Tackled by Jonathan Meeks."]