["(9:06) Josh Lambo 42 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(9:51) Philip Rivers rush up the middle for a loss of 2 yards to the Atl24.","(10:19) Melvin Gordon rush to the right for 5 yards to the Atl27. Tackled by Deion Jones. Penalty: Holding on Atlanta (Tyson Jackson) 5 yards.","(10:59) Melvin Gordon rush to the right for 2 yards to the Atl32. Tackled by Keanu Neal.","(11:39) Philip Rivers pass to the middle to Antonio Gates for 11 yards to the Atl34. Tackled by Keanu Neal.","(11:39) Atlanta Falcons timeout.","(12:12) Melvin Gordon rush to the right for a loss of 2 yards to the Atl45. Tackled by Philip Wheeler.","(12:16) Devonta Freeman rush to the left for a loss of 1 yard to the Atl44. Tackled by Denzel Perryman.","(12:16) San Diego Chargers timeout.","(12:16) Atlanta Falcons timeout.","(12:42) Matt Ryan rush to the right for no gain to the Atl45. Tackled by Melvin Ingram.","(13:08) Matt Ryan pass to the right to Mohamed Sanu for 11 yards to the Atl45. Tackled by Tenny Palepoi.","(13:45) Devonta Freeman rush to the left for a loss of 2 yards to the Atl34. Tackled by Tenny Palepoi and Melvin Ingram.","(14:16) Matt Ryan pass to the left to Justin Hardy for 4 yards to the Atl36. Tackled by Trevor Williams.","(14:23) Matt Ryan incomplete pass to the left intended for Julio Jones defensed by Casey Hayward.","(15:00) Matt Ryan pass to the right to Devonta Freeman for 7 yards to the Atl32. Tackled by Kyle Emanuel.","(15:00) Josh Lambo kicks off to the endzone. Touchback.","(0:01) 58 yard field goal attempt by Matt Bryant is NO GOOD. Holder: Matt Bosher.","(0:01) San Diego Chargers timeout.","(0:01) Atlanta Falcons timeout.","(0:06) Matt Ryan pass to the right to Julio Jones for 10 yards to the SD40. Tackled by Casey Hayward.","(0:11) Matt Ryan incomplete pass to the right intended for Julio Jones.","(0:11) Atlanta Falcons timeout.","(0:18) Matt Ryan pass to the right to Julio Jones for 25 yards to the Atl50. Tackled by Casey Hayward.","(0:18) Josh Lambo kicks off to the endzone. Touchback.","(0:22) Josh Lambo 33 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(0:28) Philip Rivers incomplete pass to the left intended for Antonio Gates defensed by Robert Alford.","(0:32) Philip Rivers incomplete pass to the left intended for Dexter McCluster defensed by Courtney Upshaw.","(0:36) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(0:36) San Diego Chargers timeout.","(0:46) Melvin Gordon rush to the right for 13 yards to the Atl15. Tackled by Ricardo Allen.","(0:52) Philip Rivers pass to the middle to Travis Benjamin for 9 yards to the Atl28. Tackled by Deion Jones.","(0:57) Philip Rivers incomplete pass to the left intended for Dontrelle Inman.","(1:33) Philip Rivers pass to the right to Dontrelle Inman for 17 yards to the Atl37. Tackled by Brian Poole.","(2:00) Philip Rivers pass to the middle to Antonio Gates for 3 yards to the SD46. Tackled by Deion Jones.","(2:00) Two Minute Warning.","(2:27) Melvin Gordon rush to the left for a loss of 1 yard to the SD43. Tackled by Adrian Clayborn and Dwight Freeney.","(2:52) Melvin Gordon rush to the left for no gain to the SD44. Tackled by Adrian Clayborn.","(3:32) Philip Rivers pass to the left to Tyrell Williams for 9 yards to the SD44. Tackled by Robert Alford and Keanu Neal.","(3:41) Matt Ryan pass intended for Julio Jones INTERCEPTED by Denzel Perryman and returned for 1 yard. Tackled by Julio Jones.","(3:41) Penalty: False Start on Atlanta (Andy Levitre) -5 yards.","(3:41) Penalty: False Start on Atlanta (Ryan Schraeder) -5 yards.","(4:26) Devonta Freeman rush to the right for 6 yards to the SD40. Tackled by Brandon Mebane.","(5:10) Devonta Freeman rush to the left for 8 yards to the SD46. Tackled by Denzel Perryman.","(5:52) Matt Ryan pass to the left to Julio Jones for 21 yards to the Atl46. Tackled by Dexter McCoil.","(5:59) Matt Ryan incomplete pass to the right intended for Julio Jones.","(5:59) Josh Lambo kicks off to the endzone. Touchback.","(5:59) Josh Lambo extra point is good.","(6:03) Philip Rivers pass to the left to Melvin Gordon for 5 yards for a TOUCHDOWN.","(6:46) Philip Rivers pass to the left to Tyrell Williams for 10 yards to the Atl5. Tackled by Robert Alford.","(6:53) Philip Rivers incomplete pass to the right.","(6:58) Philip Rivers incomplete pass to the middle intended for Travis Benjamin.","(7:43) Melvin Gordon rush to the left for 2 yards to the Atl15. Tackled by De'Vondre Campbell.","(8:01) Philip Rivers pass to the left to Melvin Gordon for 14 yards to the Atl17. Tackled by Keanu Neal.","(8:48) Philip Rivers sacked at Atl31 for a loss of 6 yards by Vic Beasley Jr..","(9:28) Philip Rivers pass to the right to Griff Whalen for 12 yards to the Atl25. Tackled by Brian Poole and Ricardo Allen.","(9:55) Philip Rivers pass to the left to Tyrell Williams for 8 yards to the Atl37. Tackled by Robert Alford.","(10:38) Philip Rivers pass to the middle to Antonio Gates for 13 yards to the Atl45. Tackled by Keanu Neal.","(11:24) Philip Rivers sacked at SD42 for a loss of 5 yards by Adrian Clayborn.","(12:06) Philip Rivers pass to the left to Melvin Gordon for 4 yards to the SD47. Tackled by Robert Alford.","(12:33) Philip Rivers pass to the left to Travis Benjamin for 13 yards to the SD43. Tackled by Ricardo Allen.","(12:54) Penalty: False Start on San Diego (King Dunlap) -4 yards.","(13:15) Philip Rivers pass to the left to Melvin Gordon for 9 yards to the SD34. Tackled by De'Vondre Campbell.","(13:23) Philip Rivers incomplete pass to the right intended for Tyrell Williams defensed by Desmond Trufant.","(13:23) Matt Bosher kicks off to the endzone. Touchback.","(13:28) Matt Bryant 31 yard field goal attempt is GOOD. Holder: Matt Bosher.","(13:35) Matt Ryan incomplete pass to the left intended for Devonta Freeman defensed by Trevor Williams.","(14:21) Matt Ryan sacked at SD13 for a loss of 3 yards by Joey Bosa.","(15:00) Devonta Freeman rush to the right for 1 yard to the SD10. Tackled by Damion Square.","(0:41) Devonta Freeman rush to the left for 15 yards to the SD11. Tackled by Melvin Ingram.","(0:48) Matt Ryan incomplete pass to the right intended for Jacob Tamme.","(1:23) Devonta Freeman rush to the left for 14 yards to the SD26. Tackled by Denzel Perryman.","(1:52) Matt Ryan pass to the left to Devonta Freeman for 15 yards to the SD40. Tackled by Kyle Emanuel and Melvin Ingram.","(2:19) Matt Ryan rush to the right for 1 yard to the Atl45. Tackled by Joey Bosa.","(3:00) Matt Ryan rush to the right for 7 yards to the Atl44. Tackled by Joey Bosa.","(3:38) Devonta Freeman rush to the left for 2 yards to the Atl37. Tackled by Korey Toomer and Melvin Ingram.","(4:17) Devonta Freeman rush to the left for 8 yards to the Atl35. Tackled by Dexter McCoil and Jatavis Brown.","(4:50) Devonta Freeman rush to the left for 2 yards to the Atl27. Tackled by Jatavis Brown.","(4:50) Josh Lambo kicks off to the endzone. Touchback.","(4:54) Josh Lambo 37 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(4:58) Philip Rivers incomplete pass to the right intended for Antonio Gates.","(5:05) Philip Rivers incomplete pass to the right intended for Hunter Henry.","(5:47) Melvin Gordon rush to the right for 8 yards to the Atl19. Tackled by Philip Wheeler.","(6:28) Kenneth Farrow rush to the right for 4 yards to the Atl27. Tackled by Brooks Reed.","(6:53) Kenneth Farrow rush to the right for 9 yards to the Atl31. Tackled by Philip Wheeler.","(7:36) Philip Rivers pass to the right to Melvin Gordon for 12 yards to the Atl40. Tackled by Deion Jones and De'Vondre Campbell.","(8:05) Philip Rivers pass to the right to Dontrelle Inman for 17 yards to the SD48. Tackled by Robert Alford.","(8:15) Matt Bosher punts for 43 yards to SD16. No return. Penalty: FC Interference on Atlanta (Robenson Therezie) 15 yards.","(9:01) Matt Ryan sacked at Atl41 for a loss of 7 yards by Joey Bosa.","(9:09) Matt Ryan incomplete pass to the right intended for Aldrick Robinson.","(9:45) Devonta Freeman rush to the left for no gain to the Atl48. Tackled by Melvin Ingram.","(10:22) Matt Ryan pass to the left to Devonta Freeman for 6 yards to the Atl48. Tackled by Korey Toomer.","(11:03) Devonta Freeman rush to the right for 3 yards to the Atl42. Tackled by Denzel Perryman.","(11:33) Matt Ryan pass to the right to Patrick DiMarco for 3 yards to the Atl39. Tackled by Dwight Lowery.","(12:10) Tevin Coleman rush to the right for 17 yards to the Atl36. Tackled by Dexter McCoil.","(12:10) Penalty: False Start on Atlanta (Chris Chester) -5 yards.","(12:21) Drew Kaser punts for 48 yards to Atl34. Eric Weems - no return. Tackled by Tourek Williams and Joshua Perry. Penalty: Holding on Atlanta (Justin Hardy) -10 yards.","(12:26) Philip Rivers incomplete pass to the right intended for Dontrelle Inman defensed by Brian Poole.","(13:09) Melvin Gordon rush to the left for 7 yards to the SD18. Tackled by De'Vondre Campbell.","(13:14) Philip Rivers incomplete pass to the middle intended for Hunter Henry defensed by Jonathan Babineaux.","(13:23) Matt Bosher punts for 58 yards to SD11. No return.","(13:26) Matt Ryan incomplete pass to the right intended for Julio Jones.","(13:56) Matt Ryan pass to the right to Julio Jones for 11 yards to the Atl31. Tackled by Craig Mager.","(14:30) Matt Ryan pass to the left to Mohamed Sanu for 5 yards to the Atl20. Tackled by Dexter McCoil.","(15:00) Penalty: Holding on Atlanta (Andy Levitre) -10 yards.","(15:00) Josh Lambo kicks off to the endzone. Touchback.","(0:34) Matt Ryan sacked at Atl31 for a loss of 7 yards by Melvin Ingram.","(0:37) Matt Ryan incomplete pass to the left intended for Julio Jones.","(0:57) Matt Ryan pass to the middle to Devonta Freeman for 12 yards to the Atl38. Tackled by Casey Hayward.","(1:02) Josh Lambo kicks off to the Atl12. Patrick DiMarco return for 14 yards to Atl26. Tackled by Dexter McCoil.","(1:02) Josh Lambo extra point is good.","(1:06) Melvin Gordon rush to the left for 3 yards for a TOUCHDOWN.","(1:55) Philip Rivers pass to the right to Hunter Henry for 16 yards to the Atl3. Tackled by Ricardo Allen and Keanu Neal.","(1:55) Two Minute Warning.","(2:03) Philip Rivers pass to the left to Travis Benjamin for 21 yards to the Atl19. Tackled by Keanu Neal.","(2:08) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(2:51) Melvin Gordon rush to the right for 3 yards to the Atl40. Tackled by De'Vondre Campbell.","(3:29) Philip Rivers pass to the left to Tyrell Williams for 38 yards to the Atl43. Tackled by Ricardo Allen.","(3:47) Penalty: False Start on San Diego (Joe Barksdale) -5 yards.","(4:31) Melvin Gordon rush to the left for a loss of 1 yard to the SD24. Tackled by De'Vondre Campbell.","(4:31) Matt Bosher kicks off to the endzone. Touchback.","(4:31) Matt Bryant extra point is good.","(4:41) Philip Rivers sacked at SD10 for a loss of 7 yards by Vic Beasley Jr.. FUMBLE, recovered by Atl (Adrian Clayborn) and returned for 5 yards for a TOUCHDOWN.","(5:03) Penalty: Illegal Substitution on San Diego -5 yards.","(5:34) Philip Rivers sacked at SD22 for a loss of 5 yards by Brooks Reed.","(5:34) Atlanta Falcons timeout.","(6:07) Melvin Gordon rush to the right for 2 yards to the SD27. Tackled by Brooks Reed.","(6:07) Matt Bosher kicks off to the endzone. Touchback.","(6:07) Matt Bryant extra point is good.","(6:15) Tevin Coleman rush to the right for 30 yards for a TOUCHDOWN.","(6:39) Tevin Coleman rush to the right for 8 yards to the SD30. Tackled by Denzel Perryman.","(7:12) Matt Ryan pass to the middle to Julio Jones for 14 yards to the SD38. Tackled by Dwight Lowery.","(7:56) Tevin Coleman rush to the right for a loss of 2 yards to the Atl48. Tackled by Kyle Emanuel and Denzel Perryman.","(8:05) Drew Kaser punts for 43 yards to SD50. No return.","(8:12) Philip Rivers incomplete pass to the left intended for Antonio Gates defensed by Robert Alford.","(9:01) Melvin Gordon rush to the left for a loss of 1 yard to the SD7. Tackled by De'Vondre Campbell and Philip Wheeler.","(9:04) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(9:06) Matt Bosher kicks off to the SD8. Griff Whalen - no return.","(9:06) Matt Bryant extra point is good.","(9:12) Matt Ryan pass to the right to Jacob Tamme for 17 yards for a TOUCHDOWN.","(9:48) Matt Ryan pass to the right to Tevin Coleman for 10 yards to the SD17. Tackled by Korey Toomer.","(10:01) Penalty: Holding on Atlanta (Chris Chester) -10 yards.","(10:42) Matt Ryan pass to the right to Devonta Freeman for 2 yards to the SD17. Tackled by Melvin Ingram.","(10:55) Penalty: False Start on Atlanta (Ryan Schraeder) -5 yards.","(11:41) Matt Ryan pass to the right to Julio Jones for 50 yards to the SD14. Tackled by Dwight Lowery.","(12:16) Tevin Coleman rush to the left for 2 yards to the Atl36. Tackled by Brandon Mebane.","(12:53) Tevin Coleman rush to the right for 6 yards to the Atl34. Tackled by Casey Hayward.","(13:29) Tevin Coleman rush to the left for 3 yards to the Atl28. Tackled by Kyle Emanuel and Brandon Mebane.","(13:29) Josh Lambo kicks off to the endzone. Touchback.","(13:34) Josh Lambo 40 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(13:38) Philip Rivers incomplete pass to the right intended for Antonio Gates.","(13:43) Philip Rivers incomplete pass to the left intended for Melvin Gordon.","(14:22) Melvin Gordon rush to the right for 3 yards to the Atl22. Tackled by Deion Jones.","(14:54) Philip Rivers pass to the right to Dontrelle Inman for 24 yards to the Atl25. Tackled by Philip Wheeler.","(15:00) Travis Benjamin incomplete pass to the right intended for Tyrell Williams.","(0:33) Philip Rivers pass to the middle to Antonio Gates for 6 yards to the Atl49. Tackled by De'Vondre Campbell and Deion Jones.","(1:17) Melvin Gordon rush to the right for 5 yards to the SD45. Tackled by De'Vondre Campbell.","(1:55) Melvin Gordon rush to the left for 3 yards to the SD40. Tackled by Courtney Upshaw.","(2:30) Philip Rivers pass to the left to Tyrell Williams for 20 yards to the SD37. Tackled by Ricardo Allen.","(2:34) Matt Bosher kicks off to the SD-2. Griff Whalen return for 19 yards to SD17. Tackled by Austin Hooper and LaRoy Reynolds.","(2:38) Matt Bryant 27 yard field goal attempt is GOOD. Holder: Matt Bosher.","(2:43) Matt Ryan incomplete pass to the left intended for Jacob Tamme defensed by Dwight Lowery.","(3:23) Devonta Freeman rush to the left for 1 yard to the SD9. Tackled by Casey Hayward.","(3:30) Matt Ryan incomplete pass to the right intended for Mohamed Sanu.","(3:42) Philip Rivers pass intended for Dexter McCluster INTERCEPTED by Deion Jones and returned for 42 yards. Tackled by Tyrell Williams.","(4:23) Dexter McCluster rush to the left for a loss of 1 yard to the SD46. Tackled by Keanu Neal.","(5:01) Philip Rivers pass to the right to Travis Benjamin for 11 yards to the SD47. Tackled by Desmond Trufant.","(5:47) Philip Rivers pass to the middle to Melvin Gordon for 9 yards to the SD36. Tackled by Courtney Upshaw.","(6:26) Melvin Gordon rush to the left for 2 yards to the SD27. Tackled by Courtney Upshaw.","(6:26) Matt Bosher kicks off to the endzone. Touchback.","(6:31) Matt Bryant 42 yard field goal attempt is GOOD. Holder: Matt Bosher.","(6:35) Matt Ryan incomplete pass to the left intended for Mohamed Sanu defensed by Craig Mager.","(7:11) Tevin Coleman rush to the left for no gain to the SD24. Tackled by Melvin Ingram.","(7:35) Matt Ryan pass to the right to Levine Toilolo for 5 yards to the SD24. Tackled by Steve Williams.","(8:02) Matt Ryan pass to the right to Julio Jones for 19 yards to the SD29. Tackled by Steve Williams and Kyle Emanuel.","(8:25) Matt Ryan pass to the left to Julio Jones for 16 yards to the SD48. Tackled by Dexter McCoil.","(9:07) Matt Ryan pass to the right to Justin Hardy for 2 yards to the Atl36. Tackled by Casey Hayward.","(9:45) Devonta Freeman rush to the right for a loss of 1 yard to the Atl34. Tackled by Brandon Mebane.","(10:24) Matt Ryan pass to the right to Julio Jones for 8 yards to the Atl35. Tackled by Denzel Perryman.","(10:55) Devonta Freeman rush to the left for 2 yards to the Atl27. Tackled by Brandon Mebane and Joey Bosa.","(10:55) Josh Lambo kicks off to the endzone. Touchback.","(10:55) Josh Lambo extra point is good.","(10:59) Melvin Gordon rush to the left for 2 yards for a TOUCHDOWN.","(11:38) Melvin Gordon rush to the left for 8 yards to the Atl2. Tackled by Ricardo Allen.","(12:17) Philip Rivers pass to the right to Tyrell Williams for 49 yards to the Atl10. Tackled by Ricardo Allen.","(12:56) Melvin Gordon rush to the left for 5 yards to the SD41. Tackled by Robert Alford and Vic Beasley Jr..","(13:33) Philip Rivers pass to the right to Tyrell Williams for 6 yards to the SD36. Tackled by Keanu Neal.","(14:17) Philip Rivers pass to the middle to Antonio Gates for 5 yards to the SD30. Tackled by Deion Jones.","(15:00) Melvin Gordon rush to the right for no gain to the SD25. Tackled by Grady Jarrett and De'Vondre Campbell.","(15:00) Matt Bosher kicks off to the endzone. Touchback."]