["(0:11) Drew Brees pass to the right to Michael Thomas for 19 yards to the NO50. Tackled by Steven Nelson.","(0:11) Drew Brees incomplete pass to the middle.","(0:28) Drew Brees pass to the right to Willie Snead for 11 yards to the NO31. Tackled by Steven Nelson.","(0:28) Penalty: Delay of Game on New Orleans (Drew Brees) -5 yards.","(0:28) Cairo Santos kicks off to the endzone. Touchback.","(0:33) Cairo Santos 41 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(0:33) Kansas City Chiefs timeout.","(1:17) Spencer Ware rush up the middle for 1 yard to the NO23. Tackled by Paul Kruger.","(2:00) Spencer Ware rush up the middle for 4 yards to the NO24. Tackled by Roman Harper.","(2:00) Two Minute Warning.","(2:18) Charcandrick West rush up the middle for 1 yard to the NO28. Tackled by Tyeler Davison.","(2:26) Tyreek Hill rush to the right for 5 yards to the NO44. Tackled by Vonn Bell and Nate Stupar. Penalty: Unnecessary Roughness on New Orleans (Nick Fairley) 15 yards.","(2:26) New Orleans Saints timeout.","(2:30) Spencer Ware rush to the left for a loss of 3 yards to the NO49. Tackled by Cameron Jordan.","(2:33) Wil Lutz onside kickoff to the NO46. No return.","(2:33) Wil Lutz extra point is good.","(2:40) Drew Brees pass to the right to Brandon Coleman for 10 yards for a TOUCHDOWN.","(2:40) Kansas City Chiefs timeout.","(2:44) Drew Brees incomplete pass to the right intended for Travaris Cadet.","(2:46) Penalty: False Start on New Orleans (Travaris Cadet) -5 yards.","(3:19) Drew Brees pass to the right to Travaris Cadet for 3 yards to the KC5. Tackled by Frank Zombo.","(3:28) Drew Brees pass to the left to Michael Thomas for 21 yards to the KC8.","(3:48) Drew Brees pass to the left to Michael Thomas for 5 yards to the KC29. Tackled by D.J. White.","(4:16) Drew Brees pass to the middle to Brandin Cooks for 14 yards to the KC34. Tackled by Marcus Peters.","(4:45) Drew Brees pass to the right to Travaris Cadet for 4 yards to the KC48. Tackled by Marcus Peters.","(4:49) Drew Brees pass to the right to Brandin Cooks for 7 yards to the NO48. Tackled by Ron Parker.","(4:56) Drew Brees pass to the right to Michael Thomas for 21 yards to the NO41. Tackled by Eric Berry.","(5:00) Drew Brees incomplete pass to the left intended for Travaris Cadet.","(5:07) Dustin Colquitt punts for 54 yards to NO0. Touchback.","(5:13) Alex Smith incomplete pass to the left intended for Charcandrick West.","(5:13) Kansas City Chiefs timeout.","(5:50) Spencer Ware rush up the middle for 3 yards to the KC46. Tackled by Craig Robertson and Jairus Byrd.","(6:31) Spencer Ware rush to the right for 4 yards to the KC43. Tackled by Darryl Tapp.","(6:44) New Orleans Saints timeout.","(6:44) Alex Smith pass to the right to Chris Conley for 18 yards to the KC39. Tackled by B.W. Webb.","(7:03) Penalty: False Start on Kansas City (Chris Conley) -5 yards.","(7:46) Spencer Ware rush up the middle for a loss of 3 yards to the KC26. Tackled by Kenny Vaccaro.","(8:26) Spencer Ware rush to the left for 1 yard to the KC29. Tackled by Craig Robertson.","(8:37) Mark Ingram rush up the middle for 6 yards to the KC7. Tackled by Ron Parker. FUMBLE, recovered by KC (Marcus Peters) and returned for 21 yards. Tackled by Willie Snead and Michael Thomas.","(9:16) Drew Brees pass to the left to Willie Snead for 12 yards to the KC13. Tackled by Steven Nelson.","(9:56) Drew Brees pass to the right to Mark Ingram for 2 yards to the KC25. Tackled by Ramik Wilson and Frank Zombo.","(10:02) Drew Brees incomplete pass to the right intended for Brandin Cooks.","(10:37) Drew Brees pass to the left to Michael Thomas for 23 yards to the KC27. Tackled by D.J. White.","(11:09) Mark Ingram rush to the left for 5 yards to the NO50. Tackled by Ramik Wilson.","(11:39) Mark Ingram rush up the middle for 6 yards to the NO45. Tackled by Marcus Peters.","(12:11) Drew Brees pass to the right to Josh Hill for 6 yards to the NO39. Tackled by Ramik Wilson.","(12:21) Dustin Colquitt punts for 39 yards to NO22. Tommylee Lewis return for 11 yards to NO33. Tackled by James Winchester.","(12:27) Alex Smith incomplete pass to the right intended for Demetrius Harris.","(13:11) Charcandrick West rush up the middle for 2 yards to the KC39. Tackled by Darryl Tapp.","(13:42) Alex Smith pass to the right to Charcandrick West for 3 yards to the KC37. Tackled by Nate Stupar.","(14:22) Alex Smith pass to the right to Jeremy Maclin for 13 yards to the KC34. Tackled by B.W. Webb.","(15:00) Spencer Ware rush up the middle for 1 yard to the KC21. Tackled by David Onyemata.","(0:12) Spencer Ware rush to the left for 8 yards to the KC20. Tackled by Craig Robertson.","(0:55) Spencer Ware rush to the left for 7 yards to the KC12. Tackled by John Jenkins.","(1:03) Thomas Morstead punts for 50 yards to KC5. No return.","(1:34) Drew Brees pass to the left to Willie Snead for 6 yards to the NO45. Tackled by Eric Berry.","(2:12) Tim Hightower rush to the left for 3 yards to the NO39. Tackled by Chris Jones and Frank Zombo.","(2:17) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(2:50) Tim Hightower rush up the middle for 6 yards to the NO36. Tackled by Daniel Sorensen.","(3:21) Tim Hightower rush to the right for 5 yards to the NO30. Tackled by Derrick Johnson.","(3:21) Cairo Santos kicks off to the endzone. Touchback.","(3:26) Cairo Santos 39 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(4:07) Charcandrick West rush to the right for no gain to the NO21. Tackled by Vonn Bell.","(4:22) Alex Smith pass to the right to Albert Wilson for 4 yards to the NO21. Tackled by Nate Stupar.","(5:01) Spencer Ware rush up the middle for 4 yards to the NO25. Tackled by Nate Stupar.","(5:36) Alex Smith pass to the right to Jeremy Maclin for 11 yards to the NO29. Tackled by Jairus Byrd.","(6:18) Alex Smith pass to the right to De'Anthony Thomas for 15 yards to the NO40. Tackled by Jairus Byrd.","(6:51) Alex Smith pass to the left to Jeremy Maclin for 8 yards to the KC45. Tackled by Kenny Vaccaro.","(6:57) Wil Lutz kicks off to the KC18. Demetrius Harris return for 19 yards to KC37. Tackled by Chris McCain.","(6:57) Wil Lutz extra point is good.","(7:02) Drew Brees pass to the left to Mark Ingram for 3 yards for a TOUCHDOWN.","(7:41) Mark Ingram rush up the middle for 7 yards to the KC3. Tackled by Ron Parker.","(8:16) Drew Brees pass to the left to Mark Ingram for 7 yards to the KC10. Tackled by Derrick Johnson and Steven Nelson.","(8:23) New Orleans Saints timeout.","(9:13) Mark Ingram rush up the middle for a loss of 2 yards to the KC17. Tackled by Ramik Wilson and Eric Berry.","(9:53) Drew Brees pass to the right to Willie Snead for 7 yards to the KC15. Tackled by Ron Parker.","(10:10) Penalty: Offside on Kansas City (Tamba Hali) 5 yards.","(10:44) Mark Ingram rush up the middle for 5 yards to the KC27. Tackled by Ramik Wilson.","(11:08) Drew Brees pass to the left to Brandin Cooks for 7 yards to the KC32.","(11:44) Mark Ingram rush to the right for 4 yards to the KC39. Tackled by Dee Ford and Chris Jones.","(12:17) Tim Hightower rush up the middle for 13 yards to the KC43. Tackled by Steven Nelson.","(12:55) Drew Brees pass to the left to Tim Hightower for 5 yards to the NO44. Tackled by Daniel Sorensen.","(13:27) Mark Ingram rush to the left for 2 yards to the NO39. Tackled by Derrick Johnson.","(13:55) John Kuhn rush up the middle for 3 yards to the NO37. Tackled by Derrick Johnson.","(14:31) Drew Brees pass to the left to Brandin Cooks for 3 yards to the NO34. Tackled by D.J. White.","(15:00) Mark Ingram rush up the middle for 6 yards to the NO31. Tackled by Ramik Wilson.","(15:00) Cairo Santos kicks off to the endzone. Touchback.","(0:23) Alex Smith rush up the middle for a loss of 1 yard to the KC2.","(0:46) Alex Smith rush up the middle for a loss of 1 yard to the KC3.","(0:55) Thomas Morstead punts for 48 yards to KC4. No return.","(1:00) Drew Brees incomplete pass to the left intended for Michael Thomas.","(1:05) Penalty: Delay of Game on New Orleans (Drew Brees) -5 yards.","(1:05) Drew Brees incomplete pass to the right intended for Willie Snead.","(1:29) Drew Brees pass to the left to Michael Thomas for 5 yards to the KC47. Tackled by D.J. White.","(2:00) Drew Brees pass to the middle to Coby Fleener for 14 yards to the NO48. Tackled by Ron Parker. FUMBLE, recovered by NO (Michael Thomas).","(2:00) Two Minute Warning.","(2:13) Drew Brees pass to the left to Coby Fleener for 30 yards to the NO34. Tackled by Ron Parker.","(2:23) Dustin Colquitt punts for 60 yards to NO5. Tommylee Lewis return for a loss of 1 yard to NO9. FUMBLE, recovered by NO (Tommylee Lewis).","(2:23) New Orleans Saints timeout.","(2:33) Alex Smith pass to the right to Spencer Ware for 8 yards to the KC35. Tackled by De'Vante Harris.","(2:38) Alex Smith incomplete pass to the right intended for Charcandrick West.","(2:42) Alex Smith incomplete pass to the right.","(2:46) Kansas City Chiefs timeout.","(3:13) Penalty: False Start on Kansas City (James O'Shaughnessy) -5 yards.","(4:01) Spencer Ware rush to the left for 11 yards to the KC32. Tackled by John Jenkins.","(4:47) Alex Smith pass to the middle to Demetrius Harris for 10 yards to the KC21. Tackled by Kenny Vaccaro and Craig Robertson.","(4:55) Thomas Morstead punts for 49 yards to KC11. Tyreek Hill - no return. Tackled by Brian Dixon.","(5:13) Drew Brees pass to the left to Willie Snead for 7 yards to the NO40. Tackled by Daniel Sorensen.","(5:54) Drew Brees pass to the left to Michael Thomas for 7 yards to the NO33. Tackled by Eric Berry.","(6:18) Penalty: Holding on New Orleans (Tim Lelito) -10 yards.","(6:24) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Ron Parker.","(6:53) Tim Hightower rush to the left for 12 yards to the NO36. Tackled by Eric Berry.","(7:02) Cairo Santos kicks off to the NO-2. Tommylee Lewis return for 26 yards to NO24. Tackled by Anthony Sherman.","(7:02) Cairo Santos extra point is good.","(7:09) Alex Smith pass to the left to Tyreek Hill for 38 yards for a TOUCHDOWN.","(7:45) Spencer Ware rush to the left for 11 yards to the NO38. Tackled by Vonn Bell.","(7:45) Kansas City Chiefs timeout.","(8:15) Alex Smith rush to the left for 6 yards to the NO34. Tackled by Nate Stupar. Penalty: Unnecessary Roughness on Kansas City (Charcandrick West) -15 yards.","(8:40) Penalty: Encroachment on New Orleans (Nick Fairley) 5 yards.","(9:24) Alex Smith pass to the left to De'Anthony Thomas for a loss of 3 yards to the NO45. Tackled by Ken Crawley.","(10:09) Alex Smith rush to the left for 3 yards to the NO42. Tackled by Kenny Vaccaro.","(10:43) Alex Smith pass to the middle to Travis Kelce for 14 yards to the KC40. Tackled by Jairus Byrd. Penalty: Unnecessary Roughness on New Orleans (Vonn Bell) 15 yards.","(11:19) Alex Smith pass to the left to Chris Conley for 11 yards to the KC26. Tackled by Ken Crawley.","(12:00) Jamaal Charles rush to the right for no gain to the KC15. Tackled by Craig Robertson.","(12:14) Thomas Morstead punts for 46 yards to KC15. No return.","(13:14) Drew Brees pass to the left to Michael Thomas for 9 yards to the NO39. Tackled by Daniel Sorensen.","(13:37) Drew Brees sacked at NO30 for a loss of 8 yards by Daniel Sorensen.","(14:15) Drew Brees pass to the right to Brandin Cooks for 6 yards to the NO38. Tackled by Ron Parker.","(14:33) Penalty: False Start on New Orleans (John Kuhn) -5 yards.","(15:00) Drew Brees pass to the left to Michael Thomas for 4 yards to the NO37. Tackled by D.J. White.","(0:14) Mark Ingram rush up the middle for 3 yards to the NO33. Tackled by Jaye Howard.","(0:46) Drew Brees pass to the right to Willie Snead for 5 yards to the NO30. Tackled by Ramik Wilson.","(0:46) Cairo Santos kicks off to the endzone. Touchback.","(0:46) Cairo Santos extra point is good.","(0:58) Drew Brees pass intended for Willie Snead INTERCEPTED by Daniel Sorensen defensed by Eric Berry and returned for 48 yards for a TOUCHDOWN.","(1:03) Drew Brees incomplete pass to the left intended for John Kuhn.","(1:43) Mark Ingram rush up the middle for 3 yards to the NO39. Tackled by Tamba Hali and Ramik Wilson.","(2:37) Penalty: False Start on New Orleans (Jahri Evans) -5 yards.","(2:37) Drew Brees pass to the right to Willie Snead for 15 yards to the NO41. Tackled by Tamba Hali.","(3:02) Penalty: False Start on New Orleans (Brandin Cooks) -5 yards.","(3:38) Drew Brees pass to the left to Mark Ingram for 8 yards to the NO31. Tackled by Tamba Hali and Eric Berry.","(4:07) Mark Ingram rush to the left for a loss of 2 yards to the NO23. Tackled by Frank Zombo.","(4:07) Cairo Santos kicks off to the endzone. Touchback.","(4:07) Cairo Santos extra point is good.","(4:16) Alex Smith pass to the left to Spencer Ware for 46 yards for a TOUCHDOWN.","(5:01) Tyreek Hill rush to the left for 18 yards to the NO46. Tackled by Nate Stupar.","(5:22) New Orleans Saints timeout.","(5:22) Alex Smith pass to the right to Jeremy Maclin for 8 yards to the KC36.","(6:01) Spencer Ware rush up the middle for 3 yards to the KC28. Tackled by Darryl Tapp.","(6:07) Alex Smith incomplete pass to the right intended for Travis Kelce defensed by Nate Stupar.","(6:07) Wil Lutz kicks off to the endzone. Touchback.","(6:07) Wil Lutz extra point is good.","(6:12) Drew Brees pass to the left to Brandin Cooks for 9 yards for a TOUCHDOWN.","(6:47) Drew Brees pass to the left to Brandin Cooks for 12 yards to the KC9. Tackled by Steven Nelson.","(7:32) Drew Brees pass to the right to Willie Snead for 17 yards to the KC21. Tackled by Steven Nelson.","(8:08) Drew Brees pass to the right to Willie Snead for 7 yards to the KC38. Tackled by Steven Nelson.","(8:40) Mark Ingram rush to the left for 2 yards to the KC45. Tackled by Daniel Sorensen.","(9:12) Mark Ingram rush up the middle for 5 yards to the KC47. Tackled by Jaye Howard.","(9:42) Drew Brees pass to the left to Michael Thomas for 16 yards to the NO48. Tackled by Steven Nelson.","(9:45) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by D.J. White.","(10:17) Mark Ingram rush up the middle for 5 yards to the NO32. Tackled by Jaye Howard.","(10:47) Mark Ingram rush up the middle for 7 yards to the NO27. Tackled by Eric Berry.","(10:56) Dustin Colquitt punts for 38 yards to NO0. Touchback.","(11:02) Alex Smith incomplete pass to the left intended for Demetrius Harris.","(11:08) Alex Smith incomplete pass to the right intended for Jeremy Maclin.","(11:49) Charcandrick West rush up the middle for 2 yards to the NO38. Tackled by Tyeler Davison.","(12:24) Spencer Ware rush to the left for 12 yards to the NO40. Tackled by Vonn Bell.","(13:04) Spencer Ware rush to the right for 11 yards to the KC48. Tackled by Nate Stupar.","(13:41) Spencer Ware rush to the right for 2 yards to the KC37. Tackled by Darryl Tapp and Craig Robertson.","(14:24) Alex Smith pass to the right to Travis Kelce for 10 yards to the KC35. Tackled by Kenny Vaccaro.","(15:00) Alex Smith pass to the right to Anthony Sherman for no gain to the KC25. Tackled by Nate Stupar.","(15:00) Wil Lutz kicks off to the endzone. Touchback."]