["(0:12) Tom Brady rush up the middle for a loss of 1 yard to the NE44.","(0:16) Landry Jones incomplete pass to the middle intended for Darrius Heyward-Bey.","(1:00) Landry Jones pass to the right to Sammie Coates for 4 yards to the NE45. Tackled by Jamie Collins.","(1:06) Landry Jones pass to the left to Le'Veon Bell for 5 yards to the NE49. Tackled by Dont'a Hightower.","(1:13) Penalty: Pass Interference on Pittsburgh (Sammie Coates) -10 yards.","(1:17) Landry Jones incomplete pass to the left intended for Cobi Hamilton.","(1:41) Landry Jones pass to the right to Le'Veon Bell for 6 yards to the NE44. Tackled by Jamie Collins.","(1:51) Landry Jones pass to the right to Darrius Heyward-Bey for 7 yards to the Pit50. Tackled by Justin Coleman.","(1:56) Landry Jones incomplete pass to the right intended for Le'Veon Bell.","(2:00) Landry Jones incomplete pass to the right intended for Darrius Heyward-Bey.","(2:00) Two Minute Warning.","(2:08) Landry Jones pass to the left to Xavier Grimble for 9 yards to the Pit43. Tackled by Justin Coleman.","(2:33) Landry Jones pass to the right to Le'Veon Bell for 3 yards to the Pit34. Tackled by Dont'a Hightower.","(3:02) Landry Jones pass to the left to Le'Veon Bell for 5 yards to the Pit31. Tackled by Jamie Collins and Patrick Chung.","(3:13) Ryan Allen punts for 28 yards to Pit26. No return.","(3:54) LeGarrette Blount rush to the left for 1 yard to the NE46. Tackled by William Gay.","(4:38) LeGarrette Blount rush up the middle for 7 yards to the NE45. Tackled by Jarvis Jones and Ricardo Mathews.","(5:19) LeGarrette Blount rush to the left for 1 yard to the NE38. Tackled by Ricardo Mathews.","(5:29) Jordan Berry punts for 52 yards to NE31. Danny Amendola return for 6 yards to NE37. Tackled by Steven Johnson.","(5:38) Landry Jones incomplete pass to the left intended for Antonio Brown.","(6:16) Landry Jones pass to the left to Antonio Brown for 7 yards to the Pit17. Tackled by Malcolm Butler.","(6:24) Landry Jones incomplete pass to the left intended for Xavier Grimble defensed by Eric Rowe.","(6:24) Pittsburgh Steelers timeout.","(6:57) Penalty: Holding on Pittsburgh (Maurkice Pouncey) -10 yards.","(7:04) Ryan Allen punts for 57 yards to Pit0. Touchback.","(7:16) Tom Brady incomplete pass to the right intended for Malcolm Mitchell.","(7:58) LeGarrette Blount rush to the right for 6 yards to the NE43. Tackled by Lawrence Timmons.","(8:38) LeGarrette Blount rush to the left for 3 yards to the NE37. Tackled by William Gay and Ryan Shazier.","(9:00) Penalty: Holding on New England (David Andrews) -10 yards.","(9:05) 54 yard field goal attempt by Chris Boswell is NO GOOD. Holder: Jordan Berry.","(9:14) Landry Jones incomplete pass to the left intended for Le'Veon Bell.","(10:05) Landry Jones pass to the left to Jesse James for 8 yards to the NE36. Tackled by Jamie Collins.","(10:37) Le'Veon Bell rush to the left for a loss of 1 yard to the NE44. Tackled by Alan Branch.","(10:50) Jordan Berry punts for 43 yards to NE29. Julian Edelman return for 12 yards to NE41. Tackled by Steven Johnson. FUMBLE, recovered by Pit (Greg Warren). Tackled by Julian Edelman.","(10:55) Landry Jones incomplete pass to the left intended for Darrius Heyward-Bey defensed by Justin Coleman.","(11:36) Le'Veon Bell rush to the right for 3 yards to the Pit28. Tackled by Malcom Brown.","(11:44) Landry Jones incomplete pass to the left intended for Cobi Hamilton defensed by Patrick Chung.","(11:44) Stephen Gostkowski kicks off to the endzone. Touchback.","(11:44) Stephen Gostkowski extra point is good.","(11:47) LeGarrette Blount rush to the left for 5 yards for a TOUCHDOWN.","(12:21) Tom Brady pass to the left to Rob Gronkowski for 37 yards to the Pit5. Tackled by Artie Burns.","(12:58) Tom Brady pass to the right to Rob Gronkowski for 7 yards to the Pit42. Tackled by Lawrence Timmons.","(13:33) LeGarrette Blount rush to the left for 4 yards to the Pit49. Tackled by Lawrence Timmons.","(14:09) LeGarrette Blount rush to the left for 11 yards to the NE47. Tackled by Artie Burns and Jarvis Jones.","(14:44) Tom Brady pass to the left to Julian Edelman for 11 yards to the NE36. Tackled by Ross Cockrell.","(14:44) Chris Boswell kicks off to the endzone. Touchback.","(14:49) Chris Boswell 44 yard field goal attempt is GOOD. Holder: Jordan Berry.","(14:54) Landry Jones incomplete pass to the right intended for Antonio Brown.","(15:00) Landry Jones incomplete pass to the right intended for Le'Veon Bell defensed by Patrick Chung.","(0:02) Le'Veon Bell rush to the left for no gain to the NE26. Tackled by Dont'a Hightower.","(0:43) Landry Jones pass to the right to Cobi Hamilton for 17 yards to the NE26. Tackled by Logan Ryan.","(1:26) Le'Veon Bell rush to the left for 2 yards to the NE43. Tackled by Patrick Chung.","(1:50) Penalty: False Start on Pittsburgh (Alejandro Villanueva) -5 yards.","(2:29) Le'Veon Bell rush to the right for 3 yards to the NE40. Tackled by Malcom Brown and Patrick Chung.","(3:13) Landry Jones pass to the left to Cobi Hamilton for 15 yards to the NE43. Tackled by Devin McCourty.","(3:51) Landry Jones pass to the left to Le'Veon Bell for 1 yard to the Pit42. Tackled by Patrick Chung.","(4:31) Landry Jones pass to the right to Cobi Hamilton for 4 yards to the Pit41. Tackled by Eric Rowe.","(4:57) Penalty: False Start on Pittsburgh (Xavier Grimble) -5 yards.","(5:32) Le'Veon Bell rush to the left for 4 yards to the Pit42. Tackled by Patrick Chung.","(6:10) Landry Jones pass to the right to Antonio Brown for 6 yards to the Pit38. Tackled by Malcolm Butler.","(6:19) Stephen Gostkowski kicks off to the Pit0. Justin Gilbert return for 32 yards to Pit32. Tackled by Geneo Grissom.","(6:19) Stephen Gostkowski extra point is NO GOOD.","(6:27) Tom Brady pass to the middle to Rob Gronkowski for 36 yards for a TOUCHDOWN.","(7:04) Tom Brady pass to the right to Julian Edelman for 3 yards to the Pit36. Tackled by Ross Cockrell.","(7:40) LeGarrette Blount rush up the middle for no gain to the Pit39. Tackled by Stephon Tuitt.","(8:20) LeGarrette Blount rush to the left for 25 yards to the Pit39. Tackled by Robert Golden and Ryan Shazier.","(8:44) LeGarrette Blount rush up the middle for 11 yards to the NE36. Tackled by Mike Mitchell.","(8:44) Chris Boswell kicks off to the endzone. Touchback.","(8:49) Chris Boswell 46 yard field goal attempt is GOOD. Holder: Jordan Berry.","(8:57) Landry Jones incomplete pass to the left intended for Xavier Grimble defensed by Malcolm Butler.","(9:38) Le'Veon Bell rush to the left for 1 yard to the NE28. Tackled by Jamie Collins and Chris Long.","(10:27) Landry Jones pass to the right to Le'Veon Bell for 5 yards to the NE29. Tackled by Eric Rowe and Patrick Chung.","(11:08) Le'Veon Bell rush up the middle for 9 yards to the NE34. Tackled by Devin McCourty.","(11:42) Le'Veon Bell rush to the left for 2 yards to the NE43. Tackled by Anthony Johnson and Alan Branch.","(11:42) Pittsburgh Steelers timeout.","(12:15) Le'Veon Bell rush to the right for 11 yards to the NE45. Tackled by Patrick Chung.","(12:54) Antonio Brown rush to the left for 13 yards to the Pit44.","(13:33) Le'Veon Bell rush to the left for 7 yards to the Pit31. Tackled by Chris Long and Logan Ryan.","(13:42) Ryan Allen punts for 43 yards to Pit34. No return. Penalty: Holding on Pittsburgh (Roosevelt Nix) -10 yards.","(14:20) Tom Brady pass to the middle to Martellus Bennett for 5 yards to the NE23. Tackled by William Gay.","(14:48) Tom Brady rush up the middle for 3 yards to the NE18. Tackled by Jarvis Jones and Anthony Chickillo.","(14:54) Penalty: Holding on New England (Nate Solder) -10 yards.","(15:00) Tom Brady incomplete pass to the left intended for James White.","(15:00) Chris Boswell kicks off to the endzone. Touchback.","(0:02) Chris Boswell kicks off to the NE13. Danny Amendola return for 6 yards to NE19. Tackled by Steven Johnson.","(0:06) Chris Boswell 32 yard field goal attempt is GOOD. Holder: Jordan Berry.","(0:11) Landry Jones incomplete pass to the right intended for Darrius Heyward-Bey defensed by Malcolm Butler.","(0:15) Landry Jones pass to the left to Jesse James for 10 yards to the NE14. Tackled by Eric Rowe.","(0:15) Pittsburgh Steelers timeout.","(0:25) Landry Jones pass to the right to Le'Veon Bell for 22 yards to the NE24. Tackled by Malcolm Butler and Duron Harmon.","(0:25) Landry Jones incomplete pass to the middle.","(0:43) Landry Jones pass to the right to Darrius Heyward-Bey for 9 yards to the NE46. Tackled by Logan Ryan.","(0:49) Landry Jones incomplete pass to the right intended for Cobi Hamilton defensed by Logan Ryan.","(0:52) Landry Jones pass to the left to Le'Veon Bell for 7 yards to the Pit45. Tackled by Logan Ryan.","(0:55) Pittsburgh Steelers timeout.","(1:05) Landry Jones pass to the right to Le'Veon Bell for 10 yards to the Pit38. Tackled by Eric Rowe.","(1:47) Le'Veon Bell rush up the middle for 8 yards to the Pit28. Tackled by Patrick Chung and Anthony Johnson.","(1:56) Ryan Allen punts for 50 yards to Pit0. Touchback.","(2:00) Tom Brady incomplete pass to the right intended for Julian Edelman.","(2:00) Two Minute Warning.","(2:31) Tom Brady pass to the right to LeGarrette Blount for 7 yards to the NE50. Tackled by Vince Williams.","(3:11) LeGarrette Blount rush to the left for no gain to the NE43. Tackled by Vince Williams.","(3:56) Tom Brady rush to the right for 4 yards to the NE43.","(4:39) Tom Brady pass to the right to Julian Edelman for 7 yards to the NE39. Tackled by William Gay.","(4:42) Tom Brady incomplete pass to the left intended for James White defensed by L.T. Walton.","(4:47) 42 yard field goal attempt by Chris Boswell is NO GOOD. Holder: Jordan Berry.","(4:53) Landry Jones incomplete pass to the right intended for Antonio Brown.","(4:53) New England Patriots timeout.","(5:00) Penalty: Holding on Pittsburgh (Chris Hubbard) -10 yards.","(5:38) Landry Jones pass to the right to Antonio Brown for 5 yards to the NE14. Tackled by Eric Rowe.","(6:10) Le'Veon Bell rush to the right for 2 yards to the NE19. Tackled by Malcom Brown.","(6:56) Le'Veon Bell rush to the left for 12 yards to the NE21. Tackled by Eric Rowe.","(7:26) Landry Jones pass to the right to Le'Veon Bell for 4 yards to the NE48. Tackled by Jamie Collins. Penalty: Unnecessary Roughness on New England (Dont'a Hightower) 15 yards.","(8:10) Le'Veon Bell rush to the right for 1 yard to the Pit48. Tackled by Malcom Brown.","(8:16) Ryan Allen punts for 25 yards to Pit47. No return.","(8:22) Tom Brady incomplete pass to the right intended for Brandon Bolden.","(8:26) Tom Brady incomplete pass to the left intended for Martellus Bennett.","(9:02) LeGarrette Blount rush up the middle for 3 yards to the NE28. Tackled by Lawrence Timmons.","(9:02) Chris Boswell kicks off to the endzone. Touchback.","(9:02) Chris Boswell extra point is good.","(9:10) Landry Jones pass to the left to Darrius Heyward-Bey for 14 yards for a TOUCHDOWN.","(9:45) Le'Veon Bell rush to the left for 1 yard to the NE14. Tackled by Malcolm Butler.","(10:23) Le'Veon Bell rush up the middle for 5 yards to the NE15. Tackled by Elandon Roberts.","(10:47) Landry Jones pass to the right to Antonio Brown for 51 yards to the NE20. Tackled by Duron Harmon and Malcolm Butler.","(10:52) Landry Jones incomplete pass to the left intended for Xavier Grimble.","(10:58) Stephen Gostkowski kicks off to the Pit2. Fitzgerald Toussaint return for 27 yards to Pit29. Tackled by Nate Ebner.","(10:58) Stephen Gostkowski extra point is good.","(11:01) LeGarrette Blount rush to the left for 3 yards for a TOUCHDOWN.","(11:23) LeGarrette Blount rush to the left for 4 yards to the Pit3. Tackled by Robert Golden.","(11:59) LeGarrette Blount rush to the left for 6 yards to the Pit7. Tackled by Lawrence Timmons and James Harrison.","(12:46) Pittsburgh Steelers timeout.","(12:46) Tom Brady pass to the middle to Rob Gronkowski for 13 yards to the Pit13. Tackled by Mike Mitchell.","(13:18) Tom Brady pass to the right to Julian Edelman for 6 yards to the Pit26. Tackled by Artie Burns.","(13:18) Penalty: False Start on New England (Joe Thuney) -5 yards.","(13:24) Tom Brady incomplete pass to the left intended for James White defensed by Ryan Shazier.","(13:53) Tom Brady pass to the right to Chris Hogan for 13 yards to the Pit42. Tackled by Artie Burns. Penalty: Unnecessary Roughness on Pittsburgh (Artie Burns) 15 yards.","(14:26) Tom Brady pass to the middle to Julian Edelman for 11 yards to the NE45. Tackled by Lawrence Timmons.","(15:00) LeGarrette Blount rush up the middle for 9 yards to the NE34. Tackled by Lawrence Timmons.","(0:05) Tom Brady pass to the left to Julian Edelman for 9 yards to the NE25. Tackled by Lawrence Timmons.","(0:44) LeGarrette Blount rush to the right for no gain to the NE16. Tackled by Stephon Tuitt and Arthur Moats.","(0:52) Jordan Berry punts for 55 yards to NE16. No return.","(1:00) Penalty: Illegal Formation on Pittsburgh -5 yards.","(1:24) Landry Jones pass to the right to Antonio Brown for 9 yards to the Pit34. Tackled by Jamie Collins.","(2:05) Landry Jones pass to the middle to David Johnson for 5 yards to the Pit25. Tackled by Rob Ninkovich and Dont'a Hightower.","(2:13) Penalty: Pass Interference on Pittsburgh (Darrius Heyward-Bey) -10 yards.","(2:49) Le'Veon Bell rush up the middle for 2 yards to the Pit30. Tackled by Devin McCourty.","(2:55) Stephen Gostkowski kicks off to the Pit6. Fitzgerald Toussaint return for 22 yards to Pit28. Tackled by Patrick Chung and Devin McCourty.","(2:55) Stephen Gostkowski extra point is good.","(3:03) Tom Brady pass to the left to James White for 19 yards for a TOUCHDOWN.","(3:43) Tom Brady pass to the middle to Julian Edelman for 6 yards to the Pit19. Tackled by Lawrence Timmons.","(4:18) LeGarrette Blount rush to the right for 1 yard to the Pit25. Tackled by Robert Golden and Arthur Moats.","(4:55) Tom Brady rush to the left for 5 yards to the Pit26. Tackled by William Gay.","(5:35) LeGarrette Blount rush up the middle for a loss of 1 yard to the Pit31. Tackled by Jarvis Jones.","(6:12) LeGarrette Blount rush to the right for 9 yards to the Pit30. Tackled by Lawrence Timmons.","(6:44) Tom Brady pass to the right to James White for 13 yards to the Pit39.","(7:26) Tom Brady pass to the left to Julian Edelman for a loss of 2 yards to the NE48. Tackled by Lawrence Timmons.","(7:55) LeGarrette Blount rush to the right for 3 yards to the NE50. Tackled by Jarvis Jones.","(8:29) LeGarrette Blount rush up the middle for 9 yards to the NE47. Tackled by Mike Mitchell.","(9:02) LeGarrette Blount rush to the left for 7 yards to the NE38. Tackled by Jarvis Jones and Vince Williams.","(9:41) Tom Brady rush up the middle for 2 yards to the NE31. Tackled by Javon Hargrave.","(10:18) Tom Brady pass to the left to Julian Edelman for 9 yards to the NE29. Tackled by Vince Williams.","(10:24) Landry Jones pass intended for Antonio Brown INTERCEPTED by Malcolm Butler. No return. Touchback.","(11:07) Le'Veon Bell rush to the right for 3 yards to the NE16. Tackled by Jamie Collins and Rob Ninkovich.","(11:42) Le'Veon Bell rush up the middle for 6 yards to the NE19. Tackled by Malcom Brown and Rob Ninkovich.","(12:02) Penalty: False Start on Pittsburgh (Chris Hubbard) -5 yards.","(12:42) Landry Jones pass to the middle to Antonio Brown for 25 yards to the NE20. Tackled by Malcolm Butler and Devin McCourty.","(12:51) Tom Brady pass to the left to Chris Hogan for 12 yards to the NE44. Tackled by Jarvis Jones. FUMBLE, recovered by Pit (Jarvis Jones). Tackled by Chris Hogan.","(13:02) Jordan Berry punts for 45 yards to NE22. Julian Edelman return for 10 yards to NE32. Tackled by Tyler Matakevich.","(13:36) Landry Jones pass to the left to Xavier Grimble for 5 yards to the Pit33. Tackled by Patrick Chung.","(14:19) Le'Veon Bell rush up the middle for no gain to the Pit28. Tackled by Alan Branch. FUMBLE, recovered by Pit (Le'Veon Bell).","(15:00) Landry Jones pass to the left to Antonio Brown for 3 yards to the Pit28. Tackled by Patrick Chung.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback."]