["(0:03) Chandler Catanzaro 43 yard field goal attempt is GOOD. Holder: Matt Wile.","(0:27) Carson Palmer pass to the right to Larry Fitzgerald for 8 yards to the Sea25. Tackled by Deshawn Shead.","(0:31) Carson Palmer incomplete pass to the right intended for John Brown.","(0:35) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(0:41) Carson Palmer pass to the left to David Johnson for 29 yards to the Sea33. Tackled by Kam Chancellor.","(0:47) Carson Palmer incomplete pass to the right intended for Brittan Golden.","(0:47) Arizona Cardinals timeout.","(0:55) Carson Palmer pass to the left to David Johnson for 13 yards to the Ari38. Tackled by K.J. Wright and Bobby Wagner.","(1:00) Carson Palmer incomplete pass to the left intended for David Johnson.","(1:00) Steven Hauschka kicks off to the endzone. Touchback.","(1:00) Steven Hauschka extra point is NO GOOD.","(1:05) Russell Wilson pass to the left to Paul Richardson for 5 yards for a TOUCHDOWN.","(1:10) Russell Wilson pass to the left to Paul Richardson for 6 yards to the Ari5. Tackled by Brandon Williams.","(1:48) Russell Wilson rush to the left for a loss of 3 yards to the Ari11. Tackled by Sio Moore.","(1:54) Russell Wilson rush to the right for 7 yards to the Ari8. Tackled by D.J. Swearinger.","(1:54) Seattle Seahawks timeout.","(2:00) Russell Wilson pass to the left to Doug Baldwin for 31 yards to the Ari15. Tackled by Patrick Peterson.","(2:00) Two Minute Warning.","(2:22) Alex Collins rush up the middle for a loss of 1 yard to the Ari46. Tackled by Calais Campbell.","(2:31) Matt Wile punts for 39 yards to Sea45. No return. Penalty: Holding on Arizona (Kerwynn Williams) 10 yards.","(2:34) Carson Palmer incomplete pass to the right intended for David Johnson.","(2:34) Arizona Cardinals timeout.","(2:39) Carson Palmer pass to the left to Larry Fitzgerald for 4 yards to the Ari16. Tackled by Richard Sherman.","(2:39) Seattle Seahawks timeout.","(2:44) David Johnson rush to the right for a loss of 2 yards to the Ari12. Tackled by Kam Chancellor.","(2:48) Steven Hauschka kicks off to the Ari3. Patrick Peterson return for 11 yards to Ari14. Tackled by Jeron Johnson.","(2:48) Steven Hauschka extra point is good.","(2:56) Russell Wilson pass to the left to Jimmy Graham for 37 yards for a TOUCHDOWN.","(2:56) Seattle Seahawks timeout.","(3:04) Russell Wilson sacked at Ari37 for a loss of 2 yards by Alex Okafor.","(3:24) Russell Wilson pass to the left to Alex Collins for 9 yards to the Ari35. Tackled by Brandon Williams and Sio Moore.","(3:45) Russell Wilson pass to the left to Paul Richardson for 15 yards to the Ari44. Tackled by Brandon Williams and Kevin Minter.","(3:48) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(4:10) Russell Wilson pass to the right to Jermaine Kearse for 16 yards to the Sea41. Tackled by Patrick Peterson and Sio Moore.","(4:10) Chandler Catanzaro kicks off to the endzone. Touchback.","(4:15) Chandler Catanzaro 42 yard field goal attempt is GOOD. Holder: Matt Wile.","(4:19) Carson Palmer incomplete pass to the right intended for J.J. Nelson defensed by Richard Sherman.","(4:26) David Johnson rush to the right for 6 yards to the Sea24. Tackled by Bobby Wagner and Deshawn Shead.","(5:09) David Johnson rush to the left for no gain to the Sea30. Tackled by Deshawn Shead.","(5:17) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(5:43) Russell Wilson pass to the left to Alex Collins for 1 yard to the Sea30. Tackled by Brandon Williams.","(6:15) Alex Collins rush up the middle for 3 yards to the Sea29. Tackled by D.J. Swearinger and Sio Moore.","(6:41) Russell Wilson pass to the left to Doug Baldwin for 5 yards to the Sea26. Tackled by Brandon Williams.","(6:47) Chandler Catanzaro kicks off to the Sea-3. Paul Richardson return for 24 yards to Sea21. Tackled by Stepfan Taylor.","(6:47) Chandler Catanzaro extra point is good.","(6:50) David Johnson rush to the left for 1 yard for a TOUCHDOWN.","(7:27) David Johnson rush to the left for no gain to the Sea1. Tackled by Deshawn Shead and Bobby Wagner.","(8:00) Carson Palmer pass to the left to J.J. Nelson for 41 yards to the Sea1. Tackled by Richard Sherman.","(8:49) David Johnson rush to the right for 33 yards to the Sea42. Tackled by Steven Terrell.","(8:49) Steven Hauschka kicks off to the endzone. Touchback.","(8:49) Russell Wilson 2 pt conversion pass to Marcel Reece is GOOD.","(8:57) Russell Wilson pass to the left to Doug Baldwin for 42 yards for a TOUCHDOWN.","(9:02) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(9:36) Russell Wilson pass to the left to Doug Baldwin for 9 yards to the Ari42. Tackled by Justin Bethel.","(10:19) Russell Wilson rush to the left for 3 yards to the Sea49. Tackled by Sio Moore.","(11:01) Russell Wilson rush to the left for 7 yards to the Sea46. Tackled by Brandon Williams.","(11:36) Russell Wilson pass to the left to Jermaine Kearse for 9 yards to the Sea39. Tackled by D.J. Swearinger.","(11:46) Penalty: False Start on Seattle (Germain Ifedi) -5 yards.","(12:25) Russell Wilson pass to the right to Alex Collins for 2 yards to the Sea35. Tackled by Patrick Peterson.","(13:00) Alex Collins rush up the middle for 1 yard to the Sea33. Tackled by Markus Golden.","(13:32) Russell Wilson rush to the right for 7 yards to the Sea32. Tackled by Sio Moore.","(13:32) Chandler Catanzaro kicks off to the endzone. Touchback.","(13:32) Chandler Catanzaro extra point is good.","(13:36) David Johnson rush up the middle for 1 yard for a TOUCHDOWN.","(13:38) Penalty: Pass Interference on Seattle (Bobby Wagner) 2 yards.","(13:38) Arizona Cardinals timeout.","(14:13) David Johnson rush to the left for a loss of 2 yards to the Sea3. Tackled by Michael Bennett.","(15:00) Carson Palmer pass to the left to Larry Fitzgerald for 16 yards to the Sea1. Tackled by Deshawn Shead.","(0:19) David Johnson rush to the right for 5 yards to the Sea17. Tackled by K.J. Wright and Bobby Wagner.","(1:02) Carson Palmer pass to the right to Jermaine Gresham for 6 yards to the Sea22. Tackled by Bobby Wagner and Jeremy Lane.","(1:38) David Johnson rush to the left for 11 yards to the Sea28. Tackled by Ahtyba Rubin and Bobby Wagner.","(2:18) Carson Palmer pass to the right to John Brown for 12 yards to the Sea39. Tackled by Jeremy Lane.","(2:58) David Johnson rush to the left for 4 yards to the Ari49. Tackled by Deshawn Shead and Frank Clark.","(3:31) Carson Palmer pass to the right to Kerwynn Williams for 6 yards to the Ari45. Tackled by Mike Morgan.","(3:38) Jon Ryan punts for 6 yards to Ari39. Chandler Jones - no return.","(3:48) Russell Wilson incomplete pass to the middle intended for Doug Baldwin.","(4:20) Russell Wilson pass to the left to Doug Baldwin for a loss of 1 yard to the Ari45. Tackled by Justin Bethel.","(4:25) Russell Wilson incomplete pass to the left intended for Paul Richardson.","(5:00) Russell Wilson pass to the right to Doug Baldwin for 11 yards to the Ari44. Tackled by Patrick Peterson.","(5:47) Russell Wilson pass to the right to Doug Baldwin for 2 yards to the Sea45. Tackled by Patrick Peterson.","(5:50) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(5:55) 53 yard field goal attempt by Chandler Catanzaro is NO GOOD. Holder: Matt Wile.","(5:59) Carson Palmer incomplete pass to the right intended for J.J. Nelson.","(6:03) Carson Palmer incomplete pass to the left intended for Jermaine Gresham defensed by K.J. Wright.","(6:46) David Johnson rush up the middle for 3 yards to the Sea35. Tackled by Frank Clark.","(7:29) Carson Palmer pass to the right to Brittan Golden for 22 yards to the Sea38. Tackled by Richard Sherman.","(7:40) Penalty: Pass Interference on Seattle (Jeremy Lane) 13 yards.","(8:20) David Johnson rush to the left for 2 yards to the Ari27. Tackled by Jarran Reed.","(8:20) Steven Hauschka kicks off to the endzone. Touchback.","(8:20) Steven Hauschka extra point is good.","(8:25) Russell Wilson pass to the right to Jermaine Kearse for 2 yards for a TOUCHDOWN.","(9:01) Alex Collins rush to the left for 2 yards to the Ari2. Tackled by Sio Moore and Josh Mauro.","(9:37) Russell Wilson rush to the left for 4 yards to the Ari4. Tackled by Rodney Gunter.","(10:16) Alex Collins rush to the left for 6 yards to the Ari8. Tackled by Alex Okafor and Rodney Gunter.","(10:51) Alex Collins rush up the middle for 4 yards to the Ari14. Tackled by Josh Mauro and Sio Moore.","(11:31) Russell Wilson pass to the left to Paul Richardson for 16 yards to the Ari18. Tackled by Brandon Williams and Harlan Miller.","(11:39) Russell Wilson incomplete pass to the right intended for Doug Baldwin defensed by Justin Bethel.","(11:44) Russell Wilson incomplete pass to the left intended for Jermaine Kearse defensed by Justin Bethel.","(12:19) Russell Wilson pass to the right to Alex Collins for 7 yards to the Ari34. Tackled by Justin Bethel.","(12:56) Russell Wilson pass to the middle to Doug Baldwin for 14 yards to the Ari41. Tackled by D.J. Swearinger.","(13:33) Russell Wilson pass to the left to Doug Baldwin for 4 yards to the Sea45. Tackled by Brandon Williams.","(13:54) Penalty: Holding on Seattle (George Fant) -10 yards.","(14:27) Alex Collins rush to the left for 13 yards to the Ari49. Tackled by Kevin Minter.","(14:55) Doug Baldwin rush to the left for 4 yards to the Sea38. Tackled by Justin Bethel.","(15:00) Chandler Catanzaro kicks off to the Sea2. Paul Richardson return for 32 yards to Sea34. Tackled by Kerwynn Williams.","(0:15) Carson Palmer rush up the middle for a loss of 1 yard to the Ari24.","(0:15) Steven Hauschka kicks off to the endzone. Touchback.","(0:18) Steven Hauschka 27 yard field goal attempt is GOOD. Holder: Jon Ryan.","(0:22) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(0:27) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(0:32) Russell Wilson incomplete pass to the right intended for Doug Baldwin defensed by Justin Bethel.","(0:37) David Johnson rush to the right for a loss of 2 yards to the Ari9. FUMBLE, recovered by Sea (K.J. Wright). Tackled by Earl Watford.","(1:11) David Johnson rush to the right for 3 yards to the Ari11. Tackled by Deshawn Shead.","(1:15) Russell Wilson sacked at Ari8 for a loss of 7 yards by Rodney Gunter.","(1:15) Seattle Seahawks timeout.","(1:21) Russell Wilson incomplete pass to the right.","(2:00) Russell Wilson rush up the middle for no gain to the Ari1. Tackled by Calais Campbell and Scooby Wright III.","(2:00) Two Minute Warning.","(2:27) Thomas Rawls rush to the right for no gain to the Ari1. Tackled by Sio Moore and Corey Peters.","(2:46) Russell Wilson pass to the left to Tyler Lockett for 28 yards to the Ari1. Tackled by Brandon Williams.","(3:18) Russell Wilson pass to the left to Doug Baldwin for 31 yards to the Ari29. Tackled by Brandon Williams.","(3:53) Russell Wilson rush to the right for 15 yards to the Sea40. Tackled by Harlan Miller.","(3:53) Chandler Catanzaro kicks off to the endzone. Touchback.","(3:53) Chandler Catanzaro extra point is good.","(4:04) Carson Palmer pass to the right to J.J. Nelson for 80 yards for a TOUCHDOWN.","(4:44) David Johnson rush up the middle for 2 yards to the Ari20. Tackled by Frank Clark.","(5:23) David Johnson rush to the left for 9 yards to the Ari18. Tackled by Bobby Wagner and Jeron Johnson.","(5:29) Jon Ryan punts for 43 yards to Ari9. No return.","(5:34) Russell Wilson incomplete pass to the left intended for Thomas Rawls.","(6:15) Thomas Rawls rush to the left for 2 yards to the Sea48. Tackled by D.J. Swearinger.","(6:46) Russell Wilson pass to the left to Doug Baldwin for 4 yards to the Sea46. Tackled by Justin Bethel.","(7:24) Russell Wilson pass to the middle to Doug Baldwin for 10 yards to the Sea42. Tackled by D.J. Swearinger.","(8:04) Thomas Rawls rush to the left for 2 yards to the Sea32. Tackled by Josh Mauro and Calais Campbell.","(8:40) Thomas Rawls rush up the middle for 4 yards to the Sea30. Tackled by Corey Peters and Sio Moore.","(9:06) Russell Wilson pass to the right to Doug Baldwin for 9 yards to the Sea26. Tackled by Patrick Peterson.","(9:12) Matt Wile punts for 29 yards to Sea17. No return.","(9:33) Carson Palmer pass to the right to David Johnson for 4 yards to the Sea31. Tackled by Richard Sherman and K.J. Wright. Penalty: Taunting on Arizona (Jermaine Gresham) -15 yards.","(10:26) Carson Palmer pass to the right to David Johnson for a loss of 5 yards to the Sea35. Tackled by Bobby Wagner and K.J. Wright.","(11:06) David Johnson rush up the middle for a loss of 3 yards to the Sea30. Tackled by Michael Bennett.","(11:54) Carson Palmer pass to the right to Jermaine Gresham for 34 yards to the Sea27. Tackled by Jeron Johnson and Steven Terrell.","(12:32) Carson Palmer pass to the left to Larry Fitzgerald for 3 yards to the Ari39. Tackled by Bobby Wagner and Deshawn Shead.","(12:40) Jon Ryan punts for 45 yards to Ari36. No return.","(12:58) Russell Wilson pass to the right to Jimmy Graham for 6 yards to the Sea19.","(13:40) Russell Wilson sacked at Sea13 for a loss of 7 yards by Chandler Jones and Calais Campbell.","(14:22) Russell Wilson rush to the left for a loss of 4 yards to the Sea20. Tackled by Sio Moore.","(14:29) Matt Wile punts for 42 yards to Sea24. No return.","(15:00) David Johnson rush to the right for 2 yards to the Ari34. Tackled by Bobby Wagner.","(15:00) Penalty: False Start on Arizona (Evan Boehm) -5 yards.","(0:25) David Johnson rush to the left for 2 yards to the Ari37. Tackled by Kam Chancellor.","(0:25) Arizona Cardinals timeout.","(0:31) Larry Fitzgerald incomplete pass to the right intended for David Johnson.","(0:38) Steven Hauschka 45 yard field goal attempt is BLOCKED by Rodney Gunter.","(1:19) Russell Wilson sacked at Ari27 for a loss of 9 yards by Markus Golden.","(1:56) Doug Baldwin rush to the left for 2 yards to the Ari18. Tackled by Sio Moore and Josh Mauro.","(2:34) Thomas Rawls rush to the left for no gain to the Ari20. Tackled by Sio Moore.","(2:38) Penalty: Holding on Arizona (Brandon Williams) 5 yards.","(2:41) Russell Wilson incomplete pass to the left intended for Tyler Lockett defensed by Brandon Williams.","(2:52) Penalty: Pass Interference on Arizona (D.J. Swearinger) 31 yards.","(3:29) Thomas Rawls rush to the left for a loss of 2 yards to the Sea44. Tackled by Corey Peters.","(3:49) Russell Wilson pass to the left to Tyler Lockett for 10 yards to the Sea46. Tackled by Patrick Peterson.","(4:32) Thomas Rawls rush up the middle for 1 yard to the Sea36. Tackled by Rodney Gunter and Sio Moore.","(5:05) Thomas Rawls rush to the left for 1 yard to the Sea35. Tackled by Chandler Jones and Corey Peters.","(5:16) Matt Wile punts for 59 yards to Sea31. Tyler Lockett return for 3 yards to Sea34. Tackled by Kareem Martin.","(5:23) Carson Palmer incomplete pass to the left intended for J.J. Nelson defensed by Richard Sherman.","(5:27) Carson Palmer incomplete pass to the right intended for Jermaine Gresham defensed by Kam Chancellor.","(5:57) Penalty: Holding on Arizona (Jermaine Gresham) -9 yards.","(6:35) David Johnson rush to the left for 3 yards to the Ari19. Tackled by K.J. Wright and Frank Clark.","(6:43) Jon Ryan punts for 50 yards to Ari26. No return. Penalty: Holding on Arizona (Justin Bethel) -10 yards.","(6:48) Russell Wilson incomplete pass to the middle intended for Jimmy Graham defensed by D.J. Swearinger.","(7:03) Russell Wilson pass to the left to Jermaine Kearse for 10 yards to the Sea24. Tackled by Brandon Williams.","(7:45) Russell Wilson sacked at Sea14 for a loss of 9 yards by Markus Golden.","(7:52) Chandler Catanzaro kicks off to the Sea-5. Tyler Lockett return for 28 yards to Sea23. Tackled by Chandler Catanzaro and Justin Bethel.","(7:52) Chandler Catanzaro extra point is good.","(7:56) David Johnson rush up the middle for 2 yards for a TOUCHDOWN.","(8:39) Carson Palmer pass to the left to J.J. Nelson for 11 yards to the Sea2. Tackled by Richard Sherman.","(9:21) David Johnson rush to the left for 1 yard to the Sea13. Tackled by Kam Chancellor and K.J. Wright.","(10:06) David Johnson rush up the middle for 6 yards to the Sea14. Tackled by Kam Chancellor and Deshawn Shead.","(10:46) David Johnson rush to the right for 3 yards to the Sea20. Tackled by Kam Chancellor.","(10:54) Russell Wilson rush up the middle for no gain to the Sea24. FUMBLE, recovered by Ari (Calais Campbell). Tackled by George Fant.","(11:29) Russell Wilson sacked at Sea24 for a loss of 3 yards by Chandler Jones.","(11:33) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(12:01) Penalty: Pass Interference on Seattle (Jermaine Kearse) -10 yards.","(12:13) Matt Wile punts for 53 yards to Sea33. Tyler Lockett return for 4 yards to Sea37. Tackled by Kareem Martin and Zaviar Gooden.","(12:50) David Johnson rush to the left for a loss of 8 yards to the Ari14. Tackled by Frank Clark and Cliff Avril.","(13:35) Carson Palmer sacked at Ari22 for a loss of 8 yards by Michael Bennett and Jarran Reed.","(14:15) David Johnson rush up the middle for no gain to the Ari30. Tackled by Ahtyba Rubin.","(14:56) David Johnson rush up the middle for 13 yards to the Ari30. Tackled by Kam Chancellor and Steven Terrell.","(15:00) Steven Hauschka kicks off to the Ari1. Brittan Golden return for 16 yards to Ari17. Tackled by Kam Chancellor."]