["(0:05) 43 yard field goal attempt by Randy Bullock is NO GOOD. Holder: Kevin Huber.","(0:05) Houston Texans timeout.","(0:22) Rex Burkhead rush to the right for 9 yards to the Hou25. Tackled by Quintin Demps and Eddie Pleasant.","(0:47) Andy Dalton pass to the right to C.J. Uzomah for 1 yard to the Hou34. Tackled by Andre Hal.","(0:47) Houston Texans timeout.","(1:02) Andy Dalton pass to the right to Rex Burkhead for 9 yards to the Hou35. Tackled by Eddie Pleasant.","(1:25) Andy Dalton pass to the right to C.J. Uzomah for 8 yards to the Hou44. Tackled by Andre Hal.","(1:25) Houston Texans timeout.","(1:56) Andy Dalton pass to the middle to James Wright for 8 yards to the Cin48. Tackled by A.J. Bouye.","(2:00) Andy Dalton pass to the left to C.J. Uzomah for 5 yards to the Cin40. Tackled by A.J. Bouye.","(2:00) Two Minute Warning.","(2:13) Rex Burkhead rush to the left for a loss of 6 yards to the Cin35. Tackled by Brian Cushing.","(2:19) Andy Dalton pass to the right to C.J. Uzomah for 8 yards to the Cin41. Tackled by Andre Hal.","(2:50) Rex Burkhead rush up the middle for 5 yards to the Cin33. Tackled by Andre Hal and Benardrick McKinney.","(2:55) Andy Dalton incomplete pass to the right intended for Cody Core.","(3:24) Andy Dalton pass to the left to Cody Core for 4 yards to the Cin28. Tackled by A.J. Bouye.","(3:46) Rex Burkhead rush to the right for 9 yards to the Cin24. Tackled by Andre Hal and Brian Cushing.","(3:56) Shane Lechler punts for 42 yards to Cin8. Alex Erickson return for 7 yards to Cin15. Tackled by Don Jones and Akeem Hunt.","(4:01) Tom Savage pass to the left to Keith Mumphery for 5 yards to the Hou50. Tackled by Adam Jones.","(4:01) Cincinnati Bengals timeout.","(4:07) Alfred Blue rush to the right for 1 yard to the Hou45. Tackled by George Iloka.","(4:51) Alfred Blue rush to the right for 1 yard to the Hou44. Tackled by Pat Sims.","(5:35) Tom Savage pass to the middle to DeAndre Hopkins for 16 yards to the Hou43. Tackled by Adam Jones.","(6:20) Tom Savage pass to the middle to Alfred Blue for 4 yards to the Hou27. Tackled by Karlos Dansby.","(7:00) Alfred Blue rush up the middle for 2 yards to the Hou23. Tackled by Karlos Dansby.","(7:08) Kevin Huber punts for 53 yards to Hou21. No return.","(7:13) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(7:56) Andy Dalton sacked at Cin26 for a loss of 6 yards by Whitney Mercilus.","(8:34) Rex Burkhead rush to the left for 3 yards to the Cin32. Tackled by Whitney Mercilus and Benardrick McKinney.","(8:41) Nick Novak kicks off to the Cin3. Alex Erickson return for 26 yards to Cin29. Tackled by Jonathan Grimes.","(8:41) Nick Novak extra point is BLOCKED.","(8:47) Alfred Blue rush to the left for 24 yards for a TOUCHDOWN.","(9:31) Tom Savage pass to the left to DeAndre Hopkins for 21 yards to the Cin24. Tackled by Karlos Dansby.","(10:11) Tom Savage rush up the middle for 11 yards to the Cin45. Tackled by Vincent Rey.","(10:45) Tom Savage pass to the right to Will Fuller V for 19 yards to the Hou44. Tackled by Darqueze Dennard.","(10:45) Randy Bullock kicks off to the endzone. Touchback.","(10:45) Randy Bullock extra point is good.","(10:59) Andy Dalton pass to the left to Brandon LaFell for 86 yards for a TOUCHDOWN.","(11:02) Andy Dalton incomplete pass to the left intended for Brandon LaFell.","(11:40) Rex Burkhead rush to the right for 5 yards to the Cin14. Tackled by Antonio Smith.","(11:48) Shane Lechler punts for 31 yards to Cin9. No return.","(11:53) Tom Savage incomplete pass to the middle intended for Ryan Griffin defensed by Vincent Rey.","(11:59) Tom Savage incomplete pass to the right intended for DeAndre Hopkins.","(12:41) Alfred Blue rush up the middle for no gain to the Cin40. Tackled by Domata Peko and George Iloka.","(12:48) Andy Dalton pass intended for Tyler Boyd INTERCEPTED by Quintin Demps. No return. Tackled by Rex Burkhead.","(13:21) Andy Dalton pass to the right to Brandon LaFell for 15 yards to the Cin35. Tackled by Johnathan Joseph.","(13:31) Nick Novak kicks off to the Cin1. Alex Erickson return for 19 yards to Cin20. Tackled by Jonathan Grimes and Akeem Hunt.","(13:34) Nick Novak 22 yard field goal attempt is GOOD. Holder: Shane Lechler.","(13:38) Tom Savage incomplete pass to the right intended for DeAndre Hopkins.","(14:23) Alfred Blue rush up the middle for 1 yard to the Cin5. Tackled by Vincent Rey and Domata Peko.","(14:29) Tom Savage incomplete pass to the left intended for Will Fuller V.","(15:00) Tom Savage pass to the left to Akeem Hunt for 24 yards to the Cin6. Tackled by Shawn Williams.","(0:36) Tom Savage pass to the left to C.J. Fiedorowicz for 9 yards to the Cin30. Tackled by Shawn Williams.","(1:18) Tom Savage sacked at Cin39 for a loss of 3 yards by Will Clarke.","(1:24) Penalty: Pass Interference on Cincinnati (Adam Jones) 9 yards.","(2:08) Tom Savage pass to the middle to Alfred Blue for 4 yards to the Cin45. Tackled by Vincent Rey.","(2:51) Tom Savage pass to the middle to DeAndre Hopkins for 6 yards to the Cin49. Tackled by Nick Vigil.","(3:23) Penalty: Pass Interference on Houston (DeAndre Hopkins) -10 yards.","(3:27) Penalty: Pass Interference on Cincinnati (Adam Jones) 8 yards.","(4:12) Tom Savage pass to the left to Keith Mumphery for 2 yards to the Hou47. Tackled by George Iloka.","(4:56) Alfred Blue rush up the middle for 6 yards to the Hou45. Tackled by George Iloka.","(5:00) Penalty: Roughing Passer on Cincinnati (Margus Hunt) 15 yards.","(5:05) Tom Savage incomplete pass to the left intended for C.J. Fiedorowicz defensed by Karlos Dansby.","(5:16) Kevin Huber punts for 47 yards to Hou14. Tyler Ervin return for 10 yards to Hou24. Tackled by Cedric Peerman and Darqueze Dennard.","(5:47) Andy Dalton pass to the right to Rex Burkhead for 1 yard to the Cin39. Tackled by Eddie Pleasant.","(5:47) Cincinnati Bengals timeout.","(6:35) Andy Dalton pass to the right to Rex Burkhead for 4 yards to the Cin38. Tackled by John Simon and D.J. Reader.","(7:14) Andy Dalton sacked at Cin34 for a loss of 8 yards by Whitney Mercilus.","(7:41) Andy Dalton pass to the left to Tyler Boyd for 4 yards to the Cin42. Tackled by A.J. Bouye.","(8:23) Jeremy Hill rush to the right for 4 yards to the Cin38. Tackled by A.J. Bouye.","(8:59) Andy Dalton pass to the left to Brandon LaFell for 4 yards to the Cin34. Tackled by A.J. Bouye.","(9:05) Nick Novak kicks off to the Cin3. Alex Erickson return for 27 yards to Cin30. Tackled by Eddie Pleasant.","(9:09) Nick Novak 25 yard field goal attempt is GOOD. Holder: Shane Lechler.","(9:51) Tom Savage pass to the left to Akeem Hunt for 4 yards to the Cin7. Tackled by Michael Johnson.","(10:11) Penalty: False Start on Houston (Akeem Hunt) -5 yards.","(10:55) Alfred Blue rush to the right for 2 yards to the Cin6. Tackled by Karlos Dansby.","(11:03) Tom Savage incomplete pass to the left intended for Ryan Griffin.","(11:44) Tom Savage pass to the right to Alfred Blue for 4 yards to the Cin8. Tackled by Rey Maualuga.","(12:18) Alfred Blue rush up the middle for 7 yards to the Cin12. Tackled by Karlos Dansby.","(12:25) Penalty: Face Mask on Cincinnati (Carlos Dunlap) 15 yards.","(12:39) Penalty: Illegal Use of Hands on Cincinnati (Adam Jones) 5 yards.","(12:43) Penalty: Pass Interference on Houston (DeAndre Hopkins) -10 yards.","(13:05) Tom Savage pass to the right to C.J. Fiedorowicz for 12 yards to the Cin29. Tackled by Carlos Dunlap. FUMBLE, recovered by Hou.","(13:49) Alfred Blue rush to the right for 1 yard to the Cin41. Tackled by Josh Shaw.","(14:13) Tom Savage pass to the left to Alfred Blue for 5 yards to the Cin42. Tackled by Karlos Dansby and Vincent Rey.","(14:41) Tom Savage pass to the middle to Will Fuller V for 14 yards to the Cin47. Tackled by Dre Kirkpatrick.","(15:00) Tom Savage pass to the right to C.J. Fiedorowicz for 14 yards to the Hou39. Tackled by Shawn Williams.","(15:00) Randy Bullock kicks off to the endzone. Touchback.","(0:05) Randy Bullock 43 yard field goal attempt is GOOD. Holder: Kevin Huber.","(0:09) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(0:31) Andy Dalton pass to the right to Brandon LaFell for 11 yards to the Hou25. Tackled by Johnathan Joseph.","(0:36) Andy Dalton pass to the left to C.J. Uzomah for 6 yards to the Hou36. Tackled by Quintin Demps.","(0:36) Cincinnati Bengals timeout.","(0:41) Andy Dalton pass to the left to Cody Core for 6 yards to the Hou42. Tackled by A.J. Bouye.","(0:47) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(1:10) Andy Dalton pass to the left to Tyler Boyd for 21 yards to the Hou48. Tackled by Brian Cushing.","(1:14) Andy Dalton incomplete pass to the right intended for C.J. Uzomah.","(1:14) Cincinnati Bengals timeout.","(2:00) Jeremy Hill rush to the left for 1 yard to the Cin31. Tackled by Quintin Demps.","(2:00) Two Minute Warning.","(2:35) Andy Dalton pass to the right to Alex Erickson for 5 yards to the Cin30. Tackled by Andre Hal.","(3:15) Rex Burkhead rush up the middle for 4 yards to the Cin25. Tackled by Benardrick McKinney.","(3:48) Andy Dalton pass to the right to Brandon LaFell for 5 yards to the Cin21. Tackled by Brian Cushing.","(4:15) Andy Dalton pass to the left to Cody Core for 6 yards to the Cin16. Tackled by A.J. Bouye.","(4:58) Rex Burkhead rush to the left for 2 yards to the Cin10. Tackled by Quintin Demps and Andre Hal.","(5:11) Shane Lechler punts for 51 yards to Cin10. Alex Erickson return for 6 yards to Cin16. Tackled by Corey Moore. Penalty: Illegal Block on Cincinnati (Clayton Fejedelem) -8 yards.","(5:16) Tom Savage incomplete pass to the left intended for DeAndre Hopkins defensed by Vincent Rey.","(5:57) Alfred Blue rush to the left for a loss of 3 yards to the Hou39. Tackled by Pat Sims and Michael Johnson.","(6:29) Alfred Blue rush to the right for 3 yards to the Hou42. Tackled by Karlos Dansby and Margus Hunt.","(7:09) Alfred Blue rush to the left for 3 yards to the Hou39. Tackled by Michael Johnson.","(7:29) Tom Savage pass to the left to C.J. Fiedorowicz for 7 yards to the Hou36. Tackled by Rey Maualuga.","(7:42) Kevin Huber punts for 54 yards to Hou15. Tyler Ervin return for 14 yards to Hou29. Tackled by P.J. Dawson.","(8:17) Andy Dalton sacked at Cin31 for a loss of 10 yards by Jadeveon Clowney.","(9:01) Rex Burkhead rush to the left for a loss of 1 yard to the Cin41. Tackled by D.J. Reader and Jadeveon Clowney.","(9:39) Rex Burkhead rush to the right for 8 yards to the Cin42. Tackled by Quintin Demps.","(10:04) Andy Dalton pass to the right to Rex Burkhead for 11 yards to the Cin34. Tackled by Corey Moore.","(10:17) Shane Lechler punts for 55 yards to Cin23. Alex Erickson - no return. Tackled by Akeem Hunt.","(10:21) Tom Savage incomplete pass to the left intended for Will Fuller V.","(11:03) Alfred Blue rush up the middle for 5 yards to the Hou22. Tackled by Geno Atkins.","(11:39) Alfred Blue rush up the middle for no gain to the Hou17. Tackled by George Iloka and Vincent Rey.","(11:47) Kevin Huber punts for 47 yards to Hou16. Tyler Ervin return for 1 yard to Hou17. Tackled by Josh Shaw.","(11:54) Andy Dalton incomplete pass to the middle intended for Cody Core defensed by A.J. Bouye.","(12:36) Andy Dalton pass to the left to Cody Core for 9 yards to the Cin37. Tackled by A.J. Bouye.","(12:40) Andy Dalton incomplete pass to the left intended for Cody Core.","(12:52) Shane Lechler punts for 44 yards to Cin32. Alex Erickson return for a loss of 4 yards to Cin28. Tackled by Don Jones and Brian Peters.","(12:58) Tom Savage incomplete pass to the left intended for C.J. Fiedorowicz.","(13:40) Alfred Blue rush to the right for 3 yards to the Hou24. Tackled by Vincent Rey.","(14:13) Alfred Blue rush up the middle for 3 yards to the Hou21. Tackled by Domata Peko and Karlos Dansby.","(14:22) Kevin Huber punts for 48 yards to Hou18. No return.","(15:00) Andy Dalton pass to the left to Cody Core for 6 yards to the Cin34. Tackled by Kareem Jackson and Quintin Demps.","(0:19) Jeremy Hill rush to the right for a loss of 2 yards to the Cin28. Tackled by Vince Wilfork.","(1:05) Jeremy Hill rush to the left for 2 yards to the Cin30. Tackled by Benardrick McKinney and Christian Covington.","(1:15) Shane Lechler punts for 52 yards to Cin28. Alex Erickson - no return. FUMBLE, recovered by Cin (Alex Erickson).","(1:20) Tom Savage incomplete pass to the right intended for Will Fuller V defensed by Dre Kirkpatrick.","(2:01) Alfred Blue rush to the left for 6 yards to the Hou20. Tackled by Karlos Dansby and Pat Sims.","(2:33) Alfred Blue rush to the left for 1 yard to the Hou14. Tackled by Domata Peko and Karlos Dansby.","(2:41) Kevin Huber punts for 31 yards to Hou13. No return.","(2:47) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(3:16) Andy Dalton pass to the right to Cody Core for 2 yards to the Hou44.","(3:22) Andy Dalton incomplete pass to the left intended for Cody Core defensed by A.J. Bouye.","(4:01) Rex Burkhead rush up the middle for 2 yards to the Hou46. Tackled by Corey Moore.","(4:45) Andy Dalton pass to the right to Cody Core for 7 yards to the Hou48. Tackled by Corey Moore and Quintin Demps.","(5:19) Rex Burkhead rush to the left for 2 yards to the Cin45. Tackled by Benardrick McKinney.","(5:31) Shane Lechler punts for 41 yards to Cin44. Adam Jones return for a loss of 1 yard to Cin43. Tackled by Akeem Dent.","(6:02) Akeem Hunt rush up the middle for 6 yards to the Hou15. Tackled by Wallace Gilberry.","(6:32) Tom Savage sacked at Hou9 for a loss of 6 yards by Wallace Gilberry.","(7:16) Tom Savage sacked at Hou15 for a loss of 7 yards by Geno Atkins.","(7:25) Kevin Huber punts for 49 yards to Hou15. Tyler Ervin return for 7 yards to Hou22. Tackled by Josh Shaw.","(7:29) Andy Dalton incomplete pass to the left intended for Cody Core defensed by A.J. Bouye.","(8:14) Andy Dalton pass to the middle to Ryan Hewitt for 8 yards to the Cin36. Tackled by Benardrick McKinney.","(8:47) Andy Dalton pass to the right to Cody Core for a loss of 1 yard to the Cin28. Tackled by Kareem Jackson.","(9:24) Jeremy Hill rush to the left for 4 yards to the Cin29. Tackled by Jadeveon Clowney and Christian Covington.","(10:01) Andy Dalton pass to the right to Brandon LaFell for 9 yards to the Cin25.","(10:15) Shane Lechler punts for 55 yards to Cin9. Alex Erickson return for 7 yards to Cin16. Tackled by Jay Prosch and Corey Moore.","(10:47) Tom Savage sacked at Hou36 for a loss of 5 yards by Wallace Gilberry and Michael Johnson.","(11:30) Alfred Blue rush up the middle for 4 yards to the Hou41. Tackled by Will Clarke and George Iloka.","(11:39) Tom Savage incomplete pass to the right intended for C.J. Fiedorowicz.","(12:19) Jay Prosch rush up the middle for 5 yards to the Hou37. Tackled by Nick Vigil.","(12:44) Tom Savage pass to the left to Will Fuller V for 6 yards to the Hou32.","(13:15) Alfred Blue rush up the middle for 3 yards to the Hou26. Tackled by Geno Atkins and Vincent Rey.","(13:23) Kevin Huber punts for 37 yards to Hou23. No return.","(13:29) Andy Dalton incomplete pass to the right intended for Cody Core.","(14:16) Jeremy Hill rush to the right for a loss of 3 yards to the Cin40. Tackled by Kareem Jackson and Brian Cushing.","(14:53) Jeremy Hill rush to the right for 2 yards to the Cin43. Tackled by Benardrick McKinney.","(15:00) Nick Novak kicks off to the Cin6. Alex Erickson return for 35 yards to Cin41. Tackled by Robert Nelson Jr.."]
