["(0:44) Mike Tolbert rush to the right for 3 yards to the Car29. Tackled by Ricardo Allen and Deji Olatoye.","(1:25) Cam Newton sacked at Car26 for a loss of 8 yards by Ra'Shede Hageman.","(1:55) Fozzy Whittaker rush up the middle for 9 yards to the Car34. Tackled by Ricardo Allen.","(1:55) Matt Bosher kicks off to the endzone. Touchback.","(2:00) Matt Bryant 50 yard field goal attempt is GOOD. Holder: Matt Bosher.","(2:00) Two Minute Warning.","(2:11) Matt Ryan pass to the left to Devonta Freeman for 2 yards to the Car32. Tackled by Thomas Davis.","(2:56) Tevin Coleman rush up the middle for no gain to the Car34. Tackled by Kawann Short.","(3:40) Tevin Coleman rush to the right for 1 yard to the Car34. Tackled by Thomas Davis and Kawann Short.","(3:47) Cam Newton sacked at Car35 for a loss of 7 yards by Courtney Upshaw and Brooks Reed.","(3:52) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(3:59) Cam Newton incomplete pass to the right intended for Greg Olsen.","(4:25) Cam Newton pass to the middle to Greg Olsen for 7 yards to the Car42. Tackled by Deion Jones.","(4:49) Cam Newton pass to the left to Fozzy Whittaker for 14 yards to the Car35. Tackled by Keanu Neal.","(5:26) Cam Newton pass to the middle to Greg Olsen for 8 yards to the Car21. Tackled by Deion Jones.","(5:29) Cam Newton incomplete pass to the left intended for Ted Ginn Jr..","(5:36) Matt Bosher punts for 38 yards to Car13. No return.","(5:36) Carolina Panthers timeout.","(5:42) Matt Ryan pass to the left to Taylor Gabriel for 4 yards to the Atl49. Tackled by Mario Addison.","(5:46) Matt Ryan incomplete pass to the right intended for Julio Jones defensed by Tre Boston.","(6:33) Matt Ryan pass to the middle to Devonta Freeman for a loss of 2 yards to the Atl45. Tackled by Star Lotulelei.","(6:54) Penalty: Holding on Atlanta (Chris Chester) -10 yards.","(7:37) Devonta Freeman rush to the left for 13 yards to the Car43. Tackled by Shaq Thompson.","(8:18) Matt Ryan pass to the right to Mohamed Sanu for 6 yards to the Atl44. Tackled by James Bradberry.","(8:56) Tevin Coleman rush to the left for 3 yards to the Atl38. Tackled by Vernon Butler.","(9:39) Tevin Coleman rush to the left for 15 yards to the Atl35. Tackled by Vernon Butler and Daryl Worley.","(9:43) Graham Gano kicks off to the Atl10. Justin Hardy return for 10 yards to Atl20. Tackled by Michael Griffin.","(9:47) Graham Gano 31 yard field goal attempt is GOOD. Holder: Michael Palardy.","(9:53) Cam Newton incomplete pass to the right intended for Joe Webb defensed by Jalen Collins.","(10:38) Cam Newton rush up the middle for 5 yards to the Atl13. Tackled by Deion Jones.","(10:43) Cam Newton incomplete pass to the right intended for Joe Webb defensed by Keanu Neal.","(11:20) Cam Newton pass to the right to Corey Brown for 12 yards to the Atl18. Tackled by Keanu Neal.","(11:47) Cam Newton pass to the left to Kelvin Benjamin for 18 yards to the Atl30. Tackled by Jalen Collins.","(12:25) Cam Newton rush to the left for 8 yards to the Atl48. Tackled by Deion Jones.","(12:29) Cam Newton incomplete pass to the right intended for Ted Ginn Jr. defensed by Robert Alford.","(12:35) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(12:54) Cam Newton pass to the middle to Greg Olsen for 12 yards to the Car44. Tackled by Deion Jones.","(13:19) Cam Newton pass to the middle to Greg Olsen for 7 yards to the Car32. Tackled by Deion Jones.","(13:19) Matt Bosher kicks off to the endzone. Touchback.","(13:19) Matt Bryant extra point is good.","(13:28) Tevin Coleman rush to the right for 55 yards for a TOUCHDOWN.","(14:03) Matt Ryan pass to the left to Tevin Coleman for 31 yards to the Atl45. Tackled by Daryl Worley.","(14:54) Penalty: Too Many Men on Field on Atlanta -5 yards.","(14:54) Matt Ryan sacked at Atl19 for a loss of 6 yards by Mario Addison.","(15:00) Matt Ryan incomplete pass to the right intended for Julio Jones defensed by James Bradberry.","(15:00) Graham Gano kicks off to the endzone. Touchback.","(15:00) Graham Gano extra point is good.","(0:02) Cam Newton pass to the left to Kelvin Benjamin for 26 yards for a TOUCHDOWN.","(0:26) Cam Newton pass to the left to Ted Ginn Jr. for 17 yards to the Atl26. Tackled by Robert Alford.","(0:35) Cam Newton incomplete pass to the right intended for Greg Olsen.","(0:41) Penalty: Illegal Plyr Downfld on Carolina (Mike Remmers) -5 yards.","(1:20) Jonathan Stewart rush to the right for 7 yards to the Atl38. Tackled by Ricardo Allen and Adrian Clayborn.","(2:03) Cam Newton rush up the middle for 2 yards to the Atl45. Tackled by Deion Jones and Grady Jarrett.","(2:41) Cam Newton pass to the left to Ted Ginn Jr. for 7 yards to the Atl47. Tackled by Robert Alford.","(3:22) Cam Newton pass to the left to Jonathan Stewart for 2 yards to the Car46. Tackled by Philip Wheeler.","(3:25) Cam Newton incomplete pass to the left intended for Jonathan Stewart.","(3:34) Matt Bosher kicks off to the Car-3. Fozzy Whittaker return for 47 yards to Car44. Tackled by Robert Alford and Matt Bosher.","(3:39) Matt Bryant 29 yard field goal attempt is GOOD. Holder: Matt Bosher.","(4:20) Matt Ryan sacked at Car11 for a loss of 2 yards by Kony Ealy. FUMBLE, recovered by Atl (Devonta Freeman).","(4:26) Matt Ryan incomplete pass to the right intended for Joshua Perkins.","(4:26) Atlanta Falcons timeout.","(5:12) Devonta Freeman rush to the left for 2 yards to the Car9. Tackled by Shaq Thompson.","(5:38) Matt Ryan rush to the right for 7 yards to the Car20. Tackled by Star Lotulelei. Penalty: Unnecessary Roughness on Carolina (Mario Addison) 9 yards.","(6:14) Devonta Freeman rush to the right for 5 yards to the Car27. Tackled by Kurt Coleman and Daryl Worley.","(6:57) Matt Ryan pass to the middle to Julio Jones for 17 yards to the Car32. Tackled by Kurt Coleman and Thomas Davis.","(8:02) Penalty: False Start on Atlanta (Alex Mack) -5 yards.","(8:02) Matt Ryan pass to the right to Joshua Perkins for 8 yards to the Car44. Tackled by Shaq Thompson.","(8:43) Tevin Coleman rush to the left for 1 yard to the Atl48. Tackled by Shaq Thompson.","(9:23) Matt Ryan pass to the left to Julio Jones for 22 yards to the Atl47. Tackled by Tre Boston.","(9:23) Graham Gano kicks off to the endzone. Touchback.","(9:28) Graham Gano 40 yard field goal attempt is GOOD. Holder: Michael Palardy.","(9:35) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(10:15) Cam Newton rush to the right for 5 yards to the Atl22. Tackled by Paul Worrilow.","(10:20) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(11:01) Jonathan Stewart rush to the left for 12 yards to the Atl27. Tackled by Deion Jones and Adrian Clayborn.","(11:07) Cam Newton incomplete pass to the right intended for Devin Funchess.","(11:43) Cam Newton rush to the right for 3 yards to the Atl39. Tackled by Grady Jarrett.","(11:43) Carolina Panthers timeout.","(12:26) Cam Newton rush up the middle for 9 yards to the Atl42. Tackled by Deion Jones.","(12:35) Cam Newton incomplete pass to the middle intended for Corey Brown.","(12:35) Penalty: Encroachment on Atlanta (Robert Alford) 5 yards.","(12:35) Atlanta Falcons timeout.","(13:12) Jonathan Stewart rush to the left for 3 yards to the Car44. Tackled by Paul Worrilow and Philip Wheeler.","(13:50) Jonathan Stewart rush up the middle for 4 yards to the Car41. Tackled by Brian Poole.","(14:24) Cam Newton pass to the middle to Chris Manhertz for 10 yards to the Car37. Tackled by Paul Worrilow.","(15:00) Jonathan Stewart rush to the left for 2 yards to the Car27. Tackled by Deion Jones and Jonathan Babineaux.","(15:00) Matt Bosher kicks off to the endzone. Touchback.","(0:13) Cam Newton rush up the middle for a loss of 1 yard to the Car19.","(0:18) Matt Bryant 30 yard field goal attempt is BLOCKED by Vernon Butler.","(1:00) Matt Ryan rush up the middle for 2 yards to the Car12. Tackled by Thomas Davis and Kawann Short.","(1:00) Atlanta Falcons timeout.","(1:08) Matt Ryan pass to the right to Devonta Freeman for 3 yards to the Car14. Tackled by Thomas Davis.","(1:31) Matt Ryan pass to the left to Devonta Freeman for 4 yards to the Car17. Tackled by Shaq Thompson.","(1:40) Cam Newton pass intended for Ted Ginn Jr. INTERCEPTED by Jalen Collins and returned for 37 yards. Tackled by Cam Newton.","(1:53) Matt Bosher punts for 59 yards to Car38. Ted Ginn Jr. return for 12 yards to Car50. Tackled by Josh Harris.","(1:53) Carolina Panthers timeout.","(1:56) Matt Ryan sacked at Atl3 for a loss of 8 yards by Kurt Coleman.","(1:56) Carolina Panthers timeout.","(2:00) Matt Ryan pass to the left to Devonta Freeman for 6 yards to the Atl11. Tackled by Shaq Thompson.","(2:00) Two Minute Warning.","(2:21) Devonta Freeman rush up the middle for a loss of 5 yards to the Atl5. Tackled by Thomas Davis.","(2:28) Michael Palardy punts for 35 yards to Atl10. No return.","(2:33) Cam Newton incomplete pass to the left intended for Greg Olsen defensed by Deji Olatoye.","(2:33) Atlanta Falcons timeout.","(2:36) Fozzy Whittaker rush to the right for 2 yards to the Atl45. Tackled by Brooks Reed.","(2:47) Cam Newton incomplete pass to the left intended for Devin Funchess.","(3:14) Cam Newton pass to the right to Devin Funchess for 9 yards to the Atl47. Tackled by Jalen Collins.","(3:47) Cam Newton pass to the right to Greg Olsen for 8 yards to the Car44. Tackled by Jalen Collins.","(4:27) Cam Newton pass to the middle to Kelvin Benjamin for 8 yards to the Car36. Tackled by Jalen Collins.","(5:06) Jonathan Stewart rush to the right for a loss of 2 yards to the Car28. Tackled by Vic Beasley Jr. and Paul Worrilow.","(5:34) Cam Newton pass to the right to Ted Ginn Jr. for 5 yards to the Car30. Tackled by Keanu Neal.","(5:34) Matt Bosher kicks off to the endzone. Touchback.","(5:34) Matt Bryant extra point is good.","(5:42) Matt Ryan pass to the right to D.J. Tialavea for 1 yard for a TOUCHDOWN.","(6:26) Matt Ryan pass to the right to Taylor Gabriel for 4 yards to the Car1. Tackled by James Bradberry.","(6:30) Matt Ryan incomplete pass to the middle intended for Mohamed Sanu defensed by Shaq Thompson.","(7:01) Matt Ryan pass to the right to Devonta Freeman for 7 yards to the Car5. Tackled by Thomas Davis.","(7:01) Atlanta Falcons timeout.","(7:42) Matt Ryan pass to the right to Tevin Coleman for 2 yards to the Car12. Tackled by Leonard Johnson.","(7:57) Penalty: False Start on Atlanta (Ryan Schraeder) -5 yards.","(8:23) Devonta Freeman rush to the left for 9 yards to the Car9. Tackled by Shaq Thompson and A.J. Klein.","(8:55) Matt Ryan pass to the left to Mohamed Sanu for 28 yards to the Car18. Tackled by Tre Boston.","(9:26) Devonta Freeman rush up the middle for 7 yards to the Car46. Tackled by James Bradberry.","(10:08) Matt Ryan pass to the middle to Mohamed Sanu for 22 yards to the Atl47. Tackled by Leonard Johnson.","(10:14) Matt Ryan incomplete pass to the right intended for Julio Jones.","(10:17) Matt Ryan incomplete pass to the left intended for Taylor Gabriel.","(10:17) Graham Gano kicks off to the endzone. Touchback.","(10:21) Graham Gano 31 yard field goal attempt is GOOD. Holder: Michael Palardy.","(10:26) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(10:32) Cam Newton incomplete pass to the right intended for Greg Olsen.","(10:32) Carolina Panthers timeout.","(10:39) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by Robert Alford.","(10:56) Penalty: False Start on Carolina (Andrew Norwell) -5 yards.","(11:32) Fozzy Whittaker rush to the left for 19 yards to the Atl8. Tackled by Sharrod Neasman and Deion Jones.","(11:49) Cam Newton pass to the left to Greg Olsen for 17 yards to the Atl27. Tackled by Jalen Collins.","(11:56) Matt Bosher punts for 30 yards to Atl44. No return.","(12:37) Matt Ryan sacked at Atl14 for a loss of 5 yards by Kawann Short.","(13:21) Devonta Freeman rush to the right for 4 yards to the Atl19. Tackled by James Bradberry.","(13:59) Devonta Freeman rush to the right for 4 yards to the Atl15. Tackled by Shaq Thompson.","(14:09) Michael Palardy punts for 44 yards to Atl11. No return.","(14:14) Cam Newton incomplete pass to the right intended for Greg Olsen.","(14:21) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(14:25) Cam Newton incomplete pass to the right intended for Devin Funchess.","(15:00) Jonathan Stewart rush to the right for 20 yards to the Car45. Tackled by Ricardo Allen.","(0:35) Jonathan Stewart rush up the middle for no gain to the Car25. Tackled by Grady Jarrett and Brooks Reed.","(0:35) Matt Bosher kicks off to the endzone. Touchback.","(0:41) Matt Bryant 48 yard field goal attempt is GOOD. Holder: Matt Bosher.","(1:23) Matt Ryan pass to the right to Patrick DiMarco for 6 yards to the Car30. Tackled by Shaq Thompson.","(2:08) Tevin Coleman rush up the middle for 4 yards to the Car36. Tackled by Thomas Davis.","(2:42) Devonta Freeman rush to the left for a loss of 4 yards to the Car40. Tackled by Mario Addison.","(3:17) Devonta Freeman rush to the left for 10 yards to the Car36. Tackled by Kurt Coleman.","(3:58) Matt Ryan pass to the middle to Aldrick Robinson for 15 yards to the Car46. Tackled by Thomas Davis.","(4:31) Tevin Coleman rush to the right for 8 yards to the Atl39. Tackled by Tre Boston.","(4:38) Penalty: Holding on Carolina (James Bradberry) 5 yards.","(4:48) Michael Palardy punts for 51 yards to Atl15. Eric Weems return for 11 yards to Atl26. Tackled by David Mayo.","(5:31) Cam Newton rush to the left for 5 yards to the Car34. Tackled by Vic Beasley Jr..","(5:36) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(6:09) Jonathan Stewart rush to the left for 4 yards to the Car29. Tackled by Deion Jones and Grady Jarrett.","(6:09) Matt Bosher kicks off to the endzone. Touchback.","(6:14) Matt Bryant 51 yard field goal attempt is GOOD. Holder: Matt Bosher.","(6:54) Matt Ryan pass to the right to Taylor Gabriel for 7 yards to the Car32. Tackled by Shaq Thompson.","(7:18) Matt Ryan pass to the middle to Devonta Freeman for 9 yards to the Car24. Tackled by Shaq Thompson. Penalty: Unnecessary Roughness on Atlanta (Joshua Perkins) -15 yards.","(7:52) Devonta Freeman rush to the left for a loss of 5 yards to the Car33. Tackled by Mario Addison.","(8:27) Matt Ryan pass to the right to Julio Jones for 16 yards to the Car28. Tackled by Tre Boston.","(8:38) Cam Newton pass intended for Ed Dickson INTERCEPTED by Brian Poole and returned for 24 yards. Tackled by Mike Remmers.","(9:21) Jonathan Stewart rush to the right for 2 yards to the Car50. Tackled by Deion Jones.","(10:11) Cam Newton pass to the middle to Kelvin Benjamin for 11 yards to the Car48. Tackled by Jalen Collins.","(10:44) Jonathan Stewart rush up the middle for a loss of 2 yards to the Car37. Tackled by Courtney Upshaw.","(10:50) Cam Newton incomplete pass to the right intended for Greg Olsen defensed by Deion Jones.","(10:57) Matt Bosher kicks off to the Car2. Fozzy Whittaker return for 37 yards to Car39. Tackled by Matt Bosher.","(10:57) Matt Bryant extra point is good.","(11:05) Matt Ryan pass to the left to Joshua Perkins for 26 yards for a TOUCHDOWN.","(11:31) Matt Ryan pass to the left to Tevin Coleman for 12 yards to the Car26. Tackled by Leonard Johnson.","(12:08) Matt Ryan pass to the right to Levine Toilolo for 10 yards to the Car38. Tackled by Leonard Johnson.","(12:49) Tevin Coleman rush to the left for 3 yards to the Car48. Tackled by Tre Boston.","(13:29) Matt Ryan pass to the left to Devonta Freeman for 6 yards to the Atl49. Tackled by Thomas Davis.","(14:01) Devonta Freeman rush up the middle for 4 yards to the Atl43. Tackled by Kawann Short and Thomas Davis.","(14:29) Devonta Freeman rush to the right for 9 yards to the Atl39. Tackled by Thomas Davis.","(15:00) Matt Ryan pass to the left to Julio Jones for 5 yards to the Atl30. Tackled by James Bradberry.","(15:00) Graham Gano kicks off to the endzone. Touchback."]