["(0:20) Sam Bradford sacked at Min50 for a loss of 11 yards by Nick Perry.","(0:26) Sam Bradford pass to the left to Kyle Rudolph for 11 yards to the GB39. Tackled by Makinton Dorleant.","(0:26) Minnesota Vikings timeout.","(0:32) Sam Bradford pass to the left to Cordarrelle Patterson for 3 yards to the Min50. Tackled by Micah Hyde.","(0:32) Kai Forbath onside kickoff to the Min47. Onside kick recovered by kicking team by Jayron Kearse.","(0:32) Jerick McKinnon 2 pt rush attempt.","(0:40) Sam Bradford pass to the right to Adam Thielen for 8 yards for a TOUCHDOWN.","(1:10) Sam Bradford pass to the middle to Kyle Rudolph for 8 yards to the GB8. Tackled by Morgan Burnett.","(1:15) Penalty: Holding on Minnesota (Nick Easton) -10 yards.","(1:18) Penalty: Illegal Formation on Minnesota -5 yards.","(1:35) Sam Bradford pass to the middle to Kyle Rudolph for 3 yards to the GB1. Tackled by Joe Thomas.","(1:40) Sam Bradford incomplete pass to the left intended for Kyle Rudolph defensed by Ha Ha Clinton-Dix.","(2:00) Jerick McKinnon rush to the left for 4 yards to the GB4. Tackled by Ha Ha Clinton-Dix.","(2:00) Two Minute Warning.","(2:21) Sam Bradford pass to the right to Stefon Diggs for 4 yards to the GB8. Tackled by Joe Thomas.","(2:30) Sam Bradford pass to the right to Adam Thielen for 24 yards to the GB12. Tackled by Quinten Rollins.","(2:35) Sam Bradford incomplete pass to the left intended for Charles Johnson.","(3:14) Sam Bradford sacked at GB36 for a loss of 4 yards by Nick Perry.","(3:39) Sam Bradford pass to the right to Jerick McKinnon for 2 yards to the GB32. Tackled by Joe Thomas.","(3:53) Jacob Schum punts for 38 yards to Min46. Marcus Sherels return for 20 yards to GB34. Tackled by Kentrell Brice.","(3:53) Minnesota Vikings timeout.","(3:59) Christine Michael rush to the left for a loss of 2 yards to the GB16. Tackled by Brian Robison.","(3:59) Penalty: False Start on Green Bay -5 yards.","(4:06) Brett Hundley incomplete pass to the right intended for Geronimo Allison.","(4:06) Minnesota Vikings timeout.","(4:14) Christine Michael rush to the right for a loss of 3 yards to the GB23. Tackled by Terence Newman.","(4:20) Kai Forbath kicks off to the GB5. Ty Montgomery return for 21 yards to GB26. Tackled by Justin Trattou and Edmond Robinson.","(4:20) Kai Forbath extra point is NO GOOD.","(4:24) Sam Bradford pass to the right to Stefon Diggs for 3 yards for a TOUCHDOWN.","(5:04) Sam Bradford pass to the left to Matt Asiata for 7 yards to the GB3. Tackled by Ha Ha Clinton-Dix and Morgan Burnett.","(5:07) Sam Bradford incomplete pass to the right intended for Kyle Rudolph defensed by Micah Hyde.","(5:37) Sam Bradford pass to the right to Matt Asiata for 14 yards to the GB10. Tackled by Morgan Burnett.","(5:59) Matt Asiata rush to the right for 9 yards to the GB24. Tackled by Morgan Burnett and Ha Ha Clinton-Dix.","(6:26) Sam Bradford pass to the right to Adam Thielen for 11 yards to the GB33. Tackled by Quinten Rollins.","(6:29) Sam Bradford incomplete pass to the right intended for Stefon Diggs.","(6:52) Sam Bradford pass to the right to Jerick McKinnon for 5 yards to the GB44. Tackled by Joe Thomas.","(7:10) Sam Bradford pass to the right to Kyle Rudolph for 1 yard to the GB49. Tackled by Morgan Burnett.","(7:36) Jerick McKinnon rush to the right for 6 yards to the Min50. Tackled by Joe Thomas and Kentrell Brice.","(8:09) Sam Bradford pass to the right to Adam Thielen for 4 yards to the Min44. Tackled by Damarious Randall and Micah Hyde.","(8:36) Sam Bradford rush up the middle for 5 yards to the Min40. Tackled by Damarious Randall.","(9:02) Sam Bradford pass to the left to Cordarrelle Patterson for 10 yards to the Min35. Tackled by Damarious Randall.","(9:02) Mason Crosby kicks off to the endzone. Touchback.","(9:02) Mason Crosby extra point is good.","(9:07) Aaron Rodgers pass to the right to Richard Rodgers for 13 yards for a TOUCHDOWN. Penalty: Unnecessary Roughness on Minnesota (Andrew Sendejo) 15 yards.","(9:07) Penalty: Offside on Minnesota (Everson Griffen) 5 yards.","(9:07) Green Bay Packers timeout.","(9:12) Aaron Rodgers incomplete pass to the right intended for Jared Cook.","(9:58) Christine Michael rush to the left for 3 yards to the Min18. Tackled by Anthony Barr and Eric Kendricks.","(9:58) Green Bay Packers timeout.","(10:44) Aaron Rodgers pass to the middle to Jordy Nelson for 4 yards to the Min21. Tackled by Xavier Rhodes.","(11:32) Aaron Rodgers pass to the right to Davante Adams for no gain to the Min25. Tackled by Anthony Barr and Xavier Rhodes.","(12:13) Aaron Rodgers pass to the left to Jeff Janis for 8 yards to the Min25. Tackled by Trae Waynes.","(13:01) Aaron Rodgers pass to the left to Jared Cook for 30 yards to the Min33. Tackled by Trae Waynes.","(13:25) Penalty: Holding on Green Bay (Jason Spriggs) -10 yards.","(13:33) Jeff Locke punts for 32 yards to GB44. Micah Hyde - no return. FUMBLE, recovered by GB (Micah Hyde).","(14:16) Sam Bradford pass to the right to Jerick McKinnon for a loss of 2 yards to the Min24. Tackled by Joe Thomas.","(14:23) Sam Bradford incomplete pass to the left intended for Charles Johnson defensed by Damarious Randall.","(14:55) Jerick McKinnon rush to the right for 1 yard to the Min26. Tackled by Jake Ryan and Datone Jones.","(14:55) Mason Crosby kicks off to the endzone. Touchback.","(15:00) Mason Crosby 48 yard field goal attempt is GOOD. Holder: Jacob Schum.","(0:42) Aaron Rodgers sacked at Min30 for a loss of 11 yards by Eric Kendricks.","(0:49) Aaron Rodgers incomplete pass to the left intended for Geronimo Allison.","(0:57) Aaron Rodgers incomplete pass to the right intended for Davante Adams.","(1:46) Aaron Rodgers pass to the left to Geronimo Allison for 8 yards to the Min19. Tackled by Xavier Rhodes.","(2:31) Christine Michael rush to the right for 6 yards to the Min27. Tackled by Captain Munnerlyn and Linval Joseph.","(3:10) Ty Montgomery rush to the left for no gain to the Min33. Tackled by Everson Griffen.","(3:48) Aaron Rodgers pass to the right to Geronimo Allison for 11 yards to the Min33. Tackled by Harrison Smith.","(3:55) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(4:00) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(4:11) Jeff Locke punts for 39 yards to GB45. Micah Hyde return for 11 yards to Min44. Tackled by Audie Cole.","(4:17) Sam Bradford incomplete pass to the left intended for Cordarrelle Patterson defensed by Damarious Randall.","(4:56) Jerick McKinnon rush to the right for 2 yards to the Min16. Tackled by Mike Daniels.","(5:01) Sam Bradford incomplete pass to the right intended for Adam Thielen.","(5:08) Jacob Schum punts for 47 yards to Min14. Marcus Sherels - no return. Tackled by Jeff Janis.","(5:37) Aaron Rodgers pass to the right to Ty Montgomery for no gain to the GB39. Tackled by Eric Kendricks.","(5:47) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(6:22) Aaron Rodgers pass to the right to Jordy Nelson for 5 yards to the GB39. Tackled by Xavier Rhodes.","(6:35) Jeff Locke punts for 37 yards to GB15. Micah Hyde return for 19 yards to GB34. Tackled by Marcus Sherels.","(7:15) Sam Bradford pass to the middle to Kyle Rudolph for 9 yards to the Min48. Tackled by Joe Thomas and Micah Hyde.","(7:47) Penalty: Holding on Minnesota (T.J. Clemmings) -10 yards.","(8:28) Sam Bradford pass to the right to Adam Thielen for 4 yards to the Min49. Tackled by Micah Hyde.","(8:32) Sam Bradford incomplete pass to the left intended for Charles Johnson.","(9:13) Sam Bradford pass to the middle to Stefon Diggs for 13 yards to the Min45. Tackled by Kentrell Brice and Ha Ha Clinton-Dix.","(9:55) Jerick McKinnon rush to the left for 2 yards to the Min32. Tackled by Blake Martinez and Jake Ryan.","(10:36) Jerick McKinnon rush to the left for 2 yards to the Min30. Tackled by Kenny Clark and Clay Matthews.","(11:36) Penalty: False Start on Minnesota (Alex Boone) -5 yards.","(11:36) Jerick McKinnon rush up the middle for 11 yards to the Min33. Tackled by Blake Martinez.","(12:12) Sam Bradford pass to the left to Adam Thielen for 9 yards to the Min22. Tackled by Morgan Burnett.","(12:19) Jacob Schum punts for 49 yards to Min13. No return.","(12:42) Aaron Rodgers sacked at GB38 for a loss of 9 yards by Danielle Hunter and Eric Kendricks.","(12:49) Aaron Rodgers incomplete pass to the left intended for Jared Cook.","(13:27) Ty Montgomery rush to the right for 2 yards to the GB47. Tackled by Eric Kendricks.","(13:34) Jeff Locke punts for 33 yards to GB45. No return.","(13:39) Sam Bradford incomplete pass to the left intended for Adam Thielen defensed by Clay Matthews.","(14:15) Jerick McKinnon rush up the middle for 6 yards to the Min22. Tackled by Letroy Guion and Jake Ryan.","(15:00) Sam Bradford sacked at Min16 for a loss of 9 yards by Mike Daniels.","(15:00) Mason Crosby kicks off to the endzone. Touchback.","(0:20) Jerick McKinnon rush to the left for 4 yards to the Min33. Tackled by Clay Matthews and Ha Ha Clinton-Dix.","(0:24) Mason Crosby kicks off to the Min18. David Morgan return for 11 yards to Min29. Tackled by Jordan Tripp.","(0:24) Mason Crosby extra point is good.","(0:32) Aaron Rodgers rush to the left for 6 yards for a TOUCHDOWN.","(0:37) Aaron Rodgers incomplete pass to the left intended for Geronimo Allison.","(0:42) Aaron Rodgers pass to the right to Jordy Nelson for 14 yards to the Min6. Tackled by Xavier Rhodes.","(0:42) Green Bay Packers timeout.","(0:48) Ty Montgomery rush up the middle for 2 yards to the Min20. Tackled by Danielle Hunter and Anthony Barr.","(0:54) Aaron Rodgers pass to the right to Geronimo Allison for 32 yards to the Min22. Tackled by Trae Waynes.","(1:00) Sam Bradford sacked at GB46 for a loss of 5 yards by Clay Matthews. FUMBLE, recovered by GB (Mike Daniels). Tackled by Jerick McKinnon.","(1:40) Sam Bradford pass to the right to Matt Asiata for 9 yards to the GB41. Tackled by Jake Ryan.","(2:00) Matt Asiata rush to the right for 2 yards to the Min50. Tackled by Datone Jones and Morgan Burnett.","(2:00) Two Minute Warning.","(2:16) Matt Asiata rush to the left for 9 yards to the Min48. Tackled by Kentrell Brice.","(2:24) Jacob Schum punts for 44 yards to Min39. No return.","(2:58) Aaron Rodgers sacked at GB17 for a loss of 10 yards by Eric Kendricks.","(3:44) Aaron Rodgers sacked at GB27 for a loss of 9 yards by Danielle Hunter.","(4:27) Aaron Rodgers pass to the right to Jared Cook for 5 yards to the GB36. Tackled by Eric Kendricks.","(5:13) Aaron Rodgers pass to the middle to Jordy Nelson for 12 yards to the GB31. Tackled by Harrison Smith.","(5:56) Ty Montgomery rush to the left for 3 yards to the GB19. Tackled by Xavier Rhodes.","(6:39) Aaron Rodgers pass to the right to Richard Rodgers for 7 yards to the GB16. Tackled by Harrison Smith.","(7:19) Ty Montgomery rush to the right for 3 yards to the GB9. Tackled by Anthony Barr.","(7:24) Kai Forbath kicks off to the GB0. Christine Michael return for 12 yards to GB12. Tackled by Kentrell Brothers. Penalty: Illegal Block on Green Bay (Marwin Evans) -6 yards.","(7:24) Kai Forbath extra point is good.","(7:35) Sam Bradford pass to the right to Adam Thielen for 71 yards for a TOUCHDOWN.","(8:11) Sam Bradford pass to the left to David Morgan for 4 yards to the Min29. Tackled by Ha Ha Clinton-Dix.","(8:11) Mason Crosby kicks off to the endzone. Touchback.","(8:11) Mason Crosby extra point is good.","(8:19) Aaron Rodgers pass to the right to Jordy Nelson for 2 yards for a TOUCHDOWN.","(9:00) Aaron Rodgers rush to the right for 7 yards to the Min2. Tackled by Eric Kendricks.","(9:47) Aaron Rodgers pass to the left to Jordy Nelson for 33 yards to the Min9. Tackled by Eric Kendricks and Andrew Sendejo.","(9:50) Sam Bradford rush up the middle for no gain to the Min43. FUMBLE, recovered by GB (Kenny Clark). Tackled by Nick Easton.","(10:27) Matt Asiata rush up the middle for 3 yards to the Min43. Tackled by Julius Peppers.","(11:03) Sam Bradford pass to the left to Charles Johnson for 16 yards to the Min40. Tackled by Damarious Randall.","(11:10) Jacob Schum punts for 42 yards to Min24. No return.","(11:19) Aaron Rodgers incomplete pass to the right intended for Ty Montgomery.","(12:00) Ty Montgomery rush to the left for 3 yards to the GB34. Tackled by Danielle Hunter and Eric Kendricks.","(12:30) Ty Montgomery rush to the right for 6 yards to the GB31. Tackled by Danielle Hunter.","(12:30) Kai Forbath kicks off to the endzone. Touchback.","(12:34) Kai Forbath 26 yard field goal attempt is GOOD. Holder: Jeff Locke.","(13:07) Sam Bradford pass to the left to Stefon Diggs for 9 yards to the GB8. Tackled by Ladarius Gunter.","(13:11) Penalty: Delay of Game on Minnesota (Sam Bradford) -5 yards.","(13:11) Sam Bradford incomplete pass to the right intended for Rhett Ellison.","(13:52) Adam Thielen rush to the left for 4 yards to the GB12. Tackled by Jake Ryan.","(14:30) Sam Bradford pass to the right to Kyle Rudolph for 21 yards to the GB16. Tackled by Joe Thomas.","(15:00) Sam Bradford pass to the middle to Jerick McKinnon for 10 yards to the GB22. Tackled by Joe Thomas. Penalty: Unnecessary Roughness on Minnesota (Jeremiah Sirles) -15 yards.","(0:03) Jerick McKinnon rush to the left for 1 yard to the GB32. Tackled by Letroy Guion and Joe Thomas.","(0:09) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(0:41) Sam Bradford pass to the left to Adam Thielen for 32 yards to the GB33. Tackled by Ladarius Gunter.","(1:21) Sam Bradford pass to the left to Adam Thielen for 5 yards to the Min35. Tackled by Ladarius Gunter.","(1:25) Sam Bradford incomplete pass to the right intended for Matt Asiata.","(1:49) Matt Asiata rush to the right for 5 yards to the Min30. Tackled by Datone Jones.","(1:49) Mason Crosby kicks off to the endzone. Touchback.","(1:49) Mason Crosby extra point is good.","(1:54) Aaron Rodgers pass to the right to Davante Adams for 20 yards for a TOUCHDOWN.","(2:40) Aaron Rodgers pass to the right to Ty Montgomery for 6 yards to the Min20. Tackled by Anthony Barr.","(2:42) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(3:28) Aaron Rodgers pass to the left to Jordy Nelson for 48 yards to the Min26. Tackled by Trae Waynes.","(3:37) Kai Forbath kicks off to the GB4. Christine Michael return for 22 yards to GB26. Tackled by Audie Cole and Emmanuel Lamur.","(3:40) Kai Forbath 22 yard field goal attempt is GOOD. Holder: Jeff Locke.","(3:43) Sam Bradford incomplete pass to the left intended for Cordarrelle Patterson defensed by Clay Matthews.","(3:47) Sam Bradford incomplete pass to the right intended for Adam Thielen.","(4:25) Matt Asiata rush up the middle for 6 yards to the GB4. Tackled by Ha Ha Clinton-Dix.","(5:03) Sam Bradford pass to the right to Adam Thielen for 17 yards to the GB10. Tackled by Quinten Rollins.","(5:38) Sam Bradford pass to the left to Adam Thielen for 11 yards to the GB27. Tackled by Ladarius Gunter.","(6:22) Jerick McKinnon rush up the middle for 11 yards to the GB38. Tackled by Ha Ha Clinton-Dix.","(7:07) Sam Bradford pass to the right to Jerick McKinnon for 20 yards to the GB49. Tackled by Jake Ryan.","(7:13) Mason Crosby kicks off to the Min12. Adam Thielen return for 19 yards to Min31. Tackled by Morgan Burnett.","(7:13) Mason Crosby extra point is good.","(7:20) Aaron Rodgers pass to the left to Jordy Nelson for 21 yards for a TOUCHDOWN.","(8:06) Aaron Rodgers pass to the right to Ty Montgomery for 1 yard to the Min21. Tackled by Chad Greenway.","(8:41) Aaron Rodgers pass to the right to Davante Adams for 5 yards to the Min22. Tackled by Terence Newman.","(9:12) Aaron Rodgers pass to the left to Geronimo Allison for 15 yards to the Min27. Tackled by Andrew Sendejo.","(9:53) Aaron Rodgers pass to the right to Davante Adams for 19 yards to the Min42. Tackled by Harrison Smith.","(10:05) Jeff Locke punts for 45 yards to GB29. Micah Hyde return for 10 yards to GB39. Tackled by Anthony Harris.","(10:09) Sam Bradford incomplete pass to the right intended for Jerick McKinnon.","(10:52) Sam Bradford pass to the right to Adam Thielen for 6 yards to the Min26. Tackled by Quinten Rollins.","(10:55) Sam Bradford incomplete pass to the right intended for Stefon Diggs.","(11:02) Jacob Schum punts for 39 yards to Min0. Touchback.","(11:34) Aaron Rodgers pass to the right to Jared Cook for 2 yards to the Min39. Tackled by Danielle Hunter.","(12:18) Aaron Rodgers pass to the left to Christine Michael for 1 yard to the Min41. Tackled by Xavier Rhodes.","(12:58) Ty Montgomery rush up the middle for a loss of 1 yard to the Min42. Tackled by Eric Kendricks.","(13:35) Aaron Rodgers pass to the left to Ty Montgomery for 10 yards to the Min41. Tackled by Andrew Sendejo.","(14:13) Aaron Rodgers pass to the right to Jordy Nelson for 15 yards to the GB49. Tackled by Terence Newman.","(14:54) Ty Montgomery rush to the left for 5 yards to the GB34. Tackled by Linval Joseph and Anthony Barr.","(15:00) Kai Forbath kicks off to the GB-1. Christine Michael return for 30 yards to GB29. Tackled by Marcus Sherels."]