["(0:51) Andrew Franks 27 yard field goal attempt is GOOD. Holder: Matt Darr.","(0:51) Miami Dolphins timeout.","(1:36) Matt Moore rush up the middle for a loss of 1 yard to the Buf8.","(1:39) Miami Dolphins timeout.","(1:55) Jay Ajayi rush up the middle for 6 yards to the Buf7. Tackled by Leger Douzable and Preston Brown.","(2:00) Jay Ajayi rush to the left for 4 yards to the Buf13. Tackled by Preston Brown.","(2:00) Two Minute Warning.","(2:39) Kenyan Drake rush to the left for 3 yards to the Buf17. Tackled by Marcell Dareus.","(3:12) Jay Ajayi rush up the middle for 8 yards to the Buf20. Tackled by Corey Graham.","(4:00) Jay Ajayi rush to the left for 57 yards to the Buf28. Tackled by Nickell Robey-Coleman.","(4:09) Colton Schmidt punts for 44 yards to Mia15. No return.","(4:13) Tyrod Taylor incomplete pass to the right intended for Robert Woods defensed by Ndamukong Suh.","(4:20) Tyrod Taylor pass to the left to Sammy Watkins for 7 yards to the Buf41. Tackled by Tony Lippett.","(4:46) Mike Gillislee rush to the right for 1 yard to the Buf34. Tackled by Jordan Phillips.","(5:21) Tyrod Taylor pass to the left to Charles Clay for 16 yards to the Buf33. Tackled by Bacarri Rambo.","(6:07) Tyrod Taylor rush to the left for 5 yards to the Buf17. Tackled by Cameron Wake.","(6:42) LeSean McCoy rush up the middle for a loss of 3 yards to the Buf12. Tackled by Michael Thomas.","(7:14) LeSean McCoy rush up the middle for 5 yards to the Buf15. Tackled by Kiko Alonso.","(7:44) LeSean McCoy rush to the left for 6 yards to the Buf10. Tackled by Neville Hewitt.","(7:57) Matt Darr punts for 41 yards to Buf4. No return.","(8:03) Matt Moore incomplete pass to the left intended for Dion Sims.","(8:03) Buffalo Bills timeout.","(8:29) Jay Ajayi rush up the middle for 3 yards to the Buf45. Tackled by Lorenzo Alexander and Preston Brown.","(9:06) Kenyan Drake rush to the left for 2 yards to the Buf48. Tackled by Preston Brown and Marcell Dareus.","(9:41) Kenyan Drake rush up the middle for 6 yards to the Mia50. Tackled by Preston Brown and Marcell Dareus.","(10:03) Jay Ajayi rush to the left for 9 yards to the Mia44. Tackled by Stephon Gilmore.","(10:08) 45 yard field goal attempt by Dan Carpenter is NO GOOD. Holder: Colton Schmidt.","(10:14) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(10:55) Reggie Bush rush to the left for a loss of 8 yards to the Mia27. Tackled by Neville Hewitt.","(11:31) LeSean McCoy rush up the middle for a loss of 2 yards to the Mia19. Tackled by Donald Butler and Earl Mitchell.","(12:05) Tyrod Taylor pass to the right to Sammy Watkins for 14 yards to the Mia17. Tackled by Xavien Howard.","(12:40) Tyrod Taylor rush to the left for a loss of 1 yard to the Mia31. Tackled by Andre Branch.","(13:16) Mike Gillislee rush to the right for 35 yards to the Mia30. Tackled by Michael Thomas.","(13:49) Jerome Felton rush up the middle for 1 yard to the Buf35. Tackled by Donald Butler.","(14:27) Tyrod Taylor pass to the left to Charles Clay for 11 yards to the Buf34. Tackled by Kiko Alonso.","(15:00) LeSean McCoy rush to the left for a loss of 2 yards to the Buf23. Tackled by Andre Branch.","(15:00) Andrew Franks kicks off to the endzone. Touchback.","(0:06) Tyrod Taylor rush up the middle for a loss of 1 yard to the Buf24.","(0:06) Andrew Franks kicks off to the endzone. Touchback.","(0:10) Andrew Franks 55 yard field goal attempt is GOOD. Holder: Matt Darr.","(0:46) Matt Moore pass to the left to Damien Williams for 7 yards to the Buf37. Tackled by Preston Brown and Jerry Hughes.","(0:51) Matt Moore incomplete pass to the right intended for DeVante Parker defensed by Lorenzo Alexander.","(0:51) Matt Moore incomplete pass to the middle.","(1:07) Matt Moore pass to the right to Kenny Stills for 17 yards to the Buf44. Tackled by Preston Brown.","(1:11) Matt Moore incomplete pass to the left intended for DeVante Parker.","(1:20) Dan Carpenter kicks off to the Mia0. Kenyan Drake return for 39 yards to Mia39. Tackled by Nickell Robey-Coleman.","(1:20) Dan Carpenter extra point is good.","(1:25) Tyrod Taylor pass to the right to Charles Clay for 7 yards for a TOUCHDOWN.","(1:25) Buffalo Bills timeout.","(1:32) Tyrod Taylor rush to the left for a loss of 3 yards to the Mia7. Tackled by Bacarri Rambo and Neville Hewitt.","(1:32) Miami Dolphins timeout.","(1:40) LeSean McCoy rush to the right for 4 yards to the Mia4. Tackled by Bacarri Rambo.","(1:40) Miami Dolphins timeout.","(1:50) LeSean McCoy rush to the left for a loss of 1 yard to the Mia8. Tackled by Bacarri Rambo.","(2:00) Tyrod Taylor pass to the right to Robert Woods for 34 yards to the Mia7. Tackled by Bacarri Rambo.","(2:00) Two Minute Warning.","(2:09) LeSean McCoy rush to the left for 11 yards to the Mia41. Tackled by Neville Hewitt.","(2:17) Tyrod Taylor rush to the right for 3 yards to the Buf48. Tackled by Jordan Phillips.","(2:55) Mike Gillislee rush to the left for 25 yards to the Buf45. Tackled by Michael Thomas.","(3:28) LeSean McCoy rush to the right for 2 yards to the Buf20. Tackled by Bacarri Rambo and Ndamukong Suh.","(4:00) LeSean McCoy rush to the right for 7 yards to the Buf18. Tackled by Michael Thomas and Spencer Paysinger.","(4:12) Matt Darr punts for 40 yards to Buf11. No return.","(4:55) Matt Moore pass to the right to Jarvis Landry for 3 yards to the Mia49. Tackled by Kevon Seymour.","(4:59) Matt Moore incomplete pass to the right intended for Jarvis Landry.","(5:44) Jarvis Landry rush to the left for no gain to the Mia46. Tackled by Stephon Gilmore.","(5:51) Dan Carpenter kicks off to the Mia5. Jakeem Grant return for 41 yards to Mia46. Tackled by Dan Carpenter.","(5:55) Dan Carpenter 28 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(6:04) Tyrod Taylor incomplete pass to the left intended for Charles Clay defensed by Spencer Paysinger.","(6:44) Tyrod Taylor rush to the left for a loss of 6 yards to the Mia10. Tackled by Neville Hewitt.","(7:23) LeSean McCoy rush to the left for 7 yards to the Mia4. Tackled by Bacarri Rambo and Michael Thomas.","(7:37) Penalty: Too Many Men on Field on Miami 5 yards.","(7:40) Tyrod Taylor pass to the right to Sammy Watkins for 9 yards to the Mia16. Tackled by Xavien Howard.","(7:49) Tyrod Taylor incomplete pass to the left intended for Charles Clay.","(8:29) Tyrod Taylor sacked at Mia25 for no gain by Jason Jones.","(9:10) Tyrod Taylor rush to the right for 10 yards to the Mia25.","(9:17) Tyrod Taylor incomplete pass to the left intended for Sammy Watkins.","(9:40) Tyrod Taylor pass to the left to Marquise Goodwin for 16 yards to the Mia35.","(10:15) Tyrod Taylor rush to the left for 13 yards to the Buf49. Tackled by Tony Lippett.","(10:20) 46 yard field goal attempt by Andrew Franks is NO GOOD. Holder: Matt Darr.","(10:58) Jay Ajayi rush to the left for 7 yards to the Buf28. Tackled by Corey Graham and Preston Brown.","(11:41) Matt Moore pass to the right to Jay Ajayi for 3 yards to the Buf35. Tackled by Ramon Humber and Zach Brown.","(11:41) Miami Dolphins timeout.","(12:24) Jay Ajayi rush to the right for a loss of 5 yards to the Buf38. Tackled by Leger Douzable.","(13:07) Matt Moore pass to the right to Jarvis Landry for 11 yards to the Buf33. Tackled by Marcell Dareus.","(13:43) Jay Ajayi rush to the right for no gain to the Buf44. Tackled by Leger Douzable.","(14:00) Penalty: Offside on Buffalo (Lorenzo Alexander) 5 yards.","(14:24) Jay Ajayi rush up the middle for 10 yards to the Buf49. Tackled by Zach Brown and Preston Brown.","(15:00) Matt Moore pass to the left to DeVante Parker for 10 yards to the Mia41. Tackled by Stephon Gilmore.","(0:35) Jay Ajayi rush to the right for 1 yard to the Mia31. Tackled by Marcell Dareus.","(1:12) Jay Ajayi rush up the middle for 5 yards to the Mia30. Tackled by Kyle Williams and Marcell Dareus.","(1:12) Dan Carpenter kicks off to the endzone. Touchback.","(1:12) Dan Carpenter extra point is good.","(1:18) Tyrod Taylor pass to the right to Charles Clay for 18 yards for a TOUCHDOWN.","(1:52) Tyrod Taylor rush to the right for 6 yards to the Mia18. Tackled by Spencer Paysinger.","(2:36) Tyrod Taylor pass to the right to Sammy Watkins for 53 yards to the Mia24. Tackled by Bacarri Rambo.","(3:08) LeSean McCoy rush up the middle for 1 yard to the Buf23. Tackled by Andre Branch and Isa Abdul-Quddus.","(3:14) Andrew Franks kicks off to the Buf9. Brandon Tate return for 13 yards to Buf22. Tackled by Michael Thomas and Bacarri Rambo.","(3:14) Andrew Franks extra point is good.","(3:18) Matt Moore pass to the right to Kenny Stills for 6 yards for a TOUCHDOWN.","(4:00) Jay Ajayi rush to the right for 3 yards to the Buf6. Tackled by Leger Douzable and Preston Brown.","(4:36) Matt Moore pass to the left to DeVante Parker for 15 yards to the Buf9. Tackled by Corey Graham and Stephon Gilmore.","(5:23) Matt Moore pass to the left to Damien Williams for 44 yards to the Buf24. Tackled by Corey Graham.","(6:06) Jay Ajayi rush to the left for 2 yards to the Mia32. Tackled by Kyle Williams and Ronald Darby.","(6:46) Jay Ajayi rush to the left for 5 yards to the Mia30. Tackled by Zach Brown and Jerry Hughes.","(6:46) Dan Carpenter kicks off to the endzone. Touchback.","(6:46) Dan Carpenter extra point is good.","(6:53) LeSean McCoy rush up the middle for 19 yards for a TOUCHDOWN.","(7:29) LeSean McCoy rush to the right for 6 yards to the Mia19. Tackled by Ndamukong Suh.","(7:56) Tyrod Taylor pass to the right to Sammy Watkins for 13 yards to the Mia25.","(8:33) Tyrod Taylor pass to the right to Charles Clay for 9 yards to the Mia38. Tackled by Spencer Paysinger.","(9:09) Tyrod Taylor pass to the left to Charles Clay for 7 yards to the Mia47. Tackled by Donald Butler.","(9:41) Mike Gillislee rush to the left for 5 yards to the Buf46. Tackled by Michael Thomas.","(10:21) Tyrod Taylor pass to the right to Charles Clay for 8 yards to the Buf41. Tackled by Spencer Paysinger.","(10:52) Tyrod Taylor pass to the left to LeSean McCoy for 2 yards to the Buf33. Tackled by Neville Hewitt.","(11:27) LeSean McCoy rush up the middle for a loss of 1 yard to the Buf31. Tackled by Andre Branch.","(11:58) LeSean McCoy rush to the right for 9 yards to the Buf32. Tackled by Andre Branch.","(12:05) Andrew Franks kicks off to the Buf1. Brandon Tate return for 22 yards to Buf23. Tackled by Mike Hull and Bacarri Rambo.","(12:05) Andrew Franks extra point is good.","(12:15) Matt Moore pass to the left to DeVante Parker for 56 yards for a TOUCHDOWN.","(12:57) Matt Moore pass to the right to DeVante Parker for 4 yards to the Mia44. Tackled by Ronald Darby.","(13:40) Jay Ajayi rush to the right for no gain to the Mia40. Tackled by Marcell Dareus and Kyle Williams.","(14:20) Jay Ajayi rush up the middle for 9 yards to the Mia40. Tackled by Lorenzo Alexander and Kyle Williams.","(15:00) Jay Ajayi rush to the right for 1 yard to the Mia31. Tackled by Zach Brown and Jerry Hughes.","(15:00) Dan Carpenter kicks off to the endzone. Touchback. Penalty: Offside on Buffalo (Marcus Roberson) 5 yards.","(0:05) Tyrod Taylor pass to the left to Robert Woods for no gain to the Buf42. Lateral to LeSean McCoy for 4 yards to the Buf46. Tackled by Spencer Paysinger.","(0:05) Buffalo Bills timeout.","(0:09) Tyrod Taylor pass to the middle to Robert Woods for 9 yards to the Buf42. Tackled by Bobby McCain.","(0:30) LeSean McCoy rush up the middle for 13 yards to the Buf33. Tackled by Isa Abdul-Quddus and Tony Lippett.","(0:42) Matt Moore pass intended for Kenny Stills INTERCEPTED by Corey White. No return. Touchback.","(0:46) Matt Moore incomplete pass to the right intended for Kenny Stills.","(1:06) Jay Ajayi rush to the right for 11 yards to the Buf25. Tackled by Ronald Darby.","(1:11) Matt Moore incomplete pass to the right intended for Kenny Stills defensed by Zach Brown.","(1:24) Colton Schmidt punts for 48 yards to Mia48. Jarvis Landry return for 16 yards to Buf36. Tackled by Preston Brown and Jonathan Meeks.","(1:24) Miami Dolphins timeout.","(1:30) Tyrod Taylor sacked at Buf4 for a loss of 12 yards by Cameron Wake.","(1:38) Tyrod Taylor incomplete pass to the right intended for Sammy Watkins defensed by Xavien Howard.","(1:44) Tyrod Taylor incomplete pass to the left intended for Robert Woods.","(1:56) Matt Darr punts for 41 yards to Buf16. No return.","(2:00) Matt Moore incomplete pass to the right intended for Damien Williams.","(2:00) Two Minute Warning.","(2:40) Matt Moore pass to the right to Jarvis Landry for 15 yards to the Mia43. Tackled by Zach Brown and Corey Graham.","(3:08) Penalty: Holding on Miami (Ja'Wuan James) -10 yards.","(3:45) Jay Ajayi rush to the left for 2 yards to the Mia38. Tackled by Preston Brown.","(4:20) Matt Moore pass to the right to Dion Sims for 7 yards to the Mia36. Tackled by Kevon Seymour.","(4:59) Jay Ajayi rush to the left for 4 yards to the Mia29. Tackled by Lorenzo Alexander.","(5:06) Matt Moore incomplete pass to the right intended for Jarvis Landry.","(5:06) Dan Carpenter kicks off to the endzone. Touchback.","(5:06) Dan Carpenter extra point is good.","(5:14) Tyrod Taylor pass to the right to Sammy Watkins for 38 yards for a TOUCHDOWN.","(5:53) LeSean McCoy rush to the left for 14 yards to the Mia38. Tackled by Michael Thomas and Spencer Paysinger.","(6:24) LeSean McCoy rush up the middle for 6 yards to the Buf48. Tackled by Nick Williams.","(6:58) Tyrod Taylor rush to the left for 23 yards to the Buf42. Tackled by Tony Lippett.","(7:35) LeSean McCoy rush to the left for 8 yards to the Buf19. Tackled by Spencer Paysinger and Ndamukong Suh.","(7:48) Penalty: Holding on Buffalo (Jordan Mills) -10 yards.","(7:51) Tyrod Taylor incomplete pass to the left intended for LeSean McCoy.","(8:00) Matt Darr punts for 38 yards to Buf21. No return.","(8:06) Matt Moore incomplete pass to the middle intended for DeVante Parker defensed by Stephon Gilmore.","(8:10) Matt Moore incomplete pass to the right intended for Kenny Stills defensed by Leger Douzable.","(8:48) Jay Ajayi rush to the right for 2 yards to the Mia41. Tackled by Lorenzo Alexander.","(9:08) Mike Gillislee rush to the right for no gain to the Mia39. Tackled by Kiko Alonso and Ndamukong Suh.","(9:51) Mike Gillislee rush to the left for 1 yard to the Mia39. Tackled by Earl Mitchell and Neville Hewitt.","(10:25) Mike Gillislee rush to the left for 2 yards to the Mia40. Tackled by Jason Jones.","(10:56) Mike Gillislee rush up the middle for 6 yards to the Mia42. Tackled by Nick Williams.","(11:21) Tyrod Taylor pass to the right to Sammy Watkins for 20 yards to the Mia48. Tackled by Xavien Howard.","(11:59) Tyrod Taylor pass to the left to LeSean McCoy for 5 yards to the Buf32. Tackled by Spencer Paysinger.","(12:15) Penalty: Holding on Buffalo (John Miller) -10 yards.","(12:21) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(12:56) Tyrod Taylor rush to the right for 5 yards to the Buf37. Tackled by Donald Butler.","(13:26) Tyrod Taylor pass to the left to Charles Clay for 9 yards to the Buf32. Tackled by Donald Butler.","(13:34) Andrew Franks kicks off to the Buf4. Mike Gillislee return for 19 yards to Buf23. Tackled by Michael Thomas. FUMBLE, recovered by Buf (Mike Gillislee).","(13:34) Andrew Franks extra point is good.","(13:45) Kenyan Drake rush to the left for 45 yards for a TOUCHDOWN.","(14:23) Jay Ajayi rush to the right for 7 yards to the Buf45. Tackled by Ronald Darby.","(15:00) Jay Ajayi rush to the right for 7 yards to the Mia48. Tackled by Zach Brown.","(0:29) Jay Ajayi rush to the left for 5 yards to the Mia41. Tackled by Preston Brown and Zach Brown.","(0:34) 46 yard field goal attempt by Dan Carpenter is NO GOOD. Holder: Colton Schmidt.","(1:19) Tyrod Taylor pass to the left to LeSean McCoy for 7 yards to the Mia28. Tackled by Tony Lippett.","(1:19) Penalty: Delay of Game on Buffalo (Tyrod Taylor) -5 yards.","(1:26) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(2:00) Mike Gillislee rush to the left for 5 yards to the Mia30. Tackled by Isa Abdul-Quddus.","(2:37) Tyrod Taylor pass to the right to Jerome Felton for 9 yards to the Mia35. Tackled by Tony Lippett.","(3:21) Tyrod Taylor pass to the right to LeSean McCoy for 2 yards to the Mia44. Tackled by Xavien Howard and Cameron Wake.","(3:57) LeSean McCoy rush up the middle for 5 yards to the Mia46. Tackled by Kiko Alonso.","(4:31) Mike Gillislee rush to the left for 4 yards to the Buf49. Tackled by Ndamukong Suh.","(5:00) Mike Gillislee rush up the middle for 7 yards to the Buf45. Tackled by Kiko Alonso and Neville Hewitt.","(5:39) Tyrod Taylor pass to the right to Jerome Felton for 5 yards to the Buf38. Tackled by Donald Butler and Xavien Howard.","(5:39) Buffalo Bills timeout.","(6:18) LeSean McCoy rush to the right for 8 yards to the Buf33. Tackled by Neville Hewitt.","(6:24) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin defensed by Tony Lippett.","(6:24) Andrew Franks kicks off to the endzone. Touchback.","(6:24) Andrew Franks extra point is good.","(6:30) Jay Ajayi rush to the right for 2 yards for a TOUCHDOWN.","(6:30) Miami Dolphins timeout.","(7:05) Jay Ajayi rush to the left for 8 yards to the Buf2. Tackled by Lorenzo Alexander and Corey White.","(7:43) Jay Ajayi rush to the right for 5 yards to the Buf10. Tackled by Preston Brown.","(8:02) Buffalo Bills timeout.","(8:02) Matt Moore pass to the right to Kenny Stills for 12 yards to the Buf15. Tackled by Ronald Darby.","(8:07) Matt Moore incomplete pass to the right intended for Jarvis Landry.","(8:47) Jay Ajayi rush to the left for a loss of 1 yard to the Buf27. Tackled by Leger Douzable.","(9:34) Jay Ajayi rush to the right for 19 yards to the Buf26. Tackled by Corey Graham.","(10:08) Jay Ajayi rush to the right for 7 yards to the Buf45. Tackled by Zach Brown.","(10:37) Matt Moore pass to the right to MarQueis Gray for 20 yards to the Mia48. Tackled by Corey Graham.","(10:47) Colton Schmidt punts for 36 yards to Mia19. Jarvis Landry return for 9 yards to Mia28. Tackled by Kevon Seymour and Nick O'Leary.","(10:53) Tyrod Taylor incomplete pass to the right intended for Sammy Watkins.","(11:32) Tyrod Taylor pass to the right to LeSean McCoy for a loss of 3 yards to the Buf45. Tackled by Xavien Howard.","(12:10) LeSean McCoy rush to the right for 8 yards to the Buf48. Tackled by Michael Thomas and Kiko Alonso.","(12:26) Matt Darr punts for 47 yards to Buf17. Brandon Tate return for 23 yards to Buf40. Tackled by Trevor Reilly and Matt Darr.","(12:31) Matt Moore incomplete pass to the right intended for Kenny Stills defensed by Ronald Darby.","(13:03) Matt Moore pass to the left to Dion Sims for 3 yards to the Mia36. Tackled by Corey White.","(13:41) Jay Ajayi rush to the left for 3 yards to the Mia33. Tackled by Ramon Humber.","(13:53) Colton Schmidt punts for 41 yards to Mia30. No return.","(14:18) Tyrod Taylor rush to the left for 6 yards to the Buf29. Tackled by Spencer Paysinger.","(14:54) LeSean McCoy rush to the right for a loss of 2 yards to the Buf23. Tackled by Ndamukong Suh and Kiko Alonso.","(15:00) Tyrod Taylor incomplete pass to the left intended for Robert Woods defensed by Tony Lippett.","(15:00) Andrew Franks kicks off to the endzone. Touchback."]