["(0:05) Carson Wentz rush up the middle for a loss of 1 yard to the Phi10.","(0:14) Eli Manning pass intended for Will Tye INTERCEPTED by Terrence Brooks and returned for 6 yards. Tackled by Will Tye.","(0:20) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(0:25) Eli Manning incomplete pass to the left intended for Victor Cruz.","(0:25) New York Giants timeout.","(0:32) Eli Manning pass to the right to Victor Cruz for 11 yards to the Phi34. Tackled by Leodis McKelvin.","(0:47) Eli Manning pass to the right to Sterling Shepard for 8 yards to the Phi45. Tackled by Jalen Mills.","(0:50) Eli Manning incomplete pass to the right intended for Bobby Rainey.","(0:54) Eli Manning pass to the right to Sterling Shepard for 6 yards to the NYG47.","(1:10) Eli Manning pass to the right to Bobby Rainey for 13 yards to the NYG41. Tackled by Nigel Bradham.","(1:27) Eli Manning pass to the right to Victor Cruz for 9 yards to the NYG28. Tackled by Jalen Mills.","(1:31) Eli Manning pass to the left to Will Tye for 4 yards to the NYG19.","(1:37) Donnie Jones punts for 43 yards to NYG15. No return.","(1:42) Carson Wentz incomplete pass to the left intended for Jordan Matthews defensed by Trevin Wade.","(1:42) Philadelphia Eagles timeout.","(1:42) New York Giants timeout.","(1:50) Darren Sproles rush to the right for 3 yards to the Phi42. Tackled by Landon Collins.","(1:50) New York Giants timeout.","(1:54) Darren Sproles rush to the left for 2 yards to the Phi39. Tackled by Kelvin Sheppard.","(2:00) Eli Manning incomplete pass to the left intended for Sterling Shepard defensed by Nolan Carroll.","(2:00) Penalty: False Start on New York (John Jerry) -5 yards.","(2:00) Two Minute Warning.","(2:19) Eli Manning pass to the right to Odell Beckham Jr. for 3 yards to the Phi32. Tackled by Nolan Carroll.","(2:25) Eli Manning incomplete pass to the right intended for Roger Lewis defensed by Leodis McKelvin.","(2:32) Eli Manning pass to the middle to Odell Beckham Jr. for 6 yards to the Phi35. Tackled by Leodis McKelvin.","(2:57) Paul Perkins rush up the middle for 7 yards to the Phi41. Tackled by Brandon Graham.","(3:22) Eli Manning pass to the right to Odell Beckham Jr. for 9 yards to the Phi48. Tackled by Nigel Bradham.","(3:48) Paul Perkins rush to the right for 7 yards to the NYG43. Tackled by Malcolm Jenkins.","(4:15) Eli Manning pass to the middle to Paul Perkins for 9 yards to the NYG36. Tackled by Leodis McKelvin.","(4:24) Donnie Jones punts for 43 yards to NYG28. Dwayne Harris return for a loss of 1 yard to NYG27. Tackled by Chris Maragos.","(4:29) Carson Wentz incomplete pass to the middle intended for Nelson Agholor.","(4:34) Carson Wentz pass to the right to Jordan Matthews for 5 yards to the Phi29. Tackled by Trevin Wade.","(5:17) Darren Sproles rush to the left for a loss of 1 yard to the Phi24. Tackled by Landon Collins.","(5:17) Robbie Gould kicks off to the endzone. Touchback.","(5:20) Robbie Gould 41 yard field goal attempt is GOOD. Holder: Brad Wing.","(5:36) Penalty: False Start on New York (Brett Jones) -5 yards.","(6:16) Eli Manning pass to the left to Victor Cruz for 7 yards to the Phi18. Tackled by Nolan Carroll.","(6:21) Eli Manning incomplete pass to the left intended for Victor Cruz.","(6:25) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(6:47) Eli Manning pass to the right to Odell Beckham Jr. for 10 yards to the Phi25. Tackled by Malcolm Jenkins.","(6:52) Eli Manning incomplete pass to the right intended for Victor Cruz defensed by Leodis McKelvin.","(6:59) Eli Manning pass to the right to Rashad Jennings for no gain to the Phi35. FUMBLE, recovered by NYG.","(7:26) Eli Manning pass to the middle to Will Tye for 5 yards to the Phi35. Tackled by Jalen Mills and Jordan Hicks.","(8:10) Eli Manning pass to the left to Odell Beckham Jr. for 33 yards to the Phi40. Tackled by Jalen Mills.","(8:42) Sterling Shepard rush to the left for 2 yards to the NYG27. Tackled by Jalen Mills.","(8:47) Caleb Sturgis kicks off to the NYG2. Dwayne Harris return for 23 yards to NYG25. Tackled by Rodney McLeod.","(8:47) Caleb Sturgis 41 yard field goal attempt is GOOD. Holder: Donnie Jones.","(9:02) Carson Wentz pass to the right to Nelson Agholor for 7 yards to the NYG23.","(9:30) Nelson Agholor rush to the left for 5 yards to the NYG30.","(10:09) Darren Sproles rush to the left for a loss of 3 yards to the NYG35. Tackled by Coty Sensabaugh.","(11:07) Carson Wentz rush up the middle for 11 yards to the NYG32.","(11:48) Darren Sproles rush to the right for 13 yards to the NYG43. Tackled by Landon Collins.","(11:57) Carson Wentz incomplete pass to the left.","(12:03) Eli Manning pass intended for Sterling Shepard INTERCEPTED by Malcolm Jenkins. No return.","(12:06) Eli Manning incomplete pass to the left intended for Paul Perkins.","(12:36) Eli Manning pass to the left to Odell Beckham Jr. for 5 yards to the NYG37. Tackled by Nolan Carroll.","(13:15) Eli Manning pass to the left to Jerell Adams for 9 yards to the NYG32. Tackled by Nigel Bradham.","(13:53) Eli Manning pass to the left to Odell Beckham Jr. for 4 yards to the NYG23. Tackled by Nigel Bradham.","(14:29) Paul Perkins rush up the middle for no gain to the NYG19. Tackled by Brandon Graham and Jordan Hicks.","(15:00) Paul Perkins rush up the middle for 9 yards to the NYG19. Tackled by Nigel Bradham.","(0:37) Paul Perkins rush up the middle for 4 yards to the NYG10. Tackled by Mychal Kendricks and Fletcher Cox.","(1:10) Paul Perkins rush to the right for 4 yards to the NYG6. Tackled by Nigel Bradham.","(1:13) Ryan Mathews rush up the middle for a loss of 1 yard to the NYG2. Tackled by Kerry Wynn and Devon Kennard.","(1:48) Ryan Mathews rush up the middle for 2 yards to the NYG1. Tackled by Damon Harrison.","(2:30) Ryan Mathews rush up the middle for a loss of 2 yards to the NYG3. Tackled by Landon Collins.","(3:12) Ryan Mathews rush to the left for 8 yards to the NYG1. Tackled by Landon Collins.","(3:52) Chase Daniel pass to the middle to Ryan Mathews for 16 yards to the NYG9. Tackled by Keenan Robinson.","(4:29) Ryan Mathews rush to the right for a loss of 2 yards to the NYG25. Tackled by Andrew Adams.","(4:33) Penalty: Roughing Passer on New York (Olivier Vernon) 15 yards.","(4:39) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham defensed by Dominique Rodgers-Cromartie.","(5:17) Darren Sproles rush up the middle for 1 yard to the NYG38. Tackled by Olivier Vernon.","(5:39) Penalty: False Start on Philadelphia (Jason Peters) -5 yards.","(6:26) Carson Wentz pass to the right to Zach Ertz for 19 yards to the NYG34. Tackled by Devon Kennard.","(7:09) Ryan Mathews rush to the right for 2 yards to the Phi47. Tackled by Dominique Rodgers-Cromartie.","(7:53) Carson Wentz pass to the left to Brent Celek for 6 yards to the Phi45. Tackled by Jonathan Casillas.","(8:34) Ryan Mathews rush to the left for 7 yards to the Phi39. Tackled by Kelvin Sheppard.","(9:09) Carson Wentz pass to the right to Jordan Matthews for 7 yards to the Phi32. Tackled by Trevin Wade.","(9:09) Robbie Gould kicks off to the endzone. Touchback.","(9:13) Robbie Gould 29 yard field goal attempt is GOOD. Holder: Brad Wing.","(9:19) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(9:22) Eli Manning incomplete pass to the middle intended for Odell Beckham Jr..","(10:02) Eli Manning pass to the left to Victor Cruz for 1 yard to the Phi11. Tackled by Nolan Carroll.","(10:33) Eli Manning pass to the left to Victor Cruz for 10 yards to the Phi12. Tackled by Nolan Carroll.","(10:51) Rashad Jennings rush up the middle for 19 yards to the Phi22. Tackled by Jaylen Watkins.","(10:57) Eli Manning incomplete pass to the right intended for Will Tye.","(11:41) Eli Manning pass to the left to Odell Beckham Jr. for 27 yards to the Phi41. Tackled by Malcolm Jenkins.","(12:17) Eli Manning pass to the left to Rashad Jennings for 6 yards to the NYG32. Tackled by Nigel Bradham.","(12:52) Rashad Jennings rush up the middle for 3 yards to the NYG26. Tackled by Connor Barwin and Nigel Bradham.","(13:17) Penalty: Holding on New York (Justin Pugh) -10 yards.","(13:28) Donnie Jones punts for 55 yards to NYG29. Dwayne Harris return for 4 yards to NYG33. Tackled by Nigel Bradham and Terrence Brooks.","(13:37) Carson Wentz incomplete pass to the right intended for Nelson Agholor defensed by Jonathan Casillas.","(14:16) Ryan Mathews rush to the left for a loss of 6 yards to the Phi16. Tackled by Olivier Vernon.","(14:55) Ryan Mathews rush to the left for 2 yards to the Phi22. Tackled by Keenan Robinson.","(15:00) Robbie Gould kicks off to the Phi1. Nelson Agholor return for 19 yards to Phi20. Tackled by Kerry Wynn.","(0:02) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(0:02) Philadelphia Eagles timeout.","(0:11) Carson Wentz pass to the right to Darren Sproles for 17 yards to the NYG44. Tackled by Keenan Robinson.","(0:15) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(0:16) Carson Wentz incomplete pass to the middle.","(0:33) Carson Wentz pass to the right to Zach Ertz for 14 yards to the Phi39. Tackled by Landon Collins.","(0:33) Robbie Gould kicks off to the endzone. Touchback.","(0:33) Robbie Gould extra point is good.","(0:37) Eli Manning pass to the middle to Sterling Shepard for 13 yards for a TOUCHDOWN.","(0:37) New York Giants timeout.","(0:41) Eli Manning pass to the middle to Sterling Shepard for 7 yards to the Phi13. Tackled by Malcolm Jenkins and Jordan Hicks.","(0:45) Eli Manning incomplete pass to the right intended for Victor Cruz.","(1:08) Eli Manning pass to the left to Odell Beckham Jr. for 10 yards to the Phi20. Tackled by Connor Barwin.","(1:37) Eli Manning pass to the left to Will Tye for 7 yards to the Phi30. Tackled by Nigel Bradham and Jalen Mills.","(2:00) Rashad Jennings rush to the left for a loss of 3 yards to the Phi37. Tackled by Brandon Graham.","(2:00) Two Minute Warning.","(2:07) Eli Manning pass to the left to Sterling Shepard for 6 yards to the Phi34. Tackled by Jordan Hicks.","(2:49) Eli Manning pass to the right to Victor Cruz for 5 yards to the Phi40. Tackled by Leodis McKelvin.","(3:18) Paul Perkins rush up the middle for 3 yards to the Phi45. Tackled by Vinny Curry.","(3:37) Eli Manning pass to the right to Victor Cruz for 29 yards to the Phi48.","(4:18) Eli Manning pass to the right to Will Tye for 6 yards to the NYG23. Tackled by Leodis McKelvin and Fletcher Cox.","(4:54) Paul Perkins rush to the right for 1 yard to the NYG17. Tackled by Brandon Graham and Nigel Bradham.","(4:59) Caleb Sturgis kicks off to the NYG3. Dwayne Harris return for 13 yards to NYG16. Tackled by Kamu Grugier-Hill.","(4:59) Caleb Sturgis extra point is good.","(5:05) Carson Wentz pass to the left to Nelson Agholor for 40 yards for a TOUCHDOWN.","(5:38) Carson Wentz rush up the middle for 8 yards to the Phi45. Tackled by Eli Apple. Penalty: Unnecessary Roughness on New York (Eli Apple) 15 yards.","(6:17) Carson Wentz pass to the left to Dorial Green-Beckham for 7 yards to the Phi37. Tackled by Coty Sensabaugh.","(6:56) Ryan Mathews rush to the right for 4 yards to the Phi30. Tackled by Landon Collins.","(7:28) Ryan Mathews rush up the middle for 1 yard to the Phi26. Tackled by Romeo Okwara.","(7:28) Robbie Gould kicks off to the endzone. Touchback.","(7:32) Robbie Gould 35 yard field goal attempt is GOOD. Holder: Brad Wing.","(7:36) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(8:09) Eli Manning pass to the left to Rashad Jennings for a loss of 2 yards to the Phi17. Tackled by Beau Allen.","(8:35) Rashad Jennings rush up the middle for 3 yards to the Phi15. Tackled by Rodney McLeod.","(9:01) Eli Manning pass to the left to Victor Cruz for 12 yards to the Phi18. Tackled by Nolan Carroll.","(9:39) Eli Manning pass to the middle to Odell Beckham Jr. for 13 yards to the Phi30. Tackled by Bennie Logan.","(10:24) Eli Manning pass to the left to Rashad Jennings for 3 yards to the Phi43. Tackled by Nigel Bradham.","(11:00) Rashad Jennings rush up the middle for no gain to the Phi46. Tackled by Fletcher Cox.","(11:28) Eli Manning pass to the left to Sterling Shepard for 10 yards to the Phi46. Tackled by Malcolm Jenkins.","(11:39) Donnie Jones punts for 43 yards to NYG49. Dwayne Harris return for a loss of 5 yards to NYG44. Tackled by Terrence Brooks. FUMBLE, recovered by NYG (Trevin Wade).","(12:16) Ryan Mathews rush to the right for a loss of 1 yard to the Phi8. Tackled by Johnathan Hankins and Romeo Okwara.","(12:16) Philadelphia Eagles timeout.","(13:04) Carson Wentz pass to the right to Brent Celek for 5 yards to the Phi9. Tackled by Devon Kennard.","(13:44) Ryan Mathews rush up the middle for 2 yards to the Phi4. Tackled by Devon Kennard.","(13:53) Brad Wing punts for 56 yards to Phi2. No return.","(13:56) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(14:39) Paul Perkins rush to the right for 4 yards to the NYG42. Tackled by Jordan Hicks.","(14:43) Eli Manning incomplete pass to the middle intended for Sterling Shepard.","(14:56) Carson Wentz pass intended for Bryce Treggs INTERCEPTED by Dominique Rodgers-Cromartie. No return.","(14:56) Philadelphia Eagles timeout.","(15:00) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(0:05) Ryan Mathews rush up the middle for 2 yards to the Phi24. Tackled by Landon Collins.","(0:10) Robbie Gould kicks off to the Phi3. Nelson Agholor return for 19 yards to Phi22. Tackled by Deontae Skinner.","(0:14) Robbie Gould 35 yard field goal attempt is GOOD. Holder: Brad Wing.","(0:19) Eli Manning incomplete pass to the right intended for Rashad Jennings.","(0:24) Eli Manning incomplete pass to the left intended for Sterling Shepard defensed by Leodis McKelvin.","(1:04) Rashad Jennings rush to the left for 2 yards to the Phi17. Tackled by Connor Barwin and Jaylen Watkins.","(1:42) Rashad Jennings rush up the middle for 12 yards to the Phi19. Tackled by Malcolm Jenkins.","(2:18) Eli Manning pass to the left to Odell Beckham Jr. for 30 yards to the Phi31. Tackled by Leodis McKelvin.","(3:00) Paul Perkins rush up the middle for 1 yard to the NYG39. Tackled by Beau Allen and Destiny Vaeao.","(3:36) Paul Perkins rush to the left for 4 yards to the NYG38. Tackled by Jordan Hicks.","(4:11) Eli Manning pass to the left to Sterling Shepard for 11 yards to the NYG34.","(4:50) Paul Perkins rush to the left for a loss of 2 yards to the NYG23. Tackled by Connor Barwin.","(5:24) Paul Perkins rush up the middle for 20 yards to the NYG25. Tackled by Rodney McLeod.","(5:58) Paul Perkins rush up the middle for 2 yards to the NYG5. Tackled by Connor Barwin.","(6:07) Donnie Jones punts for 53 yards to NYG3. No return.","(6:45) Carson Wentz pass to the left to Darren Sproles for 6 yards to the Phi44. Tackled by Trevin Wade.","(7:31) Carson Wentz pass to the left to Trey Burton for 3 yards to the Phi38. Tackled by Landon Collins.","(7:34) Carson Wentz incomplete pass to the right intended for Nelson Agholor.","(7:41) Brad Wing punts for 39 yards to Phi35. No return.","(7:45) Eli Manning incomplete pass to the right intended for Victor Cruz.","(7:48) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(8:20) Rashad Jennings rush to the left for 1 yard to the NYG26. Tackled by Beau Allen.","(8:20) Caleb Sturgis kicks off to the endzone. Touchback.","(8:20) Caleb Sturgis extra point is good.","(8:29) Eli Manning pass intended for Will Tye INTERCEPTED by Malcolm Jenkins and returned for 34 yards for a TOUCHDOWN.","(9:08) Paul Perkins rush to the left for 4 yards to the NYG27. Tackled by Jordan Hicks.","(9:42) Eli Manning pass to the left to Will Tye for 1 yard to the NYG23. Tackled by Nigel Bradham.","(9:48) Caleb Sturgis kicks off to the NYG0. Bobby Rainey return for 22 yards to NYG22. Tackled by Trey Burton.","(9:48) Caleb Sturgis extra point is good.","(9:54) Darren Sproles rush to the right for 25 yards for a TOUCHDOWN.","(10:39) Carson Wentz rush to the left for 9 yards to the NYG25.","(11:18) Ryan Mathews rush to the left for 2 yards to the NYG34. Tackled by Dominique Rodgers-Cromartie.","(11:56) Ryan Mathews rush to the right for 5 yards to the NYG36. Tackled by Damon Harrison.","(12:34) Ryan Mathews rush up the middle for 4 yards to the NYG41. Tackled by Romeo Okwara.","(13:19) Carson Wentz pass to the left to Brent Celek for 16 yards to the NYG45. Tackled by Kelvin Sheppard.","(14:01) Ryan Mathews rush to the right for 17 yards to the Phi39. Tackled by Eli Apple.","(14:08) Brad Wing punts for 50 yards to Phi22. No return.","(14:12) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(14:17) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by Malcolm Jenkins.","(14:54) Rashad Jennings rush up the middle for 7 yards to the NYG28. Tackled by Mychal Kendricks.","(15:00) Caleb Sturgis kicks off to the NYG-3. Dwayne Harris return for 24 yards to NYG21. Tackled by Najee Goode."]