["(0:08) Trevor Siemian pass intended for Jordan Taylor INTERCEPTED by Eric Berry and returned for 19 yards. Tackled by Max Garcia.","(0:08) Denver Broncos timeout.","(0:18) Trevor Siemian pass to the right to Henry Krieger-Coble for 13 yards to the KC26. Tackled by Eric Murray.","(0:23) Trevor Siemian incomplete pass to the left intended for Bennie Fowler defensed by Steven Nelson.","(0:46) Juwan Thompson rush to the right for 7 yards to the KC39. Tackled by Ramik Wilson and Kendall Reyes.","(0:52) Trevor Siemian incomplete pass to the left intended for Juwan Thompson.","(1:17) Juwan Thompson rush up the middle for 14 yards to the KC46. Tackled by Ramik Wilson.","(1:21) Trevor Siemian incomplete pass to the left.","(1:45) Juwan Thompson rush to the right for a loss of 2 yards to the Den40. Tackled by Daniel Sorensen.","(1:52) Cairo Santos kicks off to the Den17. Kalif Raymond return for 25 yards to Den42. Tackled by James O'Shaughnessy.","(1:52) Cairo Santos extra point is NO GOOD.","(1:55) Dontari Poe pass to the middle to Demetrius Harris for 2 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Kansas City (Demetrius Harris) -15 yards.","(1:55) Denver Broncos timeout.","(2:00) Charcandrick West rush up the middle for 1 yard to the Den2. Tackled by Todd Davis.","(2:00) Two Minute Warning.","(2:46) Charcandrick West rush to the left for a loss of 2 yards to the Den3. Tackled by Will Parks.","(3:31) Charcandrick West rush to the left for 5 yards to the Den1. Tackled by Chris Harris Jr. and Todd Davis.","(4:15) Charcandrick West rush up the middle for 2 yards to the Den6. Tackled by Todd Davis.","(4:22) Charcandrick West rush to the left for 7 yards to the Den8. Tackled by Corey Nelson.","(5:05) Charcandrick West rush to the right for 6 yards to the Den15. Tackled by Corey Nelson.","(5:06) Denver Broncos timeout.","(5:12) Charcandrick West rush up the middle for 3 yards to the Den21. Tackled by Von Miller.","(5:55) Charcandrick West rush up the middle for 3 yards to the Den24. Tackled by Jared Crick.","(6:23) Charcandrick West rush up the middle for 1 yard to the Den42. Tackled by Sylvester Williams. Penalty: Face Mask on Denver (Sylvester Williams) 15 yards.","(6:35) Trevor Siemian pass to the right to Devontae Booker for a loss of 1 yard to the KC42. Tackled by Daniel Sorensen. FUMBLE, recovered by KC (Daniel Sorensen) and returned for 1 yard. Tackled by Bennie Fowler. Penalty: Unsports. Conduct on Denver (Donald Stephenson) 15 yards.","(6:55) Penalty: False Start on Denver (Donald Stephenson) -5 yards.","(7:34) Devontae Booker rush up the middle for 7 yards to the KC36. Tackled by Ramik Wilson.","(7:39) Trevor Siemian incomplete pass to the left intended for Devontae Booker.","(8:15) Trevor Siemian pass to the left to Jordan Taylor for 26 yards to the KC43. Tackled by Terrance Mitchell.","(8:46) Trevor Siemian pass to the right to Demaryius Thomas for 6 yards to the Den31. Tackled by Marcus Peters.","(8:51) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas defensed by Marcus Peters.","(8:51) Cairo Santos kicks off to the endzone. Touchback.","(8:55) Cairo Santos 39 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(8:59) Alex Smith incomplete pass to the right intended for Demetrius Harris.","(9:44) Alex Smith pass to the right to Travis Kelce for a loss of 1 yard to the Den21. Tackled by Todd Davis.","(10:08) Alex Smith pass to the right to Jeremy Maclin for 4 yards to the Den20. Tackled by Chris Harris Jr..","(11:01) Alex Smith pass to the left to Demetrius Harris for 10 yards to the Den24. Tackled by Todd Davis.","(11:01) Kansas City Chiefs timeout.","(11:49) Charcandrick West rush up the middle for 2 yards to the Den34. Tackled by Shane Ray and Aqib Talib.","(11:59) Cairo Santos kicks off to the Den2. Kalif Raymond return for 29 yards to Den31. Tackled by Anthony Sherman. FUMBLE, recovered by KC (Daniel Sorensen). Tackled by Shaquil Barrett.","(12:02) Cairo Santos 27 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(12:06) Alex Smith incomplete pass to the middle intended for Tyreek Hill.","(12:11) Alex Smith incomplete pass to the left intended for Demetrius Harris.","(12:55) Alex Smith pass to the left to Travis Kelce for 3 yards to the Den9. Tackled by Todd Davis.","(13:39) Alex Smith rush up the middle for 13 yards to the Den12. Tackled by Todd Davis.","(14:21) Spencer Ware rush up the middle for 3 yards to the Den25. Tackled by Todd Davis and Sylvester Williams.","(15:00) Alex Smith pass to the left to Chris Conley for 8 yards to the Den28. Tackled by Aqib Talib.","(0:35) Spencer Ware rush up the middle for 5 yards to the Den36. Tackled by Todd Davis.","(1:20) Alex Smith pass to the left to Travis Kelce for 15 yards to the Den41. Tackled by Justin Simmons.","(1:37) Penalty: Offside on Denver (Von Miller) 5 yards.","(2:23) Tyreek Hill rush up the middle for a loss of 4 yards to the KC39. Tackled by Justin Simmons.","(2:58) Spencer Ware rush up the middle for 5 yards to the KC43. Tackled by Adam Gotsis and Von Miller.","(3:06) Riley Dixon punts for 39 yards to KC41. Tyreek Hill return for a loss of 3 yards to KC38. Tackled by Bennie Fowler.","(3:13) Trevor Siemian incomplete pass to the middle intended for Cody Latimer.","(3:20) Trevor Siemian incomplete pass to the right.","(3:54) Justin Forsett rush up the middle for 6 yards to the Den20. Tackled by Tamba Hali and Terrance Mitchell.","(4:02) Dustin Colquitt punts for 29 yards to Den14. No return.","(4:02) Penalty: False Start on Kansas City (Anthony Sherman) -5 yards.","(4:06) Alex Smith incomplete pass to the left intended for Tyreek Hill.","(4:06) Penalty: False Start on Kansas City (Mitchell Schwartz) -5 yards.","(4:10) Alex Smith incomplete pass to the middle intended for Tyreek Hill.","(4:15) Alex Smith incomplete pass to the middle intended for Demetrius Harris defensed by Justin Simmons.","(5:06) Alex Smith pass to the left to Travis Kelce for 3 yards to the Den33. Tackled by Darian Stewart.","(5:46) Spencer Ware rush up the middle for 1 yard to the Den36. Tackled by Von Miller.","(6:23) Alex Smith pass to the left to Demetrius Harris for 6 yards to the Den37. Tackled by Shane Ray.","(7:04) Alex Smith pass to the right to Travis Kelce for 17 yards to the Den43. Tackled by Justin Simmons.","(7:44) Tyreek Hill rush to the left for a loss of 3 yards to the KC40. Tackled by Darian Stewart.","(8:23) Alex Smith rush to the left for 24 yards to the KC43. Tackled by Darian Stewart.","(8:35) Riley Dixon punts for 51 yards to KC16. Tyreek Hill return for 3 yards to KC19. Tackled by Will Parks.","(8:41) Trevor Siemian incomplete pass to the left intended for Devontae Booker.","(9:23) Trevor Siemian pass to the left to Devontae Booker for a loss of 4 yards to the Den33. Tackled by Rakeem Nunez-Roches.","(9:46) Penalty: False Start on Denver (Donald Stephenson) -5 yards.","(10:10) Penalty: Offside on Kansas City (Chris Jones) 5 yards.","(10:15) Trevor Siemian incomplete pass to the right.","(10:52) Trevor Siemian pass to the left to Emmanuel Sanders for 26 yards to the Den37. Tackled by Terrance Mitchell.","(11:30) Devontae Booker rush up the middle for 3 yards to the Den11. Tackled by Ramik Wilson.","(11:35) Trevor Siemian incomplete pass to the right intended for Devontae Booker.","(11:48) Dustin Colquitt punts for 52 yards to Den8. Kalif Raymond - no return. FUMBLE, recovered by Den (Kalif Raymond).","(12:24) Alex Smith pass to the left to Jeremy Maclin for 5 yards to the KC40. Tackled by Corey Nelson.","(13:02) Alex Smith pass to the right to Jeremy Maclin for no gain to the KC35. Tackled by Chris Harris Jr..","(13:45) Alex Smith pass to the left to Spencer Ware for no gain to the KC35. Tackled by Shaquil Barrett and Jared Crick. FUMBLE, recovered by KC.","(14:25) Spencer Ware rush up the middle for 4 yards to the KC35. Tackled by Jared Crick.","(15:00) Alex Smith pass to the middle to Demetrius Harris for 6 yards to the KC31. Tackled by Corey Nelson.","(15:00) Brandon McManus kicks off to the endzone. Touchback.","(0:12) Alex Smith rush up the middle for a loss of 1 yard to the KC31.","(0:17) Alex Smith pass to the right to Albert Wilson for 3 yards to the KC32. Tackled by Shaquil Barrett.","(0:23) Brandon McManus rush to the left for 6 yards to the KC29. Tackled by Eric Murray.","(0:30) Trevor Siemian incomplete pass to the left intended for Kalif Raymond.","(0:30) Kansas City Chiefs timeout.","(0:54) Trevor Siemian pass to the right to Bennie Fowler for 5 yards to the KC35. Tackled by Kenneth Acker.","(0:58) Trevor Siemian incomplete pass to the left intended for Jeff Heuerman.","(1:03) Penalty: False Start on Denver (Donald Stephenson) -5 yards.","(1:12) Trevor Siemian pass to the right to Jordan Norwood for 17 yards to the Den50. Penalty: Unnecessary Roughness on Kansas City (Chris Jones) 15 yards.","(1:20) Dustin Colquitt punts for 40 yards to Den33. No return.","(1:20) Denver Broncos timeout.","(1:24) Charcandrick West rush up the middle for 4 yards to the KC27. Tackled by Von Miller.","(1:24) Penalty: False Start on Kansas City (Alex Smith) -5 yards.","(1:28) Alex Smith incomplete pass to the left intended for Jeremy Maclin.","(1:49) Charcandrick West rush up the middle for 2 yards to the KC28. Tackled by DeMarcus Ware and Jared Crick.","(1:49) Two Minute Warning.","(2:01) Riley Dixon punts for 61 yards to KC16. Tyreek Hill return for 10 yards to KC26. Tackled by Will Parks.","(2:33) Devontae Booker rush to the left for a loss of 3 yards to the Den23. Tackled by Dee Ford.","(3:16) Trevor Siemian pass to the left to Demaryius Thomas for 9 yards to the Den26. Tackled by Terrance Mitchell.","(3:21) Trevor Siemian incomplete pass to the middle intended for Jeff Heuerman defensed by Dontari Poe.","(3:28) Dustin Colquitt punts for 43 yards to Den17. No return.","(3:28) Denver Broncos timeout.","(3:38) Alex Smith pass to the right to Charcandrick West for 3 yards to the KC40. Tackled by Von Miller and Aqib Talib.","(4:03) Penalty: Holding on Kansas City (Jah Reid) -10 yards.","(4:43) Spencer Ware rush up the middle for 6 yards to the KC47. Tackled by Todd Davis.","(5:18) Spencer Ware rush up the middle for 3 yards to the KC41. Tackled by Shane Ray.","(5:52) Alex Smith pass to the right to Travis Kelce for 8 yards to the KC38. Tackled by Will Parks.","(5:57) Alex Smith incomplete pass to the right intended for Travis Kelce.","(6:38) Tyreek Hill rush to the left for 5 yards to the KC30. Tackled by Shane Ray.","(6:38) Brandon McManus kicks off to the endzone. Touchback.","(6:43) Brandon McManus 52 yard field goal attempt is GOOD. Holder: Riley Dixon.","(6:47) Trevor Siemian incomplete pass to the left intended for Jeff Heuerman.","(6:53) Trevor Siemian incomplete pass to the middle intended for Demaryius Thomas defensed by Ron Parker.","(6:59) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(7:41) Trevor Siemian pass to the left to Devontae Booker for 21 yards to the KC34. Tackled by Ramik Wilson.","(8:25) Trevor Siemian pass to the middle to Jeff Heuerman for 16 yards to the Den45. Tackled by Frank Zombo.","(8:29) 39 yard field goal attempt by Cairo Santos is NO GOOD. Holder: Dustin Colquitt.","(9:05) Alex Smith pass to the right to Chris Conley for 6 yards to the Den21. Tackled by Chris Harris Jr..","(9:08) Alex Smith incomplete pass to the left intended for Tyreek Hill.","(9:13) Alex Smith incomplete pass to the right intended for Spencer Ware.","(9:21) Penalty: Holding on Denver (Todd Davis) 5 yards.","(10:04) Alex Smith pass to the middle to Demetrius Harris for 11 yards to the Den32. Tackled by Corey Nelson.","(10:33) Alex Smith pass to the left to Demetrius Harris for 2 yards to the Den43. Tackled by Todd Davis. FUMBLE, recovered by KC.","(11:10) Spencer Ware rush up the middle for 6 yards to the Den45. Tackled by Von Miller.","(11:42) Alex Smith pass to the left to Spencer Ware for 20 yards to the KC49.","(12:15) Alex Smith pass to the right to Travis Kelce for 9 yards to the KC29. Tackled by Darian Stewart.","(12:22) Riley Dixon punts for 40 yards to KC20. No return.","(13:02) Trevor Siemian pass to the right to Devontae Booker for 9 yards to the Den40. Tackled by Dontari Poe.","(13:32) Penalty: Holding on Denver (Michael Schofield) -10 yards.","(14:12) Justin Forsett rush to the right for 1 yard to the Den41. Tackled by Dee Ford.","(14:22) Trevor Siemian incomplete pass to the right intended for Jordan Taylor defensed by Terrance Mitchell.","(15:00) Trevor Siemian pass to the left to Jeff Heuerman for 7 yards to the Den40. Tackled by Daniel Sorensen.","(0:23) Trevor Siemian pass to the left to Devontae Booker for 3 yards to the Den33. Tackled by Steven Nelson.","(0:53) Penalty: Illegal Contact on Kansas City (Terrance Mitchell) 5 yards.","(0:53) Cairo Santos kicks off to the endzone. Touchback.","(0:53) Cairo Santos extra point is good.","(1:08) Alex Smith pass to the right to Travis Kelce for 80 yards for a TOUCHDOWN.","(1:48) Spencer Ware rush to the right for 4 yards to the KC20. Tackled by Corey Nelson.","(1:54) Brandon McManus kicks off to the KC-1. Tyreek Hill return for 17 yards to KC16. Tackled by Dekoda Watson.","(1:54) Brandon McManus extra point is good.","(1:57) Justin Forsett rush up the middle for 1 yard for a TOUCHDOWN.","(2:35) Trevor Siemian pass to the left to Demaryius Thomas for 5 yards to the KC1. Tackled by Terrance Mitchell.","(2:47) Alex Smith pass intended for Tyreek Hill INTERCEPTED by Justin Simmons and returned for 38 yards. Tackled by Mitch Morse.","(3:32) Charcandrick West rush to the left for 3 yards to the KC21. Tackled by Derek Wolfe.","(4:09) Charcandrick West rush up the middle for a loss of 2 yards to the KC18. Tackled by Von Miller.","(4:17) Riley Dixon punts for 53 yards to KC0. Touchback.","(4:22) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(4:28) Trevor Siemian incomplete pass to the right intended for Devontae Booker.","(4:38) Penalty: False Start on Denver (Max Garcia) -5 yards.","(5:08) Devontae Booker rush to the left for 8 yards to the KC48. Tackled by Ramik Wilson.","(5:17) Cairo Santos kicks off to the Den4. Kalif Raymond return for 40 yards to Den44. Tackled by Cairo Santos.","(5:17) Cairo Santos extra point is good.","(5:31) Tyreek Hill rush to the left for 70 yards for a TOUCHDOWN.","(6:08) Spencer Ware rush up the middle for 2 yards to the KC30. Tackled by Justin Simmons and Todd Davis.","(6:46) Alex Smith pass to the left to Travis Kelce for 8 yards to the KC28. Tackled by Will Parks.","(7:29) Spencer Ware rush up the middle for 1 yard to the KC20. Tackled by Derek Wolfe.","(7:39) Riley Dixon punts for 39 yards to KC8. Tyreek Hill return for 11 yards to KC19. Tackled by Shaquil Barrett.","(7:43) Trevor Siemian incomplete pass to the middle intended for Demaryius Thomas.","(7:48) Trevor Siemian incomplete pass to the right intended for Cody Latimer defensed by Chris Jones.","(7:53) Trevor Siemian incomplete pass to the left intended for Jordan Taylor.","(8:23) Devontae Booker rush up the middle for 12 yards to the KC47. Tackled by Terrance Mitchell.","(8:59) Trevor Siemian pass to the left to Devontae Booker for 16 yards to the Den41. Tackled by Eric Berry.","(8:59) Cairo Santos kicks off to the endzone. Touchback.","(8:59) Cairo Santos extra point is good.","(9:05) Alex Smith rush to the left for 10 yards for a TOUCHDOWN.","(9:44) Alex Smith pass to the middle to Travis Kelce for 14 yards to the Den10. Tackled by Justin Simmons.","(10:27) Tyreek Hill rush to the left for a loss of 1 yard to the Den24. Tackled by Corey Nelson.","(11:14) Spencer Ware rush up the middle for 18 yards to the Den23. Tackled by Von Miller.","(11:41) Tyreek Hill rush to the right for 28 yards to the Den41. Tackled by Todd Davis.","(12:17) Alex Smith pass to the right to Travis Kelce for 4 yards to the KC31. Tackled by Aqib Talib.","(12:50) Spencer Ware rush up the middle for 4 yards to the KC27. Tackled by Jared Crick.","(13:00) Riley Dixon punts for 43 yards to KC23. No return.","(13:04) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas defensed by Chris Jones.","(13:10) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(13:38) Justin Forsett rush up the middle for no gain to the Den34. Tackled by Chris Jones.","(14:18) Trevor Siemian pass to the left to Jeff Heuerman for 9 yards to the Den34. Tackled by Steven Nelson.","(14:23) Trevor Siemian incomplete pass to the right intended for Justin Forsett.","(14:54) Justin Forsett rush to the right for 3 yards to the Den25. Tackled by Terrance Smith.","(15:00) Cairo Santos kicks off to the Den3. Kalif Raymond return for 19 yards to Den22. Tackled by James O'Shaughnessy."]