["(0:00) 45 yard field goal attempt by Josh Lambo is NO GOOD. Holder: Kellen Clemens.","(0:28) Philip Rivers pass to the left to Antonio Gates for 11 yards to the Cle27. Tackled by Jamar Taylor.","(0:43) Philip Rivers rush up the middle for no gain to the Cle35. FUMBLE, recovered by SD (Philip Rivers).","(0:44) Philip Rivers incomplete pass to the middle.","(1:06) Philip Rivers pass to the right to Antonio Gates for 25 yards to the Cle35. Tackled by Ed Reynolds.","(1:11) Philip Rivers incomplete pass to the left intended for Tyrell Williams defensed by Tramon Williams.","(1:15) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(1:19) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(1:25) Philip Rivers pass to the right to Antonio Gates for 12 yards to the SD40.","(1:46) Philip Rivers pass to the middle to Antonio Gates for 6 yards to the SD28. Tackled by Jamie Collins.","(1:52) Britton Colquitt punts for 41 yards to SD22. No return.","(1:52) Two Minute Warning.","(2:02) Cody Kessler sacked at Cle37 for a loss of 1 yard by Korey Toomer.","(2:47) Isaiah Crowell rush to the right for a loss of 3 yards to the Cle38. Tackled by Corey Liuget.","(2:47) San Diego Chargers timeout.","(2:52) Duke Johnson Jr. rush to the right for 6 yards to the Cle41. Tackled by Korey Toomer.","(2:52) San Diego Chargers timeout.","(2:59) Cody Kessler pass to the left to Corey Coleman for 9 yards to the Cle35. Tackled by Trovon Reed.","(2:59) San Diego Chargers timeout.","(3:04) Isaiah Crowell rush to the right for 5 yards to the Cle26. Tackled by Jahleel Addae.","(3:45) Isaiah Crowell rush to the right for a loss of 1 yard to the Cle21. Tackled by Melvin Ingram.","(3:49) Josh Lambo 32 yard field goal attempt is BLOCKED by Jamie Meder.","(3:54) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(4:00) Philip Rivers incomplete pass to the middle intended for Tyrell Williams defensed by Jamar Taylor.","(4:42) Ronnie Hillman rush to the left for a loss of 1 yard to the Cle14. Tackled by Tramon Williams.","(4:49) Philip Rivers pass to the left to Antonio Gates for 20 yards to the Cle13. Tackled by Christian Kirksey.","(5:37) Britton Colquitt punts for 41 yards to Cle44. Isaiah Burse return for 11 yards to Cle33. Tackled by Christian Kirksey.","(5:37) Cody Kessler sacked at Cle3 for a loss of 10 yards by Melvin Ingram.","(6:10) Cody Kessler pass to the right to Isaiah Crowell for 2 yards to the Cle13. Tackled by Jatavis Brown.","(6:48) Isaiah Crowell rush to the left for no gain to the Cle11. Tackled by Melvin Ingram.","(6:59) Drew Kaser punts for 57 yards to Cle4. Mario Alford return for 7 yards to Cle11. Tackled by Korey Toomer.","(7:32) Kenneth Farrow rush to the left for a loss of 1 yard to the SD39. Tackled by Jamar Taylor and Tramon Williams.","(7:36) Philip Rivers incomplete pass to the right intended for Antonio Gates defensed by Tracy Howard.","(8:24) Philip Rivers pass to the right to Dontrelle Inman for 19 yards to the SD40. Tackled by Briean Boddy-Calhoun.","(8:46) Penalty: Holding on San Diego (Kenny Wiggins) -10 yards.","(9:23) Philip Rivers pass to the left to Kenneth Farrow for 10 yards to the SD31. Tackled by Carl Nassib.","(10:05) Kenneth Farrow rush to the left for 3 yards to the SD21. Tackled by Jamar Taylor and Jamie Collins.","(10:15) Britton Colquitt punts for 50 yards to SD18. Isaiah Burse - no return. Tackled by Ricardo Louis.","(10:20) Cody Kessler incomplete pass to the right intended for Corey Coleman defensed by Trovon Reed.","(10:50) Robert Griffin III sacked at Cle32 for no gain by Darius Philon.","(11:19) Isaiah Crowell rush to the right for no gain to the Cle32. Tackled by Denzel Perryman and Ryan Carrethers.","(11:29) Drew Kaser punts for 53 yards to Cle28. Mario Alford return for 4 yards to Cle32. Tackled by Derek Watt.","(11:49) Philip Rivers incomplete pass to the left intended for Dontrelle Inman defensed by Tramon Williams.","(11:54) Philip Rivers incomplete pass to the left intended for Dontrelle Inman.","(12:00) Philip Rivers incomplete pass to the left intended for Dontrelle Inman defensed by Jamar Taylor.","(12:09) Britton Colquitt punts for 42 yards to SD18. Isaiah Burse return for 1 yard to SD19. Tackled by Ricardo Louis.","(12:29) Robert Griffin III pass to the left to Gary Barnidge for 9 yards to the Cle40. Tackled by Kyle Emanuel and Trevor Williams.","(12:36) Penalty: False Start on Cleveland -5 yards.","(13:22) Robert Griffin III pass to the right to Isaiah Crowell for a loss of 1 yard to the Cle36. Tackled by Jatavis Brown.","(13:43) Duke Johnson Jr. rush to the right for a loss of 3 yards to the Cle37. Tackled by Dwight Lowery and Trevor Williams.","(13:49) Penalty: Roughing Passer on San Diego (Joey Bosa) 15 yards.","(14:25) Robert Griffin III rush to the left for a loss of 1 yard to the Cle25. Tackled by Joey Bosa.","(15:00) Robert Griffin III sacked at Cle26 for a loss of 5 yards by Damion Square.","(0:18) Robert Griffin III pass to the right to Gary Barnidge for 12 yards to the Cle31. Tackled by Adrian Phillips.","(0:57) Robert Griffin III sacked at Cle19 for a loss of 5 yards by Denzel Perryman.","(1:34) Isaiah Crowell rush to the right for 3 yards to the Cle24. Tackled by Ryan Carrethers.","(1:45) Drew Kaser punts for 35 yards to Cle21. No return.","(1:50) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(1:53) Philip Rivers incomplete pass to the left intended for Ronnie Hillman.","(1:59) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(2:36) Philip Rivers pass to the right to Derek Watt for 16 yards to the SD44. Tackled by Marcus Burley.","(3:16) Ronnie Hillman rush to the right for 3 yards to the SD28. Tackled by Christian Kirksey.","(3:56) Ronnie Hillman rush to the right for no gain to the SD25. Tackled by Joe Haden and Danny Shelton.","(4:09) Britton Colquitt punts for 51 yards to SD17. Isaiah Burse return for 8 yards to SD25. Tackled by Joe Schobert.","(4:47) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 7 yards to the Cle32. Tackled by Trevor Williams.","(5:30) Robert Griffin III sacked at Cle25 for a loss of 4 yards by Joey Bosa.","(6:04) Duke Johnson Jr. rush to the right for 4 yards to the Cle29. Tackled by Joey Bosa.","(6:04) Josh Lambo kicks off to the endzone. Touchback.","(6:04) Josh Lambo extra point is good.","(6:09) Philip Rivers pass to the left to Tyrell Williams for 1 yard for a TOUCHDOWN.","(6:17) Philip Rivers incomplete pass to the right intended for Geremy Davis.","(6:43) Ronnie Hillman rush to the left for no gain to the Cle1. Tackled by Demario Davis and Christian Kirksey.","(6:43) Cleveland Browns timeout.","(6:49) Penalty: Pass Interference on Cleveland (Jamar Taylor) 19 yards.","(6:55) Philip Rivers incomplete pass to the right intended for Antonio Gates.","(7:40) Ronnie Hillman rush to the right for 2 yards to the Cle20. Tackled by Ed Reynolds.","(8:12) Philip Rivers pass to the right to Dontrelle Inman for 17 yards to the Cle22. Tackled by Joe Haden.","(8:19) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(8:55) Philip Rivers pass to the left to Tyrell Williams for 16 yards to the Cle39. Tackled by Tramon Williams.","(9:45) Philip Rivers pass to the left to Tyrell Williams for 20 yards to the SD45. Tackled by Briean Boddy-Calhoun and Ed Reynolds.","(10:32) Ronnie Hillman rush to the left for a loss of 1 yard to the SD25. Tackled by Jamar Taylor and Jamie Collins.","(10:56) Ronnie Hillman rush to the right for 1 yard to the SD26. Tackled by Ed Reynolds and Carl Nassib.","(10:58) Cody Parkey kicks off to the endzone. Touchback.","(11:44) Cody Parkey 27 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(11:44) Robert Griffin III pass to the right to Isaiah Crowell for a loss of 2 yards to the SD9. Tackled by Denzel Perryman.","(12:23) Isaiah Crowell rush to the right for 6 yards to the SD7. Tackled by Denzel Perryman.","(12:29) Robert Griffin III incomplete pass to the right intended for Andrew Hawkins.","(13:17) Penalty: False Start on Cleveland (Cameron Erving) -5 yards.","(13:17) Duke Johnson Jr. rush to the left for 22 yards to the SD8. Tackled by Trevor Williams.","(13:40) Robert Griffin III pass to the right to Danny Vitale for 15 yards to the SD30. Tackled by Denzel Perryman.","(14:13) Isaiah Crowell rush to the right for 10 yards to the SD45.","(14:55) Robert Griffin III pass to the right to Terrelle Pryor Sr. for 11 yards to the Cle45. Tackled by Jatavis Brown.","(15:00) Josh Lambo kicks off to the Cle3. Mario Alford return for 31 yards to Cle34. Tackled by Korey Toomer.","(0:41) Robert Griffin III sacked at Cle20 for a loss of 11 yards by Joey Bosa.","(0:53) Drew Kaser punts for 57 yards to Cle23. Mario Alford return for 8 yards to Cle31. Tackled by Joshua Perry.","(0:53) Cleveland Browns timeout.","(0:57) Ronnie Hillman rush to the right for 1 yard to the SD20. Tackled by Cam Johnson and Emmanuel Ogbah.","(1:21) Philip Rivers pass to the right to Dontrelle Inman for 8 yards to the SD19. Tackled by Joe Haden.","(1:25) Philip Rivers incomplete pass to the right intended for Ronnie Hillman.","(1:32) Britton Colquitt punts for 33 yards to SD11. No return.","(1:36) Robert Griffin III incomplete pass to the left intended for Gary Barnidge.","(1:43) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(1:48) Robert Griffin III incomplete pass to the left intended for Rashard Higgins.","(1:51) Penalty: Illegal Use of Hands on San Diego (Melvin Ingram) 5 yards.","(2:00) Robert Griffin III pass to the left to Corey Coleman for 6 yards to the SD49. Tackled by Jatavis Brown.","(2:00) Two Minute Warning.","(2:13) Robert Griffin III pass to the right to Andrew Hawkins for 21 yards to the Cle45. Tackled by Jatavis Brown.","(2:41) Duke Johnson Jr. rush to the right for no gain to the Cle24. Tackled by Corey Liuget.","(2:49) Drew Kaser punts for 49 yards to Cle24. No return.","(2:55) Philip Rivers incomplete pass to the left intended for Travis Benjamin.","(3:14) Penalty: False Start on San Diego (Spencer Pulley) -5 yards.","(3:58) Kenneth Farrow rush to the right for 1 yard to the SD32. Tackled by Christian Kirksey.","(4:29) Philip Rivers pass to the right to Kenneth Farrow for 16 yards to the SD31. Tackled by Jamie Collins.","(4:46) Penalty: Holding on San Diego (D.J. Fluker) -10 yards.","(4:46) Cody Parkey kicks off to the endzone. Touchback.","(4:49) Cody Parkey 49 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(4:51) Cleveland Browns timeout.","(5:33) Robert Griffin III sacked at SD31 for a loss of 4 yards by Jatavis Brown and Kyle Emanuel.","(6:11) Isaiah Crowell rush to the right for 3 yards to the SD27. Tackled by Dwight Lowery.","(6:18) Robert Griffin III incomplete pass to the left intended for Corey Coleman.","(6:57) Robert Griffin III rush to the left for 12 yards to the SD30. Tackled by Dwight Lowery.","(7:01) Robert Griffin III incomplete pass to the left intended for Isaiah Crowell.","(7:45) Robert Griffin III rush up the middle for 8 yards to the SD42. Tackled by Jatavis Brown.","(8:26) Robert Griffin III pass to the left to Gary Barnidge for 5 yards to the Cle50. Tackled by Dwight Lowery.","(8:59) Duke Johnson Jr. rush to the left for a loss of 3 yards to the Cle45. Tackled by Jahleel Addae.","(9:35) Robert Griffin III pass to the middle to Terrelle Pryor Sr. for 18 yards to the Cle48. Tackled by Adrian Phillips.","(9:46) Philip Rivers pass intended for Antonio Gates INTERCEPTED by Jamar Taylor and returned for 17 yards. Tackled by Chris Hairston.","(10:20) Philip Rivers pass to the left to Travis Benjamin for 10 yards to the Cle45. Tackled by Briean Boddy-Calhoun.","(11:06) Philip Rivers pass to the right to Antonio Gates for 8 yards to the SD45. Tackled by Christian Kirksey.","(11:10) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(11:55) Philip Rivers pass to the right to Antonio Gates for 11 yards to the SD37. Tackled by Emmanuel Ogbah.","(12:01) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(12:39) Ronnie Hillman rush to the right for 1 yard to the SD26. Tackled by Ed Reynolds and Joe Haden.","(12:39) Cody Parkey kicks off to the endzone. Touchback.","(12:39) Cody Parkey extra point is good.","(12:42) Isaiah Crowell rush to the right for 4 yards for a TOUCHDOWN.","(13:08) Robert Griffin III pass to the left to Seth DeValve for 21 yards to the SD4. Tackled by Darrell Stuckey.","(13:32) Robert Griffin III pass to the right to Duke Johnson Jr. for 17 yards to the SD25. Tackled by Trovon Reed.","(14:05) Isaiah Crowell rush to the right for 1 yard to the SD42. Tackled by Jahleel Addae.","(14:32) Robert Griffin III pass to the right to Isaiah Crowell for 5 yards to the SD43. Tackled by Jatavis Brown.","(15:00) Robert Griffin III rush to the left for 7 yards to the SD48. Tackled by Kyle Emanuel.","(0:28) Robert Griffin III pass to the middle to Duke Johnson Jr. for 4 yards to the Cle45. Tackled by Denzel Perryman.","(0:34) Robert Griffin III incomplete pass to the left intended for Corey Coleman.","(1:13) Isaiah Crowell rush to the right for 14 yards to the Cle41. Tackled by Dwight Lowery.","(1:49) Isaiah Crowell rush to the right for 2 yards to the Cle27. Tackled by Jatavis Brown and Joey Bosa.","(1:49) Josh Lambo kicks off to the endzone. Touchback.","(1:54) Josh Lambo 43 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(2:32) Philip Rivers pass to the right to Kenneth Farrow for a loss of 4 yards to the Cle25. Tackled by Christian Kirksey.","(3:15) Philip Rivers pass to the right to Kenneth Farrow for 7 yards to the Cle21. Tackled by Ed Reynolds.","(3:20) Philip Rivers incomplete pass to the right. Penalty: Intentional Grounding on San Diego (Philip Rivers) -11 yards.","(3:48) Philip Rivers pass to the right to Tyrell Williams for 27 yards to the Cle32. Tackled by Jamar Taylor. Penalty: Unnecessary Roughness on Cleveland (Jamar Taylor) 15 yards.","(4:29) Kenneth Farrow rush to the right for 1 yard to the SD41. Tackled by Christian Kirksey.","(5:12) Philip Rivers pass to the left to Travis Benjamin for 15 yards to the SD40. Tackled by Briean Boddy-Calhoun.","(5:12) Cody Parkey kicks off to the endzone. Touchback.","(5:12) Cody Parkey extra point is good.","(5:16) Isaiah Crowell rush to the right for 8 yards for a TOUCHDOWN.","(5:19) Penalty: Roughing Passer on San Diego (Denzel Perryman) 8 yards.","(5:54) Duke Johnson Jr. rush to the right for 2 yards to the SD16. Tackled by Ryan Carrethers.","(6:33) Robert Griffin III pass to the middle to Gary Barnidge for 6 yards to the SD18. Tackled by Trovon Reed.","(6:39) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr. defensed by Casey Hayward.","(7:19) Robert Griffin III rush to the left for 5 yards to the SD24. Tackled by Jatavis Brown.","(7:56) Robert Griffin III pass to the middle to Gary Barnidge for 10 yards to the SD29. Tackled by Dwight Lowery.","(8:30) Robert Griffin III rush to the left for 11 yards to the SD39. Tackled by Trovon Reed.","(9:08) Isaiah Crowell rush to the left for 1 yard to the Cle50. Tackled by Trevor Williams.","(9:49) Robert Griffin III sacked at Cle49 for a loss of 8 yards by Damion Square.","(9:53) Penalty: Pass Interference on San Diego (Casey Hayward) 13 yards.","(10:25) Isaiah Crowell rush to the left for 1 yard to the Cle44. Tackled by Trevor Williams and Denzel Perryman.","(10:43) Penalty: Face Mask on San Diego (Damion Square) 15 yards.","(10:49) Josh Lambo kicks off to the Cle3. Mario Alford return for 25 yards to Cle28. Tackled by Trovon Reed.","(10:49) Josh Lambo extra point is good.","(10:53) Philip Rivers pass to the left to Antonio Gates for 1 yard for a TOUCHDOWN.","(11:24) Kenneth Farrow rush to the right for 3 yards to the Cle1. Tackled by Christian Kirksey and Tracy Howard.","(11:30) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(12:12) Kenneth Farrow rush to the right for no gain to the Cle4. Tackled by Emmanuel Ogbah.","(12:56) Kenneth Farrow rush to the left for 9 yards to the Cle4. Tackled by Jamie Meder and Christian Kirksey.","(13:35) Kenneth Farrow rush to the left for 4 yards to the Cle13. Tackled by Emmanuel Ogbah.","(14:04) Kenneth Farrow rush to the right for 8 yards to the Cle17. Tackled by Ed Reynolds.","(15:00) Philip Rivers pass to the middle to Travis Benjamin for 50 yards to the Cle25. Tackled by Joe Haden.","(15:00) Cody Parkey kicks off to the endzone. Touchback."]