["(0:07) Bradley Pinion punts for 47 yards to LA15. No return.","(0:07) Los Angeles Rams timeout.","(0:11) Shaun Draughn rush up the middle for no gain to the SF38. Tackled by William Hayes.","(0:11) Los Angeles Rams timeout.","(0:13) Colin Kaepernick rush up the middle for a loss of 3 yards to the SF38.","(0:13) Los Angeles Rams timeout.","(0:16) Colin Kaepernick rush up the middle for a loss of 1 yard to the SF41.","(0:21) Jared Goff pass intended for Brian Quick INTERCEPTED by Rashard Robinson. No return. Tackled by Brian Quick.","(0:27) Jared Goff incomplete pass to the right intended for Brian Quick.","(0:31) Phil Dawson kicks off to the LA18. Pharoh Cooper return for 24 yards to LA42. Tackled by Vinnie Sunseri and Shaun Draughn.","(0:31) San Francisco 49ers timeout.","(0:31) Colin Kaepernick 2 pt rush attempt. Successful. Penalty: Taunting on San Francisco (Zane Beadles) -15 yards.","(0:36) Colin Kaepernick pass to the left to Rod Streater for 10 yards for a TOUCHDOWN.","(0:36) San Francisco 49ers timeout.","(0:37) Colin Kaepernick pass to the left to Rod Streater for 7 yards to the LA10. Tackled by E.J. Gaines.","(0:59) Colin Kaepernick pass to the left to Jeremy Kerley for 7 yards to the LA17. Tackled by E.J. Gaines.","(1:17) Shaun Draughn rush up the middle for 2 yards to the LA24. Tackled by Alec Ogletree.","(1:17) San Francisco 49ers timeout.","(1:23) Colin Kaepernick pass to the right to Jeremy Kerley for 9 yards to the LA26. Tackled by Cody Davis.","(1:56) Colin Kaepernick sacked at LA35 for no gain by Blake Countess.","(1:56) Two Minute Warning.","(2:02) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley defensed by Cody Davis. Penalty: Unnecessary Roughness on Los Angeles (Cody Davis) 15 yards.","(2:23) Colin Kaepernick pass to the left to Rod Streater for 11 yards to the SF50. Tackled by Alec Ogletree and Blake Countess.","(2:46) Colin Kaepernick pass to the middle to Garrett Celek for 12 yards to the SF39. Tackled by Alec Ogletree.","(3:10) Colin Kaepernick pass to the right to Shaun Draughn for 5 yards to the SF27. Tackled by Alec Ogletree.","(3:10) Penalty: False Start on San Francisco (John Theus) -5 yards.","(3:15) Johnny Hekker punts for 39 yards to SF27. No return.","(3:24) Jared Goff sacked at LA34 for a loss of 1 yard by Ronald Blair.","(4:13) Todd Gurley rush up the middle for 4 yards to the LA35. Tackled by Gerald Hodges Jr..","(4:59) Todd Gurley rush up the middle for 1 yard to the LA31. Tackled by Quinton Dial.","(5:06) Phil Dawson kicks off to the LA-4. Pharoh Cooper return for 34 yards to LA30. Tackled by Rod Streater.","(5:06) Phil Dawson extra point is good.","(5:14) Colin Kaepernick rush up the middle for 13 yards for a TOUCHDOWN.","(5:19) Colin Kaepernick incomplete pass to the middle intended for Jeremy Kerley.","(5:24) Colin Kaepernick incomplete pass to the left intended for Garrett Celek.","(5:57) Colin Kaepernick pass to the left to Rod Streater for 10 yards to the LA13. Tackled by E.J. Gaines.","(6:36) Colin Kaepernick pass to the right to Jeremy Kerley for 13 yards to the LA23. Tackled by Trumaine Johnson.","(6:39) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley.","(7:09) Colin Kaepernick pass to the left to Shaun Draughn for 4 yards to the LA36. Tackled by Mark Barron.","(7:33) Penalty: False Start on San Francisco (Trenton Brown) -5 yards.","(7:56) Penalty: Holding on San Francisco (Zane Beadles) -10 yards.","(8:24) Colin Kaepernick pass to the left to DuJuan Harris for 14 yards to the LA25. Tackled by Dominique Easley.","(8:27) Colin Kaepernick incomplete pass to the left intended for Shaun Draughn.","(9:00) Colin Kaepernick pass to the left to Jeremy Kerley for 21 yards to the LA39. Tackled by Alec Ogletree.","(9:32) Shaun Draughn rush up the middle for 1 yard to the SF40. Tackled by Blake Countess.","(9:59) Colin Kaepernick pass to the right to Garrett Celek for 3 yards to the SF39. Tackled by Mark Barron.","(10:28) Colin Kaepernick pass to the left to Shaun Draughn for 11 yards to the SF36. Tackled by Blake Countess.","(10:32) Greg Zuerlein kicks off to the endzone. Touchback.","(10:32) Greg Zuerlein extra point is good.","(10:38) Jared Goff pass to the left to Tyler Higbee for 2 yards for a TOUCHDOWN.","(11:22) Todd Gurley rush up the middle for 4 yards to the SF2. Tackled by Gerald Hodges Jr. and Antoine Bethea.","(12:02) Todd Gurley rush up the middle for 3 yards to the SF6. Tackled by Chris Jones.","(12:07) Penalty: Pass Interference on San Francisco (Rashard Robinson) 16 yards.","(12:45) Todd Gurley rush to the right for no gain to the SF25. Tackled by Ahmad Brooks.","(12:52) Colin Kaepernick pass to the left to Carlos Hyde for no gain to the SF34. Tackled by E.J. Gaines. FUMBLE, recovered by LA (Morgan Fox).","(13:02) Johnny Hekker punts for 37 yards to SF25. Jeremy Kerley return for 9 yards to SF34. Tackled by Troy Hill.","(13:32) Jared Goff sacked at LA38 for a loss of 1 yard by Eli Harold.","(14:20) Jared Goff pass to the right to Todd Gurley for 6 yards to the LA39. Tackled by Gerald Hodges Jr..","(15:00) Todd Gurley rush to the right for 2 yards to the LA33. Tackled by Gerald Hodges Jr..","(0:45) Todd Gurley rush to the left for 7 yards to the LA31. Tackled by Jaquiski Tartt and Gerald Hodges Jr..","(1:16) Todd Gurley rush to the left for 5 yards to the LA24. Tackled by DeForest Buckner.","(1:25) Bradley Pinion punts for 38 yards to LA18. Tavon Austin return for 1 yard to LA19. Tackled by Vinnie Sunseri.","(2:06) Colin Kaepernick sacked at SF44 for a loss of 3 yards by Aaron Donald.","(2:36) Colin Kaepernick pass to the left to Jeremy Kerley for 12 yards to the SF47. Tackled by E.J. Gaines.","(3:17) Carlos Hyde rush to the right for a loss of 2 yards to the SF35. Tackled by Dominique Easley and Blake Countess.","(3:30) Penalty: False Start on San Francisco (Andrew Tiller) -5 yards.","(3:54) Colin Kaepernick pass to the left to Rod Streater for 17 yards to the SF42. Tackled by Cody Davis.","(4:01) Johnny Hekker punts for 43 yards to SF25. No return.","(4:37) Jared Goff sacked at LA32 for a loss of 8 yards by DeForest Buckner.","(5:17) Tavon Austin rush to the left for a loss of 1 yard to the LA40. Tackled by Jaquiski Tartt and Gerald Hodges Jr..","(5:20) Jared Goff incomplete pass to the left intended for Brian Quick.","(5:32) Bradley Pinion punts for 40 yards to LA42. Tavon Austin return for a loss of 1 yard to LA41. Tackled by Garrett Celek. FUMBLE, recovered by LA (Mike Jordan).","(5:41) Colin Kaepernick incomplete pass to the right intended for Aaron Burbridge.","(6:26) Carlos Hyde rush up the middle for a loss of 1 yard to the SF18. Tackled by Morgan Fox. FUMBLE, recovered by SF (Carlos Hyde).","(6:56) Carlos Hyde rush to the left for 2 yards to the SF19. Tackled by Morgan Fox and Michael Brockers.","(7:04) Johnny Hekker punts for 51 yards to SF17. No return.","(7:10) Jared Goff incomplete pass to the middle intended for Tavon Austin.","(7:56) Todd Gurley rush to the left for no gain to the LA32. Tackled by Eli Harold and Jaquiski Tartt.","(8:19) Jared Goff pass to the right to Tavon Austin for a loss of 1 yard to the LA32. Tackled by Gerald Hodges Jr..","(8:31) Bradley Pinion punts for 46 yards to LA33. No return.","(9:11) Colin Kaepernick pass to the middle to Shaun Draughn for 11 yards to the SF21. Tackled by Blake Countess.","(9:45) Shaun Draughn rush up the middle for 2 yards to the SF10. Tackled by Cam Thomas and Aaron Donald.","(9:58) Penalty: Tripping on San Francisco (John Theus) -9 yards.","(10:27) Carlos Hyde rush to the left for 2 yards to the SF17. Tackled by Mark Barron.","(10:34) Johnny Hekker punts for 53 yards to SF15. No return.","(10:40) Jared Goff incomplete pass to the left intended for Brian Quick defensed by Ahmad Brooks.","(11:22) Tavon Austin rush to the left for a loss of 3 yards to the LA32. Tackled by Ahmad Brooks.","(12:06) Todd Gurley rush to the left for 3 yards to the LA35. Tackled by Gerald Hodges Jr. and Eli Harold.","(12:23) Penalty: Unnecessary Roughness on San Francisco (Rashard Robinson) 15 yards.","(12:27) Jared Goff incomplete pass to the right intended for Lance Kendricks defensed by Rashard Robinson.","(12:33) Jared Goff incomplete pass to the right intended for Kenny Britt.","(12:53) Penalty: False Start on Los Angeles -5 yards.","(13:33) Todd Gurley rush up the middle for 1 yard to the LA22. Tackled by Gerald Hodges Jr. and Chris Jones.","(14:16) Jared Goff pass to the middle to Lance Kendricks for 6 yards to the LA21. Tackled by Antoine Bethea.","(14:55) Todd Gurley rush to the left for 3 yards to the LA15. Tackled by Chris Jones and Gerald Hodges Jr..","(15:00) Phil Dawson kicks off to the LA2. Pharoh Cooper return for 20 yards to LA22. Tackled by Carl Bradford. Penalty: Holding on Los Angeles (Bryce Hager) -10 yards.","(0:04) Jared Goff rush up the middle for a loss of 1 yard to the LA47.","(0:13) Bradley Pinion punts for 40 yards to LA39. Tavon Austin return for 9 yards to LA48. Tackled by Kyle Nelson.","(0:13) Los Angeles Rams timeout.","(0:27) Shaun Draughn rush up the middle for 3 yards to the SF21. Tackled by Aaron Donald and Blake Countess.","(0:27) Los Angeles Rams timeout.","(0:32) Shaun Draughn rush to the right for 3 yards to the SF18. Tackled by William Hayes.","(0:32) Los Angeles Rams timeout.","(0:38) Shaun Draughn rush up the middle for 3 yards to the SF15. Tackled by Aaron Donald.","(0:45) Johnny Hekker punts for 49 yards to SF12. No return.","(0:49) Jared Goff incomplete pass to the left intended for Kenny Britt defensed by DeForest Buckner.","(0:49) San Francisco 49ers timeout.","(0:56) Jared Goff pass to the left to Lance Kendricks for 6 yards to the LA39. Tackled by Jaquiski Tartt.","(1:29) Todd Gurley rush to the right for 2 yards to the LA33. Tackled by Ahmad Brooks.","(1:51) Todd Gurley rush up the middle for 11 yards to the LA31. Tackled by Gerald Hodges Jr..","(2:00) Bradley Pinion punts for 41 yards to LA0. Touchback.","(2:00) Two Minute Warning.","(2:10) Colin Kaepernick pass to the left to Aaron Burbridge for 2 yards to the LA41. Tackled by E.J. Gaines.","(2:52) Colin Kaepernick rush to the left for 2 yards to the LA43. Tackled by Alec Ogletree.","(3:24) Shaun Draughn rush to the left for 2 yards to the LA45. Tackled by Cam Thomas.","(3:28) Penalty: Pass Interference on Los Angeles (Blake Countess) 5 yards.","(3:55) Carlos Hyde rush to the right for 6 yards to the SF48. Tackled by William Hayes.","(4:23) Colin Kaepernick pass to the right to Shaun Draughn for 9 yards to the SF42. Tackled by Blake Countess.","(4:55) Colin Kaepernick pass to the left to Aaron Burbridge for 13 yards to the SF33. Tackled by Blake Countess.","(5:34) Carlos Hyde rush to the left for 2 yards to the SF20. Tackled by Dominique Easley.","(6:06) Carlos Hyde rush up the middle for 5 yards to the SF18. Tackled by Michael Brockers.","(6:14) Johnny Hekker punts for 48 yards to SF13. No return.","(6:20) Jared Goff incomplete pass to the left intended for Tavon Austin.","(7:05) Malcolm Brown rush to the right for 2 yards to the LA39. Tackled by Rashard Robinson.","(7:45) Jared Goff pass to the right to Tyler Higbee for 3 yards to the LA37. Tackled by Antoine Bethea.","(7:58) Bradley Pinion punts for 47 yards to LA36. Tavon Austin return for a loss of 2 yards to LA34. Tackled by Vinnie Sunseri and Michael Wilhoite.","(8:02) Colin Kaepernick incomplete pass to the left intended for Rod Streater.","(8:41) Carlos Hyde rush up the middle for no gain to the SF17. Tackled by Cam Thomas and William Hayes.","(9:16) Colin Kaepernick rush to the left for 3 yards to the SF17. Tackled by Eugene Sims.","(9:28) Johnny Hekker punts for 48 yards to SF24. Jeremy Kerley - no return. Tackled by Chase Reynolds. Penalty: Illegal Block on San Francisco (JaCorey Shepherd) -10 yards.","(9:34) Jared Goff incomplete pass to the left intended for Tavon Austin.","(10:21) Jared Goff rush up the middle for 5 yards to the LA28. Tackled by Aaron Lynch.","(11:03) Todd Gurley rush up the middle for a loss of 5 yards to the LA23. Tackled by Chris Jones.","(11:52) Jared Goff pass to the right to Todd Gurley for 9 yards to the LA28. Tackled by Tramaine Brock and Antoine Bethea.","(12:32) Todd Gurley rush to the left for 1 yard to the LA19. Tackled by Chris Jones.","(12:41) Bradley Pinion punts for 34 yards to LA18. No return.","(13:19) Colin Kaepernick sacked at SF48 for a loss of 5 yards by Dominique Easley.","(13:57) Shaun Draughn rush up the middle for no gain to the LA47. Tackled by William Hayes.","(14:31) Carlos Hyde rush to the right for 3 yards to the LA47. Tackled by Mark Barron.","(15:00) Colin Kaepernick pass to the left to Garrett Celek for 12 yards to the SF50. Tackled by T.J. McDonald.","(0:21) Colin Kaepernick pass to the left to Carlos Hyde for 5 yards to the SF38. Tackled by Blake Countess.","(0:59) Carlos Hyde rush up the middle for 2 yards to the SF33. Tackled by Dominique Easley and Ethan Westbrooks.","(1:33) Colin Kaepernick pass to the right to Rod Streater for 8 yards to the SF31. Tackled by Trumaine Johnson.","(1:58) Colin Kaepernick rush up the middle for 1 yard to the SF23. Tackled by Cam Thomas and Ethan Westbrooks.","(2:26) Shaun Draughn rush to the left for 1 yard to the SF22. Tackled by T.J. McDonald.","(2:33) Greg Zuerlein kicks off to the SF-1. JaCorey Shepherd return for 22 yards to SF21. Tackled by Isaiah Johnson.","(2:33) Greg Zuerlein extra point is good.","(2:41) Tavon Austin rush to the left for 30 yards for a TOUCHDOWN.","(2:53) Colin Kaepernick pass intended for Garrett Celek INTERCEPTED by Cody Davis and returned for 29 yards. Tackled by Carlos Hyde.","(3:38) Carlos Hyde rush to the right for 2 yards to the SF35. Tackled by Aaron Donald.","(4:07) Colin Kaepernick pass to the right to Shaun Draughn for 8 yards to the SF33. Tackled by Alec Ogletree.","(4:07) Greg Zuerlein kicks off to the endzone. Touchback.","(4:07) Greg Zuerlein extra point is good. Penalty: Offside on San Francisco (Rashard Robinson) 5 yards.","(4:13) Todd Gurley rush up the middle for 1 yard for a TOUCHDOWN.","(4:56) Todd Gurley rush up the middle for 5 yards to the SF1. Tackled by Quinton Dial and Chris Jones.","(5:37) Jared Goff pass to the right to Lance Kendricks for 24 yards to the SF6. Tackled by Jaquiski Tartt.","(5:41) Jared Goff incomplete pass to the right intended for Tavon Austin.","(6:28) Jared Goff pass to the right to Todd Gurley for 5 yards to the SF30. Tackled by Antoine Bethea.","(7:07) Todd Gurley rush up the middle for 3 yards to the SF35. Tackled by Mike Purcell and Ahmad Brooks.","(7:33) Jared Goff pass to the right to Tavon Austin for 15 yards to the SF38. Tackled by Keith Reaser.","(8:10) Jared Goff sacked at LA47 for a loss of 2 yards by Ahmad Brooks.","(8:49) Todd Gurley rush up the middle for 1 yard to the LA49. Tackled by Gerald Hodges Jr. and Eli Harold.","(9:01) Bradley Pinion kicks off to the LA-3. Pharoh Cooper return for 51 yards to LA48. Tackled by Vinnie Sunseri.","(9:01) Phil Dawson extra point is good.","(9:08) Colin Kaepernick pass to the left to Carlos Hyde for 19 yards for a TOUCHDOWN.","(9:38) Carlos Hyde rush to the left for 3 yards to the LA19. Tackled by Blake Countess.","(9:38) Penalty: Too Many Men on Field on San Francisco -5 yards.","(9:48) Jared Goff pass intended for Kenny Britt INTERCEPTED by Tramaine Brock and returned for 39 yards. Tackled by Jared Goff.","(10:10) Jared Goff pass to the left to Kenny Britt for 15 yards to the LA43. Tackled by Keith Reaser. FUMBLE, recovered by LA.","(10:55) Todd Gurley rush up the middle for 4 yards to the LA28. Tackled by Eli Harold and Quinton Dial.","(10:59) Jared Goff incomplete pass to the left intended for Tavon Austin.","(11:34) Todd Gurley rush up the middle for 7 yards to the LA24. Tackled by Gerald Hodges Jr..","(12:11) Todd Gurley rush up the middle for 4 yards to the LA17. Tackled by Antoine Bethea.","(12:22) Bradley Pinion punts for 39 yards to LA18. Tavon Austin return for 5 yards to LA23. Tackled by Marcus Ball. Penalty: Holding on Los Angeles (Troy Hill) -10 yards.","(13:01) Colin Kaepernick sacked at SF43 for a loss of 5 yards by Eugene Sims.","(13:44) Colin Kaepernick pass to the left to Chris Harper for 1 yard to the SF48. Tackled by E.J. Gaines.","(13:50) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(14:16) Colin Kaepernick pass to the right to Garrett Celek for 12 yards to the SF47. Tackled by Alec Ogletree.","(14:20) Colin Kaepernick incomplete pass to the left intended for Garrett Celek defensed by Alec Ogletree.","(14:54) Carlos Hyde rush to the left for 14 yards to the SF35. Tackled by T.J. McDonald.","(15:00) Greg Zuerlein kicks off to the SF6. JaCorey Shepherd return for 15 yards to SF21. Tackled by Bryce Hager."]