["(0:36) Matt McGloin rush up the middle for a loss of 1 yard to the Oak43.","(1:18) Matt McGloin rush up the middle for a loss of 1 yard to the Oak44.","(1:59) Matt McGloin rush up the middle for a loss of 1 yard to the Oak45.","(1:59) Two Minute Warning.","(2:22) Matt McGloin pass to the right to Amari Cooper for 19 yards to the Oak46. Tackled by Vontae Davis.","(2:22) Indianapolis Colts timeout.","(2:28) DeAndre Washington rush to the right for 2 yards to the Oak27. Tackled by Antonio Morrison and Rashaan Melvin.","(2:28) Indianapolis Colts timeout.","(2:33) DeAndre Washington rush up the middle for no gain to the Oak25. Tackled by Zach Kerr.","(2:33) Adam Vinatieri kicks off to the endzone. Touchback.","(2:38) Adam Vinatieri 42 yard field goal attempt is GOOD. Holder: Pat McAfee.","(2:41) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(3:14) Andrew Luck rush up the middle for 1 yard to the Oak25. Tackled by TJ Carrie.","(3:20) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(3:48) Andrew Luck pass to the right to T.Y. Hilton for 39 yards to the Oak26. Tackled by TJ Carrie.","(4:00) Marquette King punts for 55 yards to Ind0. Touchback. Penalty: Face Mask on Oakland (Andre Holmes) 15 yards.","(4:03) Matt McGloin incomplete pass to the right intended for Andre Holmes.","(4:46) Latavius Murray rush up the middle for 2 yards to the Oak45. Tackled by Henry Anderson.","(5:30) Latavius Murray rush up the middle for 4 yards to the Oak43. Tackled by Trent Cole.","(6:04) Indianapolis Colts timeout.","(6:10) Matt McGloin pass to the right to Andre Holmes for 10 yards to the Oak39. Tackled by Darryl Morris.","(6:53) Latavius Murray rush up the middle for 3 yards to the Oak29. Tackled by T.J. Green.","(7:40) Latavius Murray rush to the left for 1 yard to the Oak26. Tackled by Hassan Ridgeway.","(7:40) Adam Vinatieri kicks off to the endzone. Touchback.","(7:40) Andrew Luck 2 pt conversion pass to T.Y. Hilton is GOOD.","(7:47) Andrew Luck rush to the left for 11 yards for a TOUCHDOWN.","(7:52) Penalty: Pass Interference on Oakland (Sean Smith) 7 yards.","(8:21) Andrew Luck pass to the middle to Dwayne Allen for 10 yards to the Oak18. Tackled by Perry Riley Jr..","(8:50) Penalty: Illegal Formation on Indianapolis (Chester Rogers) -5 yards.","(9:11) Andrew Luck pass to the right to Jack Doyle for 11 yards to the Oak23. Tackled by Nate Allen.","(9:31) Andrew Luck pass to the right to T.Y. Hilton for 15 yards to the Oak34. Tackled by Malcolm Smith.","(9:54) Andrew Luck pass to the left to Phillip Dorsett for 8 yards to the Oak49. Tackled by TJ Carrie.","(10:16) Andrew Luck pass to the right to Dwayne Allen for 11 yards to the Ind43. Tackled by Malcolm Smith.","(10:27) Marquette King punts for 48 yards to Ind22. Chester Rogers return for 10 yards to Ind32. Tackled by Keith McGill.","(10:45) DeAndre Washington rush to the right for 5 yards to the Oak45. Tackled by Darryl Morris. Penalty: Unnecessary Roughness on Oakland (Menelik Watson) -15 yards.","(11:07) Derek Carr sacked at Oak40 for a loss of 8 yards by Trent Cole.","(11:32) Penalty: Holding on Oakland (Andre Holmes) -11 yards.","(12:13) Latavius Murray rush to the left for 3 yards to the Ind41. Tackled by Trent Cole.","(12:23) Pat McAfee punts for 47 yards to Oak41. No return. Penalty: FC Interference on Indianapolis (Chris Milton) 15 yards.","(12:26) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(13:08) Andrew Luck pass to the left to Robert Turbin for 8 yards to the Ind12. Tackled by Malcolm Smith.","(13:12) Andrew Luck incomplete pass to the middle intended for Jack Doyle.","(13:23) Marquette King punts for 34 yards to Ind4. No return.","(13:28) Derek Carr incomplete pass to the right. Penalty: Intentional Grounding on Oakland (Derek Carr) -10 yards.","(14:11) DeAndre Washington rush up the middle for 8 yards to the Ind28. Tackled by Edwin Jackson.","(15:00) Jalen Richard rush to the right for 2 yards to the Ind36. Tackled by Antonio Morrison.","(0:22) Penalty: Holding on Oakland (Clive Walford) -10 yards.","(0:48) Penalty: False Start on Oakland (Clive Walford) -5 yards.","(1:24) Derek Carr pass to the left to Amari Cooper for 14 yards to the Ind23. Tackled by Rashaan Melvin.","(2:09) Derek Carr pass to the right to Michael Crabtree for 8 yards to the Ind37. Tackled by Vontae Davis.","(2:50) DeAndre Washington rush to the left for 4 yards to the Ind45. Tackled by Edwin Jackson.","(2:54) Derek Carr incomplete pass to the left intended for Amari Cooper.","(3:29) DeAndre Washington rush up the middle for 11 yards to the Ind49. Tackled by Mike Adams.","(4:04) Derek Carr pass to the left to Latavius Murray for no gain to the Oak40. Tackled by Mike Adams.","(4:43) Latavius Murray rush up the middle for 5 yards to the Oak40. Tackled by Edwin Jackson.","(5:18) Derek Carr pass to the right to Michael Crabtree for 10 yards to the Oak35. Tackled by T.J. Green and Edwin Jackson.","(5:18) Adam Vinatieri kicks off to the endzone. Touchback.","(5:18) Adam Vinatieri extra point is good.","(5:22) Andrew Luck pass to the left to Robert Turbin for 3 yards for a TOUCHDOWN.","(5:26) Andrew Luck incomplete pass to the left intended for Jack Doyle.","(6:07) Robert Turbin rush to the left for 2 yards to the Oak3. Tackled by Reggie Nelson.","(6:39) Andrew Luck pass to the left to T.Y. Hilton for 39 yards to the Oak5. Tackled by TJ Carrie.","(7:11) Frank Gore rush to the right for 3 yards to the Oak44. Tackled by Justin Ellis.","(7:41) Andrew Luck pass to the left to Frank Gore for 12 yards to the Oak47. Tackled by Perry Riley Jr..","(8:08) Andrew Luck pass to the middle to Dwayne Allen for 10 yards to the Ind41. Tackled by Malcolm Smith.","(8:40) Andrew Luck pass to the left to Donte Moncrief for 6 yards to the Ind31. Tackled by Perry Riley Jr..","(8:40) Sebastian Janikowski kicks off to the endzone. Touchback.","(8:40) Sebastian Janikowski extra point is good.","(8:45) DeAndre Washington rush to the right for 22 yards for a TOUCHDOWN.","(9:29) Latavius Murray rush up the middle for 8 yards to the Ind22. Tackled by T.J. Green.","(10:13) Derek Carr rush up the middle for 8 yards to the Ind30. Tackled by Erik Walden.","(10:18) Frank Gore rush up the middle for 11 yards to the Ind37. Tackled by Malcolm Smith. FUMBLE, recovered by Oak (TJ Carrie). Tackled by Ryan Kelly.","(10:43) Frank Gore rush to the left for 3 yards to the Ind26. Tackled by Sean Smith.","(10:48) Sebastian Janikowski kicks off to the Ind11. Jordan Todman return for 12 yards to Ind23. Tackled by Cory James.","(10:48) Sebastian Janikowski extra point is good.","(10:53) DeAndre Washington rush up the middle for 22 yards for a TOUCHDOWN.","(11:39) Derek Carr pass to the middle to Andre Holmes for 22 yards to the Ind22. Tackled by Rashaan Melvin.","(12:21) DeAndre Washington rush to the right for 10 yards to the Ind44. Tackled by David Parry.","(12:59) DeAndre Washington rush to the left for 9 yards to the Oak46. Tackled by Mike Adams and Antonio Morrison.","(13:38) Derek Carr pass to the left to Michael Crabtree for 11 yards to the Oak37. Tackled by Darryl Morris.","(14:17) Latavius Murray rush up the middle for no gain to the Oak26. Tackled by Henry Anderson.","(14:56) Latavius Murray rush up the middle for 3 yards to the Oak26. Tackled by Henry Anderson.","(15:00) Adam Vinatieri kicks off to the Oak0. Jalen Richard return for 23 yards to Oak23. Tackled by Josh McNary.","(0:12) Andrew Luck rush up the middle for a loss of 1 yard to the Ind21.","(0:18) Sebastian Janikowski kicks off to the Ind3. Josh Ferguson return for 19 yards to Ind22. Tackled by Taiwan Jones.","(0:18) Sebastian Janikowski extra point is BLOCKED.","(0:22) Derek Carr pass to the left to Jalen Richard for 4 yards for a TOUCHDOWN.","(0:25) Derek Carr incomplete pass to the right intended for Amari Cooper.","(0:25) Oakland Raiders timeout.","(0:39) Derek Carr pass to the middle to DeAndre Washington for 18 yards to the Ind4. Tackled by Mike Adams.","(0:46) Derek Carr pass to the left to Amari Cooper for 34 yards to the Ind22.","(0:46) Oakland Raiders timeout.","(0:54) Derek Carr pass to the middle to Michael Crabtree for 5 yards to the Oak44. Tackled by Edwin Jackson.","(1:03) Indianapolis Colts timeout.","(1:13) Jalen Richard rush up the middle for 19 yards to the Oak39. Tackled by Erik Walden.","(1:21) Andrew Luck pass intended for T.Y. Hilton INTERCEPTED by Reggie Nelson. No return. Touchback.","(1:25) Andrew Luck incomplete pass to the right intended for Dwayne Allen.","(2:00) Andrew Luck pass to the right to T.Y. Hilton for 12 yards to the Oak29. Tackled by David Amerson.","(2:00) Two Minute Warning.","(2:15) Robert Turbin rush to the right for 6 yards to the Oak41. Tackled by Reggie Nelson.","(2:56) Robert Turbin rush up the middle for 3 yards to the Oak47. Tackled by Khalil Mack.","(3:34) Frank Gore rush up the middle for 9 yards to the Ind50. Tackled by Nate Allen.","(3:39) Andrew Luck incomplete pass to the left intended for Frank Gore defensed by Perry Riley Jr..","(4:25) Andrew Luck pass to the left to Jack Doyle for 7 yards to the Ind41. Tackled by Malcolm Smith.","(5:09) Andrew Luck pass to the right to Jack Doyle for 7 yards to the Ind34. Tackled by Malcolm Smith.","(5:50) Frank Gore rush up the middle for 2 yards to the Ind27. Tackled by Jihad Ward.","(5:50) Sebastian Janikowski kicks off to the endzone. Touchback.","(5:50) Sebastian Janikowski extra point is NO GOOD.","(5:55) Derek Carr pass to the right to Clive Walford for 5 yards for a TOUCHDOWN.","(6:34) Jalen Richard rush to the right for 9 yards to the Ind5. Tackled by T.J. Green.","(7:01) Jalen Richard rush to the left for 15 yards to the Ind14. Tackled by Darryl Morris.","(7:35) Jalen Richard rush to the left for 12 yards to the Ind29. Tackled by Edwin Jackson.","(8:18) Derek Carr pass to the right to Jalen Richard for 1 yard to the Ind41. Tackled by Mike Adams.","(8:37) Derek Carr pass to the right to Michael Crabtree for 35 yards to the Ind42. Tackled by Darius Butler.","(9:10) DeAndre Washington rush to the left for 3 yards to the Oak23. Tackled by Edwin Jackson.","(9:44) Latavius Murray rush up the middle for a loss of 1 yard to the Oak20. Tackled by Antonio Morrison.","(9:49) Adam Vinatieri kicks off to the Oak0. Jalen Richard return for 21 yards to Oak21. Tackled by Jordan Todman.","(9:49) Adam Vinatieri extra point is good.","(9:49) Penalty: Encroachment on Oakland (Mario Edwards Jr.) 5 yards.","(9:54) Andrew Luck pass to the left to Donte Moncrief for 24 yards for a TOUCHDOWN.","(10:37) Andrew Luck pass to the right to Jack Doyle for 4 yards to the Oak24. Tackled by Khalil Mack.","(11:16) Frank Gore rush up the middle for 8 yards to the Oak28. Tackled by Nate Allen.","(11:55) Robert Turbin rush up the middle for 3 yards to the Oak36. Tackled by Bruce Irvin.","(12:30) Robert Turbin rush up the middle for 6 yards to the Oak39. Tackled by Perry Riley Jr..","(13:07) Frank Gore rush up the middle for 3 yards to the Oak45. Tackled by Nate Allen.","(13:55) Andrew Luck pass to the middle to Jack Doyle for 17 yards to the Oak48. Tackled by Nate Allen.","(14:24) Frank Gore rush to the right for 3 yards to the Ind35. Tackled by Justin Ellis.","(14:57) Frank Gore rush up the middle for 7 yards to the Ind32. Tackled by James Cowser.","(14:57) Sebastian Janikowski kicks off to the endzone. Touchback.","(14:57) Sebastian Janikowski extra point is good.","(15:00) Derek Carr pass to the right to Andre Holmes for 1 yard for a TOUCHDOWN.","(0:03) Latavius Murray rush up the middle for no gain to the Ind1. Tackled by Antonio Morrison.","(0:07) Penalty: Pass Interference on Indianapolis (Rashaan Melvin) 0 yards.","(0:11) Penalty: Pass Interference on Indianapolis (Vontae Davis) 2 yards.","(0:15) Derek Carr incomplete pass to the right intended for Seth Roberts defensed by Darryl Morris.","(0:58) Latavius Murray rush up the middle for a loss of 1 yard to the Ind3. Tackled by Mike Adams.","(1:26) Derek Carr pass to the left to Michael Crabtree for 15 yards to the Ind2. Tackled by Vontae Davis.","(2:09) Derek Carr pass to the middle to Michael Crabtree for 6 yards to the Ind17. Tackled by Vontae Davis.","(2:52) Derek Carr pass to the right to Amari Cooper for 5 yards to the Ind23. Tackled by Edwin Jackson and Rashaan Melvin.","(3:58) Penalty: False Start on Oakland (Menelik Watson) -5 yards.","(3:58) Latavius Murray rush to the right for 8 yards to the Ind23. Tackled by Antonio Morrison.","(4:39) DeAndre Washington rush to the right for 3 yards to the Ind31. Tackled by Trent Cole.","(4:39) Indianapolis Colts timeout.","(5:14) Derek Carr pass to the left to Clive Walford for 15 yards to the Ind34. Tackled by T.J. Green.","(5:55) Derek Carr pass to the left to Jalen Richard for 8 yards to the Ind49. Tackled by David Parry.","(6:23) Penalty: Holding on Oakland (Kelechi Osemele) -10 yards.","(6:23) Oakland Raiders timeout.","(7:09) Latavius Murray rush up the middle for 7 yards to the Ind47. Tackled by David Parry and Antonio Morrison.","(7:18) Andrew Luck pass intended for T.Y. Hilton INTERCEPTED by Nate Allen and returned for 4 yards. Tackled by Frank Gore.","(8:03) Frank Gore rush to the left for 13 yards to the Ind43. Tackled by Reggie Nelson.","(8:12) Marquette King punts for 40 yards to Ind30. No return.","(8:16) Derek Carr incomplete pass to the right intended for Seth Roberts.","(8:21) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(8:27) Derek Carr incomplete pass to the left intended for Seth Roberts defensed by Darryl Morris.","(8:34) Pat McAfee rush to the left for no gain to the Oak30. Tackled by Daren Bates.","(9:13) Andrew Luck rush up the middle for 1 yard to the Oak30. Tackled by Khalil Mack.","(9:43) Robert Turbin rush to the left for a loss of 2 yards to the Oak31. Tackled by Nate Allen.","(10:14) Frank Gore rush up the middle for 6 yards to the Oak29. Tackled by TJ Carrie.","(10:55) Andrew Luck pass to the left to Erik Swoope for 45 yards to the Oak35. Tackled by Nate Allen.","(11:03) Marquette King punts for 58 yards to Ind0. Touchback.","(11:06) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(11:46) Latavius Murray rush up the middle for a loss of 2 yards to the Oak42. Tackled by Antonio Morrison.","(12:23) Jalen Richard rush up the middle for 9 yards to the Oak44. Tackled by Antonio Morrison.","(13:04) Derek Carr pass to the left to Latavius Murray for 11 yards to the Oak35. Tackled by Vontae Davis.","(13:10) Derek Carr incomplete pass to the left intended for Andre Holmes.","(13:17) Derek Carr incomplete pass to the right intended for Michael Crabtree defensed by Vontae Davis.","(13:30) Pat McAfee punts for 53 yards to Oak16. Jalen Richard return for 8 yards to Oak24. Tackled by Josh McNary.","(13:36) Andrew Luck incomplete pass to the left intended for Donte Moncrief.","(14:16) Frank Gore rush to the left for 5 yards to the Ind31. Tackled by Perry Riley Jr..","(14:54) Frank Gore rush to the left for no gain to the Ind26. Tackled by Malcolm Smith.","(15:00) Sebastian Janikowski kicks off to the Ind-1. Jordan Todman return for 27 yards to Ind26. Tackled by Keith McGill."]