["(0:38) Drew Brees rush up the middle for a loss of 1 yard to the TB29.","(1:06) Drew Brees rush up the middle for a loss of 1 yard to the TB28.","(1:44) Drew Brees rush up the middle for a loss of 1 yard to the TB27.","(1:44) Tampa Bay Buccaneers timeout.","(1:51) Mark Ingram rush to the right for 10 yards to the TB26. Tackled by Brent Grimes.","(1:51) New Orleans Saints timeout.","(1:51) Tampa Bay Buccaneers timeout.","(1:55) Mark Ingram rush to the left for 2 yards to the TB36. Tackled by Gerald McCoy.","(1:55) Tampa Bay Buccaneers timeout.","(1:59) Mark Ingram rush to the right for 7 yards to the TB38. Tackled by Bradley McDougald.","(2:00) Roberto Aguayo onside kickoff to the TB45. Onside kick recovered by receiving team by Brandin Cooks.","(2:00) Two Minute Warning.","(2:05) Roberto Aguayo 35 yard field goal attempt is GOOD. Holder: Bryan Anger.","(2:09) Jameis Winston incomplete pass to the left intended for Adam Humphries.","(2:13) Jameis Winston incomplete pass to the right intended for Brandon Myers.","(2:17) Jameis Winston incomplete pass to the right intended for Brandon Myers.","(2:46) Jameis Winston pass to the right to Russell Shepard for 22 yards to the NO17. Tackled by Ken Crawley and Jairus Byrd.","(3:27) Jameis Winston rush to the left for 8 yards to the NO39. Tackled by David Onyemata and B.W. Webb.","(3:32) Penalty: Intentional Grounding on Tampa Bay (Jameis Winston) -11 yards.","(3:58) Jameis Winston pass to the left to Mike Evans for 12 yards to the NO36. Tackled by Ken Crawley.","(4:04) Jameis Winston incomplete pass to the left intended for Russell Shepard defensed by B.W. Webb.","(4:33) Jameis Winston pass to the middle to Charles Sims for 9 yards to the NO48. Tackled by Sheldon Rankins.","(4:44) Thomas Morstead punts for 40 yards to TB25. Adam Humphries return for 18 yards to TB43. Tackled by Shiloh Keo.","(4:50) Drew Brees incomplete pass to the left intended for Brandin Cooks defensed by Vernon Hargreaves III.","(5:15) Penalty: Delay of Game on New Orleans (Drew Brees) -5 yards.","(6:03) Tim Hightower rush to the right for no gain to the NO40. Tackled by Lavonte David.","(6:46) Drew Brees pass to the right to Michael Thomas for 5 yards to the NO40. Tackled by Brent Grimes.","(7:22) Drew Brees pass to the left to Michael Thomas for 10 yards to the NO35. Tackled by Keith Tandy.","(8:05) Tim Hightower rush to the right for 7 yards to the NO25. Tackled by Kwon Alexander and Daryl Smith.","(8:13) Jameis Winston pass intended for Russell Shepard INTERCEPTED by Jairus Byrd and returned for 11 yards. Tackled by Charles Sims. Penalty: Illegal Block on New Orleans (Sterling Moore) -10 yards.","(8:58) Jameis Winston rush up the middle for 3 yards to the NO28. Tackled by Sheldon Rankins.","(9:51) Jameis Winston sacked at NO31 for a loss of 7 yards by Cameron Jordan.","(10:15) Jameis Winston pass to the middle to Adam Humphries for 12 yards to the NO24. Tackled by Roman Harper.","(10:42) Jameis Winston pass to the right to Mike Evans for 6 yards to the NO36. Tackled by Sterling Moore.","(11:17) Jameis Winston pass to the left to Mike Evans for 9 yards to the NO42. Tackled by Craig Robertson.","(11:22) Jameis Winston incomplete pass to the middle intended for Brandon Myers.","(11:55) Jameis Winston pass to the right to Russell Shepard for 24 yards to the TB49. Tackled by Dannell Ellerbe.","(11:55) Wil Lutz kicks off to the endzone. Touchback.","(11:58) Wil Lutz 21 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(12:00) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Keith Tandy.","(12:04) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Vernon Hargreaves III.","(12:38) Mark Ingram rush to the left for 4 yards to the TB3. Tackled by Keith Tandy.","(13:20) Drew Brees pass to the left to Michael Thomas for 17 yards to the TB7. Tackled by Vernon Hargreaves III.","(13:42) Penalty: Face Mask on New Orleans (Mark Ingram) -15 yards.","(14:22) Mark Ingram rush to the left for 2 yards to the TB9. Tackled by Lavonte David.","(15:00) Drew Brees pass to the left to John Kuhn for 7 yards to the TB11. Tackled by Daryl Smith.","(0:41) Drew Brees pass to the left to Brandin Cooks for 42 yards to the TB18. Tackled by Vernon Hargreaves III.","(1:16) Mark Ingram rush to the right for no gain to the NO40. Tackled by Kwon Alexander and Keith Tandy.","(1:37) Drew Brees pass to the right to John Phillips for 10 yards to the NO40. Tackled by Brent Grimes.","(1:45) Penalty: Offside on Tampa Bay (DaVonte Lambert) 5 yards.","(1:52) Drew Brees incomplete pass to the left intended for Coby Fleener defensed by Kwon Alexander.","(1:52) Roberto Aguayo kicks off to the endzone. Touchback.","(1:52) Roberto Aguayo extra point is good.","(1:59) Jameis Winston pass to the left to Mike Evans for 34 yards for a TOUCHDOWN.","(2:46) Jameis Winston pass to the right to Charles Sims for 13 yards to the NO34. Tackled by Sterling Moore and Craig Robertson.","(3:31) Jameis Winston pass to the left to Josh Huff for 12 yards to the NO47. Tackled by Vonn Bell.","(3:36) Jameis Winston incomplete pass to the right intended for Brandon Myers.","(4:10) Charles Sims rush to the left for 4 yards to the TB41. Tackled by Jairus Byrd and Kasim Edebali.","(4:33) Jameis Winston pass to the right to Brandon Myers for 12 yards to the TB37. Tackled by Craig Robertson.","(4:39) Penalty: False Start on Tampa Bay (Ali Marpet) -5 yards.","(5:19) Jameis Winston pass to the left to Charles Sims for 6 yards to the TB30. Tackled by Darryl Tapp.","(6:03) Jameis Winston pass to the middle to Brandon Myers for 9 yards to the TB24. Tackled by Vonn Bell.","(6:20) Penalty: Holding on Tampa Bay (Ali Marpet) -10 yards.","(6:20) Wil Lutz kicks off to the endzone. Touchback.","(6:20) Mark Ingram 2 pt rush attempt. Successful.","(6:24) Drew Brees pass to the middle to Travaris Cadet for 11 yards for a TOUCHDOWN.","(6:28) Drew Brees incomplete pass to the right intended for Willie Snead defensed by Gerald McCoy.","(7:03) Mark Ingram rush to the right for 6 yards to the TB11. Tackled by Brent Grimes.","(7:27) Drew Brees pass to the left to Michael Thomas for 46 yards to the TB17. Tackled by Kwon Alexander.","(8:01) Mark Ingram rush to the right for 3 yards to the NO37. Tackled by Clinton McDonald and DaVonte Lambert.","(8:38) Drew Brees pass to the right to Brandin Cooks for 9 yards to the NO34. Tackled by Brent Grimes.","(8:38) Roberto Aguayo kicks off to the endzone. Touchback.","(8:38) Roberto Aguayo extra point is good.","(8:43) Jacquizz Rodgers rush to the right for 3 yards for a TOUCHDOWN.","(9:16) Jacquizz Rodgers rush to the left for 1 yard to the NO3. Tackled by Sheldon Rankins.","(9:35) Penalty: Illegal Use of Hands on New Orleans (Vonn Bell) 5 yards.","(10:09) Charles Sims rush to the left for 12 yards to the NO9. Tackled by B.W. Webb.","(10:47) Jacquizz Rodgers rush to the right for 11 yards to the NO21. Tackled by Sterling Moore and Nate Stupar.","(11:24) Jameis Winston pass to the right to Mike Evans for 8 yards to the NO32. Tackled by Sterling Moore.","(11:54) Jameis Winston pass to the right to Alan Cross for 5 yards to the NO40. Tackled by Nate Stupar.","(12:37) Jacquizz Rodgers rush to the left for no gain to the NO45. Tackled by Nick Fairley and Jairus Byrd.","(13:07) Jacquizz Rodgers rush to the right for 9 yards to the NO45. Tackled by Roman Harper.","(13:27) Jacquizz Rodgers rush to the right for 4 yards to the TB41. Tackled by Vonn Bell and Dannell Ellerbe. Penalty: Holding on New Orleans (Tyeler Davison) 5 yards.","(14:01) Jameis Winston pass to the left to Jacquizz Rodgers for 12 yards to the TB37. Tackled by Vonn Bell.","(14:01) Wil Lutz kicks off to the endzone. Touchback.","(14:01) Wil Lutz extra point is good.","(14:06) Mark Ingram rush to the right for 14 yards for a TOUCHDOWN.","(14:18) Jameis Winston pass intended for Mike Evans INTERCEPTED by Jairus Byrd and returned for 24 yards. Tackled by Jacquizz Rodgers.","(14:57) Jacquizz Rodgers rush to the left for a loss of 1 yard to the TB3. Tackled by Paul Kruger.","(15:00) Wil Lutz kicks off to the TB2. Josh Huff - no return. Tackled by De'Vante Harris.","(0:03) Wil Lutz 34 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(0:03) New Orleans Saints timeout.","(0:27) Drew Brees rush up the middle for 4 yards to the TB16. Tackled by Ryan Russell.","(1:02) Drew Brees pass to the right to Mark Ingram for a loss of 2 yards to the TB20. Tackled by Chris Conte.","(1:02) New Orleans Saints timeout.","(1:10) Drew Brees sacked at TB18 for a loss of 1 yard by Clinton McDonald.","(1:44) Drew Brees pass to the middle to Michael Thomas for 15 yards to the TB17. Tackled by Brent Grimes.","(2:00) Drew Brees pass to the left to Brandin Cooks for 14 yards to the TB32. Tackled by Vernon Hargreaves III. FUMBLE, recovered by NO.","(2:00) Two Minute Warning.","(2:24) Drew Brees pass to the right to Willie Snead for 14 yards to the TB46. Tackled by Brent Grimes.","(2:29) Drew Brees incomplete pass to the right intended for Brandin Cooks.","(3:06) Mark Ingram rush to the right for 4 yards to the NO40. Tackled by Kwon Alexander.","(3:38) Mark Ingram rush to the right for 9 yards to the NO36. Tackled by Bradley McDougald.","(3:46) Bryan Anger punts for 48 yards to NO12. No return. Penalty: Unsports. Conduct on Tampa Bay (Ryan Smith) 15 yards.","(3:52) Jameis Winston incomplete pass to the left intended for Josh Huff.","(4:35) Jameis Winston pass to the right to Josh Huff for 12 yards to the TB40. Tackled by Vonn Bell.","(5:21) Jameis Winston sacked at TB28 for a loss of 10 yards by Sheldon Rankins and Kasim Edebali.","(6:01) Jameis Winston pass to the left to Mike Evans for 11 yards to the TB38. Tackled by Roman Harper.","(6:45) Jameis Winston pass to the left to Charles Sims for 2 yards to the TB27. Tackled by Jairus Byrd.","(6:45) Wil Lutz kicks off to the endzone. Touchback.","(6:50) Wil Lutz 42 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(6:54) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(7:28) Mark Ingram rush to the left for 7 yards to the TB24. Tackled by Alterraun Verner.","(7:34) Drew Brees incomplete pass to the left intended for Mark Ingram.","(7:51) Drew Brees pass to the left to Brandin Cooks for 13 yards to the TB31. Tackled by Vernon Hargreaves III.","(8:31) Drew Brees pass to the left to Michael Thomas for 5 yards to the TB44. Tackled by Vernon Hargreaves III.","(9:05) Tim Hightower rush to the left for 4 yards to the TB49. Tackled by Vernon Hargreaves III.","(9:42) Drew Brees pass to the left to Tim Hightower for 11 yards to the NO47. Tackled by Bradley McDougald.","(10:19) Drew Brees pass to the middle to Willie Snead for 7 yards to the NO36. Tackled by Javien Elliott.","(10:50) Tim Hightower rush to the right for 4 yards to the NO29. Tackled by Kwon Alexander.","(10:50) Roberto Aguayo kicks off to the endzone. Touchback.","(10:50) Roberto Aguayo extra point is good.","(10:55) Jameis Winston pass to the left to Cameron Brate for 12 yards for a TOUCHDOWN.","(11:00) New Orleans Saints timeout.","(11:00) Penalty: Pass Interference on New Orleans (Vonn Bell) 14 yards.","(11:40) Charles Sims rush to the left for a loss of 4 yards to the NO26. Tackled by Jairus Byrd.","(11:43) Jameis Winston incomplete pass to the right intended for Cameron Brate.","(12:03) Jameis Winston pass to the right to Mike Evans for 17 yards to the NO22. Tackled by Jairus Byrd.","(12:11) Thomas Morstead punts for 45 yards to NO50. Adam Humphries return for 6 yards to NO44. Tackled by Brandon Coleman. Penalty: Illegal Plyr Downfld on New Orleans (Nate Stupar) 5 yards.","(12:15) Drew Brees incomplete pass to the right intended for Brandin Cooks defensed by Brent Grimes.","(12:48) Mark Ingram rush to the right for 1 yard to the NO5. Tackled by Noah Spence and Clinton McDonald.","(12:53) Drew Brees incomplete pass to the left intended for Willie Snead.","(13:03) Bryan Anger punts for 55 yards to NO4. No return.","(13:43) Jacquizz Rodgers rush to the right for no gain to the TB41. Tackled by Craig Robertson.","(14:26) Jacquizz Rodgers rush to the left for 1 yard to the TB41. Tackled by Dannell Ellerbe.","(15:00) Jacquizz Rodgers rush to the right for 8 yards to the TB40. Tackled by Roman Harper and Sterling Moore.","(0:18) Jameis Winston pass to the right to Russell Shepard for 15 yards to the TB32. Tackled by Sterling Moore.","(0:53) Jameis Winston pass to the middle to Jacquizz Rodgers for 3 yards to the TB17. Tackled by Paul Kruger.","(0:57) Wil Lutz kicks off to the TB-3. Josh Huff return for 17 yards to TB14. Tackled by Kasim Edebali.","(0:57) Wil Lutz extra point is good.","(1:01) Mark Ingram rush to the left for 6 yards for a TOUCHDOWN.","(1:48) Drew Brees pass to the middle to Coby Fleener for 21 yards to the TB6. Tackled by Bradley McDougald and Keith Tandy.","(2:10) Mark Ingram rush to the left for no gain to the TB27. Tackled by Robert Ayers Jr..","(2:31) Penalty: Pass Interference on Tampa Bay (Chris Conte) 12 yards.","(3:10) Tim Hightower rush to the left for 3 yards to the TB39. Tackled by Lavonte David.","(3:42) Tim Hightower rush to the right for 2 yards to the TB42. Tackled by Gerald McCoy.","(3:47) Penalty: Offside on Tampa Bay (Noah Spence) 5 yards.","(4:27) Drew Brees pass to the left to Brandin Cooks for 20 yards to the TB49. Tackled by Daryl Smith.","(4:59) John Kuhn rush to the left for 3 yards to the NO31. Tackled by Kwon Alexander.","(5:38) Tim Hightower rush to the right for 4 yards to the NO28. Tackled by Noah Spence.","(6:11) Drew Brees pass to the left to Travaris Cadet for 5 yards to the NO24. Tackled by Lavonte David.","(6:59) Tim Hightower rush to the right for 5 yards to the NO19. Tackled by Kwon Alexander and Clinton McDonald.","(7:29) Drew Brees pass to the left to John Phillips for 5 yards to the NO14. Tackled by Lavonte David.","(7:37) Bryan Anger punts for 50 yards to NO9. No return.","(8:23) Jameis Winston rush to the left for 3 yards to the TB41. Tackled by Dannell Ellerbe.","(9:06) Jacquizz Rodgers rush to the left for 3 yards to the TB38. Tackled by Dannell Ellerbe.","(9:11) Jameis Winston incomplete pass to the left intended for Luke Stocker defensed by Cameron Jordan.","(9:44) Jacquizz Rodgers rush to the left for 2 yards to the TB35. Tackled by Cameron Jordan.","(10:21) Jacquizz Rodgers rush to the left for 5 yards to the TB33. Tackled by Dannell Ellerbe.","(10:53) Jacquizz Rodgers rush to the right for 4 yards to the TB28. Tackled by Nick Fairley.","(11:21) Jacquizz Rodgers rush to the left for 13 yards to the TB24. Tackled by Roman Harper.","(11:28) Thomas Morstead punts for 39 yards to TB11. No return.","(12:02) Drew Brees sacked at NO50 for a loss of 4 yards by Lavonte David.","(12:06) Drew Brees incomplete pass to the left intended for Willie Snead defensed by Kwon Alexander.","(12:41) Mark Ingram rush to the right for 5 yards to the TB46. Tackled by Daryl Smith and Kwon Alexander.","(13:13) Drew Brees pass to the right to Coby Fleener for 9 yards to the NO49. Tackled by Brent Grimes.","(13:46) Drew Brees pass to the right to Mark Ingram for 5 yards to the NO40. Tackled by Kwon Alexander.","(14:30) Mark Ingram rush to the right for 1 yard to the NO35. Tackled by Kwon Alexander and Lavonte David.","(15:00) Mark Ingram rush to the right for 9 yards to the NO34. Tackled by Brent Grimes.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback."]