["(0:29) Jimmy Garoppolo rush up the middle for a loss of 1 yard to the NE31.","(1:09) Jimmy Garoppolo rush up the middle for no gain to the NE32.","(1:50) Jimmy Garoppolo rush up the middle for a loss of 1 yard to the NE32.","(1:55) Ryan Fitzpatrick incomplete pass to the left intended for Devin Smith.","(2:00) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa.","(2:00) Two Minute Warning.","(2:08) Brandon Wilds rush to the left for 1 yard to the NE33. Tackled by Elandon Roberts and Cyrus Jones.","(2:40) Brandon Wilds rush up the middle for 3 yards to the NE34. Tackled by Elandon Roberts.","(2:48) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 30 yards to the NE37. Tackled by Duron Harmon.","(3:34) Brandon Wilds rush to the left for 4 yards to the NYJ33. Tackled by Rob Ninkovich and Elandon Roberts.","(4:10) Brandon Wilds rush to the left for 6 yards to the NYJ29. Tackled by Elandon Roberts and Kyle Van Noy.","(4:23) Ryan Allen punts for 43 yards to NYJ23. No return.","(5:01) Dion Lewis rush to the left for no gain to the NE34. Tackled by Leonard Williams and Jordan Jenkins.","(5:38) Jimmy Garoppolo pass to the left to Michael Floyd for 6 yards to the NE34. Tackled by Buster Skrine.","(6:16) Dion Lewis rush to the right for 3 yards to the NE28. Tackled by Darron Lee.","(6:16) Nick Folk kicks off to the endzone. Touchback.","(6:20) Nick Folk 29 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(6:24) Ryan Fitzpatrick incomplete pass to the left intended for Devin Smith.","(6:30) Ryan Fitzpatrick incomplete pass to the middle intended for Quincy Enunwa.","(7:13) Khiry Robinson rush to the left for a loss of 1 yard to the NE11. Tackled by Devin McCourty and Trey Flowers.","(7:53) Ryan Fitzpatrick pass to the left to Charone Peake for 27 yards to the NE10. Tackled by Eric Rowe.","(8:02) Ryan Fitzpatrick incomplete pass to the left intended for Robby Anderson defensed by Eric Rowe.","(8:38) Khiry Robinson rush to the right for a loss of 2 yards to the NE37. Tackled by Trey Flowers and Kyle Van Noy.","(9:15) Khiry Robinson rush to the left for 9 yards to the NE35. Tackled by Duron Harmon.","(9:53) Ryan Fitzpatrick pass to the right to Devin Smith for 20 yards to the NE44. Tackled by Patrick Chung.","(10:30) Bilal Powell rush to the right for 2 yards to the NYJ36. Tackled by Elandon Roberts.","(11:13) Bilal Powell rush up the middle for no gain to the NYJ34. Tackled by Kyle Van Noy and Trey Flowers.","(11:49) Ryan Fitzpatrick pass to the right to Bilal Powell for 8 yards to the NYJ34. Tackled by Elandon Roberts.","(12:24) Bilal Powell rush to the right for 1 yard to the NYJ26. Tackled by Malcom Brown and Logan Ryan.","(12:24) Stephen Gostkowski kicks off to the endzone. Touchback.","(12:24) Stephen Gostkowski extra point is good.","(12:27) LeGarrette Blount rush to the right for 1 yard for a TOUCHDOWN.","(13:02) LeGarrette Blount rush up the middle for no gain to the NYJ1. Tackled by Darron Lee and Leonard Williams.","(13:27) LeGarrette Blount rush to the right for 2 yards to the NYJ1. Tackled by David Harris.","(13:32) Penalty: Holding on New York (Juston Burris) 4 yards.","(13:36) Jimmy Garoppolo incomplete pass to the left intended for Chris Hogan.","(14:11) Dion Lewis rush to the right for 2 yards to the NYJ7. Tackled by Deon Simon.","(14:35) Dion Lewis rush to the right for 4 yards to the NYJ9. Tackled by Rontez Miles and Freddie Bishop III.","(15:00) Dion Lewis rush up the middle for 3 yards to the NYJ13. Tackled by Jordan Jenkins and David Harris.","(0:27) LeGarrette Blount rush to the right for 6 yards to the NYJ16. Tackled by Jordan Jenkins and Calvin Pryor.","(0:38) Ryan Fitzpatrick pass intended for Quincy Enunwa INTERCEPTED by Malcolm Butler and returned for 21 yards. Tackled by Wesley Johnson. Penalty: Face Mask on New York (Brandon Shell) 15 yards.","(1:17) Quincy Enunwa rush to the right for 12 yards to the NYJ47. Tackled by Logan Ryan and Devin McCourty.","(1:55) Khiry Robinson rush to the left for 5 yards to the NYJ35. Tackled by Elandon Roberts.","(2:34) Khiry Robinson rush to the left for 4 yards to the NYJ30. Tackled by Kyle Van Noy and Eric Rowe.","(3:09) Ryan Fitzpatrick pass to the left to Brandon Marshall for 17 yards to the NYJ26. Tackled by Kyle Van Noy and Elandon Roberts.","(3:09) Penalty: False Start on New York -5 yards.","(3:22) Stephen Gostkowski kicks off to the NYJ7. Nick Marshall return for 1 yard to NYJ8. Tackled by Brandon King.","(3:22) Penalty: Offside on New England (Brandon King) -5 yards.","(3:22) Stephen Gostkowski extra point is good.","(3:25) LeGarrette Blount rush up the middle for 1 yard for a TOUCHDOWN.","(3:59) LeGarrette Blount rush to the right for no gain to the NYJ1. Tackled by Darrelle Revis.","(4:11) Penalty: Holding on New York (Darrelle Revis) 1 yards.","(4:49) LeGarrette Blount rush to the right for 4 yards to the NYJ2. Tackled by Sheldon Richardson and Doug Middleton.","(5:20) LeGarrette Blount rush to the right for 2 yards to the NYJ6. Tackled by Sheldon Richardson and Muhammad Wilkerson.","(6:01) LeGarrette Blount rush to the right for 8 yards to the NYJ8. Tackled by Rontez Miles and Doug Middleton.","(6:37) LeGarrette Blount rush up the middle for 1 yard to the NYJ16. Tackled by Darron Lee and Sheldon Richardson.","(6:57) Tom Brady pass to the left to Malcolm Mitchell for 8 yards to the NYJ17. Tackled by Juston Burris.","(7:51) Tom Brady pass to the right to James White for 7 yards to the NYJ25. Tackled by Darrelle Revis.","(8:26) LeGarrette Blount rush to the right for 1 yard to the NYJ32. Tackled by Freddie Bishop III and Leonard Williams.","(9:05) LeGarrette Blount rush to the left for 3 yards to the NYJ33. Tackled by Sheldon Richardson and Calvin Pryor.","(9:05) Penalty: Too Many Men on Field on New York 5 yards.","(9:52) Tom Brady pass to the middle to Julian Edelman for 28 yards to the NYJ41. Tackled by Doug Middleton.","(10:21) Dion Lewis rush to the left for 3 yards to the NE31. Tackled by Calvin Pryor.","(11:02) Tom Brady sacked at NE28 for a loss of 9 yards by Muhammad Wilkerson. FUMBLE, recovered by NE (Tom Brady).","(11:12) Lachlan Edwards punts for 45 yards to NE33. Cyrus Jones return for 4 yards to NE37. Tackled by Rontez Miles.","(11:18) Ryan Fitzpatrick incomplete pass to the left intended for Robby Anderson.","(11:21) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Bostick.","(12:00) Bilal Powell rush to the right for 4 yards to the NYJ22. Tackled by Alan Branch.","(12:07) Ryan Allen punts for 42 yards to NYJ18. No return.","(12:38) James White rush up the middle for 14 yards to the NE40. Tackled by Rontez Miles.","(13:19) Tom Brady pass to the left to James White for no gain to the NE26. Tackled by David Harris.","(13:25) Tom Brady incomplete pass to the right intended for Julian Edelman.","(13:29) Penalty: Illegal Use of Hands on New England (David Andrews) -10 yards.","(14:16) LeGarrette Blount rush to the right for 2 yards to the NE36. Tackled by Calvin Pryor and Leonard Williams.","(14:55) Dion Lewis rush to the left for 9 yards to the NE34. Tackled by Calvin Pryor and Rontez Miles.","(15:00) Tom Brady incomplete pass to the left intended for Chris Hogan.","(15:00) Nick Folk kicks off to the endzone. Touchback.","(0:25) Bilal Powell rush to the right for 3 yards to the NYJ28. Tackled by Jabaal Sheard and Kyle Van Noy.","(0:25) Stephen Gostkowski kicks off to the endzone. Touchback.","(0:25) Stephen Gostkowski extra point is good.","(0:31) Tom Brady pass to the right to James White for 25 yards for a TOUCHDOWN.","(0:38) Penalty: Pass Interference on New York (Doug Middleton) 47 yards.","(0:38) New England Patriots timeout.","(0:46) Tom Brady pass to the left to Julian Edelman for 9 yards to the NE28. Tackled by Buster Skrine.","(0:46) New York Jets timeout.","(0:52) Dion Lewis rush up the middle for 3 yards to the NE19. Tackled by Muhammad Wilkerson and David Harris.","(1:30) Dion Lewis rush up the middle for 3 yards to the NE16. Tackled by Buster Skrine.","(1:40) Lachlan Edwards punts for 49 yards to NE9. Julian Edelman return for 4 yards to NE13. Tackled by Devin Smith and Rontez Miles.","(1:46) Ryan Fitzpatrick incomplete pass to the middle intended for Charone Peake.","(1:50) Ryan Fitzpatrick incomplete pass to the left intended for Charone Peake defensed by Logan Ryan.","(1:53) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(2:00) Penalty: Illegal Use of Hands on New England (Malcolm Butler) 5 yards.","(2:00) Two Minute Warning.","(2:11) Ryan Fitzpatrick pass to the right to Brandon Marshall for 11 yards to the NYJ37. Tackled by Devin McCourty.","(2:40) Bilal Powell rush to the right for 1 yard to the NYJ26. Tackled by Shea McClellin and Chris Long.","(2:40) Stephen Gostkowski kicks off to the endzone. Touchback.","(2:40) Stephen Gostkowski extra point is good.","(2:47) Tom Brady pass to the middle to Matt Lengel for 18 yards for a TOUCHDOWN.","(3:26) LeGarrette Blount rush to the left for 2 yards to the NYJ18. Tackled by Sheldon Richardson and Rontez Miles.","(4:02) Tom Brady pass to the right to Julian Edelman for 35 yards to the NYJ20. Tackled by Rontez Miles.","(4:47) Dion Lewis rush up the middle for a loss of 1 yard to the NE45. Tackled by Darron Lee and Jordan Jenkins.","(4:53) Ryan Fitzpatrick pass intended for Brandon Marshall INTERCEPTED by Eric Rowe. No return.","(5:02) Ryan Allen punts for 51 yards to NYJ20. Nick Marshall return for 3 yards to NYJ23. Tackled by Jonathan Jones.","(5:10) Tom Brady incomplete pass to the left intended for James White.","(5:50) Tom Brady pass to the right to Dion Lewis for 5 yards to the NE29. Tackled by Darron Lee and Jordan Jenkins.","(5:56) Tom Brady incomplete pass to the left intended for Malcolm Mitchell.","(6:00) 34 yard field goal attempt by Nick Folk is NO GOOD. Holder: Lachlan Edwards.","(6:05) Ryan Fitzpatrick incomplete pass to the middle intended for Austin Seferian-Jenkins.","(6:45) Khiry Robinson rush to the right for 1 yard to the NE16. Tackled by Devin McCourty.","(7:26) Ryan Fitzpatrick rush to the right for 3 yards to the NE17. Tackled by Logan Ryan.","(7:58) Khiry Robinson rush to the left for 10 yards to the NE20. Tackled by Kyle Van Noy.","(8:35) Ryan Fitzpatrick pass to the left to Austin Seferian-Jenkins for 17 yards to the NE30. Tackled by Duron Harmon.","(9:15) Bilal Powell rush to the left for 2 yards to the NE47. Tackled by Trey Flowers and Logan Ryan.","(9:55) Bilal Powell rush to the left for 12 yards to the NE49. Tackled by Patrick Chung and Devin McCourty.","(10:31) Bilal Powell rush to the left for 12 yards to the NYJ39. Tackled by Devin McCourty.","(11:08) Ryan Fitzpatrick pass to the left to Bilal Powell for 6 yards to the NYJ27. Tackled by Trey Flowers and Shea McClellin.","(11:13) Stephen Gostkowski kicks off to the NYJ1. Nick Marshall return for 20 yards to NYJ21. Tackled by Nate Ebner.","(11:16) Stephen Gostkowski 22 yard field goal attempt is GOOD. Holder: Ryan Allen.","(11:20) Tom Brady incomplete pass to the left intended for Julian Edelman defensed by Juston Burris.","(11:22) Tom Brady incomplete pass to the left intended for Chris Hogan.","(12:08) Tom Brady pass to the left to James Develin for no gain to the NYJ4. Tackled by Darron Lee.","(12:41) LeGarrette Blount rush to the right for 12 yards to the NYJ4. Tackled by Rontez Miles.","(13:20) Tom Brady pass to the right to Julian Edelman for 9 yards to the NYJ16. Tackled by Buster Skrine.","(13:51) Dion Lewis rush to the left for 3 yards to the NYJ25. Tackled by Leonard Williams and Muhammad Wilkerson.","(13:55) Tom Brady incomplete pass to the right intended for Chris Hogan.","(14:01) Khiry Robinson rush to the right for a loss of 4 yards to the NYJ30. Tackled by Elandon Roberts. FUMBLE, recovered by NE (Malcolm Butler) and returned for 2 yards. Tackled by Bryce Petty.","(14:11) Ryan Allen punts for 51 yards to NYJ30. Nick Marshall return for 4 yards to NYJ34. Tackled by Geneo Grissom.","(14:16) Tom Brady incomplete pass to the left intended for Julian Edelman.","(15:00) Dion Lewis rush to the left for no gain to the NE19. Tackled by Rontez Miles.","(0:20) Dion Lewis rush to the right for 6 yards to the NE19. Tackled by David Harris and Darron Lee.","(0:30) Lachlan Edwards punts for 41 yards to NE13. No return.","(0:34) Bryce Petty incomplete pass to the right intended for Quincy Enunwa.","(1:16) Bilal Powell rush to the right for 1 yard to the NYJ46. Tackled by Rob Ninkovich and Vincent Valentine.","(1:54) Bilal Powell rush to the right for 5 yards to the NYJ45. Tackled by Elandon Roberts and Patrick Chung.","(2:32) Bilal Powell rush to the right for 9 yards to the NYJ40. Tackled by Rob Ninkovich.","(3:02) Bilal Powell rush to the right for 6 yards to the NYJ31. Tackled by Elandon Roberts and Patrick Chung.","(3:02) Stephen Gostkowski kicks off to the endzone. Touchback.","(3:02) Stephen Gostkowski extra point is good.","(3:07) Tom Brady pass to the middle to Martellus Bennett for 5 yards for a TOUCHDOWN.","(3:49) LeGarrette Blount rush up the middle for no gain to the NYJ5. Tackled by Muhammad Wilkerson and Deon Simon.","(4:28) LeGarrette Blount rush to the left for 3 yards to the NYJ5. Tackled by Leonard Williams.","(5:13) Tom Brady pass to the middle to Malcolm Mitchell for 5 yards to the NYJ8. Tackled by David Harris.","(5:52) Dion Lewis rush to the left for 6 yards to the NYJ13. Tackled by Rontez Miles and Buster Skrine.","(6:28) Tom Brady pass to the left to Chris Hogan for 22 yards to the NYJ19. Tackled by Doug Middleton.","(7:13) Dion Lewis rush up the middle for 6 yards to the NYJ41. Tackled by Rontez Miles and Sheldon Richardson.","(7:19) Tom Brady incomplete pass to the left intended for Michael Floyd.","(7:26) Bryce Petty pass intended for Robby Anderson INTERCEPTED by Malcolm Butler. No return. Tackled by Robby Anderson.","(7:30) Bryce Petty incomplete pass to the left intended for Bilal Powell.","(8:12) Bryce Petty sacked at NYJ20 for a loss of 1 yard by Alan Branch and Jabaal Sheard.","(8:16) Stephen Gostkowski kicks off to the NYJ1. Nick Marshall return for 20 yards to NYJ21. Tackled by Nate Ebner.","(8:20) Stephen Gostkowski 29 yard field goal attempt is GOOD. Holder: Ryan Allen.","(8:29) Tom Brady incomplete pass to the right intended for Malcolm Mitchell.","(9:08) LeGarrette Blount rush up the middle for no gain to the NYJ11. Tackled by David Harris and Sheldon Richardson.","(9:43) LeGarrette Blount rush to the right for 3 yards to the NYJ11. Tackled by Leonard Williams and Ronald Martin.","(10:19) Tom Brady pass to the middle to Martellus Bennett for 14 yards to the NYJ14. Tackled by Rontez Miles.","(10:55) Tom Brady pass to the middle to Julian Edelman for 8 yards to the NYJ28. Tackled by Calvin Pryor.","(11:36) LeGarrette Blount rush to the left for a loss of 1 yard to the NYJ36. Tackled by Sheldon Richardson.","(12:07) Tom Brady pass to the middle to Malcolm Mitchell for 16 yards to the NYJ35. Tackled by Buster Skrine.","(12:47) Dion Lewis rush up the middle for 2 yards to the NE49. Tackled by Rontez Miles and Muhammad Wilkerson.","(12:56) Lachlan Edwards punts for 45 yards to NE39. Julian Edelman return for 8 yards to NE47. Tackled by David Harris.","(13:35) Bryce Petty sacked at NYJ16 for a loss of 7 yards by Chris Long.","(14:18) Bilal Powell rush to the left for 2 yards to the NYJ23. Tackled by Alan Branch and Vincent Valentine.","(14:57) Bilal Powell rush to the left for no gain to the NYJ21. Tackled by Trey Flowers and Eric Rowe.","(15:00) Stephen Gostkowski kicks off to the NYJ5. Nick Marshall return for 16 yards to NYJ21."]