["(0:36) Blake Bortles rush up the middle for a loss of 1 yard to the Jax14.","(0:41) Matt Cassel incomplete pass to the right intended for Delanie Walker defensed by Tashaun Gipson.","(0:46) Matt Cassel incomplete pass to the right intended for Delanie Walker defensed by Johnathan Cyprien.","(0:50) Matt Cassel incomplete pass to the left intended for DeMarco Murray.","(0:51) Matt Cassel incomplete pass to the middle.","(1:12) Matt Cassel pass to the left to Tajae Sharpe for 24 yards to the Jax15. Tackled by Tashaun Gipson.","(1:13) Matt Cassel incomplete pass to the middle.","(1:29) DeMarco Murray rush up the middle for 1 yard to the Jax39. Tackled by Dante Fowler Jr..","(1:34) Matt Cassel pass to the left to Harry Douglas for 5 yards to the Jax40.","(1:58) Matt Cassel pass to the right to Delanie Walker for 4 yards to the Jax45. Tackled by Jalen Ramsey.","(1:58) Two Minute Warning.","(2:04) Matt Cassel pass to the left to Harry Douglas for 13 yards to the Jax49.","(2:11) Matt Cassel pass to the middle to Derrick Henry for 11 yards to the Ten38.","(2:15) Matt Cassel incomplete pass to the middle intended for Delanie Walker defensed by Sen'Derrick Marks.","(2:36) Matt Cassel pass to the left to Kendall Wright for 11 yards to the Ten27. Tackled by Paul Posluszny.","(2:45) Matt Cassel incomplete pass to the left intended for Tajae Sharpe defensed by Jalen Ramsey.","(2:53) Brad Nortman punts for 38 yards to Ten16. No return.","(2:53) Jacksonville Jaguars timeout.","(3:37) Corey Grant rush to the left for 3 yards to the Jax46. Tackled by Al Woods.","(3:38) Tennessee Titans timeout.","(3:42) Corey Grant rush to the right for a loss of 1 yard to the Jax43. Tackled by Al Woods.","(3:42) Tennessee Titans timeout.","(3:49) Corey Grant rush to the left for 6 yards to the Jax44. Tackled by Avery Williamson.","(3:56) Brett Kern punts for 47 yards to Jax38. No return.","(4:39) Matt Cassel pass to the left to Delanie Walker for 5 yards to the Ten15. Tackled by Jalen Ramsey.","(4:43) Matt Cassel incomplete pass to the left intended for Tajae Sharpe defensed by Malik Jackson.","(4:49) Penalty: Holding on Tennessee (Taylor Lewan) -9 yards.","(5:17) Matt Cassel sacked at Ten19 for a loss of 6 yards by Yannick Ngakoue.","(5:17) Jason Myers kicks off to the endzone. Touchback.","(5:17) Jason Myers extra point is good.","(5:25) Matt Cassel pass intended for Rishard Matthews INTERCEPTED by Jalen Ramsey and returned for 30 yards for a TOUCHDOWN.","(5:25) Jason Myers kicks off to the endzone. Touchback.","(5:25) Jason Myers extra point is NO GOOD.","(5:32) Marqise Lee pass to the left to Blake Bortles for 20 yards for a TOUCHDOWN.","(5:32) Jacksonville Jaguars timeout.","(6:20) Blake Bortles pass to the left to Alex Ellis for 6 yards to the Ten20. Tackled by Aaron Wallace.","(6:55) Blake Bortles pass to the left to Allen Robinson for 16 yards to the Ten26. Tackled by Kevin Byard and Valentino Blake.","(7:30) Corey Grant rush to the left for a loss of 1 yard to the Ten42. Tackled by Jurrell Casey.","(8:01) Blake Bortles pass to the left to Allen Robinson for 21 yards to the Ten41. Tackled by Valentino Blake.","(8:37) Corey Grant rush to the left for 3 yards to the Jax38. Tackled by Sean Spence.","(8:42) Penalty: Pass Interference on Tennessee (Brice McCain) 10 yards.","(8:42) Ryan Succop kicks off to the endzone. Touchback.","(8:42) Ryan Succop extra point is good.","(8:49) Matt Cassel pass to the left to Delanie Walker for 14 yards for a TOUCHDOWN.","(9:31) Matt Cassel pass to the right to DeMarco Murray for no gain to the Jax14.","(10:15) Derrick Henry rush up the middle for 2 yards to the Jax14. Tackled by Paul Posluszny.","(11:03) Matt Cassel pass to the left to Derrick Henry for 11 yards to the Jax16. Tackled by Paul Posluszny.","(11:42) Matt Cassel pass to the right to Kendall Wright for 10 yards to the Jax27. Tackled by Paul Posluszny.","(12:08) Penalty: Illegal Formation on Tennessee (Jack Conklin) -5 yards.","(12:42) Matt Cassel pass to the left to Harry Douglas for 8 yards to the Jax32. Tackled by Jalen Ramsey.","(13:23) DeMarco Murray rush up the middle for 2 yards to the Jax40. Tackled by Abry Jones.","(14:06) Matt Cassel pass to the left to Harry Douglas for 8 yards to the Jax42. Tackled by Jalen Ramsey.","(14:16) Brad Nortman punts for 50 yards to Ten35. No return. Penalty: FC Interference on Jacksonville (Peyton Thompson) 15 yards.","(14:21) Blake Bortles incomplete pass to the left intended for Marqise Lee defensed by Jurrell Casey.","(14:54) Corey Grant rush up the middle for 4 yards to the Jax15. Tackled by Derrick Morgan.","(15:00) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(0:00) Brett Kern punts for 41 yards to Jax11. No return.","(0:08)  FUMBLE, recovered by Ten (Matt Cassel). Matt Cassel incomplete pass to the right intended for Tajae Sharpe.","(0:13) Matt Cassel incomplete pass to the right intended for Rishard Matthews defensed by Prince Amukamara.","(0:53) Marcus Mariota sacked at Ten48 for a loss of 4 yards by Sheldon Day.","(1:25) Marcus Mariota pass to the left to Anthony Fasano for 12 yards to the Jax48. Tackled by Telvin Smith.","(2:06) DeMarco Murray rush up the middle for 1 yard to the Ten40. Tackled by Sen'Derrick Marks.","(2:53) Marcus Mariota pass to the right to Rishard Matthews for 14 yards to the Ten39. Tackled by Johnathan Cyprien.","(2:59) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(2:59) Jason Myers kicks off to the endzone. Touchback.","(3:04) Jason Myers 50 yard field goal attempt is GOOD. Holder: Brad Nortman.","(3:08) Blake Bortles incomplete pass to the right intended for Corey Grant.","(3:34) Penalty: Illegal Use of Hands on Jacksonville (Jermey Parnell) -10 yards.","(4:09) Blake Bortles pass to the right to Allen Robinson for 7 yards to the Ten22. Tackled by Valentino Blake.","(4:14) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(4:53) Blake Bortles rush to the right for 7 yards to the Ten29. Tackled by Kalan Reed.","(5:27) Blake Bortles pass to the left to Marqise Lee for 4 yards to the Ten36. Tackled by Aaron Wallace and Brice McCain.","(5:27) Tennessee Titans timeout.","(6:01) Blake Bortles pass to the left to Chris Ivory for 37 yards to the Ten40. Tackled by Sean Spence.","(6:11) Brett Kern punts for 43 yards to Jax23. Bryan Walters - no return. Tackled by Kalan Reed and LeShaun Sims.","(6:50) Derrick Henry rush up the middle for no gain to the Ten34. Tackled by Johnathan Cyprien.","(7:36) Marcus Mariota pass to the right to Harry Douglas for 14 yards to the Ten34. Tackled by Paul Posluszny.","(7:41) Marcus Mariota incomplete pass to the left intended for Harry Douglas.","(8:13) Penalty: Illegal Formation on Tennessee -5 yards.","(8:13) Jason Myers kicks off to the endzone. Touchback.","(8:18) Jason Myers 56 yard field goal attempt is GOOD. Holder: Brad Nortman.","(8:23) Blake Bortles incomplete pass to the right intended for Bryan Walters.","(8:58) Blake Bortles pass to the middle to Bryan Walters for 11 yards to the Ten38. Tackled by Brian Orakpo.","(9:41) Chris Ivory rush to the right for a loss of 2 yards to the Ten49. Tackled by Brice McCain.","(10:14) Blake Bortles pass to the left to Ben Koyack for 6 yards to the Ten47. Tackled by Sean Spence.","(10:21) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(10:58) Chris Ivory rush to the left for 6 yards to the Jax47. Tackled by Rashad Johnson.","(11:03) Blake Bortles incomplete pass to the right intended for Chris Ivory. Penalty: Face Mask on Tennessee (Wesley Woodyard) 15 yards.","(11:43) Blake Bortles rush up the middle for 1 yard to the Jax26.","(12:21) Chris Ivory rush to the right for a loss of 5 yards to the Jax25. Tackled by Derrick Morgan.","(12:24) Penalty: Holding on Tennessee (Brice McCain) 5 yards.","(12:24) Ryan Succop kicks off to the endzone. Touchback.","(12:29) Ryan Succop 42 yard field goal attempt is GOOD. Holder: Brett Kern.","(12:34) Marcus Mariota incomplete pass to the right intended for Rishard Matthews defensed by Dante Fowler Jr..","(13:18) DeMarco Murray rush up the middle for 2 yards to the Jax24. Tackled by Paul Posluszny and Abry Jones.","(13:23) Marcus Mariota incomplete pass to the right intended for Delanie Walker defensed by Prince Amukamara.","(13:28) Chris Ivory rush up the middle for 4 yards to the Jax21. Tackled by Brian Orakpo. FUMBLE, recovered by Ten (Da'Norris Searcy). Tackled by Ben Koyack.","(13:36) Brett Kern punts for 54 yards to Jax17. No return.","(13:40) Marcus Mariota incomplete pass to the left intended for Kendall Wright defensed by Dante Fowler Jr..","(14:24) DeMarco Murray rush to the left for no gain to the Ten29. Tackled by Paul Posluszny.","(15:00) Marcus Mariota rush to the right for 4 yards to the Ten29.","(15:00) Jason Myers kicks off to the endzone. Touchback.","(0:11) Marcus Mariota rush up the middle for a loss of 1 yard to the Ten24.","(0:11) Jason Myers kicks off to the endzone. Touchback.","(0:16) Jason Myers 48 yard field goal attempt is GOOD. Holder: Brad Nortman.","(0:23) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(0:27) Blake Bortles incomplete pass to the middle intended for Chris Ivory.","(0:32) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(0:32) Jacksonville Jaguars timeout.","(0:41) Blake Bortles pass to the right to Allen Robinson for 37 yards to the Ten30. Tackled by LeShaun Sims.","(0:43) Blake Bortles incomplete pass to the right intended for Corey Grant.","(1:03) Blake Bortles pass to the middle to Ben Koyack for 6 yards to the Jax33. Tackled by Daimion Stafford.","(1:09) Blake Bortles pass to the right to Corey Grant for 5 yards to the Jax27. Tackled by Daimion Stafford.","(1:16) Brett Kern punts for 49 yards to Jax22. No return.","(1:16) Jacksonville Jaguars timeout.","(1:24) Derrick Henry rush to the left for 1 yard to the Ten29. Tackled by Telvin Smith.","(1:31) Marcus Mariota incomplete pass to the right intended for Kendall Wright defensed by Jalen Ramsey.","(1:31) Tennessee Titans timeout.","(1:35) Marcus Mariota sacked at Ten28 for a loss of 8 yards by Dante Fowler Jr..","(1:56) Marcus Mariota pass to the left to Tajae Sharpe for 11 yards to the Ten36. Tackled by Prince Amukamara.","(1:57) Jason Myers kicks off to the endzone. Touchback.","(1:57) Jason Myers extra point is NO GOOD.","(2:00) Chris Ivory rush up the middle for 1 yard for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:45) Blake Bortles pass to the right to Chris Ivory for 19 yards to the Ten1. Tackled by Avery Williamson.","(3:27) Blake Bortles pass to the right to Bryan Walters for 15 yards to the Ten20. Tackled by Brice McCain.","(4:06) Blake Bortles pass to the right to Marqise Lee for 12 yards to the Ten35. Tackled by Valentino Blake.","(4:45) Blake Bortles sacked at Ten47 for a loss of 9 yards. FUMBLE, recovered by Jax (Jermey Parnell).","(5:28) Blake Bortles pass to the right to Bryan Walters for 4 yards to the Ten38. Tackled by Brice McCain.","(6:04) Blake Bortles pass to the left to Bryan Walters for 9 yards to the Ten42. Tackled by Nate Palmer.","(6:34) Blake Bortles pass to the left to Allen Robinson for 6 yards to the Jax49. Tackled by LeShaun Sims.","(7:15) Chris Ivory rush to the left for 2 yards to the Jax43. Tackled by DaQuan Jones.","(7:50) Blake Bortles pass to the left to Allen Robinson for 6 yards to the Jax41. Tackled by LeShaun Sims.","(8:26) Blake Bortles pass to the left to Bryan Walters for 6 yards to the Jax35. Tackled by Brian Orakpo.","(8:59) Chris Ivory rush to the right for 4 yards to the Jax29. Tackled by Daimion Stafford.","(8:59) Ryan Succop kicks off to the endzone. Touchback.","(8:59) Ryan Succop extra point is good.","(9:07) Marcus Mariota pass to the right to Rishard Matthews for 3 yards for a TOUCHDOWN.","(9:52) DeMarco Murray rush up the middle for 3 yards to the Jax3. Tackled by Johnathan Cyprien.","(10:35) DeMarco Murray rush up the middle for no gain to the Jax6. Tackled by Abry Jones.","(11:18) Derrick Henry rush to the left for 10 yards to the Jax6. Tackled by Telvin Smith and Johnathan Cyprien.","(11:59) DeMarco Murray rush to the left for 8 yards to the Jax16. Tackled by Telvin Smith.","(12:07) Penalty: Roughing Passer on Jacksonville (Sheldon Day) 15 yards.","(12:53) Marcus Mariota pass to the right to Tajae Sharpe for 13 yards to the Jax39. Tackled by Prince Amukamara.","(12:58) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(13:36) DeMarco Murray rush up the middle for a loss of 2 yards to the Ten48. Tackled by Malik Jackson.","(14:16) DeMarco Murray rush up the middle for 11 yards to the Ten50. Tackled by Telvin Smith.","(15:00) DeMarco Murray rush to the left for 8 yards to the Ten39. Tackled by Johnathan Cyprien.","(0:08) Brad Nortman punts for 55 yards to Ten33. Marc Mariani return for a loss of 2 yards to Ten31. Tackled by Peyton Thompson.","(0:40) Blake Bortles pass to the middle to Alex Ellis for 4 yards to the Jax12. Tackled by Brian Orakpo.","(1:18) Blake Bortles sacked at Jax8 for a loss of 5 yards by Sean Spence.","(1:55) Chris Ivory rush to the right for a loss of 2 yards to the Jax13. Tackled by Wesley Woodyard and Aaron Wallace.","(2:03) Brett Kern punts for 36 yards to Jax15. No return.","(2:12) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe defensed by Jalen Ramsey.","(2:17) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(2:22) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(2:54) Marcus Mariota pass to the left to DeMarco Murray for 18 yards to the Ten49. Tackled by Tashaun Gipson.","(3:36) DeMarco Murray rush up the middle for no gain to the Ten31. Tackled by Paul Posluszny and Johnathan Cyprien.","(4:03) DeMarco Murray rush to the right for 6 yards to the Ten31. Tackled by Tyson Alualu.","(4:03) Jason Myers kicks off to the endzone. Touchback.","(4:05) Jason Myers 29 yard field goal attempt is GOOD. Holder: Brad Nortman.","(4:06) Penalty: Delay of Game on Jacksonville (Blake Bortles) -5 yards.","(4:10) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Valentino Blake.","(4:48) Corey Grant rush to the right for no gain to the Ten6. Tackled by DaQuan Jones.","(5:24) Corey Grant rush to the right for 8 yards to the Ten6. Tackled by Wesley Woodyard.","(6:00) Chris Ivory rush to the left for 13 yards to the Ten14. Tackled by Wesley Woodyard.","(6:31) Chris Ivory rush up the middle for 1 yard to the Ten27. Tackled by Aaron Wallace.","(7:08) Blake Bortles pass to the left to Allen Robinson for 18 yards to the Ten28. Tackled by Valentino Blake.","(7:43) Corey Grant rush up the middle for 5 yards to the Ten46. Tackled by Austin Johnson.","(8:24) Blake Bortles pass to the right to Chris Ivory for 10 yards to the Jax49. Tackled by Brice McCain.","(9:00) Chris Ivory rush to the left for 10 yards to the Jax39. Tackled by DaQuan Jones.","(9:33) Blake Bortles pass to the right to Chris Ivory for 3 yards to the Jax29. Tackled by Valentino Blake.","(9:44) Brett Kern punts for 43 yards to Jax16. Bryan Walters return for 10 yards to Jax26. Tackled by Beau Brinkley.","(9:51) Marcus Mariota incomplete pass to the middle intended for Rishard Matthews defensed by Paul Posluszny.","(10:34) DeMarco Murray rush up the middle for 2 yards to the Ten41. Tackled by Josh Johnson and Tyson Alualu.","(10:39) Marcus Mariota incomplete pass to the left intended for DeMarco Murray.","(11:03) Marcus Mariota pass to the left to Rishard Matthews for 14 yards to the Ten39. Tackled by Paul Posluszny.","(11:03) Jason Myers kicks off to the endzone. Touchback.","(11:03) Jason Myers extra point is good.","(11:10) Blake Bortles pass to the left to Marqise Lee for 21 yards for a TOUCHDOWN.","(11:35) Chris Ivory rush up the middle for 6 yards to the Ten21. Tackled by Da'Norris Searcy.","(12:05) Chris Ivory rush to the right for 5 yards to the Ten27. Tackled by Austin Johnson.","(12:46) Blake Bortles pass to the right to Allen Robinson for 28 yards to the Ten32. Tackled by Valentino Blake.","(13:27) T.J. Yeldon rush to the right for 4 yards to the Jax40. Tackled by Avery Williamson.","(14:01) Chris Ivory rush to the right for 2 yards to the Jax36. Tackled by Sean Spence.","(14:33) T.J. Yeldon rush up the middle for 1 yard to the Jax34. Tackled by Valentino Blake.","(15:00) Blake Bortles pass to the right to Allen Robinson for 8 yards to the Jax33. Tackled by Valentino Blake.","(15:00) Ryan Succop kicks off to the endzone. Touchback."]