["(0:08) Dwayne Washington rush up the middle for 6 yards to the Dal44. Tackled by Barry Church.","(0:39) Matthew Stafford pass to the left to Dwayne Washington for 4 yards to the Det50. Tackled by Barry Church.","(1:06) Matthew Stafford pass to the left to Golden Tate for 6 yards to the Det46. Tackled by Byron Jones.","(1:12) Chris Jones punts for 44 yards to Det40. No return.","(2:00) Darren McFadden rush to the right for 2 yards to the Dal16. Tackled by Haloti Ngata.","(2:00) Two Minute Warning.","(2:33) Darren McFadden rush to the left for a loss of 1 yard to the Dal14. Tackled by Ezekiel Ansah.","(3:16) Darren McFadden rush up the middle for a loss of 2 yards to the Dal15. Tackled by A'Shawn Robinson.","(3:59) Darren McFadden rush to the right for 3 yards to the Dal17. Tackled by Ezekiel Ansah.","(3:59) Detroit Lions timeout.","(4:05) Darren McFadden rush to the right for 3 yards to the Dal14. Tackled by Josh Bynes.","(4:05) Detroit Lions timeout.","(4:11) Darren McFadden rush to the right for 6 yards to the Dal11. Tackled by Glover Quin.","(4:19) Matthew Stafford sacked at Dal5 for a loss of 1 yard by David Irving. FUMBLE, recovered by Dal (Kyle Wilber). Tackled by Zach Zenner.","(4:51) Matthew Stafford pass to the right to Golden Tate for 7 yards to the Dal4. Tackled by Orlando Scandrick. FUMBLE, recovered by Det (Golden Tate).","(4:56) Matthew Stafford incomplete pass to the left intended for TJ Jones.","(5:33) Matthew Stafford pass to the right to Golden Tate for 7 yards to the Dal11. Tackled by Orlando Scandrick.","(5:38) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(6:11) Matthew Stafford pass to the left to Eric Ebron for 12 yards to the Dal18. Tackled by J.J. Wilcox.","(6:25) Chris Jones punts for 51 yards to Det47. Andre Roberts return for 23 yards to Dal30. Tackled by Chris Jones and Kyle Wilber.","(6:33) Penalty: Illegal Motion on Dallas (Vince Mayle) -2 yards.","(6:40) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(7:27) Darren McFadden rush up the middle for 2 yards to the Dal4. Tackled by Ezekiel Ansah and Josh Bynes.","(8:10) Darren McFadden rush to the left for a loss of 1 yard to the Dal2. Tackled by Tavon Wilson.","(8:27) Sam Martin punts for 51 yards to Dal3. No return.","(9:04) Matthew Stafford sacked at Det46 for a loss of 9 yards by Benson Mayowa.","(9:12) Matthew Stafford incomplete pass to the right intended for Eric Ebron defensed by Damien Wilson.","(9:51) Dwayne Washington rush up the middle for no gain to the Dal45. Tackled by Randy Gregory.","(10:38) Matthew Stafford pass to the left to Eric Ebron for 16 yards to the Dal45. Tackled by Jeff Heath and Barry Church.","(10:45) Matthew Stafford incomplete pass to the right intended for Dwayne Washington.","(11:13) Dwayne Washington rush to the right for 4 yards to the Det39. Tackled by Sean Lee.","(11:37) Matthew Stafford pass to the middle to Eric Ebron for 6 yards to the Det35. Tackled by Anthony Hitchens.","(12:04) Dwayne Washington rush to the left for 9 yards to the Det29. Tackled by Barry Church.","(12:12) Dan Bailey kicks off to the Det-2. Andre Roberts return for 22 yards to Det20. Tackled by Byron Jones.","(12:12) Dan Bailey extra point is good.","(12:18) Dak Prescott pass to the right to Dez Bryant for 19 yards for a TOUCHDOWN.","(12:56) Darren McFadden rush to the right for 2 yards to the Det19. Tackled by Tavon Wilson.","(13:41) Dak Prescott pass to the right to Cole Beasley for 12 yards to the Det21. Tackled by Devin Taylor.","(13:41) Detroit Lions timeout.","(14:14) Darren McFadden rush up the middle for 2 yards to the Det33. Tackled by Ezekiel Ansah and A'Shawn Robinson.","(15:00) Dak Prescott pass to the right to Cole Beasley for 4 yards to the Det35. Tackled by Tavon Wilson.","(0:11) Darren McFadden rush to the left for 6 yards to the Det39. Tackled by Johnson Bademosi.","(0:47) Darren McFadden rush to the left for 18 yards to the Det45. Tackled by Glover Quin.","(0:52) 47 yard field goal attempt by Matt Prater is NO GOOD. Holder: Sam Martin.","(0:58) Matthew Stafford incomplete pass to the left intended for TJ Jones.","(1:39) Matthew Stafford pass to the middle to Anquan Boldin for 5 yards to the Dal29. Tackled by Anthony Hitchens.","(1:43) Matthew Stafford incomplete pass to the left intended for TJ Jones.","(2:20) Matthew Stafford pass to the left to Andre Roberts for 14 yards to the Dal34. Tackled by Brandon Carr.","(2:57) Matthew Stafford pass to the left to Golden Tate for 16 yards to the Dal48. Tackled by Brandon Carr and Sean Lee.","(3:03) Matthew Stafford incomplete pass to the right intended for Zach Zenner defensed by David Irving.","(3:34) Matthew Stafford pass to the middle to Anquan Boldin for 8 yards to the Det36. Tackled by Damien Wilson.","(4:03) Zach Zenner rush to the right for 3 yards to the Det28. Tackled by Orlando Scandrick and Jack Crawford.","(4:03) Dan Bailey kicks off to the endzone. Touchback.","(4:03) Dan Bailey extra point is good.","(4:11) Dez Bryant pass to the left to Jason Witten for 10 yards for a TOUCHDOWN.","(4:53) Dak Prescott rush to the left for 15 yards to the Det10. Tackled by Johnson Bademosi.","(4:57) Dak Prescott incomplete pass to the middle intended for Jason Witten.","(5:21) Penalty: Unnecessary Roughness on Detroit (A'Shawn Robinson) 15 yards.","(6:04) Dak Prescott pass to the left to Terrance Williams for 30 yards to the Det40. Tackled by Johnson Bademosi.","(6:41) Dak Prescott pass to the left to Terrance Williams for 14 yards to the Dal30. Tackled by Tahir Whitehead.","(7:27) Ezekiel Elliott rush to the right for no gain to the Dal16. Tackled by Tavon Wilson and Ezekiel Ansah.","(8:08) Dak Prescott pass to the right to Terrance Williams for 11 yards to the Dal16. Tackled by Nevin Lawson.","(8:22) Sam Martin punts for 54 yards to Dal10. Lucky Whitehead - no return. Tackled by Miles Killebrew. Penalty: Holding on Dallas (Byron Jones) -5 yards.","(8:30) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by J.J. Wilcox.","(8:33) Matthew Stafford incomplete pass to the middle intended for Eric Ebron defensed by Jeff Heath.","(8:39) Matthew Stafford incomplete pass to the middle intended for Eric Ebron.","(9:13) Dwayne Washington rush to the right for 2 yards to the Det36. Tackled by Barry Church.","(9:39) Dwayne Washington rush to the right for 1 yard to the Det34. Tackled by Sean Lee.","(10:19) Matthew Stafford pass to the right to Matthew Mulligan for 8 yards to the Det33. Tackled by Barry Church.","(10:19) Dan Bailey kicks off to the endzone. Touchback.","(10:19) Dan Bailey extra point is good.","(10:24) Ezekiel Elliott rush to the right for 1 yard for a TOUCHDOWN.","(10:39) Penalty: Holding on Detroit (Johnson Bademosi) 1 yards.","(11:17) Ezekiel Elliott rush to the right for 3 yards to the Det2. Tackled by Tavon Wilson.","(11:24) Penalty: Pass Interference on Detroit (Nevin Lawson) 31 yards.","(12:05) Ezekiel Elliott rush to the right for 2 yards to the Det36. Tackled by Tavon Wilson and A'Shawn Robinson.","(12:16) Matthew Stafford pass intended for TJ Jones INTERCEPTED by J.J. Wilcox and returned for 8 yards. Tackled by Eric Ebron.","(13:02) Matthew Stafford sacked at Det18 for a loss of 11 yards by Maliek Collins.","(13:09) Penalty: Holding on Detroit (Zach Zenner) -10 yards.","(13:48) Matthew Stafford pass to the left to Anquan Boldin for 6 yards to the Det39. Tackled by Byron Jones.","(14:30) Matthew Stafford pass to the middle to Eric Ebron for 8 yards to the Det33. Tackled by Sean Lee and Anthony Hitchens.","(15:00) Zach Zenner rush to the left for no gain to the Det25. Tackled by Anthony Hitchens and J.J. Wilcox.","(15:00) Dan Bailey kicks off to the endzone. Touchback.","(0:15) Ezekiel Elliott rush up the middle for 1 yard to the Dal30. Tackled by Ezekiel Ansah.","(0:26) Sam Martin punts for 37 yards to Dal29. No return.","(0:33) Matthew Stafford incomplete pass to the right intended for TJ Jones defensed by Orlando Scandrick.","(0:40) Matthew Stafford incomplete pass to the left.","(1:04) Matthew Stafford pass to the left to TJ Jones for 9 yards to the Det34. Tackled by Jeff Heath.","(1:04) Dan Bailey kicks off to the endzone. Touchback.","(1:04) Dan Bailey extra point is good.","(1:10) Dak Prescott pass to the left to Dez Bryant for 25 yards for a TOUCHDOWN.","(1:24) Dak Prescott incomplete pass to the right intended for Jason Witten.","(2:00) Ezekiel Elliott rush to the left for 3 yards to the Det25. Tackled by A'Shawn Robinson.","(2:00) Two Minute Warning.","(2:16) Dak Prescott pass to the right to Ezekiel Elliott for 12 yards to the Det28. Tackled by Tahir Whitehead.","(2:40) Dak Prescott pass to the left to Dez Bryant for 8 yards to the Det40. Tackled by Johnson Bademosi.","(3:14) Ezekiel Elliott rush up the middle for 3 yards to the Det48. Tackled by Kerry Hyder and Nevin Lawson.","(3:30) Sam Martin punts for 54 yards to Dal44. Lucky Whitehead return for 5 yards to Dal49. Tackled by Antwione Williams and Brandon Copeland.","(4:10) Matthew Stafford sacked at Det2 for a loss of 10 yards by Benson Mayowa and David Irving.","(4:15) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(4:46) Zach Zenner rush up the middle for 2 yards to the Det12. Tackled by Jack Crawford and Barry Church.","(4:56) Chris Jones punts for 57 yards to Det10. No return.","(5:52) Dak Prescott rush up the middle for 5 yards to the Dal33. Tackled by Tahir Whitehead and Haloti Ngata.","(6:56) Penalty: False Start on Dallas (Doug Free) -5 yards.","(6:56) Darren McFadden rush to the right for 2 yards to the Dal33. Tackled by Stefan Charles.","(7:35) Darren McFadden rush to the left for 7 yards to the Dal31. Tackled by Josh Bynes.","(7:40) Sam Martin kicks off to the Dal2. Lucky Whitehead return for 22 yards to Dal24. Tackled by Clay Harbor.","(7:40) Matt Prater extra point is good.","(7:45) Zach Zenner rush to the right for 5 yards for a TOUCHDOWN.","(8:29) Matthew Stafford pass to the right to Eric Ebron for 12 yards to the Dal5. Tackled by Jack Crawford and Anthony Hitchens.","(9:11) Zach Zenner rush to the right for a loss of 1 yard to the Dal17. Tackled by Byron Jones and Damien Wilson.","(9:51) Matthew Stafford pass to the right to Golden Tate for 14 yards to the Dal16. Tackled by Barry Church and David Irving.","(10:32) Zach Zenner rush to the right for 7 yards to the Dal30. Tackled by Anthony Hitchens.","(11:04) Matthew Stafford pass to the right to Eric Ebron for 12 yards to the Dal37. Tackled by Jeff Heath.","(11:12) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by Orlando Scandrick.","(11:41) Zach Zenner rush to the left for 4 yards to the Dal49. Tackled by Anthony Hitchens and Barry Church.","(11:48) Chris Jones punts for 37 yards to Det47. No return.","(11:54) Dak Prescott incomplete pass to the left intended for Darren McFadden.","(12:47) Penalty: Too Many Men on Field on Dallas -5 yards.","(12:47) Dak Prescott sacked at Dal21 for a loss of 11 yards by Ezekiel Ansah.","(13:23) Dak Prescott rush up the middle for 3 yards to the Dal32. Tackled by Tahir Whitehead.","(13:32) Sam Martin kicks off to the Dal7. Lucky Whitehead return for 22 yards to Dal29. Tackled by Don Carey.","(13:32) Matt Prater extra point is good.","(13:40) Matthew Stafford rush up the middle for 1 yard for a TOUCHDOWN.","(14:20) Dwayne Washington rush to the right for no gain to the Dal1. Tackled by Jack Crawford.","(14:28) Matthew Stafford incomplete pass to the right intended for Anquan Boldin.","(14:30) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(14:54) Matthew Stafford pass to the right to Marvin Jones Jr. for 16 yards to the Dal1.","(15:00) Matthew Stafford incomplete pass to the left intended for Anquan Boldin.","(0:24) Zach Zenner rush to the right for 3 yards to the Dal17. Tackled by Byron Jones and Anthony Hitchens.","(1:01) Zach Zenner rush up the middle for 6 yards to the Dal20. Tackled by Sean Lee.","(1:45) Matthew Stafford pass to the right to Anquan Boldin for 5 yards to the Dal26. Tackled by J.J. Wilcox.","(2:16) Matthew Stafford pass to the left to Eric Ebron for 21 yards to the Dal31. Tackled by Brandon Carr.","(2:40) Matthew Stafford pass to the left to Eric Ebron for 6 yards to the Det48. Tackled by Brandon Carr.","(2:49) Dan Bailey kicks off to the Det0. Andre Roberts return for 42 yards to Det42. Tackled by Dan Bailey and Lance Dunbar.","(2:49) Dan Bailey extra point is good.","(3:00) Ezekiel Elliott rush to the right for 55 yards for a TOUCHDOWN.","(3:46) Dak Prescott rush to the left for 12 yards to the Dal45. Tackled by Tahir Whitehead.","(4:06) Penalty: False Start on Dallas (Brice Butler) -5 yards.","(4:45) Ezekiel Elliott rush to the right for 7 yards to the Dal38. Tackled by DeAndre Levy.","(5:23) Dak Prescott pass to the right to Terrance Williams for 6 yards to the Dal31. Tackled by DeAndre Levy.","(5:23) Matt Prater kicks off to the endzone. Touchback.","(5:23) Matt Prater extra point is good. Penalty: Running into Kicker on Dallas (Anthony Brown) 15 yards.","(5:28) Zach Zenner rush up the middle for 7 yards for a TOUCHDOWN.","(6:03) Matthew Stafford pass to the middle to Golden Tate for 8 yards to the Dal7. Tackled by Orlando Scandrick.","(6:23) Penalty: False Start on Detroit (Anquan Boldin) -5 yards.","(7:08) Zach Zenner rush up the middle for 11 yards to the Dal10. Tackled by Randy Gregory.","(7:14) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by Anthony Brown.","(8:02) Matthew Stafford pass to the right to Zach Zenner for 13 yards to the Dal21. Tackled by Barry Church.","(8:47) Matthew Stafford pass to the right to Zach Zenner for 12 yards to the Dal34. Tackled by Barry Church.","(8:53) Matthew Stafford incomplete pass to the right intended for Eric Ebron.","(9:22) Zach Zenner rush up the middle for 20 yards to the Dal46. Tackled by Barry Church and Byron Jones.","(9:57) Matthew Stafford pass to the middle to Anquan Boldin for 9 yards to the Det34. Tackled by Anthony Hitchens.","(9:57) Dan Bailey kicks off to the endzone. Touchback.","(9:57) Dan Bailey extra point is good.","(10:02) Dak Prescott pass to the left to Brice Butler for 21 yards for a TOUCHDOWN.","(10:44) Ezekiel Elliott rush up the middle for 1 yard to the Det21. Tackled by Tavon Wilson and Kerry Hyder.","(10:48) Dak Prescott incomplete pass to the left intended for Cole Beasley.","(11:44) Penalty: False Start on Dallas (Jason Witten) -5 yards.","(11:44) Dak Prescott pass to the right to Jason Witten for 23 yards to the Det17. Tackled by Johnson Bademosi.","(12:17) Dak Prescott pass to the right to Cole Beasley for 5 yards to the Det40.","(12:52) Ezekiel Elliott rush to the left for 4 yards to the Det45. Tackled by Glover Quin.","(13:29) Dak Prescott pass to the left to Cole Beasley for 4 yards to the Det49. Tackled by Johnson Bademosi and Rafael Bush.","(14:09) Dak Prescott pass to the right to Dez Bryant for 18 yards to the Dal47. Tackled by Nevin Lawson.","(14:47) Ezekiel Elliott rush to the right for no gain to the Dal29. Tackled by Tahir Whitehead and Tyrunn Walker.","(14:53) Penalty: Illegal Plyr Downfld on Dallas (Travis Frederick) -5 yards.","(15:00) Sam Martin kicks off to the Dal4. Darren McFadden return for 30 yards to Dal34. Tackled by Tavon Wilson."]