["(0:03) Matt Barkley pass to the middle to Jeremy Langford for 4 yards to the Chi50. Tackled by Terence Garvin.","(0:27) Matt Barkley pass to the right to Ben Braunecker for 12 yards to the Chi46. Tackled by Terence Garvin.","(0:53) Matt Barkley pass to the right to Cameron Meredith for 9 yards to the Chi34. Tackled by Terence Garvin.","(0:57) Matt Barkley incomplete pass to the left intended for Jeremy Langford defensed by Lynden Trail.","(0:57) Dustin Hopkins kicks off to the endzone. Touchback.","(0:57) Dustin Hopkins extra point is good.","(1:08) Mack Brown rush to the left for 61 yards for a TOUCHDOWN.","(1:08) Chicago Bears timeout.","(1:14) Mack Brown rush to the right for 3 yards to the Was39. Tackled by C.J. Wilson.","(1:14) Chicago Bears timeout.","(1:20) Mack Brown rush to the right for 3 yards to the Was36. Tackled by Mitch Unrein.","(1:21) Connor Barth onside kickoff to the Was33. Onside kick recovered by receiving team by Ryan Grant.","(1:21) Connor Barth extra point is good. Penalty: Leverage on Washington (Ty Nsekhe) 15 yards.","(1:26) Matt Barkley pass to the right to Deonte Thompson for 3 yards for a TOUCHDOWN.","(2:00) Matt Barkley pass to the right to Alshon Jeffery for 14 yards to the Was3. Tackled by Josh Norman.","(2:00) Two Minute Warning.","(2:31) Matt Barkley pass to the left to Cameron Meredith for 14 yards to the Was17. Tackled by Martrell Spaight.","(3:03) Jordan Howard rush to the right for 2 yards to the Was31. Tackled by Terence Garvin.","(3:25) Matt Barkley pass to the right to Jordan Howard for 9 yards to the Was33. Tackled by Dashaun Phillips.","(3:54) Matt Barkley pass to the middle to Cameron Meredith for 5 yards to the Was42. Tackled by Martrell Spaight.","(4:22) Matt Barkley pass to the right to Ben Braunecker for 7 yards to the Was47. Tackled by Kendall Fuller and Greg Toler.","(4:31) Jordan Howard rush to the left for 20 yards to the Chi46. Tackled by Deshazor Everett.","(5:02) Jordan Howard rush to the right for 2 yards to the Chi26. Tackled by Terence Garvin.","(5:49) Jordan Howard rush to the left for 8 yards to the Chi24. Tackled by Chris Baker.","(6:26) Jordan Howard rush to the right for 1 yard to the Chi16. Tackled by Cullen Jenkins.","(6:34) Tress Way punts for 34 yards to Chi15. No return.","(6:39) Kirk Cousins incomplete pass to the left intended for Maurice Harris defensed by Johnthan Banks.","(7:28) Mack Brown rush to the right for 4 yards to the Chi49. Tackled by Jerrell Freeman.","(8:20) Kirk Cousins pass to the right to Ryan Grant for 1 yard to the Was47. Tackled by Akiem Hicks.","(8:57) Kirk Cousins pass to the left to Ryan Grant for 16 yards to the Was46. Tackled by Harold Jones-Quartey.","(9:38) Mack Brown rush to the left for 5 yards to the Was30. Tackled by Nick Kwiatkoski.","(10:07) Penalty: Holding on Washington (Brandon Scherff) -10 yards.","(10:22) Matt Barkley pass intended for Alshon Jeffery INTERCEPTED by Josh Norman and returned for 35 yards. Tackled by Charles Leno Jr..","(10:54) Matt Barkley pass to the left to Cameron Meredith for 13 yards to the Was24. Tackled by Kendall Fuller.","(11:00) Matt Barkley incomplete pass to the left intended for Cameron Meredith.","(11:04) Matt Barkley incomplete pass to the middle intended for Daniel Brown defensed by Mason Foster.","(11:40) Matt Barkley pass to the right to Daniel Brown for 9 yards to the Was37. Tackled by Mason Foster.","(12:00) Jeremy Langford rush to the right for 5 yards to the Was46. Tackled by Mason Foster.","(12:22) Matt Barkley pass to the right to Joshua Bellamy for 11 yards to the Chi49. Tackled by Greg Toler.","(12:47) Jeremy Langford rush to the right for 5 yards to the Chi38. Tackled by Duke Ihenacho.","(12:53) Dustin Hopkins kicks off to the Chi0. Deonte Thompson return for 33 yards to Chi33. Tackled by Greg Toler.","(12:57) Dustin Hopkins 20 yard field goal attempt is GOOD. Holder: Tress Way.","(13:04) Kirk Cousins incomplete pass to the right.","(13:51) Mack Brown rush to the left for 4 yards to the Chi1. Tackled by Jerrell Freeman.","(14:36) Mack Brown rush to the right for 4 yards to the Chi5. Tackled by C.J. Wilson.","(14:53) Matt Barkley pass intended for Alshon Jeffery INTERCEPTED by Will Blackmon and returned for 79 yards. Tackled by Jordan Howard.","(15:00) Matt Barkley incomplete pass to the right intended for Deonte Thompson defensed by Greg Toler.","(0:04) Matt Barkley pass to the right to Deonte Thompson for 13 yards to the Was41. Tackled by Will Blackmon.","(0:08) Matt Barkley incomplete pass to the right intended for Jordan Howard.","(0:34) Jordan Howard rush to the left for 16 yards to the Chi46. Tackled by Donte Whitner.","(0:58) Jordan Howard rush to the right for 12 yards to the Chi30. Tackled by Donte Whitner.","(1:03) Kirk Cousins incomplete pass to the right intended for Vernon Davis.","(1:31) Kirk Cousins pass to the right to Jamison Crowder for 3 yards to the Chi19. Tackled by Tracy Porter.","(2:12) Kirk Cousins pass to the right to Ryan Grant for 8 yards to the Chi22. Tackled by Nick Kwiatkoski and Willie Young.","(2:52) Mack Brown rush to the right for a loss of 2 yards to the Chi30. Tackled by Jonathan Bullard.","(2:59) Matt Barkley pass intended for Cameron Meredith INTERCEPTED by Bashaud Breeland defensed by Josh Norman and returned for 6 yards. Tackled by Cameron Meredith.","(3:05) Dustin Hopkins kicks off to the Chi10. Bralon Addison return for 18 yards to Chi28. Tackled by Will Blackmon.","(3:05) Dustin Hopkins extra point is good.","(3:10) Kirk Cousins rush to the left for 1 yard for a TOUCHDOWN.","(3:57) Rob Kelley rush to the right for 2 yards to the Chi1. Tackled by Akiem Hicks.","(4:27) Penalty: Illegal Use of Hands on Chicago (Deiondre' Hall) 4 yards.","(5:04) Rob Kelley rush to the right for 6 yards to the Chi7. Tackled by Pernell McPhee.","(5:43) Rob Kelley rush to the right for 2 yards to the Chi13. Tackled by Sam Acho.","(6:00) Kirk Cousins pass to the left to Vernon Davis for 13 yards to the Chi15. Tackled by Nick Kwiatkoski.","(6:44) Kirk Cousins pass to the right to Mack Brown for a loss of 2 yards to the Chi28. Tackled by Jerrell Freeman.","(7:07) Kirk Cousins pass to the right to Pierre Garcon for 7 yards to the Chi26. Tackled by Deiondre' Hall.","(7:25) Rob Kelley rush to the right for 1 yard to the Chi33. Tackled by Nick Kwiatkoski.","(8:08) Chris Thompson rush to the left for 9 yards to the Chi34. Tackled by Nick Kwiatkoski.","(8:13) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(8:57) Kirk Cousins rush to the left for 8 yards to the Chi43. Tackled by Cornelius Washington.","(9:04) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(9:42) Rob Kelley rush to the left for 4 yards to the Was49. Tackled by Nick Kwiatkoski.","(9:50) Matt Barkley pass intended for Alshon Jeffery INTERCEPTED by Josh Norman and returned for 2 yards. Tackled by Alshon Jeffery.","(10:22) Penalty: Holding on Chicago (Josh Sitton) -10 yards.","(11:10) Jeremy Langford rush to the left for 4 yards to the Was46. Tackled by Trent Murphy.","(11:47) Chris Prosinski rush to the right for 2 yards to the Chi50. Tackled by Lynden Trail.","(12:19) Jeremy Langford rush to the left for no gain to the Chi48. Tackled by Chris Baker.","(13:00) Matt Barkley pass to the left to Alshon Jeffery for 14 yards to the Chi48. Tackled by Josh Norman.","(13:26) Matt Barkley sacked at Chi34 for a loss of 5 yards by Preston Smith.","(14:04) Matt Barkley pass to the left to Cameron Meredith for 11 yards to the Chi39. Tackled by Bashaud Breeland.","(14:43) Jeremy Langford rush to the right for 1 yard to the Chi28. Tackled by Will Compton.","(15:00) Jordan Howard rush to the right for 2 yards to the Chi27. Tackled by Ziggy Hood and Donte Whitner.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback.","(0:34) Kirk Cousins rush up the middle for a loss of 1 yard to the Was24.","(0:34) Connor Barth kicks off to the endzone. Touchback.","(0:34) Connor Barth extra point is good.","(0:41) Matt Barkley pass to the right to Cameron Meredith for 21 yards for a TOUCHDOWN.","(0:41) Chicago Bears timeout.","(0:53) Matt Barkley pass to the left to Alshon Jeffery for 37 yards to the Was21. Tackled by Josh Norman.","(1:00) Penalty: Illegal Use of Hands on Washington (Mason Foster) 5 yards.","(1:17) Jeremy Langford rush to the right for 3 yards to the Chi37. Tackled by Martrell Spaight.","(1:41) Matt Barkley pass to the middle to Cameron Meredith for 9 yards to the Chi34. Tackled by Mason Foster.","(1:41) Dustin Hopkins kicks off to the endzone. Touchback.","(1:41) Dustin Hopkins extra point is good.","(1:48) Kirk Cousins rush to the right for 9 yards for a TOUCHDOWN.","(1:48) Chicago Bears timeout.","(2:00) Rob Kelley rush to the right for 15 yards to the Chi9. Tackled by Jerrell Freeman.","(2:00) Two Minute Warning.","(2:30) Rob Kelley rush to the left for 5 yards to the Chi24. Tackled by Harold Jones-Quartey.","(3:08) Rob Kelley rush to the left for 6 yards to the Chi29. Tackled by Jerrell Freeman.","(3:15) Kirk Cousins pass to the middle to Rob Kelley for 1 yard to the Was37. Tackled by Jerrell Freeman. Penalty: Pass Interference on Chicago (Tracy Porter) 28 yards.","(4:44) Rob Kelley rush to the right for a loss of 2 yards to the Was36. Tackled by Akiem Hicks.","(5:28) Kirk Cousins pass to the middle to DeSean Jackson for 29 yards to the Was38. Tackled by Harold Jones-Quartey.","(6:07) Rob Kelley rush to the left for 4 yards to the Was9. Tackled by Jerrell Freeman and Johnthan Banks.","(6:14) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(6:20) Penalty: Illegal Substitution on Washington -4 yards.","(6:20) Connor Barth kicks off to the Was0. Bashaud Breeland return for 18 yards to Was18. Tackled by Chris Prosinski and Ben Braunecker. Penalty: Illegal Block on Washington (Terence Garvin) -9 yards.","(6:20) Connor Barth extra point is good.","(6:27) Jeremy Langford rush to the left for 1 yard for a TOUCHDOWN.","(7:11) Matt Barkley pass to the right to Cameron Meredith for 32 yards to the Was1. Tackled by Greg Toler.","(7:50) Jordan Howard rush to the left for a loss of 1 yard to the Was33. Tackled by Mason Foster.","(8:24) Jordan Howard rush to the right for 3 yards to the Was32. Tackled by Donte Whitner and Mason Foster.","(8:52) Jordan Howard rush to the right for 13 yards to the Chi50. Tackled by Duke Ihenacho. Penalty: Horse Collar Tackle on Washington (Duke Ihenacho) 15 yards.","(9:31) Matt Barkley pass to the middle to Alshon Jeffery for 9 yards to the Chi37. Tackled by Josh Norman.","(9:35) Matt Barkley incomplete pass to the right intended for Alshon Jeffery defensed by Josh Norman.","(10:07) Jordan Howard rush to the right for 3 yards to the Chi28. Tackled by Mason Foster.","(10:07) Dustin Hopkins kicks off to the endzone. Touchback.","(10:12) Dustin Hopkins 29 yard field goal attempt is GOOD. Holder: Tress Way.","(10:59) Kirk Cousins pass to the right to DeSean Jackson for 2 yards to the Chi11. Tackled by Jerrell Freeman.","(11:07) Kirk Cousins incomplete pass to the right.","(11:43) Rob Kelley rush to the right for 3 yards to the Chi13. Tackled by Jonathan Bullard.","(12:17) Kirk Cousins pass to the right to Pierre Garcon for 46 yards to the Chi16. Tackled by Harold Jones-Quartey.","(12:59) Chris Thompson rush to the right for 4 yards to the Was38. Tackled by Akiem Hicks.","(13:39) Rob Kelley rush to the right for 5 yards to the Was34. Tackled by Jerrell Freeman.","(14:16) Kirk Cousins pass to the middle to Pierre Garcon for 25 yards to the Was29. Tackled by Tracy Porter.","(14:47) Rob Kelley rush to the left for 3 yards to the Was4. Tackled by Willie Young and Mitch Unrein.","(15:00) Matt Barkley pass intended for Joshua Bellamy INTERCEPTED by Bashaud Breeland. No return. Tackled by Joshua Bellamy.","(0:23) Matt Barkley pass to the left to Cameron Meredith for 21 yards to the Was49. Tackled by Bashaud Breeland.","(0:57) Jordan Howard rush to the left for 15 yards to the Chi40. Tackled by Donte Whitner. Penalty: Holding on Chicago (Deonte Thompson) -10 yards.","(0:57) Dustin Hopkins kicks off to the endzone. Touchback.","(0:57) Dustin Hopkins extra point is good.","(1:05) Kirk Cousins pass to the right to Chris Thompson for 17 yards for a TOUCHDOWN.","(1:11) Kirk Cousins incomplete pass to the right intended for Ryan Grant.","(1:52) Rob Kelley rush to the right for 1 yard to the Chi17. Tackled by Pernell McPhee.","(2:39) Kirk Cousins pass to the right to DeSean Jackson for 57 yards to the Chi18. Tackled by Deon Bush.","(3:22) Kirk Cousins pass to the right to Rob Kelley for 5 yards to the Was25. Tackled by Nick Kwiatkoski.","(3:26) Connor Barth 22 yard field goal attempt is BLOCKED by Preston Smith.","(3:32) Matt Barkley incomplete pass to the left intended for Alshon Jeffery.","(3:36) Matt Barkley incomplete pass to the right intended for Daniel Brown.","(4:12) Jordan Howard rush to the right for 5 yards to the Was4. Tackled by Donte Whitner.","(4:50) Jordan Howard rush to the left for 23 yards to the Was9. Tackled by Greg Toler.","(5:10) Matt Barkley pass to the middle to Daniel Brown for 10 yards to the Was32. Tackled by Mason Foster.","(5:54) Matt Barkley pass to the left to Alshon Jeffery for 18 yards to the Was42. Tackled by Josh Norman and Donte Whitner.","(6:35) Matt Barkley pass to the middle to Deonte Thompson for 18 yards to the Chi40. Tackled by Deshazor Everett.","(6:43) Matt Barkley incomplete pass to the left intended for Jordan Howard defensed by Chris Baker.","(7:26) Jordan Howard rush to the right for a loss of 8 yards to the Chi22. Tackled by Duke Ihenacho.","(7:35) Penalty: Pass Interference on Washington (Bashaud Breeland) 15 yards.","(7:38) Matt Barkley incomplete pass to the right intended for Ben Braunecker.","(7:43) Dustin Hopkins kicks off to the Chi1. Deonte Thompson return for 14 yards to Chi15. Tackled by Duke Ihenacho and Mack Brown.","(7:43) Dustin Hopkins extra point is good.","(7:48) Chris Thompson rush to the right for 7 yards for a TOUCHDOWN.","(8:29) Kirk Cousins pass to the right to DeSean Jackson for 5 yards to the Chi7. Tackled by Harold Jones-Quartey.","(9:09) Rob Kelley rush to the left for 3 yards to the Chi12. Tackled by Leonard Floyd.","(9:48) Kirk Cousins pass to the right to DeSean Jackson for 21 yards to the Chi15. Tackled by Harold Jones-Quartey.","(9:52) Kirk Cousins incomplete pass to the left intended for Rob Kelley.","(10:07) Kirk Cousins pass to the left to Pierre Garcon for 16 yards to the Chi36.","(10:33) Rob Kelley rush to the right for 8 yards to the Was48. Tackled by Pernell McPhee.","(11:18) Rob Kelley rush to the right for 5 yards to the Was40. Tackled by Deon Bush and Akiem Hicks.","(11:26) Patrick O'Donnell punts for 51 yards to Was35. No return.","(11:31) Matt Barkley incomplete pass to the right intended for Cameron Meredith.","(12:05) Jordan Howard rush to the right for 1 yard to the Chi14. Tackled by Will Compton.","(12:37) Jordan Howard rush to the left for 2 yards to the Chi13. Tackled by Mason Foster.","(12:48) Tress Way punts for 49 yards to Chi8. Bralon Addison return for 3 yards to Chi11. Tackled by Martrell Spaight.","(12:54) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(13:02) Kirk Cousins incomplete pass to the right.","(13:39) Rob Kelley rush to the left for 4 yards to the Was43. Tackled by Adrian Amos.","(14:19) Kirk Cousins rush to the right for 13 yards to the Was39.","(15:00) Rob Kelley rush to the left for 1 yard to the Was26. Tackled by Akiem Hicks.","(15:00) Connor Barth kicks off to the endzone. Touchback."]