["(0:04) Joe Flacco pass intended for Mike Wallace INTERCEPTED by Ryan Shazier. No return. Tackled by Dennis Pitta.","(0:04) Baltimore Ravens timeout.","(0:09) Joe Flacco pass to the right to Dennis Pitta for 16 yards to the Bal41. Tackled by William Gay and Jordan Dangerfield.","(0:09) Chris Boswell kicks off to the endzone. Touchback.","(0:09) Chris Boswell extra point is good. Penalty: Offside on Baltimore (Tavon Young) 5 yards.","(0:09) Penalty: Offside on Baltimore (Tavon Young) 5 yards.","(0:13) Ben Roethlisberger pass to the left to Antonio Brown for 4 yards for a TOUCHDOWN.","(0:14) Ben Roethlisberger incomplete pass to the middle.","(0:32) Ben Roethlisberger pass to the right to Jesse James for 9 yards to the Bal4. Tackled by Zachary Orr.","(0:32) Pittsburgh Steelers timeout.","(0:41) Ben Roethlisberger pass to the right to Cobi Hamilton for 6 yards to the Bal13. Tackled by Zachary Orr.","(0:41) Ben Roethlisberger incomplete pass to the middle.","(0:57) Ben Roethlisberger pass to the right to Eli Rogers for 20 yards to the Bal19. Tackled by Tavon Young.","(1:02) Ben Roethlisberger pass to the right to Demarcus Ayers for 9 yards to the Bal39. Tackled by Tavon Young.","(1:02) Pittsburgh Steelers timeout.","(1:09) Ben Roethlisberger pass to the left to Jesse James for 16 yards to the Bal48. Tackled by C.J. Mosley.","(1:14) Ben Roethlisberger pass to the left to Antonio Brown for 8 yards to the Pit36.","(1:18) Ben Roethlisberger pass to the right to Jesse James for 3 yards to the Pit28. Tackled by Lardarius Webb.","(1:18) Justin Tucker kicks off to the endzone. Touchback.","(1:18) Justin Tucker extra point is good.","(1:25) Kyle Juszczyk rush up the middle for 10 yards for a TOUCHDOWN.","(2:00) Joe Flacco pass to the left to Dennis Pitta for 3 yards to the Pit10. Tackled by William Gay and Sean Davis.","(2:00) Two Minute Warning.","(2:05) Joe Flacco pass to the middle to Kyle Juszczyk for 6 yards to the Pit13. Tackled by Ryan Shazier.","(2:48) Kyle Juszczyk rush to the left for 5 yards to the Pit19. Tackled by Artie Burns and Ryan Shazier.","(3:30) Joe Flacco pass to the left to Dennis Pitta for 9 yards to the Pit24. Tackled by Lawrence Timmons and Sean Davis.","(4:02) Joe Flacco pass to the right to Breshad Perriman for 15 yards to the Pit33. Tackled by Mike Mitchell and Ross Cockrell.","(4:07) Joe Flacco incomplete pass to the left intended for Breshad Perriman.","(4:11) Joe Flacco incomplete pass to the left intended for Kamar Aiken.","(4:44) Kenneth Dixon rush to the right for 4 yards to the Pit48. Tackled by James Harrison.","(4:44) Baltimore Ravens timeout.","(5:25) Kenneth Dixon rush up the middle for 4 yards to the Bal48. Tackled by Ryan Shazier.","(5:57) Joe Flacco pass to the middle to Kyle Juszczyk for 4 yards to the Bal44. Tackled by James Harrison and Lawrence Timmons.","(6:30) Joe Flacco pass to the middle to Dennis Pitta for 11 yards to the Bal40. Tackled by Lawrence Timmons.","(7:10) Joe Flacco pass to the right to Steve Smith Sr. for 4 yards to the Bal29. Tackled by Ross Cockrell and William Gay.","(7:16) Joe Flacco incomplete pass to the left intended for Kenneth Dixon defensed by Sean Davis.","(7:16) Chris Boswell kicks off to the endzone. Touchback.","(7:16) Chris Boswell extra point is good. Penalty: Leverage on Baltimore (Lawrence Guy) 15 yards.","(7:27) Ben Roethlisberger pass to the right to Le'Veon Bell for 7 yards for a TOUCHDOWN.","(8:08) Ben Roethlisberger pass to the left to Antonio Brown for 26 yards to the Bal7. Tackled by Shareece Wright and Lardarius Webb.","(8:51) Ben Roethlisberger pass to the left to Antonio Brown for 21 yards to the Bal33. Tackled by C.J. Mosley and Eric Weddle.","(9:26) Le'Veon Bell rush to the right for 13 yards to the Pit46. Tackled by Lardarius Webb.","(9:29) Ben Roethlisberger incomplete pass to the left intended for Eli Rogers defensed by Eric Weddle.","(10:05) Le'Veon Bell rush to the right for 23 yards to the Pit33.","(10:12) Sam Koch punts for 43 yards to Pit10. No return.","(10:16) Joe Flacco incomplete pass to the left intended for Kamar Aiken defensed by Bud Dupree.","(11:00) Kenneth Dixon rush to the right for 4 yards to the Bal47. Tackled by James Harrison and William Gay.","(11:41) Kenneth Dixon rush to the right for 3 yards to the Bal43. Tackled by Ross Cockrell.","(11:41) Chris Boswell kicks off to the Bal10, out of bounds. No return.","(11:41) Chris Boswell extra point is good.","(11:48) Le'Veon Bell rush to the left for 7 yards for a TOUCHDOWN.","(12:21) Ben Roethlisberger pass to the right to Antonio Brown for 8 yards to the Bal7. Tackled by Lardarius Webb.","(12:28) Penalty: Pass Interference on Baltimore (Tavon Young) 35 yards.","(13:02) Ben Roethlisberger pass to the left to Antonio Brown for 6 yards to the Pit50. Tackled by Shareece Wright.","(13:41) Ben Roethlisberger pass to the right to Jesse James for 21 yards to the Pit44. Tackled by Tavon Young.","(14:18) Le'Veon Bell rush up the middle for a loss of 2 yards to the Pit23. Tackled by Brandon Williams.","(14:18) Justin Tucker kicks off to the endzone. Touchback.","(14:21) Justin Tucker 23 yard field goal attempt is GOOD. Holder: Sam Koch.","(14:27) Joe Flacco incomplete pass to the right intended for Darren Waller defensed by Sean Davis.","(15:00) Joe Flacco pass to the left to Nick Boyle for 5 yards to the Pit4. Tackled by James Harrison and Ryan Shazier.","(0:37) Terrance West rush to the left for 2 yards to the Pit9. Tackled by Ryan Shazier.","(0:49) Ben Roethlisberger pass intended for Jesse James INTERCEPTED by C.J. Mosley and returned for 28 yards. Tackled by David Johnson.","(1:28) Le'Veon Bell rush up the middle for 4 yards to the Pit29. Tackled by Brandon Williams.","(1:28) Justin Tucker kicks off to the endzone. Touchback.","(1:32) Justin Tucker 46 yard field goal attempt is GOOD. Holder: Sam Koch.","(2:11) Joe Flacco pass to the right to Dennis Pitta for 5 yards to the Pit28. Tackled by William Gay.","(2:51) Joe Flacco pass to the left to Mike Wallace for 1 yard to the Pit33. Tackled by James Harrison and Artie Burns.","(3:33) Joe Flacco pass to the right to Steve Smith Sr. for a loss of 2 yards to the Pit34. Tackled by William Gay.","(4:13) Penalty: Holding on Baltimore (Jeremy Zuttah) -10 yards.","(5:00) Kenneth Dixon rush to the right for 4 yards to the Pit22. Tackled by Ross Cockrell and Lawrence Timmons.","(5:41) Terrance West rush to the left for 6 yards to the Pit26. Tackled by Ross Cockrell and Mike Mitchell.","(6:14) Joe Flacco pass to the right to Terrance West for 16 yards to the Pit32. Tackled by Sean Davis.","(6:59) Kenneth Dixon rush up the middle for 8 yards to the Pit48. Tackled by Mike Mitchell and Artie Burns.","(7:41) Joe Flacco pass to the right to Dennis Pitta for 6 yards to the Bal44. Tackled by William Gay and Bud Dupree.","(8:20) Kenneth Dixon rush to the left for 3 yards to the Bal38. Tackled by James Harrison.","(9:01) Joe Flacco pass to the left to Dennis Pitta for 8 yards to the Bal35. Tackled by James Harrison.","(9:35) Kenneth Dixon rush to the right for 2 yards to the Bal27. Tackled by Sean Davis.","(9:35) Chris Boswell kicks off to the endzone. Touchback.","(9:37) Chris Boswell 36 yard field goal attempt is GOOD. Holder: Jordan Berry.","(9:43) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(10:09) Ben Roethlisberger pass to the left to Antonio Brown for 5 yards to the Bal18. Tackled by Zachary Orr.","(10:49) Ben Roethlisberger pass to the left to Antonio Brown for 3 yards to the Bal23. Tackled by Jerraud Powers.","(10:49) Pittsburgh Steelers timeout.","(11:32) Ben Roethlisberger pass to the left to Eli Rogers for 39 yards to the Bal26. Tackled by Lardarius Webb.","(12:16) Le'Veon Bell rush up the middle for 5 yards to the Pit35. Tackled by Eric Weddle.","(12:53) Le'Veon Bell rush to the right for 5 yards to the Pit30. Tackled by Zachary Orr.","(13:21) Ben Roethlisberger pass to the left to Antonio Brown for 8 yards to the Pit25. Tackled by Jerraud Powers.","(13:26) Justin Tucker kicks off to the Pit-3. Fitzgerald Toussaint return for 20 yards to Pit17. Tackled by Kamar Aiken and Chris Moore.","(13:26) Joe Flacco 2 pt conversion pass to Steve Smith Sr. is GOOD.","(13:32) Joe Flacco pass to the middle to Steve Smith Sr. for 18 yards for a TOUCHDOWN.","(14:14) Terrance West rush to the left for 1 yard to the Pit18. Tackled by Javon Hargrave and L.T. Walton.","(14:47) Terrance West rush up the middle for 1 yard to the Pit19. Tackled by Lawrence Timmons.","(14:56) Ben Roethlisberger pass intended for David Johnson INTERCEPTED by Zachary Orr and returned for 14 yards. Tackled by Le'Veon Bell.","(15:00) Justin Tucker kicks off to the Pit6. Cobi Hamilton return for 19 yards to Pit25. Tackled by Nick Boyle and Patrick Onwuasor.","(0:12) Ben Roethlisberger rush up the middle for a loss of 1 yard to the Pit23.","(0:18) Justin Tucker kicks off to the Pit4. Cobi Hamilton return for 20 yards to Pit24. Tackled by Kyle Juszczyk.","(0:22) Justin Tucker 38 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:29) Joe Flacco incomplete pass to the right intended for Dennis Pitta.","(0:33) Joe Flacco incomplete pass to the right intended for Dennis Pitta.","(0:33) Baltimore Ravens timeout.","(0:40) Joe Flacco pass to the middle to Steve Smith Sr. for 4 yards to the Pit19. Tackled by James Harrison and Ryan Shazier.","(0:48) Joe Flacco pass to the right to Breshad Perriman for 13 yards to the Pit23.","(0:48) Baltimore Ravens timeout.","(0:53) Joe Flacco pass to the middle to Breshad Perriman for 4 yards to the Pit36. Tackled by Lawrence Timmons.","(1:23) Kenneth Dixon rush to the right for 6 yards to the Pit40. Tackled by Lawrence Timmons. FUMBLE, recovered by Bal (Kenneth Dixon).","(2:00) Joe Flacco pass to the right to Mike Wallace for 3 yards to the Pit46. Tackled by Bud Dupree.","(2:00) Two Minute Warning.","(2:16) Terrance West rush to the left for 3 yards to the Pit49. Tackled by James Harrison.","(3:00) Joe Flacco pass to the left to Dennis Pitta for 17 yards to the Bal48. Tackled by Ryan Shazier.","(3:04) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(3:41) Joe Flacco pass to the left to Terrance West for 3 yards to the Bal31. Tackled by Artie Burns.","(3:52) Jordan Berry punts for 43 yards to Bal17. Michael Campanaro return for 11 yards to Bal28. Tackled by Tyler Matakevich and Arthur Moats.","(4:27) Le'Veon Bell rush to the right for a loss of 1 yard to the Pit40. Tackled by C.J. Mosley.","(5:10) Ben Roethlisberger pass to the right to Le'Veon Bell for 3 yards to the Pit41. Tackled by C.J. Mosley and Lardarius Webb.","(5:47) Le'Veon Bell rush to the right for 4 yards to the Pit38. Tackled by Zachary Orr.","(6:23) Ben Roethlisberger pass to the middle to Eli Rogers for 9 yards to the Pit34. Tackled by Jerraud Powers.","(7:04) Le'Veon Bell rush to the right for 3 yards to the Pit25. Tackled by Matt Judon and Zachary Orr.","(7:36) Ben Roethlisberger pass to the right to Le'Veon Bell for 5 yards to the Pit22. Tackled by Lardarius Webb.","(7:45) Sam Koch punts for 39 yards to Pit17. No return.","(7:49) Joe Flacco incomplete pass to the left intended for Kyle Juszczyk.","(8:36) Joe Flacco sacked at Bal44 for a loss of 6 yards by Bud Dupree.","(8:41) Penalty: Holding on Baltimore (Nick Boyle) -10 yards.","(9:16) Kenneth Dixon rush to the left for 3 yards to the Pit40. Tackled by Daniel McCullers and James Harrison.","(9:42) Kenneth Dixon rush to the right for 17 yards to the Pit43. Tackled by Ross Cockrell and Mike Mitchell.","(10:24) Joe Flacco pass to the right to Steve Smith Sr. for 9 yards to the Bal40. Tackled by Bud Dupree.","(11:02) Terrance West rush up the middle for 7 yards to the Bal31. Tackled by Artie Burns and Javon Hargrave.","(11:07) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(11:41) Joe Flacco pass to the left to Terrance West for 9 yards to the Bal24. Tackled by Sean Davis.","(11:49) Jordan Berry punts for 39 yards to Bal15. No return.","(11:54) Ben Roethlisberger incomplete pass to the right intended for Xavier Grimble defensed by Zachary Orr.","(12:02) Ben Roethlisberger incomplete pass to the right intended for Le'Veon Bell.","(12:47) Le'Veon Bell rush up the middle for 1 yard to the Pit46. Tackled by Zachary Orr and Lawrence Guy.","(13:30) Le'Veon Bell rush up the middle for 6 yards to the Pit45. Tackled by Zachary Orr.","(14:05) Le'Veon Bell rush to the right for 9 yards to the Pit39. Tackled by Brent Urban.","(14:12) Sam Koch rush up the middle for no gain to the Pit27. FUMBLE, recovered by Bal (Rick Wagner).","(14:16) Joe Flacco incomplete pass to the middle intended for Dennis Pitta.","(15:00) Joe Flacco sacked at Pit27 for a loss of 10 yards by Lawrence Timmons.","(0:29) Terrance West rush to the right for a loss of 1 yard to the Pit17. Tackled by James Harrison.","(0:51) Penalty: Unnecessary Roughness on Pittsburgh (Ryan Shazier) 15 yards.","(1:33) Joe Flacco pass to the right to Kenneth Dixon for 1 yard to the Pit31. Tackled by L.T. Walton.","(2:11) Terrance West rush up the middle for 4 yards to the Pit32. Tackled by L.T. Walton and Javon Hargrave.","(2:56) Michael Campanaro rush to the left for 23 yards to the Pit36. Tackled by Sean Davis.","(3:25) Terrance West rush to the left for 3 yards to the Bal41. Tackled by Lawrence Timmons.","(3:51) Joe Flacco pass to the right to Darren Waller for 11 yards to the Bal38. Tackled by Ross Cockrell.","(4:01) Jordan Berry punts for 55 yards to Bal13. Michael Campanaro return for 14 yards to Bal27. Tackled by Tyler Matakevich.","(4:36) Ben Roethlisberger pass to the right to Eli Rogers for 16 yards to the Pit32. Tackled by Lardarius Webb.","(5:04) Penalty: Pass Interference on Pittsburgh (Antonio Brown) -10 yards.","(5:04) Penalty: False Start on Pittsburgh (Le'Veon Bell) -5 yards.","(5:11) Ben Roethlisberger incomplete pass to the left.","(5:50) Le'Veon Bell rush to the left for 6 yards to the Pit31. Tackled by C.J. Mosley and Eric Weddle.","(5:50) Justin Tucker kicks off to the endzone. Touchback.","(5:54) Justin Tucker 41 yard field goal attempt is GOOD. Holder: Sam Koch.","(5:59) Joe Flacco incomplete pass to the right intended for Kenneth Dixon.","(6:05) Joe Flacco incomplete pass to the left intended for Breshad Perriman defensed by Mike Mitchell.","(6:43) Kenneth Dixon rush to the right for a loss of 1 yard to the Pit23. Tackled by Javon Hargrave and Ryan Shazier.","(7:08) Joe Flacco pass to the middle to Steve Smith Sr. for 44 yards to the Pit37. Tackled by Artie Burns. Penalty: Unnecessary Roughness on Pittsburgh (Artie Burns) 15 yards.","(7:12) Chris Boswell kicks off to the Bal0. Chris Moore return for 19 yards to Bal19. Tackled by Vince Williams.","(7:12) Chris Boswell extra point is good.","(7:18) Ben Roethlisberger pass to the middle to Xavier Grimble for 20 yards for a TOUCHDOWN.","(8:03) Le'Veon Bell rush to the right for 10 yards to the Bal20. Tackled by C.J. Mosley.","(8:43) Le'Veon Bell rush up the middle for 7 yards to the Bal30. Tackled by Lawrence Guy.","(9:17) Eli Rogers rush to the left for 6 yards to the Bal37. Tackled by Shareece Wright.","(9:24) Penalty: Unnecessary Roughness on Baltimore (C.J. Mosley) 15 yards.","(9:56) Le'Veon Bell rush to the right for 7 yards to the Pit42. Tackled by Elvis Dumervil.","(10:38) Le'Veon Bell rush up the middle for 3 yards to the Pit35. Tackled by C.J. Mosley and Patrick Onwuasor.","(11:12) Le'Veon Bell rush to the left for 2 yards to the Pit32. Tackled by Patrick Onwuasor.","(11:51) Ben Roethlisberger pass to the left to Antonio Brown for 7 yards to the Pit30. Tackled by Eric Weddle.","(12:29) Le'Veon Bell rush to the right for 10 yards to the Pit23. Tackled by C.J. Mosley and Lardarius Webb.","(12:37) Sam Koch punts for 27 yards to Pit13. No return.","(13:19) Joe Flacco pass to the left to Steve Smith Sr. for 2 yards to the Pit40. Tackled by Lawrence Timmons.","(13:58) Terrance West rush to the left for 1 yard to the Pit42. Tackled by Ricardo Mathews and Ryan Shazier.","(14:31) Joe Flacco pass to the left to Mike Wallace for 3 yards to the Pit43. Tackled by Artie Burns.","(15:00) Joe Flacco pass to the left to Mike Wallace for 14 yards to the Pit46. Tackled by Mike Mitchell.","(15:00) Chris Boswell kicks off to the Bal8, out of bounds. No return."]