["(0:14) Kenneth Farrow rush up the middle for 11 yards to the SD43. Tackled by Shaq Thompson and Thomas Davis.","(0:26) Michael Palardy punts for 46 yards to SD18. Isaiah Burse return for 9 yards to SD27. Tackled by Jeremy Cash. Penalty: Illegal Formation on Carolina 5 yards.","(0:26) Carolina Panthers timeout.","(1:11) Jonathan Stewart rush to the right for a loss of 5 yards to the Car36. Tackled by Damion Square.","(1:11) Carolina Panthers timeout.","(2:00) Jonathan Stewart rush to the right for 5 yards to the Car41. Tackled by Jahleel Addae.","(2:00) Two Minute Warning.","(2:20) Jonathan Stewart rush to the right for a loss of 2 yards to the Car36. Tackled by Denzel Perryman.","(3:04) Jonathan Stewart rush to the right for 2 yards to the Car38. Tackled by Denzel Perryman.","(3:47) Cam Newton rush to the left for no gain to the Car36. Tackled by Dwight Lowery.","(3:47) San Diego Chargers timeout.","(3:53) Jonathan Stewart rush to the right for 9 yards to the Car36. Tackled by Jahleel Addae.","(4:03) Philip Rivers pass intended for Tyrell Williams INTERCEPTED by Kurt Coleman. No return. Tackled by Tyrell Williams.","(4:10) Philip Rivers incomplete pass to the left intended for Antonio Gates defensed by Kurt Coleman.","(4:17) Philip Rivers incomplete pass to the left intended for Travis Benjamin.","(4:26) Philip Rivers incomplete pass to the right.","(4:55) Philip Rivers pass to the left to Dontrelle Inman for 11 yards to the SD21. Tackled by Daryl Worley.","(5:36) Philip Rivers pass to the middle to Antonio Gates for 7 yards to the SD10. Tackled by Leonard Johnson and A.J. Klein.","(5:40) Philip Rivers incomplete pass to the middle intended for Antonio Gates.","(5:51) Michael Palardy punts for 40 yards to SD3. No return.","(5:57) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(6:42) Fozzy Whittaker rush to the left for a loss of 3 yards to the SD43. Tackled by Denzel Perryman.","(7:25) Jonathan Stewart rush to the right for a loss of 2 yards to the SD40. Tackled by Tenny Palepoi.","(8:04) Jonathan Stewart rush to the right for 12 yards to the SD38. Tackled by Korey Toomer.","(8:49) Jonathan Stewart rush to the left for 1 yard to the Car50. Tackled by Korey Toomer and Kyle Emanuel.","(9:20) Fozzy Whittaker rush to the left for 8 yards to the Car49. Tackled by Jahleel Addae.","(9:59) Jonathan Stewart rush to the right for no gain to the Car41. Tackled by Melvin Ingram and Korey Toomer.","(10:09) Drew Kaser kicks off to the Car20. Ted Ginn Jr. return for 31 yards to SD49. Tackled by Drew Kaser. Penalty: Holding on Carolina (Lou Young) -10 yards.","(10:16) Philip Rivers sacked at SD0 for a loss of 4 yards by Mario Addison. Safety.","(10:21) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(10:58) Philip Rivers pass to the right to Kenneth Farrow for 1 yard to the SD4. Tackled by Shaq Thompson.","(11:00) Cam Newton pass intended for Kelvin Benjamin INTERCEPTED by Trovon Reed and returned for 3 yards. Tackled by Kelvin Benjamin.","(11:00) San Diego Chargers timeout.","(11:04) Penalty: Pass Interference on San Diego (Casey Hayward) 6 yards.","(11:09) Cam Newton incomplete pass to the right intended for Corey Brown.","(11:09) Carolina Panthers timeout.","(11:53) Jonathan Stewart rush to the right for 4 yards to the SD10. Tackled by Casey Hayward.","(12:32) Cam Newton pass to the left to Ted Ginn Jr. for 10 yards to the SD14. Tackled by Trovon Reed.","(12:41) Philip Rivers pass intended for Antonio Gates INTERCEPTED by Shaq Thompson and returned for 12 yards. Tackled by Dontrelle Inman.","(13:28) Philip Rivers pass to the right to Hunter Henry for 4 yards to the SD29. Tackled by Thomas Davis.","(14:03) Kenneth Farrow rush up the middle for a loss of 1 yard to the SD25. Tackled by Kawann Short.","(14:17) Michael Palardy punts for 49 yards to SD32. Isaiah Burse return for a loss of 6 yards to SD26. Tackled by Colin Jones.","(14:57) Cam Newton sacked at Car19 for a loss of 7 yards by Chris Landrum.","(15:00) Cam Newton incomplete pass to the right intended for Greg Olsen.","(0:30) Jonathan Stewart rush to the right for 1 yard to the Car26. Tackled by Adrian Phillips and Korey Toomer.","(0:30) Josh Lambo kicks off to the endzone. Touchback.","(0:30) Philip Rivers 2 pt conversion pass is NO GOOD - intended for Antonio Gates.","(0:38) Philip Rivers pass to the right to Dontrelle Inman for 19 yards for a TOUCHDOWN.","(1:18) Kenneth Farrow rush to the right for 3 yards to the Car19. Tackled by Thomas Davis.","(1:43) Philip Rivers pass to the left to Tyrell Williams for 22 yards to the Car22. Tackled by Leonard Johnson.","(2:09) Kenneth Farrow rush up the middle for 2 yards to the Car44. Tackled by Vernon Butler and Daryl Worley.","(2:38) Philip Rivers pass to the left to Dontrelle Inman for 20 yards to the Car46. Tackled by Daryl Worley.","(2:48) Michael Palardy punts for 48 yards to SD35. Isaiah Burse return for a loss of 1 yard to SD34. Tackled by Fozzy Whittaker.","(2:58) Cam Newton incomplete pass to the right intended for Corey Brown.","(3:41) Jonathan Stewart rush to the left for a loss of 3 yards to the Car17. Tackled by Kyle Emanuel and Jahleel Addae.","(4:20) Cam Newton rush up the middle for 5 yards to the Car20. Tackled by Corey Liuget.","(4:26) Penalty: Pass Interference on Carolina (Ed Dickson) -10 yards.","(4:26) Josh Lambo kicks off to the endzone. Touchback.","(4:30) Josh Lambo 32 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(4:39) Philip Rivers incomplete pass to the left intended for Tyrell Williams defensed by Kurt Coleman.","(4:46) Philip Rivers incomplete pass to the left.","(4:46) Penalty: False Start on San Diego (Antonio Gates) -5 yards.","(4:46) San Diego Chargers timeout.","(5:34) Kenneth Farrow rush to the right for 2 yards to the Car9. Tackled by A.J. Klein.","(6:16) Philip Rivers pass to the left to Antonio Gates for 13 yards to the Car11. Tackled by Daryl Worley.","(6:55) Travis Benjamin rush to the left for a loss of 2 yards to the Car24. Tackled by Tre Boston.","(7:01) Philip Rivers incomplete pass to the right intended for Hunter Henry.","(7:52) Philip Rivers pass to the left to Antonio Gates for 27 yards to the Car22. Tackled by Kurt Coleman and Daryl Worley.","(8:35) Kenneth Farrow rush to the right for 3 yards to the Car49. Tackled by Kony Ealy and Kurt Coleman.","(9:01) Kenneth Farrow rush to the left for 2 yards to the SD48. Tackled by Tre Boston.","(9:36) Philip Rivers pass to the left to Kenneth Farrow for 9 yards to the SD46. Tackled by Shaq Thompson.","(10:14) Kenneth Farrow rush up the middle for 3 yards to the SD37. Tackled by Shaq Thompson.","(10:55) Kenneth Farrow rush to the left for 4 yards to the SD34. Tackled by Kurt Coleman.","(11:29) Philip Rivers pass to the left to Kenneth Farrow for 5 yards to the SD30. Tackled by Kurt Coleman and Thomas Davis.","(11:29) Graham Gano kicks off to the endzone. Touchback.","(11:33) Graham Gano 23 yard field goal attempt is GOOD. Holder: Michael Palardy.","(11:37) Cam Newton incomplete pass to the middle intended for Greg Olsen defensed by Dwight Lowery.","(11:37) Penalty: Offside on San Diego (Corey Liuget) 5 yards.","(11:37) Penalty: False Start on Carolina (Trai Turner) -5 yards.","(11:43) Cam Newton incomplete pass to the right intended for Ed Dickson.","(12:21) Jonathan Stewart rush to the right for 4 yards to the SD5. Tackled by Denzel Perryman.","(13:09) Cam Newton pass to the left to Greg Olsen for 21 yards to the SD9. Tackled by Casey Hayward.","(13:50) Cam Newton pass to the right to Corey Brown for 8 yards to the SD30. Tackled by Denzel Perryman.","(14:20) Cam Newton rush to the right for 1 yard to the SD38. Tackled by Damion Square.","(14:56) Cam Newton pass to the right to Greg Olsen for 36 yards to the SD39. Tackled by Dwight Lowery.","(15:00) Cam Newton incomplete pass to the left intended for Greg Olsen.","(15:00) Josh Lambo kicks off to the endzone. Touchback.","(0:25) Jonathan Stewart rush up the middle for no gain to the Car25. Tackled by Tenny Palepoi.","(0:58) Jonathan Stewart rush to the left for 5 yards to the Car25. Tackled by Tenny Palepoi and Jatavis Brown.","(1:03) Josh Lambo kicks off to the Car-1. Joe Webb return for 21 yards to Car20. Tackled by Derek Watt.","(1:03) Josh Lambo extra point is good.","(1:08) Philip Rivers pass to the left to Hunter Henry for 9 yards for a TOUCHDOWN.","(1:17) Philip Rivers incomplete pass to the right.","(1:50) Kenneth Farrow rush to the left for a loss of 2 yards to the Car9. Tackled by Vernon Butler.","(2:00) Philip Rivers pass to the left to Tyrell Williams for 46 yards to the Car7. Tackled by Daryl Worley.","(2:00) Two Minute Warning.","(2:05) Philip Rivers pass to the left to Kenneth Farrow for 3 yards to the SD47. Tackled by Kurt Coleman.","(2:43) Philip Rivers pass to the middle to Antonio Gates for 5 yards to the SD44. Tackled by Shaq Thompson and Leonard Johnson.","(3:18) Kenneth Farrow rush to the right for 3 yards to the SD39. Tackled by Kurt Coleman and Shaq Thompson.","(3:44) Kenneth Farrow rush up the middle for 11 yards to the SD36. Tackled by Daryl Worley.","(3:49) Philip Rivers incomplete pass to the right intended for Travis Benjamin.","(3:49) Graham Gano kicks off to the endzone. Touchback.","(3:54) Graham Gano 45 yard field goal attempt is GOOD. Holder: Michael Palardy.","(3:59) Cam Newton incomplete pass to the left intended for Devin Funchess defensed by Trevor Williams.","(4:02) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(4:36) Jonathan Stewart rush to the left for 1 yard to the SD27. Tackled by Chris Landrum and Melvin Ingram.","(4:42) Philip Rivers sacked at SD27 for no gain by A.J. Klein. FUMBLE, recovered by Car (Wes Horton). Tackled by Matt Slauson.","(4:47) Philip Rivers incomplete pass to the right intended for Antonio Gates.","(5:23) Philip Rivers pass to the right to Kenneth Farrow for 2 yards to the SD27. Tackled by A.J. Klein.","(5:23) Graham Gano kicks off to the endzone. Touchback.","(5:28) Graham Gano 44 yard field goal attempt is GOOD. Holder: Michael Palardy.","(6:08) Fozzy Whittaker rush to the right for 10 yards to the SD26. Tackled by Kyle Emanuel and Corey Liuget.","(6:43) Cam Newton sacked at SD36 for a loss of 7 yards by Joey Bosa.","(7:13) Jonathan Stewart rush to the left for no gain to the SD29. Tackled by Trevor Williams.","(7:38) Cam Newton pass to the right to Ted Ginn Jr. for 11 yards to the SD29. Tackled by Trevor Williams.","(8:11) San Diego Chargers timeout.","(8:11) Jonathan Stewart rush to the left for 20 yards to the SD40. Tackled by Corey Liuget.","(8:27) Drew Kaser punts for 45 yards to Car36. Ted Ginn Jr. return for 4 yards to Car40. Tackled by Kyle Emanuel.","(8:38) Philip Rivers incomplete pass to the left intended for Hunter Henry. Penalty: Illegal Touch on San Diego (Hunter Henry) 0 yards.","(9:24) Philip Rivers pass to the right to Dontrelle Inman for 3 yards to the SD19. Tackled by James Bradberry.","(10:07) Philip Rivers sacked at SD16 for a loss of 5 yards by Ryan Delaire.","(10:35) Philip Rivers pass to the left to Dontrelle Inman for 9 yards to the SD21. Tackled by Daryl Worley.","(11:07) Kenneth Farrow rush to the right for 3 yards to the SD12. Tackled by Leonard Johnson and Ryan Delaire.","(11:12) Graham Gano kicks off to the SD1. Isaiah Burse return for 16 yards to SD17. Tackled by Mike Tolbert. Penalty: Holding on San Diego (Sean McGrath) -8 yards.","(11:12) Graham Gano extra point is good.","(11:17) Cam Newton pass to the right to Devin Funchess for 6 yards for a TOUCHDOWN.","(12:00) Cam Newton rush to the left for 4 yards to the SD6. Tackled by Trevor Williams.","(12:05) Cam Newton incomplete pass to the left intended for Jonathan Stewart.","(12:42) Cam Newton pass to the left to Kelvin Benjamin for 11 yards to the SD10. Tackled by Trevor Williams.","(13:27) Cam Newton rush to the left for 2 yards to the SD21. Tackled by Joey Bosa and Kyle Emanuel.","(13:59) Ted Ginn Jr. rush to the left for 8 yards to the SD23. Tackled by Dwight Lowery.","(14:38) Cam Newton pass to the right to Devin Funchess for 27 yards to the SD31. Tackled by Trovon Reed.","(14:45) Cam Newton incomplete pass to the right intended for Jonathan Stewart.","(15:00) Philip Rivers pass intended for Tyrell Williams INTERCEPTED by Daryl Worley and returned for 22 yards. Tackled by Orlando Franklin.","(0:36) Philip Rivers pass to the right to Kenneth Farrow for 3 yards to the SD41. Tackled by Kurt Coleman.","(1:21) Kenneth Farrow rush up the middle for 4 yards to the SD38. Tackled by Thomas Davis.","(1:48) Kenneth Farrow rush to the right for 9 yards to the SD34. Tackled by Kurt Coleman.","(1:48) Graham Gano kicks off to the endzone. Touchback.","(1:48) Graham Gano extra point is good.","(1:52) Jonathan Stewart rush to the right for 1 yard for a TOUCHDOWN.","(2:23) Carolina Panthers timeout.","(2:23) Cam Newton rush up the middle for 8 yards to the SD1. Tackled by Korey Toomer and Denzel Perryman.","(2:29) Cam Newton incomplete pass to the left intended for Devin Funchess defensed by Jahleel Addae.","(2:44) Penalty: False Start on Carolina (Mike Remmers) -5 yards.","(3:02) Penalty: Offside on San Diego (Joey Bosa) 4 yards.","(3:30) Jonathan Stewart rush to the left for 1 yard to the SD8. Tackled by Korey Toomer and Kyle Emanuel.","(4:04) Jonathan Stewart rush to the left for 6 yards to the SD9. Tackled by Jahleel Addae and Melvin Ingram.","(4:37) Cam Newton pass to the right to Greg Olsen for 17 yards to the SD15. Tackled by Jahleel Addae.","(5:11) Jonathan Stewart rush up the middle for 3 yards to the SD32. Tackled by Jatavis Brown.","(5:19) Drew Kaser punts for 30 yards to SD35. No return.","(5:25) Philip Rivers incomplete pass to the right intended for Travis Benjamin.","(5:25) Penalty: False Start on San Diego (Orlando Franklin) -4 yards.","(5:32) Philip Rivers incomplete pass to the right intended for Hunter Henry.","(6:13) Kenneth Farrow rush to the right for a loss of 2 yards to the SD9. Tackled by A.J. Klein.","(6:21) Michael Palardy punts for 32 yards to SD11. No return.","(6:57) Cam Newton rush up the middle for 7 yards to the SD43. Tackled by Jatavis Brown.","(7:03) Cam Newton incomplete pass to the right intended for Fozzy Whittaker.","(7:38) Ted Ginn Jr. rush to the right for a loss of 3 yards to the Car50. Tackled by Melvin Ingram.","(7:48) Philip Rivers sacked at SD47 for a loss of 1 yard by Kawann Short. FUMBLE, recovered by Car (Paul Soliai). Tackled by Orlando Franklin.","(8:26) Melvin Gordon rush to the left for 4 yards to the SD48. Tackled by Daryl Worley.","(9:03) Philip Rivers pass to the right to Dontrelle Inman for 9 yards to the SD44. Tackled by James Bradberry.","(9:43) Melvin Gordon rush to the left for 1 yard to the SD35. Tackled by Daryl Worley.","(10:19) Philip Rivers pass to the right to Antonio Gates for 9 yards to the SD34. Tackled by A.J. Klein and Shaq Thompson.","(10:19) Graham Gano kicks off to the endzone. Touchback.","(10:24) Graham Gano 41 yard field goal attempt is GOOD. Holder: Michael Palardy.","(10:28) Cam Newton incomplete pass to the right intended for Kelvin Benjamin defensed by Casey Hayward.","(10:33) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(11:02) Jonathan Stewart rush up the middle for 2 yards to the SD23. Tackled by Melvin Ingram.","(11:41) Cam Newton rush up the middle for 4 yards to the SD25. Tackled by Tenny Palepoi.","(12:19) Corey Brown rush to the left for 9 yards to the SD29. Tackled by Denzel Perryman.","(12:25) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by Jahleel Addae.","(12:59) Cam Newton pass to the right to Greg Olsen for 13 yards to the SD38.","(13:29) Jonathan Stewart rush up the middle for 1 yard to the Car49. Tackled by Joey Bosa and Denzel Perryman.","(13:41) Drew Kaser punts for 47 yards to Car34. Ted Ginn Jr. return for 14 yards to Car48. Tackled by Joshua Perry.","(14:13) Philip Rivers sacked at SD19 for a loss of 6 yards by Kawann Short.","(14:56) Melvin Gordon rush up the middle for no gain to the SD25. Tackled by Wes Horton and A.J. Klein.","(15:00) Philip Rivers incomplete pass to the middle intended for Melvin Gordon.","(15:00) Graham Gano kicks off to the endzone. Touchback."]