["(0:16) Marcus Mariota rush up the middle for a loss of 1 yard to the Den43.","(0:51) Marcus Mariota rush up the middle for a loss of 1 yard to the Den42.","(0:51) Denver Broncos timeout.","(0:53) Marcus Mariota rush up the middle for a loss of 1 yard to the Den41.","(1:04) Trevor Siemian pass to the left to A.J. Derby for 11 yards to the Den40. Tackled by Avery Williamson. FUMBLE, recovered by Ten (Daimion Stafford). Tackled by Max Garcia.","(1:04) Denver Broncos timeout.","(1:08) Trevor Siemian pass to the middle to Demaryius Thomas for 8 yards to the Den29. Tackled by Rashad Johnson.","(1:35) Trevor Siemian pass to the left to Demaryius Thomas for 7 yards to the Den21. Tackled by Valentino Blake.","(1:57) Trevor Siemian pass to the left to Demaryius Thomas for 6 yards to the Den14. Tackled by Valentino Blake.","(1:57) Two Minute Warning.","(2:02) Trevor Siemian incomplete pass to the right intended for Virgil Green.","(2:26) Trevor Siemian pass to the middle to Justin Forsett for 6 yards to the Den8. Tackled by Wesley Woodyard.","(2:36) Brett Kern punts for 47 yards to Den2. No return.","(2:43) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(2:47) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(2:47) Denver Broncos timeout.","(2:51) Derrick Henry rush up the middle for no gain to the Den49. Tackled by Von Miller and Zaire Anderson.","(3:37) Marcus Mariota pass to the left to Rishard Matthews for 26 yards to the Den49. Tackled by Aqib Talib.","(4:22) DeMarco Murray rush to the right for 5 yards to the Ten25. Tackled by Von Miller.","(4:28) Brandon McManus kicks off to the Ten0. Marc Mariani return for 20 yards to Ten20. Tackled by Kayvon Webster.","(4:33) Brandon McManus 34 yard field goal attempt is GOOD. Holder: Riley Dixon.","(4:41) Trevor Siemian incomplete pass to the left intended for Bennie Fowler defensed by Brice McCain.","(4:47) Trevor Siemian incomplete pass to the left intended for Bennie Fowler.","(5:33) Trevor Siemian sacked at Ten16 for a loss of 9 yards by Aaron Wallace.","(6:14) Trevor Siemian pass to the left to Demaryius Thomas for 13 yards to the Ten7. Tackled by Jason McCourty.","(6:18) Trevor Siemian incomplete pass to the middle intended for Emmanuel Sanders defensed by Wesley Woodyard.","(6:55) Justin Forsett rush to the right for a loss of 2 yards to the Ten20. Tackled by DaQuan Jones and Brice McCain.","(7:29) Trevor Siemian pass to the left to Emmanuel Sanders for 10 yards to the Ten18. Tackled by Jason McCourty.","(7:36) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas.","(8:14) Trevor Siemian pass to the left to Demaryius Thomas for 10 yards to the Ten28. Tackled by Wesley Woodyard.","(8:55) Trevor Siemian pass to the left to Emmanuel Sanders for 17 yards to the Ten38. Tackled by Jason McCourty.","(9:01) Brett Kern punts for 36 yards to Den45. No return.","(9:09) Marcus Mariota incomplete pass to the right intended for DeMarco Murray.","(9:46) DeMarco Murray rush to the left for 1 yard to the Ten19. Tackled by Von Miller.","(9:52) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(9:58) Brandon McManus kicks off to the Ten1. Marc Mariani return for 17 yards to Ten18. Tackled by Juwan Thompson and Justin Simmons.","(9:58) Brandon McManus extra point is good.","(10:04) Trevor Siemian pass to the left to Emmanuel Sanders for 3 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Denver (Emmanuel Sanders) -15 yards.","(10:08) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(10:48) Trevor Siemian pass to the left to Demaryius Thomas for 15 yards to the Ten3. Tackled by Brian Orakpo and Daimion Stafford.","(11:31) Trevor Siemian pass to the left to Bennie Fowler for 5 yards to the Ten18. Tackled by Jason McCourty.","(11:53) Penalty: Pass Interference on Denver (Bennie Fowler) -10 yards.","(12:34) Trevor Siemian pass to the right to Emmanuel Sanders for 13 yards to the Ten13. Tackled by Valentino Blake.","(12:47) Brett Kern punts for 61 yards to Den38. Kalif Raymond return for 21 yards to Ten41. Tackled by Aaron Wallace. Penalty: Unnecessary Roughness on Tennessee (Beau Brinkley) 15 yards.","(13:27) Marcus Mariota sacked at Ten1 for a loss of 5 yards by DeMarcus Ware.","(14:12) DeMarco Murray rush to the left for 1 yard to the Ten6. Tackled by Zaire Anderson and Derek Wolfe.","(14:47) DeMarco Murray rush to the right for 1 yard to the Ten5. Tackled by Von Miller.","(14:54) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(15:00) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas defensed by LeShaun Sims.","(0:24) Justin Forsett rush to the left for 2 yards to the Ten4. Tackled by Kevin Byard.","(1:06) Trevor Siemian pass to the right to Jordan Taylor for a loss of 2 yards to the Ten6. Tackled by LeShaun Sims.","(1:06) Tennessee Titans timeout.","(1:45) Trevor Siemian pass to the left to Demaryius Thomas for 15 yards to the Ten4. Tackled by Brice McCain and Kevin Byard.","(2:31) Trevor Siemian pass to the right to Justin Forsett for 1 yard to the Ten19. Tackled by Wesley Woodyard.","(3:09) Trevor Siemian sacked at Ten20 for a loss of 5 yards by Brian Orakpo.","(3:46) Trevor Siemian pass to the right to Demaryius Thomas for 34 yards to the Ten15. Tackled by Kevin Byard.","(4:35) Riley Dixon pass to the left to Cody Latimer for 16 yards to the Ten49. Tackled by Valentino Blake.","(4:41) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas.","(5:20) Trevor Siemian pass to the left to A.J. Derby for 12 yards to the Den35. Tackled by LeShaun Sims.","(5:47) Justin Forsett rush to the left for 1 yard to the Den33. Tackled by Wesley Woodyard. Penalty: Holding on Denver (Matt Paradis) -10 yards.","(6:24) Justin Forsett rush to the left for 5 yards to the Den32. Tackled by LeShaun Sims.","(6:35) Brett Kern punts for 41 yards to Den37. Kalif Raymond - no return. Tackled by Nate Palmer. Penalty: Holding on Denver (Justin Simmons) -10 yards.","(6:39) Marcus Mariota incomplete pass to the right intended for DeMarco Murray.","(7:24) DeMarco Murray rush up the middle for 5 yards to the Ten22. Tackled by T.J. Ward.","(8:02) DeMarco Murray rush to the left for 3 yards to the Ten17. Tackled by Corey Nelson.","(8:10) Riley Dixon punts for 34 yards to Ten14. No return.","(8:16) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(8:22) Penalty: False Start on Denver (Russell Okung) -5 yards.","(8:22) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders defensed by Valentino Blake.","(9:00) Trevor Siemian pass to the right to Emmanuel Sanders for no gain to the Ten43. Tackled by Valentino Blake.","(9:32) Trevor Siemian pass to the left to Jordan Taylor for 15 yards to the Ten43. Tackled by Jason McCourty.","(10:13) Trevor Siemian pass to the left to Emmanuel Sanders for 15 yards to the Den42. Tackled by Sean Spence.","(10:41) Trevor Siemian pass to the left to Emmanuel Sanders for 7 yards to the Den27. Tackled by Jason McCourty.","(10:49) Brett Kern punts for 46 yards to Den0. Touchback.","(10:55) Marcus Mariota incomplete pass to the middle intended for Tajae Sharpe defensed by Darian Stewart.","(11:35) Derrick Henry rush to the left for 2 yards to the Den46. Tackled by Adam Gotsis and Shaquil Barrett.","(12:14) DeMarco Murray rush to the left for 4 yards to the Den48. Tackled by Zaire Anderson.","(13:00) DeMarco Murray rush to the left for 7 yards to the Ten48. Tackled by Sylvester Williams.","(13:45) Derrick Henry rush to the right for 5 yards to the Ten41. Tackled by Derek Wolfe.","(14:20) DeMarco Murray rush to the left for 4 yards to the Ten36. Tackled by Corey Nelson.","(15:00) DeMarco Murray rush to the right for 7 yards to the Ten32. Tackled by Todd Davis.","(15:00) Brandon McManus kicks off to the endzone. Touchback.","(0:11) Trevor Siemian pass to the right to A.J. Derby for 8 yards to the Ten45. Tackled by Daimion Stafford.","(0:16) Trevor Siemian incomplete pass to the left intended for Bennie Fowler.","(0:24) Penalty: Holding on Denver (Donald Stephenson) -10 yards.","(0:45) Trevor Siemian pass to the left to Jordan Taylor for 5 yards to the Ten43. Tackled by Brian Orakpo.","(0:45) Denver Broncos timeout.","(0:53) Trevor Siemian pass to the right to Devontae Booker for 6 yards to the Ten48. Tackled by Valentino Blake.","(1:16) Trevor Siemian pass to the right to A.J. Derby for 17 yards to the Den46. Tackled by Sean Spence.","(1:16) Tennessee Titans timeout.","(1:27) Trevor Siemian pass to the right to Devontae Booker for 4 yards to the Den29. Tackled by Brian Orakpo.","(1:27) Ryan Succop kicks off to the endzone. Touchback.","(1:32) Ryan Succop 41 yard field goal attempt is GOOD. Holder: Brett Kern.","(1:38) Marcus Mariota incomplete pass to the left. Penalty: Intentional Grounding on Tennessee (Marcus Mariota) -10 yards.","(1:44) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(1:50) Penalty: Pass Interference on Tennessee (Delanie Walker) -10 yards.","(1:50) Denver Broncos timeout.","(1:55) Derrick Henry rush up the middle for 4 yards to the Den3. Tackled by Zaire Anderson.","(1:55) Denver Broncos timeout.","(2:00) Marcus Mariota pass to the left to Delanie Walker for 7 yards to the Den7. Tackled by Justin Simmons.","(2:00) Penalty: Offside on Denver (DeMarcus Ware) 5 yards.","(2:00) Two Minute Warning.","(2:24) Derrick Henry rush up the middle for 2 yards to the Den19. Tackled by T.J. Ward.","(2:29) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(2:55) DeMarco Murray rush to the left for 5 yards to the Den36. Tackled by DeMarcus Ware. Penalty: Unnecessary Roughness on Denver (Aqib Talib) 15 yards.","(3:10) Derrick Henry rush to the right for 6 yards to the Den41. Tackled by Darian Stewart.","(3:57) Derrick Henry rush to the right for 2 yards to the Den47. Tackled by Darian Stewart and T.J. Ward.","(4:39) Marcus Mariota rush up the middle for 9 yards to the Den49. Tackled by Von Miller.","(5:12) Marcus Mariota pass to the right to Harry Douglas for 10 yards to the Den48. Tackled by Corey Nelson. Penalty: Illegal Block on Tennessee (DeMarco Murray) -10 yards.","(5:19) Marcus Mariota incomplete pass to the right intended for Jalston Fowler.","(5:58) DeMarco Murray rush to the left for 3 yards to the Ten42. Tackled by Corey Nelson.","(6:45) Marcus Mariota pass to the left to Anthony Fasano for 17 yards to the Ten39. Tackled by Corey Nelson.","(7:27) Marcus Mariota rush to the left for 1 yard to the Ten22. Tackled by Von Miller.","(8:09) Derrick Henry rush to the left for 6 yards to the Ten21. Tackled by Todd Davis and Jared Crick.","(8:51) DeMarco Murray rush up the middle for 3 yards to the Ten15. Tackled by Sylvester Williams.","(9:31) DeMarco Murray rush to the right for 9 yards to the Ten12. Tackled by Darian Stewart.","(9:44) Riley Dixon punts for 53 yards to Ten3. No return.","(9:49) Trevor Siemian incomplete pass to the left intended for Cody Latimer.","(9:55) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(10:28) Justin Forsett rush to the left for 2 yards to the Den44. Tackled by David Bass.","(10:59) Trevor Siemian pass to the left to Emmanuel Sanders for 16 yards to the Den42. Tackled by LeShaun Sims.","(11:33) Trevor Siemian pass to the right to Emmanuel Sanders for 7 yards to the Den26. Tackled by Avery Williamson and Kevin Byard.","(12:13) Trevor Siemian pass to the left to Justin Forsett for 11 yards to the Den19. Tackled by Al Woods.","(12:22) Brett Kern punts for 34 yards to Den15. No return. Penalty: Illegal Block on Denver (Kayvon Webster) -7 yards.","(13:03) Marcus Mariota sacked at Den49 for a loss of 10 yards by Shane Ray.","(13:33) Penalty: Pass Interference on Tennessee (Delanie Walker) -10 yards.","(14:12) Marcus Mariota rush to the left for 7 yards to the Den29. Tackled by Darian Stewart.","(14:17) Marcus Mariota incomplete pass to the right intended for Anthony Fasano.","(15:00) DeMarco Murray rush to the left for 10 yards to the Den36. Tackled by T.J. Ward.","(0:15) Derrick Henry rush up the middle for 4 yards to the Den46. Tackled by T.J. Ward.","(0:53) Marcus Mariota rush to the left for 13 yards to the Ten50. Tackled by Shane Ray.","(1:00) Riley Dixon punts for 36 yards to Ten37. No return.","(1:36) Devontae Booker rush up the middle for no gain to the Den27. Tackled by Avery Williamson.","(2:11) Devontae Booker rush to the left for 1 yard to the Den27. Tackled by Karl Klug.","(2:37) Trevor Siemian pass to the left to Emmanuel Sanders for 8 yards to the Den26. Tackled by Jason McCourty.","(2:52) Trevor Siemian pass to the right to Demaryius Thomas for 12 yards to the Den18. Tackled by Brice McCain.","(3:00) Brett Kern punts for 43 yards to Den6. No return.","(3:06) Marcus Mariota incomplete pass to the right intended for Harry Douglas.","(3:42) Derrick Henry rush up the middle for 5 yards to the Den49. Tackled by Derek Wolfe.","(4:21) DeMarco Murray rush to the right for 2 yards to the Ten46. Tackled by Darian Stewart.","(4:31) Riley Dixon punts for 42 yards to Ten27. Marc Mariani return for 17 yards to Ten44. Tackled by Thomas Gafford.","(4:35) Trevor Siemian incomplete pass to the right intended for Jordan Taylor.","(5:15) Devontae Booker rush to the right for no gain to the Den31. Tackled by Sean Spence.","(5:48) Trevor Siemian pass to the left to Demaryius Thomas for 6 yards to the Den31. Tackled by LeShaun Sims.","(5:48) Ryan Succop kicks off to the endzone. Touchback.","(5:53) Ryan Succop 53 yard field goal attempt is GOOD. Holder: Brett Kern.","(5:57) Marcus Mariota incomplete pass to the middle intended for Delanie Walker defensed by Jared Crick.","(6:42) Marcus Mariota pass to the left to Derrick Henry for 5 yards to the Den35. Tackled by Chris Harris Jr..","(6:48) DeMarco Murray incomplete pass to the right intended for Marcus Mariota defensed by T.J. Ward.","(6:58) Justin Forsett rush to the left for 9 yards to the Den38. Tackled by Rashad Johnson. FUMBLE, recovered by Ten (Jason McCourty). Tackled by Max Garcia.","(7:29) Trevor Siemian pass to the right to Emmanuel Sanders for 4 yards to the Den29. Tackled by Daimion Stafford.","(7:29) Ryan Succop kicks off to the endzone. Touchback.","(7:29) Ryan Succop extra point is good.","(7:33) DeMarco Murray rush to the left for 1 yard for a TOUCHDOWN.","(8:08) Derrick Henry rush up the middle for 1 yard to the Den1. Tackled by Zaire Anderson.","(8:08) Tennessee Titans timeout.","(8:40) DeMarco Murray rush to the left for 3 yards to the Den2. Tackled by Chris Harris Jr..","(9:24) Delanie Walker rush for 8 yards to the Den5. Tackled by Todd Davis. FUMBLE, recovered by Ten (Marcus Mariota).","(10:07) DeMarco Murray rush to the left for 7 yards to the Den13. Tackled by Corey Nelson and Todd Davis.","(10:45) Marcus Mariota pass to the left to Delanie Walker for 23 yards to the Den20. Tackled by Justin Simmons.","(10:50) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(11:34) Derrick Henry rush up the middle for 5 yards to the Den43. Tackled by Von Miller.","(12:12) DeMarco Murray rush to the right for 11 yards to the Den48. Tackled by T.J. Ward and Aqib Talib.","(12:55) Marcus Mariota rush to the right for 11 yards to the Ten41. Tackled by Todd Davis.","(13:35) DeMarco Murray rush to the right for no gain to the Ten30. Tackled by Todd Davis.","(13:43) Riley Dixon punts for 42 yards to Ten30. No return.","(14:16) Trevor Siemian sacked at Den28 for a loss of 6 yards by Derrick Morgan.","(14:21) Trevor Siemian incomplete pass to the left intended for Virgil Green.","(15:00) Trevor Siemian pass to the left to A.J. Derby for 9 yards to the Den34. Tackled by Jason McCourty.","(15:00) Ryan Succop kicks off to the endzone. Touchback."]