["(0:23) Brett Hundley rush up the middle for a loss of 1 yard to the GB25.","(1:03) Brett Hundley rush up the middle for a loss of 1 yard to the GB26.","(1:08) Alex Collins rush up the middle for 4 yards to the GB33. Tackled by Christian Ringo. FUMBLE, recovered by GB (Kentrell Brice). Tackled by Alex Collins.","(1:15) Penalty: Pass Interference on Seattle (Paul Richardson) -10 yards.","(1:57) Alex Collins rush up the middle for 2 yards to the GB27. Tackled by Jayrone Elliott and Kenny Clark.","(1:57) Two Minute Warning.","(2:05) Russell Wilson pass to the middle to Alex Collins for 14 yards to the GB29. Tackled by Joe Thomas and Morgan Burnett.","(2:42) Russell Wilson pass to the left to Tanner McEvoy for 15 yards to the GB43. Tackled by Quinten Rollins and Micah Hyde.","(3:23) Alex Collins rush to the right for a loss of 1 yard to the Sea42. Tackled by Clay Matthews.","(4:00) Alex Collins rush up the middle for 2 yards to the Sea43. Tackled by Kenny Clark.","(4:32) Alex Collins rush up the middle for 8 yards to the Sea41. Tackled by Micah Hyde and Clay Matthews.","(5:13) Alex Collins rush to the left for 3 yards to the Sea33. Tackled by Joe Thomas and Kenny Clark.","(5:36) Troymaine Pope rush to the left for 12 yards to the Sea30. Tackled by Joe Thomas.","(5:43) Mason Crosby kicks off to the Sea2. Tyler Lockett return for 26 yards to Sea28. Tackled by Mason Crosby. Penalty: Holding on Seattle (Dewey McDonald) -10 yards.","(5:43) Mason Crosby extra point is good.","(5:50) Jeff Janis rush to the left for 19 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Green Bay (Ha Ha Clinton-Dix) -15 yards.","(6:00) Russell Wilson pass intended for Troymaine Pope INTERCEPTED by Micah Hyde and returned for 11 yards. Tackled by George Fant.","(6:04) Christine Michael rush to the right for a loss of 2 yards to the Sea37. Tackled by Kam Chancellor.","(6:46) Aaron Ripkowski rush to the right for no gain to the Sea35. Tackled by Bobby Wagner.","(7:32) Aaron Ripkowski rush up the middle for no gain to the Sea35. Tackled by Kam Chancellor and Jarran Reed.","(8:19) Christine Michael rush to the left for 9 yards to the Sea35. Tackled by Bobby Wagner.","(8:21) Steven Hauschka onside kickoff to the Sea44. Onside kick recovered by receiving team by Richard Rodgers.","(8:21) Steven Hauschka extra point is good.","(8:26) Russell Wilson pass to the left to Tanner McEvoy for 21 yards for a TOUCHDOWN.","(8:56) Russell Wilson pass to the left to Alex Collins for 13 yards to the GB21. Tackled by Jayrone Elliott.","(9:02) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(9:27) Russell Wilson pass to the right to Tyler Lockett for 7 yards to the GB34. Tackled by Micah Hyde.","(9:52) Russell Wilson pass to the left to Tyler Lockett for 5 yards to the GB41. Tackled by Ha Ha Clinton-Dix.","(10:15) Russell Wilson pass to the middle to Jimmy Graham for 16 yards to the GB46. Tackled by Quinten Rollins.","(10:31) Tyler Lockett rush to the right for 13 yards to the Sea38. Tackled by Morgan Burnett.","(10:31) Mason Crosby kicks off to the endzone. Touchback.","(10:35) Mason Crosby 38 yard field goal attempt is GOOD. Holder: Jacob Schum.","(10:40) Brett Hundley incomplete pass to the left intended for Davante Adams.","(10:46) Brett Hundley incomplete pass to the right intended for Aaron Ripkowski.","(11:29) Christine Michael rush to the left for 2 yards to the Sea20. Tackled by Tony McDaniel.","(11:46) Christine Michael rush to the right for 2 yards to the Sea37. Tackled by Tony McDaniel. Penalty: Unnecessary Roughness on Seattle (Cliff Avril) 15 yards.","(11:51) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(12:19) Russell Wilson pass to the right to Tyler Lockett for 15 yards to the Sea39. Tackled by Quinten Rollins and Damarious Randall.","(13:00) Russell Wilson sacked at Sea24 for a loss of 8 yards by Jayrone Elliott.","(13:05) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(13:32) Russell Wilson pass to the left to Alex Collins for 6 yards to the Sea32. Tackled by Morgan Burnett and Julius Peppers.","(13:36) Russell Wilson incomplete pass to the middle intended for Doug Baldwin defensed by Quinten Rollins.","(14:04) Russell Wilson pass to the right to Doug Baldwin for 8 yards to the Sea26. Tackled by Joe Thomas.","(14:11) Jacob Schum punts for 49 yards to Sea18. No return.","(14:11) Seattle Seahawks timeout.","(15:00) Aaron Rodgers pass to the middle to Ty Montgomery for 16 yards to the GB33. Tackled by Kam Chancellor and Bobby Wagner.","(0:16) Aaron Rodgers sacked at GB17 for a loss of 9 yards by Ahtyba Rubin.","(0:57) Christine Michael rush to the left for 2 yards to the GB26. Tackled by Cliff Avril.","(1:42) Christine Michael rush to the right for 2 yards to the GB24. Tackled by Jarran Reed.","(2:25) Christine Michael rush to the left for 8 yards to the GB22. Tackled by Bobby Wagner and K.J. Wright.","(2:34) Jon Ryan punts for 42 yards to GB24. Micah Hyde - no return. Tackled by Dewey McDonald. Penalty: Holding on Green Bay (Josh Hawkins) -10 yards.","(2:38) Russell Wilson incomplete pass to the left intended for Tyler Lockett.","(3:18) Russell Wilson pass to the right to Luke Willson for 11 yards to the Sea34. Tackled by Quinten Rollins.","(3:18) Penalty: Delay of Game on Seattle (Russell Wilson) -5 yards.","(4:20) Russell Wilson sacked at Sea28 for a loss of 3 yards by Datone Jones.","(4:24) Mason Crosby kicks off to the Sea8. Tyler Lockett return for 23 yards to Sea31. Tackled by Kentrell Brice.","(4:24) Mason Crosby extra point is good.","(4:31) Aaron Rodgers pass to the left to Jordy Nelson for 3 yards for a TOUCHDOWN.","(4:59) Aaron Rodgers pass to the middle to Richard Rodgers for 8 yards to the Sea6. Tackled by K.J. Wright. Penalty: Unnecessary Roughness on Seattle (K.J. Wright) 3 yards.","(5:05) Aaron Rodgers incomplete pass to the left intended for Ty Montgomery.","(5:45) Ty Montgomery rush to the left for 6 yards to the Sea14. Tackled by Bobby Wagner.","(6:32) Aaron Rodgers pass to the left to Davante Adams for 8 yards to the Sea20. Tackled by Deshawn Shead.","(7:18) Aaron Rodgers pass to the left to Davante Adams for 4 yards to the Sea28. Tackled by Kam Chancellor.","(7:40) Green Bay Packers timeout.","(7:40) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson defensed by Deshawn Shead.","(7:52) Russell Wilson pass intended for Doug Baldwin INTERCEPTED by Damarious Randall and returned for 26 yards. Tackled by Thomas Rawls.","(8:36) Russell Wilson rush to the right for 2 yards to the Sea40. Tackled by Mike Daniels.","(8:53) Penalty: Offside on Green Bay (Kenny Clark) 5 yards.","(9:01) Jacob Schum punts for 32 yards to Sea33. No return.","(9:09) Aaron Rodgers pass to the left to Ty Montgomery for 5 yards to the GB35. Tackled by Deshawn Shead.","(9:49) Ty Montgomery rush to the left for a loss of 3 yards to the GB30. Tackled by Tony McDaniel.","(10:32) Aaron Rodgers rush up the middle for a loss of 2 yards to the GB33. Tackled by Michael Bennett.","(11:04) Penalty: Face Mask on Seattle (Mike Morgan) 15 yards.","(11:09) Russell Wilson pass intended for Jermaine Kearse INTERCEPTED by Quinten Rollins defensed by Ladarius Gunter. No return. Touchback.","(11:14) Russell Wilson incomplete pass to the right intended for Jimmy Graham.","(11:55) Thomas Rawls rush to the right for 15 yards to the GB20. Tackled by Jayrone Elliott and Ha Ha Clinton-Dix.","(12:30) Russell Wilson pass to the right to Marcel Reece for 7 yards to the GB35. Tackled by Joe Thomas.","(13:07) Thomas Rawls rush up the middle for 2 yards to the GB42. Tackled by Mike Daniels and Letroy Guion.","(13:46) Thomas Rawls rush up the middle for 10 yards to the GB44. Tackled by Ladarius Gunter.","(14:14) Russell Wilson pass to the right to Doug Baldwin for 5 yards to the Sea46. Tackled by Ha Ha Clinton-Dix.","(14:52) Russell Wilson pass to the middle to Thomas Rawls for 7 yards to the Sea41. Tackled by Joe Thomas.","(15:00) Mason Crosby kicks off to the Sea2. Tyler Lockett return for 32 yards to Sea34. Tackled by Morgan Burnett.","(0:22) Aaron Rodgers rush up the middle for a loss of 1 yard to the GB20.","(0:34) Russell Wilson pass intended for Doug Baldwin INTERCEPTED by Damarious Randall and returned for 21 yards. Tackled by Paul Richardson.","(0:40) Penalty: Offside on Green Bay (Dean Lowry) 5 yards.","(0:40) Green Bay Packers timeout.","(0:48) Russell Wilson pass to the right to Marcel Reece for 31 yards to the GB45. Tackled by Micah Hyde.","(0:53) Russell Wilson pass to the right to Doug Baldwin for 9 yards to the Sea24. Tackled by Quinten Rollins.","(1:14) Alex Collins rush up the middle for 5 yards to the Sea15. Tackled by Dean Lowry.","(1:21) Jacob Schum punts for 40 yards to Sea10. No return.","(1:26) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(1:49) James Starks rush up the middle for 2 yards to the GB50. Tackled by Bobby Wagner.","(1:55) Aaron Rodgers incomplete pass to the left intended for Jared Cook defensed by Deshawn Shead.","(2:00) Aaron Rodgers pass to the left to Davante Adams for 26 yards to the GB48. Tackled by Deshawn Shead.","(2:00) Two Minute Warning.","(2:27) Ty Montgomery rush to the right for 6 yards to the GB22. Tackled by Bobby Wagner.","(2:34) Jon Ryan punts for 28 yards to GB16. No return.","(2:37) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(2:43) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(3:20) Thomas Rawls rush up the middle for 4 yards to the GB44. Tackled by Micah Hyde and Kenny Clark.","(4:03) Russell Wilson pass to the right to Tanner McEvoy for 5 yards to the GB48. Tackled by Damarious Randall.","(4:12) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(4:43) Russell Wilson rush to the left for 8 yards to the Sea47. Tackled by Joe Thomas.","(5:15) Russell Wilson pass to the right to Tyler Lockett for 14 yards to the Sea39. Tackled by Quinten Rollins.","(5:15) Mason Crosby kicks off to the endzone. Touchback.","(5:15) Mason Crosby extra point is good.","(5:21) Aaron Rodgers pass to the left to Jordy Nelson for 9 yards for a TOUCHDOWN.","(5:53) Aaron Rodgers pass to the left to Ty Montgomery for 24 yards to the Sea9. Tackled by Steven Terrell.","(6:38) Aaron Rodgers pass to the left to Jordy Nelson for 2 yards to the Sea33. Tackled by Richard Sherman.","(7:20) Aaron Ripkowski rush to the right for 2 yards to the Sea35. Tackled by Cassius Marsh and Tony McDaniel.","(7:59) Aaron Rodgers pass to the right to Jordy Nelson for 11 yards to the Sea37. Tackled by Richard Sherman.","(8:05) Jon Ryan punts for 31 yards to Sea48. No return.","(8:47) Russell Wilson sacked at Sea17 for a loss of 11 yards by Dean Lowry.","(8:50) Russell Wilson incomplete pass to the left intended for Thomas Rawls.","(9:31) Thomas Rawls rush up the middle for 2 yards to the Sea28. Tackled by Mike Daniels.","(9:36) Mason Crosby kicks off to the Sea-4. Tyler Lockett return for 30 yards to Sea26. Tackled by Josh Hawkins.","(9:36) Mason Crosby extra point is good.","(9:41) Ty Montgomery rush to the left for 1 yard for a TOUCHDOWN.","(10:23) Aaron Rodgers pass to the right to Jordy Nelson for 7 yards to the Sea1. Tackled by K.J. Wright.","(11:09) Aaron Rodgers pass to the left to Jared Cook for 15 yards to the Sea8. Tackled by Deshawn Shead and Bobby Wagner.","(11:53) Ty Montgomery rush to the left for 3 yards to the Sea23. Tackled by Michael Bennett and Jarran Reed.","(12:02) Russell Wilson pass intended for Jimmy Graham INTERCEPTED by Morgan Burnett and returned for 19 yards. Tackled by Marcel Reece.","(13:08) Penalty: Unnecessary Roughness on Green Bay (Datone Jones) 15 yards.","(13:08) Thomas Rawls rush up the middle for 3 yards to the Sea19. Tackled by Mike Daniels and Joe Thomas.","(13:16) Jacob Schum punts for 33 yards to Sea16. No return.","(13:22) Aaron Rodgers incomplete pass to the right intended for Richard Rodgers.","(14:06) Aaron Rodgers pass to the left to Randall Cobb for 4 yards to the Sea49. Tackled by Deshawn Shead and Jeremy Lane.","(14:38) Ty Montgomery rush to the right for 4 yards to the GB47. Tackled by Tony McDaniel.","(15:00) Aaron Rodgers pass to the left to Randall Cobb for 25 yards to the GB43. Tackled by K.J. Wright.","(0:27) Aaron Rodgers pass to the left to Randall Cobb for 4 yards to the GB18. Tackled by K.J. Wright and Bobby Wagner.","(0:34) Jon Ryan punts for 35 yards to GB14. No return.","(1:13) Russell Wilson pass to the right to Doug Baldwin for 6 yards to the GB49. Tackled by Damarious Randall.","(1:58) Thomas Rawls rush up the middle for 3 yards to the Sea45. Tackled by Datone Jones and Morgan Burnett.","(2:05) Russell Wilson incomplete pass to the left intended for Jimmy Graham.","(2:10) 51 yard field goal attempt by Mason Crosby is NO GOOD. Holder: Jacob Schum.","(2:49) Aaron Rodgers rush to the left for a loss of 3 yards to the Sea34. Tackled by Ahtyba Rubin.","(3:33) Christine Michael rush to the left for 4 yards to the Sea31. Tackled by Bobby Wagner.","(4:07) Christine Michael rush to the right for a loss of 1 yard to the Sea35. Tackled by Jarran Reed.","(4:10) Penalty: Offside on Seattle (Tony McDaniel) 5 yards.","(4:24) Christine Michael rush to the right for 10 yards to the Sea39. Tackled by Steven Terrell.","(5:00) James Starks rush to the left for 1 yard to the Sea49. Tackled by Tony McDaniel and Bobby Wagner.","(5:31) Ty Montgomery rush to the right for 17 yards to the GB50. Tackled by Steven Terrell.","(6:09) Ty Montgomery rush to the left for 7 yards to the GB33. Tackled by Kam Chancellor and Cliff Avril.","(6:16) Steven Hauschka kicks off to the GB6. Ty Montgomery return for 20 yards to GB26. Tackled by Kam Chancellor.","(6:19) Steven Hauschka 28 yard field goal attempt is GOOD. Holder: Jon Ryan.","(7:03) Thomas Rawls rush up the middle for a loss of 1 yard to the GB10. Tackled by Jayrone Elliott and Jake Ryan.","(7:50) Tyler Lockett rush to the left for 2 yards to the GB9. Tackled by Ha Ha Clinton-Dix.","(8:30) Thomas Rawls rush to the left for 7 yards to the GB11. Tackled by Morgan Burnett.","(8:55) Russell Wilson pass to the right to Doug Baldwin for 10 yards to the GB18. Tackled by Damarious Randall.","(9:31) Russell Wilson rush up the middle for 5 yards to the GB28. Tackled by Joe Thomas.","(9:36) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(10:11) Thomas Rawls rush up the middle for 8 yards to the GB33. Tackled by Letroy Guion.","(10:50) Russell Wilson pass to the right to Jermaine Kearse for 7 yards to the GB41. Tackled by Quinten Rollins.","(11:33) Russell Wilson rush up the middle for 4 yards to the GB48. Tackled by Morgan Burnett.","(12:15) Thomas Rawls rush up the middle for 13 yards to the Sea48. Tackled by Micah Hyde and Joe Thomas.","(12:54) Thomas Rawls rush to the left for 1 yard to the Sea35. Tackled by Mike Daniels.","(13:25) Russell Wilson pass to the right to Doug Baldwin for 8 yards to the Sea34. Tackled by Damarious Randall and Morgan Burnett.","(13:30) Mason Crosby kicks off to the Sea1. Tyler Lockett return for 25 yards to Sea26. Tackled by Josh Hawkins.","(13:30) Mason Crosby extra point is good.","(13:41) Aaron Rodgers pass to the right to Davante Adams for 66 yards for a TOUCHDOWN.","(14:24) Ty Montgomery rush up the middle for no gain to the GB34. Tackled by Michael Bennett and Bobby Wagner.","(14:54) Aaron Rodgers pass to the right to Jordy Nelson for 9 yards to the GB34. Tackled by Jeremy Lane.","(15:00) Steven Hauschka kicks off to the GB9. Ty Montgomery return for 16 yards to GB25. Tackled by Dewey McDonald."]