["(8:41) Bilal Powell rush to the left for 19 yards for a TOUCHDOWN.","(9:27) Bilal Powell rush to the right for 9 yards to the SF19. Tackled by Antoine Bethea and Eli Harold.","(9:52) Penalty: False Start on New York (Ben Ijalana) -5 yards.","(10:36) Bilal Powell rush to the left for 2 yards to the SF23. Tackled by Ahmad Brooks.","(10:36) New York Jets timeout.","(11:22) Bryce Petty pass to the left to Robby Anderson for 26 yards to the SF25. Tackled by Jaquiski Tartt.","(12:07) Bilal Powell rush to the left for 8 yards to the NYJ49. Tackled by Nick Bellore and Jimmie Ward.","(12:51) Bilal Powell rush up the middle for 4 yards to the NYJ41. Tackled by DeForest Buckner.","(12:56) Carlos Hyde rush to the left for no gain to the NYJ37. Tackled by Muhammad Wilkerson and Deon Simon.","(13:32) Colin Kaepernick pass to the right to Chris Harper for 8 yards to the NYJ37. Tackled by Juston Burris.","(13:36) Colin Kaepernick incomplete pass to the middle intended for Quinton Patton defensed by Darrelle Revis.","(14:12) Shaun Draughn rush up the middle for no gain to the NYJ45. Tackled by Deon Simon.","(14:35) Carlos Hyde rush to the right for 25 yards to the NYJ45. Tackled by Rontez Miles.","(15:00) Colin Kaepernick pass to the left to Garrett Celek for 5 yards to the SF30. Tackled by David Harris.","(15:00) Nick Folk kicks off to the endzone. Touchback.","(0:07) Bilal Powell rush up the middle for 8 yards to the NYJ43. Tackled by DeForest Buckner.","(0:07) New York Jets timeout.","(0:13) Bilal Powell rush to the left for 3 yards to the NYJ35. Tackled by Keith Reaser.","(0:18) Bryce Petty incomplete pass to the middle intended for Charone Peake.","(0:25) Bradley Pinion punts for 40 yards to NYJ32. No return.","(0:25) New York Jets timeout.","(0:31) Shaun Draughn rush up the middle for 3 yards to the SF28. Tackled by Doug Middleton and Leonard Williams.","(0:35) Colin Kaepernick incomplete pass to the right intended for Chris Harper.","(0:38) Colin Kaepernick incomplete pass to the right intended for Chris Harper.","(0:38) Nick Folk kicks off to the endzone. Touchback.","(0:43) Nick Folk 50 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(0:48) Bryce Petty incomplete pass to the left intended for Robby Anderson.","(0:55) Bryce Petty rush to the right for 1 yard to the SF32. Tackled by Jimmie Ward.","(1:20) Brandon Wilds rush up the middle for 2 yards to the SF33. Tackled by DeForest Buckner.","(1:28) Penalty: Illegal Formation on New York -5 yards.","(1:55) Bilal Powell rush to the right for 9 yards to the SF30. Tackled by Jaquiski Tartt.","(1:55) Two Minute Warning.","(2:02) Bryce Petty pass to the left to Robby Anderson for 9 yards to the SF39. Tackled by Tramaine Brock and Jimmie Ward.","(2:29) Bilal Powell rush to the right for 8 yards to the SF48. Tackled by DeForest Buckner.","(2:35) Bryce Petty pass to the right to Quincy Enunwa for 9 yards to the NYJ44. Tackled by Jaquiski Tartt.","(2:42) Bradley Pinion punts for 40 yards to NYJ35. No return.","(2:42) New York Jets timeout.","(2:49) Colin Kaepernick pass to the right to Shaun Draughn for a loss of 5 yards to the SF25. Tackled by Sheldon Richardson.","(3:34) Carlos Hyde rush to the right for 4 yards to the SF30. Tackled by Deon Simon.","(3:39) Penalty: Holding on San Francisco (Trenton Brown) -10 yards.","(4:25) Carlos Hyde rush to the left for no gain to the SF36. Tackled by Deon Simon and Darron Lee.","(5:04) Carlos Hyde rush to the right for 11 yards to the SF36. Tackled by David Harris and Juston Burris.","(5:04) Nick Folk kicks off to the endzone. Touchback.","(5:04) Bryce Petty 2 pt rush attempt. Successful.","(5:09) Bilal Powell rush to the left for 5 yards for a TOUCHDOWN.","(5:55) Bryce Petty rush to the right for 4 yards to the SF5. Tackled by Nick Bellore.","(6:37) Bilal Powell rush up the middle for a loss of 2 yards to the SF9. Tackled by Nick Bellore and Jaquiski Tartt.","(7:19) Bryce Petty pass to the right to Bilal Powell for 8 yards to the SF7. Tackled by Jaquiski Tartt.","(8:01) Bryce Petty pass to the middle to Austin Seferian-Jenkins for 14 yards to the SF15. Tackled by Jaquiski Tartt.","(8:40) Bilal Powell rush to the right for a loss of 2 yards to the SF29. Tackled by Glenn Dorsey.","(9:25) Bryce Petty pass to the left to Charone Peake for 10 yards to the SF27. Tackled by Ronald Blair.","(9:55) Bryce Petty pass to the left to Brandon Marshall for 9 yards to the SF37. Tackled by Michael Wilhoite and Antoine Bethea.","(10:00) Bryce Petty incomplete pass to the left intended for Robby Anderson.","(10:43) Robby Anderson rush to the left for a loss of 1 yard to the SF46. Tackled by Gerald Hodges Jr..","(11:28) Bryce Petty pass to the left to Robby Anderson for 3 yards to the SF45. Tackled by Tramaine Brock.","(12:05) Bilal Powell rush to the right for 6 yards to the SF48. Tackled by Glenn Dorsey.","(12:40) Bilal Powell rush up the middle for 1 yard to the NYJ46. Tackled by DeForest Buckner.","(13:21) Bilal Powell rush to the right for 11 yards to the NYJ45. Tackled by Jimmie Ward.","(13:27) Bryce Petty incomplete pass to the right intended for Quincy Enunwa defensed by Jimmie Ward.","(13:39) Bradley Pinion punts for 40 yards to NYJ34. Nick Marshall - no return. Tackled by Rod Streater.","(13:43) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley.","(14:03) Penalty: Offside on New York (Freddie Bishop III) 5 yards.","(14:36) Colin Kaepernick pass to the left to Jeremy Kerley for 9 yards to the SF21. Tackled by Muhammad Wilkerson.","(15:00) Penalty: Holding on San Francisco (Marcus Martin) -10 yards.","(0:21) Carlos Hyde rush to the left for 3 yards to the SF22. Tackled by David Harris.","(0:28) Lachlan Edwards punts for 36 yards to SF19. No return.","(1:07) Bryce Petty rush to the right for 5 yards to the NYJ45. Tackled by DeForest Buckner.","(1:11) Bryce Petty incomplete pass to the right intended for Brandon Marshall.","(1:57) Bryce Petty pass to the left to Bilal Powell for 10 yards to the NYJ40. Tackled by Jaquiski Tartt.","(2:03) Penalty: Holding on New York (Ben Ijalana) -10 yards.","(2:25) Bryce Petty pass to the right to Brandon Marshall for 20 yards to the NYJ40. Tackled by Rashard Robinson.","(2:30) Bryce Petty incomplete pass to the left intended for Brandon Marshall.","(3:10) Bilal Powell rush to the right for a loss of 1 yard to the NYJ20. Tackled by DeForest Buckner.","(3:22) Bradley Pinion punts for 37 yards to NYJ21. No return.","(3:28) Colin Kaepernick incomplete pass to the left intended for Torrey Smith defensed by Juston Burris.","(4:14) Carlos Hyde rush up the middle for a loss of 1 yard to the SF42. Tackled by Muhammad Wilkerson.","(4:53) Shaun Draughn rush to the right for 5 yards to the SF43. Tackled by Jordan Jenkins.","(5:25) Colin Kaepernick rush to the right for 8 yards to the SF38.","(6:00) Carlos Hyde rush up the middle for no gain to the SF30. Tackled by Freddie Bishop III and Sheldon Richardson.","(6:28) Carlos Hyde rush to the left for 5 yards to the SF30. Tackled by Freddie Bishop III.","(6:28) Nick Folk kicks off to the endzone. Touchback.","(6:31) Nick Folk 30 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(6:52) Bryce Petty pass to the right to Bilal Powell for 6 yards to the SF12. Tackled by Eli Harold.","(7:37) Bryce Petty sacked at SF18 for a loss of 10 yards by Jaquiski Tartt.","(7:40) Bryce Petty incomplete pass to the left intended for Quincy Enunwa defensed by Jimmie Ward.","(8:13) Penalty: False Start on New York (Brent Qvale) -5 yards.","(8:55) Bryce Petty pass to the left to Robby Anderson for 40 yards to the SF3. Tackled by Antoine Bethea.","(9:38) Bryce Petty sacked at SF43 for a loss of 9 yards by DeForest Buckner.","(10:21) Bilal Powell rush to the right for 1 yard to the SF34. Tackled by Ahmad Brooks.","(10:56) Bryce Petty pass to the left to Austin Seferian-Jenkins for 9 yards to the SF35. Tackled by Antoine Bethea.","(11:37) Bilal Powell rush to the left for 3 yards to the SF44. Tackled by Gerald Hodges Jr..","(12:17) Bilal Powell rush to the left for 16 yards to the SF47. Tackled by Jimmie Ward.","(12:53) Bilal Powell rush up the middle for 4 yards to the NYJ37. Tackled by Nick Bellore.","(13:26) Bilal Powell rush up the middle for 3 yards to the NYJ33. Tackled by Michael Wilhoite.","(13:53) Bilal Powell rush to the left for 6 yards to the NYJ30. Tackled by Gerald Hodges Jr..","(14:01) Bradley Pinion punts for 46 yards to NYJ24. No return.","(14:06) Colin Kaepernick incomplete pass to the right intended for Chris Harper.","(14:49) Carlos Hyde rush up the middle for 5 yards to the SF30. Tackled by Darron Lee.","(14:53) Colin Kaepernick incomplete pass to the left intended for Blake Bell.","(15:00) Nick Folk kicks off to the SF5. JaCorey Shepherd return for 20 yards to SF25. Tackled by Bruce Carter and Rontez Miles.","(0:14) Shaun Draughn rush to the left for 11 yards to the SF43. Tackled by Marcus Williams and David Harris.","(0:14) San Francisco 49ers timeout.","(0:19) Colin Kaepernick pass to the left to Rod Streater for 7 yards to the SF32. Tackled by Darron Lee.","(0:24) Colin Kaepernick incomplete pass to the middle intended for Jeremy Kerley.","(0:24) San Francisco 49ers timeout.","(0:29) Colin Kaepernick pass to the middle to Jeremy Kerley for 9 yards to the SF25. Tackled by Marcus Gilchrist.","(0:52) Colin Kaepernick pass to the left to Jeremy Kerley for 5 yards to the SF16. Tackled by Darron Lee.","(0:59) Lachlan Edwards punts for 42 yards to SF11. No return.","(0:59) San Francisco 49ers timeout.","(1:06) Bryce Petty sacked at NYJ47 for a loss of 5 yards by Ronald Blair and Aaron Lynch.","(1:11) Bryce Petty incomplete pass to the right intended for Robby Anderson.","(1:17) Bryce Petty pass to the left to Bilal Powell for 2 yards to the SF48. Tackled by Jimmie Ward.","(1:17) New York Jets timeout.","(1:26) Bryce Petty pass to the right to Robby Anderson for 14 yards to the NYJ50. Tackled by Tramaine Brock.","(2:00) Bryce Petty pass to the middle to Quincy Enunwa for 16 yards to the NYJ36. Tackled by Antoine Bethea.","(2:00) Two Minute Warning.","(2:07) Bryce Petty pass to the left to Brandon Bostick for 14 yards to the NYJ20. Tackled by Antoine Bethea.","(2:16) Bradley Pinion punts for 36 yards to NYJ12. No return. Penalty: Holding on New York (Josh Martin) -6 yards.","(2:24) Colin Kaepernick incomplete pass to the right intended for Chris Harper.","(3:04) Shaun Draughn rush to the right for 6 yards to the NYJ48. Tackled by Bruce Carter and Calvin Pryor.","(3:45) Colin Kaepernick sacked at SF46 for a loss of 8 yards by Jordan Jenkins and Leonard Williams.","(4:23) Carlos Hyde rush to the right for 18 yards to the NYJ46. Tackled by Darron Lee.","(4:23) Penalty: False Start on San Francisco (Trenton Brown) -5 yards.","(4:30) Lachlan Edwards punts for 37 yards to SF41. No return.","(5:02) Bryce Petty sacked at NYJ22 for a loss of 7 yards by Jimmie Ward.","(5:07) Bryce Petty incomplete pass to the left intended for Robby Anderson.","(5:39) Bryce Petty rush to the left for 9 yards to the NYJ29.","(5:39) Penalty: False Start on New York (Eric Tomlinson) -5 yards.","(5:45) Phil Dawson kicks off to the NYJ1. Nick Marshall return for 24 yards to NYJ25. Tackled by Rod Streater.","(5:50) Phil Dawson 47 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(5:55) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(6:29) Shaun Draughn rush up the middle for 3 yards to the NYJ29. Tackled by David Harris and Calvin Pryor.","(6:56) Colin Kaepernick pass to the right to Jeremy Kerley for no gain to the NYJ32. Tackled by David Harris.","(7:28) Carlos Hyde rush to the right for 43 yards to the NYJ32. Tackled by Marcus Gilchrist.","(7:28) Nick Folk kicks off to the endzone. Touchback.","(7:33) Nick Folk 36 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(7:38) Bryce Petty incomplete pass to the right intended for Quincy Enunwa.","(8:20) Bryce Petty pass to the right to Quincy Enunwa for 4 yards to the SF18. Tackled by Jaquiski Tartt.","(8:57) Brandon Wilds rush to the left for 2 yards to the SF22. Tackled by DeForest Buckner.","(9:36) Bilal Powell rush to the left for 2 yards to the SF24. Tackled by Antoine Bethea.","(10:16) Bilal Powell rush to the right for 2 yards to the SF26. Tackled by Gerald Hodges Jr..","(10:50) Bryce Petty pass to the right to Robby Anderson for 7 yards to the SF28. Tackled by Jaquiski Tartt.","(11:30) Bryce Petty pass to the right to Austin Seferian-Jenkins for 12 yards to the SF35. Tackled by Jimmie Ward and Jaquiski Tartt.","(12:06) Bilal Powell rush to the right for 1 yard to the SF47. Tackled by Gerald Hodges Jr..","(12:47) Bilal Powell rush to the left for 10 yards to the SF48. Tackled by Antoine Bethea.","(13:21) Bilal Powell rush to the left for 4 yards to the NYJ42. Tackled by Gerald Hodges Jr..","(13:27) 48 yard field goal attempt by Phil Dawson is NO GOOD. Holder: Bradley Pinion.","(14:12) Colin Kaepernick sacked at NYJ30 for a loss of 9 yards by Marcus Williams.","(14:53) Carlos Hyde rush to the right for 1 yard to the NYJ21. Tackled by David Harris.","(15:00) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(0:21) Colin Kaepernick pass to the middle to Jeremy Kerley for 27 yards to the NYJ22. Tackled by Buster Skrine.","(0:21) New York Jets timeout.","(0:57) Carlos Hyde rush to the right for 20 yards to the NYJ49. Tackled by Marcus Gilchrist.","(1:27) Colin Kaepernick pass to the right to Quinton Patton for 6 yards to the SF31. Tackled by Marcus Gilchrist.","(1:58) Colin Kaepernick rush to the right for 13 yards to the SF25. Tackled by Muhammad Wilkerson.","(2:06) Lachlan Edwards punts for 33 yards to SF12. No return.","(2:44) Bryce Petty sacked at SF45 for no gain by DeForest Buckner.","(3:26) Bilal Powell rush up the middle for 3 yards to the SF45. Tackled by Gerald Hodges Jr..","(4:13) Bryce Petty pass to the right to Brandon Bostick for 3 yards to the SF48. Tackled by Jimmie Ward.","(4:55) Robby Anderson rush to the left for 13 yards to the NYJ49. Tackled by Ronald Blair.","(5:37) Bilal Powell rush to the right for 2 yards to the NYJ36. Tackled by Ronald Blair and Nick Bellore.","(5:42) 44 yard field goal attempt by Phil Dawson is NO GOOD. Holder: Bradley Pinion.","(6:05) Colin Kaepernick pass to the right to Quinton Patton for 6 yards to the NYJ26. Tackled by Juston Burris.","(6:44) Colin Kaepernick pass to the right to Quinton Patton for no gain to the NYJ32. Tackled by Jordan Jenkins.","(7:15) Carlos Hyde rush to the left for 1 yard to the NYJ32. Tackled by Jordan Jenkins.","(7:57) Colin Kaepernick pass to the middle to Blake Bell for 30 yards to the NYJ33. Tackled by Calvin Pryor.","(8:26) Colin Kaepernick rush to the right for 2 yards to the SF32. Tackled by David Harris. Penalty: Holding on New York (Buster Skrine) 5 yards.","(8:39) Lachlan Edwards punts for 54 yards to SF20. Jeremy Kerley return for 10 yards to SF30. Tackled by Josh Martin and Rontez Miles.","(9:14) Bryce Petty pass to the right to Bilal Powell for 8 yards to the NYJ26. Tackled by Jimmie Ward and DeForest Buckner.","(10:00) Bryce Petty sacked at NYJ18 for a loss of 10 yards by Gerald Hodges Jr..","(10:38) Bryce Petty pass to the left to Brandon Marshall for 4 yards to the NYJ28. Tackled by Tramaine Brock.","(10:45) Phil Dawson kicks off to the NYJ7. Nick Marshall return for 17 yards to NYJ24. Tackled by Jaquiski Tartt.","(10:45) Phil Dawson extra point is good.","(10:49) Shaun Draughn rush up the middle for 4 yards for a TOUCHDOWN.","(11:34) Carlos Hyde rush to the left for 47 yards to the NYJ4. Tackled by Marcus Gilchrist.","(12:08) Colin Kaepernick pass to the right to Quinton Patton for 19 yards to the SF49. Tackled by Darrelle Revis.","(12:34) Carlos Hyde rush to the left for 11 yards to the SF30. Tackled by Calvin Pryor.","(12:41) Lachlan Edwards punts for 35 yards to SF19. No return.","(12:44) Bryce Petty incomplete pass to the left intended for Robby Anderson.","(13:20) Matt Forte rush to the right for no gain to the NYJ46. Tackled by Chris Jones.","(13:57) Matt Forte rush to the right for 6 yards to the NYJ46. Tackled by Chris Jones.","(13:57) Phil Dawson kicks off to the NYJ40, out of bounds. No return.","(13:57) Phil Dawson extra point is good.","(14:04) Colin Kaepernick pass to the right to Carlos Hyde for 7 yards for a TOUCHDOWN.","(14:11) Bryce Petty pass intended for Quincy Enunwa INTERCEPTED by Jimmie Ward and returned for 8 yards. Tackled by Quincy Enunwa.","(14:50) Matt Forte rush to the left for 2 yards to the NYJ14. Tackled by Nick Bellore and Gerald Hodges Jr..","(15:00) Phil Dawson kicks off to the NYJ3. Nick Marshall return for 19 yards to NYJ22. Tackled by Jimmie Ward. Penalty: Holding on New York (Arthur Brown) -10 yards."]