["(0:23) Todd Gurley rush up the middle for 7 yards to the LA24. Tackled by Malliciah Goodman.","(0:55) Todd Gurley rush to the right for 6 yards to the LA17. Tackled by Paul Worrilow.","(1:09) Matt Bosher punts for 43 yards to LA28. Tavon Austin - no return. Tackled by Terron Ward. Penalty: Illegal Block on Los Angeles (Malcolm Brown) -10 yards.","(1:19) Matt Schaub incomplete pass to the right intended for Patrick DiMarco defensed by Michael Brockers.","(2:00) Terron Ward rush to the left for no gain to the Atl29. Tackled by Mark Barron.","(2:00) Two Minute Warning.","(2:44) Terron Ward rush to the left for 4 yards to the Atl29. Tackled by Mark Barron.","(2:44) Greg Zuerlein kicks off to the endzone. Touchback.","(2:44) Greg Zuerlein extra point is good.","(2:49) Jared Goff rush to the right for 2 yards for a TOUCHDOWN.","(2:52) Jared Goff incomplete pass to the left intended for Brian Quick defensed by Robert Alford.","(2:55) Jared Goff incomplete pass to the right intended for Kenny Britt defensed by Robert Alford.","(3:21) Jared Goff pass to the right to Pharoh Cooper for 19 yards to the Atl2. Tackled by Ricardo Allen.","(3:25) Jared Goff pass to the right to Tavon Austin for 11 yards to the Atl21.","(3:52) Jared Goff pass to the right to Pharoh Cooper for 2 yards to the Atl32. Tackled by Courtney Upshaw and LaRoy Reynolds.","(4:16) Jared Goff pass to the left to Mike Thomas for 16 yards to the Atl34. Tackled by Ricardo Allen.","(4:48) Jared Goff pass to the middle to Kenny Britt for 12 yards to the LA50. Tackled by Keanu Neal.","(5:34) Jared Goff pass to the middle to Todd Gurley for 4 yards to the LA38. Tackled by Keanu Neal.","(5:44) Penalty: Pass Interference on Los Angeles (Brian Quick) -10 yards.","(5:44) Penalty: Offside on Atlanta (Philip Wheeler) 5 yards.","(5:48) Jared Goff incomplete pass to the right intended for Tyler Higbee.","(6:19) Jared Goff pass to the right to Kenny Britt for 16 yards to the LA39. Tackled by Deji Olatoye.","(7:09) Jared Goff pass to the middle to Tyler Higbee for 8 yards to the LA23. Tackled by Paul Worrilow and Keanu Neal.","(7:43) Todd Gurley rush up the middle for a loss of 5 yards to the LA15. Tackled by Ra'Shede Hageman.","(7:58) Matt Bosher punts for 51 yards to LA24. Tavon Austin return for 6 yards to LA30. Tackled by C.J. Goodwin. Penalty: Illegal Block on Los Angeles (Nicholas Grigsby) -10 yards.","(8:45) Terron Ward rush to the right for a loss of 1 yard to the Atl25. Tackled by Alec Ogletree.","(9:32) Terron Ward rush to the left for 7 yards to the Atl26. Tackled by Ethan Westbrooks.","(10:13) Terron Ward rush to the left for no gain to the Atl19. Tackled by Cory Littleton.","(10:20) Johnny Hekker punts for 57 yards to Atl19. No return.","(10:53) Jared Goff pass to the right to Pharoh Cooper for 1 yard to the LA24. Tackled by Deion Jones.","(10:58) Jared Goff incomplete pass to the left intended for Todd Gurley.","(11:05) Jared Goff incomplete pass to the left intended for Kenny Britt defensed by Deji Olatoye.","(11:19) Matt Bosher punts for 42 yards to LA13. Tavon Austin return for 10 yards to LA23. Tackled by Josh Harris.","(11:24) Matt Schaub incomplete pass to the right intended for Aldrick Robinson.","(12:10) Terron Ward rush to the left for 3 yards to the Atl45. Tackled by Alec Ogletree.","(12:50) Terron Ward rush to the left for no gain to the Atl42. Tackled by T.J. McDonald and Aaron Donald.","(13:33) Terron Ward rush up the middle for 4 yards to the Atl42. Tackled by T.J. McDonald.","(14:12) Terron Ward rush up the middle for 3 yards to the Atl38. Tackled by Alec Ogletree.","(14:53) Terron Ward rush up the middle for 4 yards to the Atl35. Tackled by Eugene Sims.","(14:57) Greg Zuerlein kicks off to the Atl15. Aldrick Robinson return for 16 yards to Atl31. Tackled by Chase Reynolds.","(14:57) Greg Zuerlein extra point is good.","(15:00) Todd Gurley rush up the middle for 3 yards for a TOUCHDOWN.","(0:03) Todd Gurley rush up the middle for no gain to the Atl3. Tackled by Grady Jarrett and Jonathan Babineaux.","(0:07) Jared Goff incomplete pass to the left intended for Kenny Britt.","(0:50) Jared Goff pass to the middle to Brian Quick for 10 yards to the Atl3. Tackled by Brian Poole.","(0:58) Jared Goff incomplete pass to the left intended for Tyler Higbee defensed by Deji Olatoye.","(1:40) Jared Goff pass to the left to Kenny Britt for 8 yards to the Atl13. Tackled by Brian Poole.","(2:12) Jared Goff pass to the right to Todd Gurley for 6 yards to the Atl11. Tackled by Keanu Neal. Penalty: Illegal Block on Los Angeles (Kenny Britt) -10 yards.","(2:42) Penalty: Unnecessary Roughness on Atlanta (Ricardo Allen) 15 yards.","(2:50) Matt Bosher kicks off to the LA-1. Mike Thomas return for 41 yards to LA40. Tackled by Matt Bosher.","(2:50) Matt Bryant extra point is good.","(2:56) Jared Goff sacked at LA21 for a loss of 10 yards by Vic Beasley Jr.. FUMBLE, recovered by Atl (Vic Beasley Jr.) and returned for 21 yards for a TOUCHDOWN.","(3:26) Jared Goff pass to the right to Tavon Austin for a loss of 2 yards to the LA31. Tackled by Deion Jones.","(3:48) Jared Goff pass to the left to Kenny Britt for 12 yards to the LA33. Tackled by Deion Jones.","(3:56) Matt Bosher kicks off to the LA2. Mike Thomas return for 19 yards to LA21. Tackled by Brooks Reed and Eric Weems.","(3:56) Matt Bryant extra point is good.","(4:01) Tevin Coleman rush to the right for 6 yards for a TOUCHDOWN.","(4:33) Matt Ryan pass to the left to Nick Williams for 10 yards to the LA6. Tackled by Maurice Alexander.","(5:19) Matt Ryan pass to the middle to Devonta Freeman for 3 yards to the LA16. Tackled by William Hayes.","(5:57) Devonta Freeman rush to the left for 1 yard to the LA19. Tackled by Mark Barron.","(6:39) Matt Ryan pass to the right to Nick Williams for 19 yards to the LA20. Tackled by Maurice Alexander and Trumaine Johnson.","(7:25) Devonta Freeman rush to the right for no gain to the LA39. Tackled by Michael Brockers.","(7:59) Tevin Coleman rush to the left for 5 yards to the LA39. Tackled by Mark Barron.","(8:25) Tevin Coleman rush to the right for 10 yards to the LA44. Tackled by Mike Jordan.","(8:32) Malcolm Brown rush to the left for 2 yards to the Atl46. Tackled by Courtney Upshaw and Ricardo Allen. FUMBLE, recovered by Atl (Courtney Upshaw). Tackled by Rob Havenstein.","(9:21) Todd Gurley rush to the right for 2 yards to the Atl48. Tackled by Brooks Reed.","(10:05) Todd Gurley rush to the right for 9 yards to the LA50. Tackled by Jonathan Babineaux.","(10:34) Penalty: Holding on Atlanta (Robert Alford) 5 yards.","(11:16) Tavon Austin rush to the right for 4 yards to the LA36. Tackled by Keanu Neal.","(11:58) Todd Gurley rush up the middle for 8 yards to the LA32. Tackled by Ricardo Allen and Robert Alford.","(12:40) Jared Goff pass to the left to Tavon Austin for 9 yards to the LA24. Tackled by Grady Jarrett.","(13:13) Todd Gurley rush to the right for 2 yards to the LA15. Tackled by Dwight Freeney.","(13:18) Matt Bosher kicks off to the LA-2. Mike Thomas return for 15 yards to LA13. Tackled by Paul Worrilow and Eric Weems.","(13:18) Matt Bryant extra point is good.","(13:29) Matt Ryan pass to the right to Taylor Gabriel for 64 yards for a TOUCHDOWN.","(13:50) Matt Ryan pass to the right to Taylor Gabriel for 7 yards to the Atl21. Tackled by Alec Ogletree. Penalty: Horse Collar Tackle on Los Angeles (Alec Ogletree) 15 yards.","(14:33) Matt Ryan sacked at Atl14 for a loss of 6 yards by Aaron Donald.","(15:00) Penalty: Illegal Plyr Downfld on Atlanta (Alex Mack) -5 yards.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback.","(0:08) Matt Ryan sacked at Atl41 for a loss of 11 yards by William Hayes.","(0:12) Matt Ryan incomplete pass to the right intended for Aldrick Robinson.","(0:12) Atlanta Falcons timeout.","(0:17) Devonta Freeman rush up the middle for 5 yards to the Atl37. Tackled by Lamarcus Joyner. Penalty: Unnecessary Roughness on Los Angeles 15 yards.","(0:20) Matt Ryan incomplete pass to the right intended for Austin Hooper defensed by Trumaine Johnson.","(0:25) Matt Ryan incomplete pass to the right intended for Taylor Gabriel.","(0:36) Johnny Hekker punts for 52 yards to Atl32. No return.","(0:36) Atlanta Falcons timeout.","(0:42) Jared Goff pass to the right to Kenny Britt for 4 yards to the LA16. Tackled by Jalen Collins.","(0:47) Jared Goff incomplete pass to the right intended for Lance Kendricks defensed by Keanu Neal.","(1:16) Todd Gurley rush up the middle for 5 yards to the LA12. Tackled by Keanu Neal.","(1:28) Matt Bosher punts for 55 yards to LA6. Tavon Austin return for 1 yard to LA7. Tackled by Paul Worrilow.","(1:28) Los Angeles Rams timeout.","(1:55) Matt Ryan pass to the left to Justin Hardy for 6 yards to the Atl39. Tackled by T.J. McDonald.","(2:00) Matt Ryan incomplete pass to the left intended for Tevin Coleman.","(2:00) Two Minute Warning.","(2:30) Tevin Coleman rush to the right for 1 yard to the Atl33. Tackled by Ethan Westbrooks.","(2:52) Matt Ryan pass to the right to Tevin Coleman for 13 yards to the Atl32. Tackled by Lamarcus Joyner.","(3:30) Matt Ryan pass to the right to Austin Hooper for 5 yards to the Atl19. Tackled by Mark Barron.","(3:53) Matt Ryan pass to the right to Aldrick Robinson for 8 yards to the Atl14. Tackled by Trumaine Johnson.","(4:02) Johnny Hekker punts for 55 yards to Atl6. No return.","(4:07) Jared Goff incomplete pass to the right intended for Tavon Austin.","(4:53) Jared Goff sacked at LA39 for a loss of 11 yards by Vic Beasley Jr..","(5:37) Todd Gurley rush to the right for 4 yards to the LA50. Tackled by Ben Garland.","(5:42) Penalty: Illegal Plyr Downfld on Los Angeles (Andrew Donnal) -5 yards.","(5:58) Matt Bosher punts for 53 yards to LA24. Tavon Austin return for 27 yards to Atl49. Tackled by Patrick DiMarco and Eric Weems.","(6:04) Matt Ryan incomplete pass to the middle intended for Nick Williams.","(6:08) Matt Ryan incomplete pass to the left intended for Austin Hooper defensed by Mike Jordan.","(6:32) Tevin Coleman rush to the left for 6 yards to the Atl23. Tackled by Mark Barron.","(6:42) Johnny Hekker punts for 50 yards to Atl17. No return.","(6:47) Jared Goff incomplete pass to the middle intended for Lance Kendricks defensed by Deion Jones.","(7:33) Jared Goff pass to the middle to Lance Kendricks for 13 yards to the LA33. Tackled by Paul Worrilow.","(8:06) Penalty: Holding on Los Angeles (Greg Robinson) -10 yards.","(8:49) Todd Gurley rush to the right for 5 yards to the LA30. Tackled by Tyson Jackson and Paul Worrilow.","(8:54) Matt Bosher kicks off to the endzone. Touchback.","(8:54) Matt Bryant extra point is good.","(9:04) Jared Goff pass intended for Kenny Britt INTERCEPTED by Deion Jones and returned for 33 yards for a TOUCHDOWN.","(9:27) Penalty: False Start on Los Angeles (Rodger Saffold) -5 yards.","(10:04) Jared Goff pass to the left to Tavon Austin for 17 yards to the LA31. Tackled by Jalen Collins.","(10:21) Matt Bosher punts for 66 yards to LA14. No return.","(10:26) Matt Ryan incomplete pass to the left intended for Taylor Gabriel defensed by Eugene Sims.","(11:06) Devonta Freeman rush to the right for a loss of 1 yard to the Atl20. Tackled by Ethan Westbrooks.","(11:26) Matt Ryan pass to the right to Aldrick Robinson for 9 yards to the Atl21. Tackled by Trumaine Johnson.","(11:39) Johnny Hekker punts for 46 yards to Atl12. No return.","(11:45) Jared Goff incomplete pass to the right intended for Tavon Austin.","(12:33) Malcolm Brown rush up the middle for 10 yards to the LA42. Tackled by Keanu Neal.","(12:35) Jared Goff incomplete pass to the right intended for Brian Quick.","(12:45) Penalty: Illegal Plyr Downfld on Los Angeles (Rob Havenstein) -5 yards.","(13:22) Jared Goff pass to the left to Tavon Austin for 9 yards to the LA37.","(14:06) Malcolm Brown rush to the left for a loss of 5 yards to the LA28. Tackled by De'Vondre Campbell.","(14:45) Malcolm Brown rush up the middle for 7 yards to the LA33. Tackled by Deion Jones.","(14:53) Matt Bosher kicks off to the LA3. Mike Thomas return for 23 yards to LA26. Tackled by Eric Weems.","(14:53) Matt Bryant extra point is good.","(15:00) Matt Ryan pass to the right to Tevin Coleman for 6 yards for a TOUCHDOWN.","(0:06) Tevin Coleman rush to the right for 3 yards to the LA6. Tackled by Trumaine Johnson.","(0:25) Matt Ryan pass to the right to Levine Toilolo for 19 yards to the LA19. Tackled by T.J. McDonald. Penalty: Roughing Passer on Los Angeles (Matt Longacre) 10 yards.","(1:07) Matt Ryan pass to the left to Nick Williams for 8 yards to the LA38. Tackled by Maurice Alexander.","(1:49) Tevin Coleman rush to the right for 5 yards to the LA46. Tackled by William Hayes and Alec Ogletree.","(1:53) Matt Ryan incomplete pass to the right intended for Aldrick Robinson.","(2:14) Matt Ryan pass to the left to Aldrick Robinson for 25 yards to the Atl49. Tackled by Mike Jordan.","(2:35) Devonta Freeman rush to the left for 1 yard to the Atl24. Tackled by William Hayes.","(2:58) Matt Ryan pass to the right to Taylor Gabriel for 11 yards to the Atl23.","(3:06) Johnny Hekker punts for 46 yards to Atl12. No return.","(3:12) Jared Goff incomplete pass to the right intended for Tyler Higbee.","(3:58) Jared Goff sacked at LA42 for a loss of 6 yards by Vic Beasley Jr..","(4:31) Todd Gurley rush up the middle for 2 yards to the LA48. Tackled by Ricardo Allen.","(4:47) Matt Bosher punts for 53 yards to LA11. Tavon Austin return for 25 yards to LA36. Tackled by Levine Toilolo. Penalty: Holding on Atlanta (Paul Worrilow) 10 yards.","(5:33) Matt Ryan pass to the right to Devonta Freeman for 9 yards to the Atl36. Tackled by Dominique Easley.","(6:18) Taylor Gabriel rush to the right for no gain to the Atl27. Tackled by Mike Jordan.","(6:59) Tevin Coleman rush to the left for no gain to the Atl27. Tackled by Dominique Easley.","(7:38) Matt Ryan pass to the right to Nick Williams for 12 yards to the Atl27. Tackled by Dominique Easley.","(7:44) Johnny Hekker punts for 34 yards to Atl15. No return.","(8:28) Jared Goff pass to the left to Kenny Britt for 2 yards to the Atl49. Tackled by Jalen Collins.","(8:59) Jared Goff pass to the right to Tavon Austin for 6 yards to the LA49. Tackled by Brian Poole.","(9:05) Jared Goff incomplete pass to the left intended for Tavon Austin defensed by De'Vondre Campbell.","(9:21) Matt Bosher punts for 52 yards to LA38. Tavon Austin return for 5 yards to LA43. Tackled by C.J. Goodwin.","(9:27) Matt Ryan incomplete pass to the right intended for Taylor Gabriel.","(10:10) Devonta Freeman rush to the right for no gain to the Atl10. Tackled by Maurice Alexander.","(10:15) Matt Ryan incomplete pass to the middle intended for Devonta Freeman.","(10:23) Jared Goff pass intended for Kenny Britt INTERCEPTED by Ricardo Allen and returned for 3 yards. Tackled by Tavon Austin.","(11:08) Todd Gurley rush to the right for 2 yards to the Atl16. Tackled by Grady Jarrett.","(11:55) Todd Gurley rush to the left for 5 yards to the Atl18. Tackled by Brooks Reed and Keanu Neal.","(12:39) Tavon Austin rush to the right for 23 yards to the Atl23. Tackled by Ricardo Allen.","(13:13) Jared Goff pass to the right to Tavon Austin for 12 yards to the Atl46.","(13:53) Todd Gurley rush up the middle for 6 yards to the LA42. Tackled by Jonathan Babineaux.","(14:38) Jared Goff pass to the left to Todd Gurley for 12 yards to the LA36. Tackled by Deion Jones and Jalen Collins.","(14:43) Jared Goff incomplete pass to the right intended for Tavon Austin defensed by Robert Alford.","(14:50) Matt Bosher kicks off to the LA4. Mike Thomas return for 20 yards to LA24. Tackled by Joshua Perkins and C.J. Goodwin.","(14:50) Matt Bryant extra point is good.","(14:56) Matt Ryan pass to the left to Justin Hardy for 3 yards for a TOUCHDOWN.","(15:00) Matt Bosher kicks off to the LA-4. Mike Thomas - no return. FUMBLE, recovered by Atl (Paul Worrilow)."]