["(0:13) Matthew Stafford rush up the middle for a loss of 1 yard to the Det43.","(0:19) Matt Barkley incomplete pass to the middle intended for Joshua Bellamy defensed by Darius Slay.","(0:19) Chicago Bears timeout.","(0:25) Matt Barkley pass to the left to Cameron Meredith for 14 yards to the Det44. Tackled by Tavon Wilson.","(0:31) Matt Barkley incomplete pass to the left intended for Deonte Thompson defensed by Nevin Lawson.","(0:37) Matt Barkley pass to the left to Daniel Brown for 5 yards to the Chi42. Tackled by Adairius Barnes.","(0:48) Penalty: Holding on Chicago (Ted Larsen) -10 yards.","(0:58) Penalty: Holding on Chicago (Charles Leno Jr.) -10 yards.","(0:58) Chicago Bears timeout.","(1:03) Jeremy Langford rush up the middle for 3 yards to the Det43. Tackled by Kerry Hyder.","(1:25) Matt Barkley pass to the right to Daniel Brown for 8 yards to the Det46. Tackled by Nevin Lawson and Josh Bynes.","(1:31) Matt Barkley incomplete pass to the middle intended for Cameron Meredith.","(1:55) Matt Barkley pass to the middle to Joshua Bellamy for 6 yards to the Chi46. Tackled by Adairius Barnes.","(2:00) Matt Barkley pass to the right to Daniel Brown for 4 yards to the Chi40. Tackled by Tavon Wilson.","(2:00) Two Minute Warning.","(2:28) Matt Barkley pass to the middle to Daniel Brown for 7 yards to the Chi36. Tackled by Josh Bynes.","(3:10) Matt Barkley pass to the left to Deonte Thompson for 4 yards to the Chi29. Tackled by Tavon Wilson and Ezekiel Ansah.","(3:17) Matt Barkley incomplete pass to the right intended for Jordan Howard defensed by Josh Bynes.","(3:17) Sam Martin kicks off to the endzone. Touchback.","(3:17) Matt Prater extra point is good.","(3:27) Matthew Stafford rush to the right for 7 yards for a TOUCHDOWN.","(3:31) Matthew Stafford incomplete pass to the left intended for Dwayne Washington.","(3:37) Penalty: Pass Interference on Chicago (Bryce Callahan) 13 yards.","(4:10) Zach Zenner rush up the middle for 1 yard to the Chi20. Tackled by Pernell McPhee and Nick Kwiatkoski.","(4:59) Matthew Stafford pass to the left to Anquan Boldin for 23 yards to the Chi21. Tackled by Bryce Callahan.","(5:44) Matthew Stafford pass to the right to Joique Bell for a loss of 2 yards to the Chi44. Tackled by John Timu.","(6:14) Zach Zenner rush to the right for 11 yards to the Det43. Tackled by Leonard Floyd. Penalty: Face Mask on Chicago (Cornelius Washington) 15 yards.","(6:59) Matthew Stafford pass to the left to Marvin Jones Jr. for 8 yards to the Det32. Tackled by Bryce Callahan.","(7:07) Connor Barth kicks off to the Det-2. Andre Roberts return for 26 yards to Det24. Tackled by Sherrick McManis.","(7:07) Connor Barth extra point is good.","(7:14) Matthew Stafford pass intended for Anquan Boldin INTERCEPTED by Cre'von LeBlanc and returned for 24 yards for a TOUCHDOWN.","(7:18) Matthew Stafford incomplete pass to the right intended for Andre Roberts defensed by Cre'von LeBlanc.","(8:02) Zach Zenner rush to the right for 5 yards to the Det14. Tackled by John Timu.","(8:10) Patrick O'Donnell punts for 42 yards to Det9. No return.","(8:51) Matt Barkley sacked at Chi49 for a loss of 8 yards by Kerry Hyder.","(9:35) Matt Barkley pass to the right to Jeremy Langford for 1 yard to the Det43. Tackled by Asa Jackson and Darius Slay.","(9:41) Matt Barkley incomplete pass to the middle intended for Jordan Howard.","(10:20) Matt Barkley pass to the left to Jordan Howard for 19 yards to the Det44. Tackled by Brandon Copeland.","(10:27) Matt Barkley incomplete pass to the right intended for Joshua Bellamy defensed by Nevin Lawson.","(11:08) Ka'Deem Carey rush to the left for 2 yards to the Chi37. Tackled by Devin Taylor.","(11:46) Jordan Howard rush to the left for 9 yards to the Chi35. Tackled by A'Shawn Robinson.","(11:53) Penalty: Holding on Detroit (Asa Jackson) 5 yards.","(12:00) Matt Barkley incomplete pass to the left intended for Deonte Thompson.","(12:36) Jordan Howard rush to the left for 1 yard to the Chi21. Tackled by DeAndre Levy.","(12:42) Matthew Stafford pass intended for Golden Tate INTERCEPTED by Demontre Hurst defensed by Bryce Callahan. No return. Touchback.","(13:27) Dwayne Washington rush up the middle for 3 yards to the Chi9. Tackled by Akiem Hicks.","(14:09) Dwayne Washington rush up the middle for 3 yards to the Chi12. Tackled by John Timu and Pernell McPhee.","(14:15) Penalty: Pass Interference on Chicago (Cre'von LeBlanc) 23 yards.","(14:22) Matthew Stafford incomplete pass to the left intended for Golden Tate.","(15:00) Dwayne Washington rush to the right for no gain to the Chi38. Tackled by Mitch Unrein.","(0:32) Dwayne Washington rush to the left for 12 yards to the Chi38. Tackled by Adrian Amos.","(0:37) Matthew Stafford incomplete pass to the right intended for Golden Tate defensed by Cre'von LeBlanc.","(1:18) Dwayne Washington rush to the left for 5 yards to the Det50. Tackled by Akiem Hicks.","(1:57) Dwayne Washington rush to the left for 6 yards to the Det45. Tackled by Jonathan Bullard.","(2:39) Matthew Stafford pass to the right to Golden Tate for 9 yards to the Det39. Tackled by Willie Young.","(3:19) Dwayne Washington rush up the middle for 5 yards to the Det30. Tackled by John Timu.","(3:19) Connor Barth kicks off to the endzone. Touchback.","(3:19) Connor Barth extra point is good.","(3:26) Matt Barkley pass to the right to Cameron Meredith for 31 yards for a TOUCHDOWN.","(4:08) Matt Barkley pass to the right to Joshua Bellamy for 16 yards to the Det31. Tackled by Tavon Wilson.","(4:45) Jordan Howard rush up the middle for a loss of 3 yards to the Det47. Tackled by Josh Bynes.","(5:29) Jordan Howard rush to the left for 31 yards to the Det44. Tackled by Rafael Bush.","(5:35) Sam Martin kicks off to the Chi-1. Deonte Thompson return for 26 yards to Chi25. Tackled by Rafael Bush.","(5:40) Matt Prater 54 yard field goal attempt is GOOD. Holder: Sam Martin.","(5:46) Matthew Stafford incomplete pass to the middle intended for Anquan Boldin defensed by Akiem Hicks.","(6:32) Golden Tate rush to the right for a loss of 1 yard to the Chi36. Tackled by Leonard Floyd.","(6:38) Penalty: Offside on Chicago (Akiem Hicks) 5 yards.","(7:20) Dwayne Washington rush to the right for 2 yards to the Chi40. Tackled by Mitch Unrein and Cornelius Washington.","(8:08) Zach Zenner rush up the middle for 13 yards to the Chi42. Tackled by Cre'von LeBlanc and Adrian Amos.","(8:53) Matthew Stafford rush up the middle for 4 yards to the Det45. Tackled by Deon Bush.","(9:35) Dwayne Washington rush to the right for 7 yards to the Det41. Tackled by Adrian Amos.","(10:14) Matthew Stafford pass to the right to Eric Ebron for 9 yards to the Det34. Tackled by Deiondre' Hall.","(10:55) Dwayne Washington rush to the right for no gain to the Det25. Tackled by Nick Kwiatkoski.","(11:39) Dwayne Washington rush up the middle for 5 yards to the Det25. Tackled by Eddie Goldman and Akiem Hicks.","(11:48) Patrick O'Donnell punts for 52 yards to Det0. Touchback.","(12:26) Matt Barkley pass to the right to Daniel Brown for 11 yards to the Chi48. Tackled by Asa Jackson.","(13:06) Jeremy Langford rush up the middle for 1 yard to the Chi37. Tackled by A'Shawn Robinson.","(13:47) Matt Barkley pass to the right to Cameron Meredith for 4 yards to the Chi36. Tackled by Nevin Lawson.","(14:18) Penalty: Holding on Chicago (Josh Sitton) -10 yards.","(14:55) Matt Barkley pass to the left to Joshua Bellamy for 23 yards to the Chi42. Tackled by Tahir Whitehead.","(15:00) Sam Martin kicks off to the Chi1. Deonte Thompson return for 18 yards to Chi19. Tackled by Don Carey.","(0:19) Jordan Howard rush up the middle for 7 yards to the Chi32. Tackled by Tahir Whitehead.","(0:19) Sam Martin kicks off to the endzone. Touchback.","(0:19) Matt Prater extra point is good.","(0:24) Matthew Stafford pass to the right to Anquan Boldin for 16 yards for a TOUCHDOWN.","(0:24) Chicago Bears timeout.","(0:29) Penalty: Holding on Detroit (Riley Reiff) -10 yards.","(1:09) Matthew Stafford pass to the right to Dwayne Washington for 10 yards to the Chi6. Tackled by Nick Kwiatkoski and Deiondre' Hall.","(1:14) Matthew Stafford incomplete pass to the middle intended for Anquan Boldin defensed by Leonard Floyd.","(1:23) Matthew Stafford rush to the right for 5 yards to the Chi21. Tackled by Cornelius Washington. Penalty: Illegal Contact on Chicago (Tracy Porter) 5 yards.","(1:28) Matthew Stafford incomplete pass to the right intended for Andre Roberts.","(1:37) Matthew Stafford pass to the right to Golden Tate for 7 yards to the Chi26. Tackled by Cre'von LeBlanc.","(1:42) Matthew Stafford pass to the left to Anquan Boldin for 10 yards to the Chi33. Tackled by Harold Jones-Quartey.","(1:47) Matthew Stafford incomplete pass to the right intended for Golden Tate defensed by Cre'von LeBlanc.","(1:53) Matthew Stafford incomplete pass to the right intended for Eric Ebron.","(2:00) Penalty: Pass Interference on Chicago (Tracy Porter) 38 yards.","(2:00) Two Minute Warning.","(2:26) Matthew Stafford sacked at Det19 for no gain by Nick Kwiatkoski.","(2:34) Patrick O'Donnell punts for 50 yards to Det19. No return.","(2:43) Matt Barkley incomplete pass to the left intended for Joshua Bellamy.","(3:20) Jordan Howard rush to the right for a loss of 2 yards to the Chi31. Tackled by Ezekiel Ansah and DeAndre Levy.","(3:42) Penalty: Offside on Detroit (Ezekiel Ansah) 5 yards.","(4:17) Jordan Howard rush to the left for 3 yards to the Chi28. Tackled by Haloti Ngata.","(4:17) Sam Martin kicks off to the endzone. Touchback.","(4:21) Matt Prater 29 yard field goal attempt is GOOD. Holder: Sam Martin.","(4:25) Matthew Stafford incomplete pass to the left intended for Golden Tate defensed by Bryce Callahan.","(5:06) Matthew Stafford pass to the right to Zach Zenner for 5 yards to the Chi11. Tackled by Tracy Porter.","(5:51) Zach Zenner rush to the right for 2 yards to the Chi16. Tackled by Akiem Hicks.","(6:31) Matthew Stafford pass to the right to Marvin Jones Jr. for 48 yards to the Chi18. Tackled by Harold Jones-Quartey.","(7:18) Matthew Stafford pass to the left to Zach Zenner for 4 yards to the Det34. Tackled by Harold Jones-Quartey.","(7:25) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by Tracy Porter.","(7:55) Penalty: Illegal Use of Hands on Detroit (Graham Glasgow) -10 yards.","(8:35) Matthew Stafford pass to the left to Golden Tate for 14 yards to the Det40. Tackled by Bryce Callahan.","(9:06) Matthew Stafford sacked at Det26 for a loss of 3 yards by Mitch Unrein.","(9:54) Matthew Stafford pass to the right to Eric Ebron for 8 yards to the Det29. Tackled by Deon Bush.","(10:38) Matthew Stafford pass to the right to Marvin Jones Jr. for 4 yards to the Det21. Tackled by Tracy Porter.","(11:15) Zach Zenner rush up the middle for 2 yards to the Det17. Tackled by Nick Kwiatkoski.","(11:37) Patrick O'Donnell punts for 44 yards to Det18. Andre Roberts return for 7 yards to Det25. Tackled by Jonathan Anderson. Penalty: Illegal Block on Detroit (Joique Bell) -10 yards.","(11:43) Matt Barkley incomplete pass to the right intended for Joshua Bellamy defensed by Darius Slay.","(12:17) Jeremy Langford rush up the middle for no gain to the Chi38. Tackled by Tahir Whitehead.","(12:22) Matt Barkley incomplete pass to the left intended for Daniel Braverman.","(13:02) Matt Barkley pass to the left to Cameron Meredith for 4 yards to the Chi38. Tackled by Darius Slay.","(13:38) Jordan Howard rush to the right for 6 yards to the Chi34. Tackled by DeAndre Levy.","(14:16) Matt Barkley pass to the left to Deonte Thompson for 24 yards to the Chi28. Tackled by Nevin Lawson.","(14:27) Sam Martin punts for 57 yards to Chi4. No return.","(15:00) Dwayne Washington rush up the middle for 5 yards to the Det39. Tackled by John Timu.","(0:14) Zach Zenner rush to the left for 2 yards to the Det34. Tackled by Nick Kwiatkoski and Leonard Floyd.","(0:19) Matthew Stafford incomplete pass to the left. Penalty: Intentional Grounding on Detroit (Matthew Stafford) -10 yards.","(0:46) Matthew Stafford pass to the left to Eric Ebron for 14 yards to the Det42. Tackled by Harold Jones-Quartey.","(1:27) Dwayne Washington rush to the left for 3 yards to the Det28. Tackled by Akiem Hicks and John Timu.","(1:27) Connor Barth kicks off to the endzone. Touchback.","(1:32) Connor Barth 38 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(1:38) Matt Barkley incomplete pass to the left intended for Cameron Meredith defensed by Rafael Bush.","(1:43) Matt Barkley incomplete pass to the left intended for Jordan Howard.","(2:03) Penalty: Delay of Game on Chicago (Matt Barkley) -5 yards.","(2:28) Penalty: False Start on Chicago (Ted Larsen) -5 yards.","(3:11) Matt Barkley pass to the middle to Jordan Howard for 5 yards to the Det10. Tackled by Tahir Whitehead.","(3:48) Jordan Howard rush up the middle for 3 yards to the Det15. Tackled by Tahir Whitehead.","(3:48) Chicago Bears timeout.","(4:36) Matt Barkley pass to the right to Cameron Meredith for 8 yards to the Det18. Tackled by Darius Slay and Tahir Whitehead.","(5:17) Jordan Howard rush to the left for 1 yard to the Det26. Tackled by Tavon Wilson.","(6:00) Jordan Howard rush to the left for 28 yards to the Det27. Tackled by Nevin Lawson and Tyrunn Walker.","(6:41) Matt Barkley pass to the left to Cameron Meredith for 11 yards to the Chi45. Tackled by Josh Bynes.","(7:18) Matt Barkley pass to the right to Daniel Brown for 7 yards to the Chi34. Tackled by Josh Bynes.","(8:04) Jordan Howard rush to the right for 4 yards to the Chi27. Tackled by DeAndre Levy.","(8:40) Jordan Howard rush to the right for a loss of 2 yards to the Chi23. Tackled by Josh Bynes.","(8:44) Penalty: Offside on Detroit (Tahir Whitehead) 5 yards.","(8:53) Sam Martin punts for 45 yards to Chi0. Touchback.","(9:08) Matthew Stafford sacked at Chi45 for a loss of 11 yards by Akiem Hicks.","(9:54) Matthew Stafford pass to the left to Golden Tate for 5 yards to the Chi34. Tackled by Harold Jones-Quartey and Mitch Unrein.","(10:34) Dwayne Washington rush to the right for 3 yards to the Chi39. Tackled by Nick Kwiatkoski.","(11:14) Matthew Stafford pass to the left to Golden Tate for 12 yards to the Chi42. Tackled by Cre'von LeBlanc.","(11:58) Matthew Stafford pass to the right to Eric Ebron for 1 yard to the Det46. Tackled by Harold Jones-Quartey.","(12:42) Matthew Stafford pass to the left to Marvin Jones Jr. for 7 yards to the Det45. Tackled by Tracy Porter.","(13:27) Dwayne Washington rush to the right for 2 yards to the Det38. Tackled by Cre'von LeBlanc and Nick Kwiatkoski.","(14:13) Dwayne Washington rush to the left for 3 yards to the Det36. Tackled by Mitch Unrein.","(14:55) Matthew Stafford pass to the left to Golden Tate for 11 yards to the Det33. Tackled by Bryce Callahan.","(15:00) Connor Barth kicks off to the Det-1. Andre Roberts return for 23 yards to Det22. Tackled by Jonathan Anderson."]