["(0:37) Aaron Rodgers rush up the middle for a loss of 1 yard to the Phi34.","(0:53) Aaron Rodgers rush up the middle for a loss of 1 yard to the Phi33.","(1:05) Carson Wentz pass to the left to Darren Sproles for 14 yards to the Phi32. Tackled by Morgan Burnett.","(1:35) Carson Wentz sacked at Phi18 for a loss of 11 yards by Nick Perry.","(1:42) Carson Wentz sacked at Phi29 for a loss of 8 yards by Julius Peppers.","(1:45) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(1:52) Carson Wentz pass to the left to Dorial Green-Beckham for 24 yards to the Phi37. Tackled by Ladarius Gunter.","(1:57) Mason Crosby kicks off to the Phi1. Kenjon Barner return for 12 yards to Phi13. Tackled by Josh Hawkins.","(2:00) Mason Crosby 32 yard field goal attempt is GOOD. Holder: Jacob Schum.","(2:00) Two Minute Warning.","(2:09) James Starks rush to the left for 1 yard to the Phi14. Tackled by Jordan Hicks and Brandon Graham.","(2:53) James Starks rush to the right for 1 yard to the Phi15. Tackled by Rodney McLeod and Malcolm Jenkins.","(2:53) Philadelphia Eagles timeout.","(2:58) Aaron Ripkowski rush to the right for a loss of 2 yards to the Phi16. Tackled by Nigel Bradham.","(3:03) Aaron Rodgers pass to the right to Jordy Nelson for 21 yards to the Phi14.","(3:03) Green Bay Packers timeout.","(3:03) Penalty: Too Many Men on Field on Philadelphia 5 yards.","(3:03) Aaron Rodgers pass to the left to Davante Adams for 8 yards to the Phi40. Tackled by Nolan Carroll.","(3:07) Philadelphia Eagles timeout.","(3:13) Aaron Ripkowski rush up the middle for 2 yards to the Phi48. Tackled by Jordan Hicks.","(3:20) Penalty: Holding on Green Bay (Corey Linsley) -10 yards.","(3:20) Philadelphia Eagles timeout.","(3:25) James Starks rush to the right for no gain to the Phi40. Tackled by Brandon Graham and Fletcher Cox.","(4:10) James Starks rush to the right for 2 yards to the Phi40. Tackled by Vinny Curry.","(4:56) James Starks rush to the right for 8 yards to the Phi42. Tackled by Vinny Curry.","(5:45) Aaron Rodgers pass to the right to Jordy Nelson for 22 yards to the GB50. Tackled by Jaylen Watkins.","(5:51) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Jalen Mills.","(5:51) Green Bay Packers timeout.","(6:37) James Starks rush to the right for a loss of 2 yards to the GB28. Tackled by Vinny Curry.","(7:22) Aaron Rodgers pass to the right to Jordy Nelson for 6 yards to the GB30. Tackled by Jalen Mills.","(8:03) James Starks rush to the left for 6 yards to the GB24. Tackled by Nigel Bradham.","(8:28) Penalty: Offside on Philadelphia (Brandon Graham) 5 yards.","(9:10) Aaron Rodgers pass to the middle to Aaron Ripkowski for 9 yards to the GB13. Tackled by Malcolm Jenkins.","(9:52) James Starks rush to the left for no gain to the GB4. Tackled by Rodney McLeod.","(10:18) Penalty: Holding on Green Bay (Lane Taylor) -4 yards.","(10:26) Donnie Jones punts for 34 yards to GB12. Randall Cobb - no return. FUMBLE, recovered by GB (Randall Cobb). Penalty: Holding on Green Bay (Jeff Janis) -7 yards.","(10:32) Carson Wentz incomplete pass to the right intended for Bryce Treggs defensed by Damarious Randall.","(11:18)  FUMBLE, recovered by Phi (Carson Wentz). Carson Wentz sacked at GB46 for a loss of 10 yards by Clay Matthews.","(11:50) Carson Wentz pass to the right to Trey Burton for no gain to the GB36. Tackled by Morgan Burnett.","(12:24) Carson Wentz pass to the left to Darren Sproles for 17 yards to the GB36. Tackled by Mike Daniels.","(12:52) Carson Wentz rush to the right for 7 yards to the Phi32. Tackled by Damarious Randall. Penalty: Face Mask on Green Bay (Julius Peppers) 15 yards.","(12:56) Carson Wentz incomplete pass to the left intended for Trey Burton.","(13:28) Carson Wentz pass to the right to Wendell Smallwood for 10 yards to the Phi25. Tackled by Clay Matthews.","(13:53) Penalty: Pass Interference on Philadelphia (Dorial Green-Beckham) -10 yards.","(13:53) Mason Crosby kicks off to the endzone. Touchback.","(13:53) Mason Crosby extra point is good.","(13:56) Aaron Ripkowski rush up the middle for 1 yard for a TOUCHDOWN.","(13:59) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(14:05) Penalty: Holding on Philadelphia (Nolan Carroll) 2 yards.","(14:55) Aaron Rodgers pass to the left to Davante Adams for 23 yards to the Phi3. Tackled by Connor Barwin.","(15:00) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(0:32) James Starks rush to the left for no gain to the Phi26. Tackled by Vinny Curry and Beau Allen.","(1:20) Aaron Rodgers pass to the left to James Starks for 8 yards to the Phi26. Tackled by Nolan Carroll and Nigel Bradham.","(2:05) Aaron Rodgers pass to the left to James Starks for 5 yards to the Phi34. Tackled by Malcolm Jenkins.","(2:09) Aaron Rodgers incomplete pass to the right intended for Jared Cook defensed by Jalen Mills.","(2:46) Aaron Rodgers pass to the right to Jordy Nelson for 7 yards to the Phi39. Tackled by Jalen Mills.","(3:27) Aaron Rodgers pass to the right to James Starks for 3 yards to the Phi46. Tackled by Jordan Hicks.","(3:58) James Starks rush to the right for 5 yards to the Phi49. Tackled by Jalen Mills.","(4:02) Penalty: Roughing Passer on Philadelphia (Fletcher Cox) 15 yards.","(4:49) Aaron Rodgers pass to the left to Aaron Ripkowski for 6 yards to the GB31. Tackled by Nigel Bradham.","(5:21) James Starks rush to the left for no gain to the GB25. Tackled by Brandon Graham.","(5:21) Caleb Sturgis kicks off to the endzone. Touchback.","(5:26) Caleb Sturgis 50 yard field goal attempt is GOOD. Holder: Donnie Jones.","(5:30) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham defensed by Nick Perry.","(5:33) Carson Wentz incomplete pass to the right intended for Zach Ertz.","(6:09) Kenjon Barner rush up the middle for 2 yards to the GB32. Tackled by Joe Thomas.","(6:38) Carson Wentz pass to the middle to Kenjon Barner for 10 yards to the GB34. Tackled by Jayrone Elliott.","(7:07) Carson Wentz pass to the left to Zach Ertz for 16 yards to the GB44. Tackled by Ha Ha Clinton-Dix.","(7:11) Carson Wentz incomplete pass to the left intended for Darren Sproles.","(7:40) Darren Sproles rush to the left for 1 yard to the Phi40. Tackled by Letroy Guion.","(7:59) Carson Wentz pass to the right to Darren Sproles for 8 yards to the Phi39. Tackled by Damarious Randall.","(8:22) Carson Wentz pass to the right to Darren Sproles for 5 yards to the Phi31. Tackled by Morgan Burnett.","(8:48) Carson Wentz pass to the right to Trey Burton for 1 yard to the Phi26. Tackled by Damarious Randall.","(8:48) Mason Crosby kicks off to the endzone. Touchback.","(8:51) Mason Crosby 33 yard field goal attempt is GOOD. Holder: Jacob Schum.","(9:01) Aaron Rodgers incomplete pass to the right.","(9:43) Aaron Rodgers pass to the right to Jordy Nelson for 3 yards to the Phi15. Tackled by Leodis McKelvin.","(10:29) Christine Michael rush to the left for 4 yards to the Phi18. Tackled by Jordan Hicks.","(11:20) Aaron Rodgers pass to the right to Davante Adams for 50 yards to the Phi22. Tackled by Leodis McKelvin.","(11:28) Carson Wentz pass intended for Zach Ertz INTERCEPTED by Ha Ha Clinton-Dix and returned for 12 yards. Tackled by Dorial Green-Beckham.","(11:32) Carson Wentz incomplete pass to the right intended for Zach Ertz.","(12:11) Wendell Smallwood rush to the right for 3 yards to the GB45. Tackled by Joe Thomas.","(12:58) Wendell Smallwood rush to the right for 9 yards to the GB48. Tackled by Damarious Randall.","(13:42) Wendell Smallwood rush up the middle for 9 yards to the Phi43. Tackled by Quinten Rollins.","(13:51) Penalty: Offside on Green Bay (Nick Perry) 5 yards.","(14:23) Carson Wentz pass to the right to Jordan Matthews for 2 yards to the Phi29. Tackled by Damarious Randall.","(15:00) Wendell Smallwood rush up the middle for 2 yards to the Phi27. Tackled by Julius Peppers.","(15:00) Mason Crosby kicks off to the endzone. Touchback.","(0:21) Aaron Rodgers rush up the middle for a loss of 1 yard to the GB16.","(0:25) Caleb Sturgis kicks off to the GB-1. Ty Montgomery return for 18 yards to GB17. Tackled by Najee Goode.","(0:29) Caleb Sturgis 48 yard field goal attempt is GOOD. Holder: Donnie Jones.","(0:29) Green Bay Packers timeout.","(0:38) Carson Wentz pass to the left to Darren Sproles for 4 yards to the GB30. Tackled by Nick Perry.","(0:41) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham defensed by Quinten Rollins.","(0:47) Carson Wentz incomplete pass to the middle intended for Darren Sproles.","(1:07) Carson Wentz pass to the left to Dorial Green-Beckham for 5 yards to the GB34. Tackled by Ladarius Gunter.","(1:27) Carson Wentz pass to the right to Zach Ertz for 7 yards to the GB39. Tackled by Clay Matthews.","(1:27) Philadelphia Eagles timeout.","(1:34) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(1:39) Carson Wentz pass to the left to Bryce Treggs for 11 yards to the GB46. Tackled by Ladarius Gunter.","(1:48) Carson Wentz rush to the right for 17 yards to the Phi43.","(1:48) Penalty: Offside on Green Bay (Nick Perry) 5 yards.","(1:48) Green Bay Packers timeout.","(1:54) Carson Wentz pass to the left to Zach Ertz for 13 yards to the Phi21. Tackled by Morgan Burnett.","(1:54) Two Minute Warning.","(2:05) Carson Wentz sacked at Phi8 for a loss of 14 yards by Mike Daniels.","(2:49) Carson Wentz pass to the left to Jordan Matthews for 20 yards to the Phi22. Tackled by Damarious Randall.","(3:28) Wendell Smallwood rush up the middle for 1 yard to the Phi2. Tackled by Mike Daniels.","(3:28) Penalty: False Start on Philadelphia (Jason Peters) 0 yards.","(3:28) Philadelphia Eagles timeout.","(3:39) Jacob Schum punts for 43 yards to Phi1. No return.","(3:39) Green Bay Packers timeout.","(4:28) Aaron Rodgers pass to the left to James Starks for 7 yards to the Phi44. Tackled by Nigel Bradham.","(4:35) Aaron Rodgers incomplete pass to the middle intended for Jordy Nelson.","(5:17) Aaron Rodgers pass to the left to Randall Cobb for no gain to the GB49. Tackled by Malcolm Jenkins.","(5:52) Aaron Rodgers pass to the right to Randall Cobb for 8 yards to the GB49. Tackled by Nigel Bradham.","(6:32) James Starks rush up the middle for 4 yards to the GB41. Tackled by Nigel Bradham and Malcolm Jenkins.","(6:48) Penalty: False Start on Green Bay (Jared Cook) -5 yards.","(7:29) Aaron Rodgers pass to the middle to James Starks for 4 yards to the GB42. Tackled by Jordan Hicks.","(8:13) Aaron Rodgers pass to the right to Randall Cobb for 4 yards to the GB38. Tackled by Malcolm Jenkins.","(8:20) Aaron Rodgers incomplete pass to the left intended for Randall Cobb.","(8:37) Penalty: Offside on Philadelphia (Fletcher Cox) 5 yards.","(9:17) Aaron Rodgers pass to the left to Ty Montgomery for 3 yards to the GB29. Tackled by Jordan Hicks.","(10:01) Aaron Rodgers rush to the right for 4 yards to the GB26. Tackled by Jaylen Watkins.","(10:37) Aaron Rodgers pass to the left to Jeff Janis for 7 yards to the GB22. Tackled by Rodney McLeod.","(11:16) Ty Montgomery rush up the middle for 2 yards to the GB15. Tackled by Jaylen Watkins.","(11:23) Donnie Jones punts for 37 yards to GB13. No return.","(11:29) Carson Wentz incomplete pass to the left intended for Bryce Treggs defensed by Ladarius Gunter.","(12:17) Carson Wentz rush up the middle for 8 yards to the Phi50. Tackled by Ha Ha Clinton-Dix.","(12:58) Wendell Smallwood rush to the left for a loss of 2 yards to the Phi42. Tackled by Letroy Guion.","(13:35) Wendell Smallwood rush up the middle for 7 yards to the Phi44. Tackled by Quinten Rollins.","(14:12) Wendell Smallwood rush to the right for 6 yards to the Phi37. Tackled by Morgan Burnett.","(14:48) Carson Wentz pass to the right to Jordan Matthews for 17 yards to the Phi31. Tackled by Morgan Burnett.","(14:53) Mason Crosby kicks off to the Phi-2. Kenjon Barner return for 16 yards to Phi14. Tackled by Marwin Evans.","(14:53) Mason Crosby extra point is good.","(15:00) Aaron Rodgers pass to the left to Davante Adams for 20 yards for a TOUCHDOWN.","(0:22) Aaron Rodgers pass to the right to Randall Cobb for 11 yards to the Phi20. Tackled by Jaylen Watkins.","(0:59) James Starks rush to the left for 8 yards to the Phi31. Tackled by Jordan Hicks and Marcus Smith.","(1:03) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(1:30) Aaron Rodgers pass to the right to Jordy Nelson for 9 yards to the Phi39. Tackled by Leodis McKelvin.","(2:07) Aaron Rodgers pass to the right to Jordy Nelson for 13 yards to the Phi48. Tackled by Leodis McKelvin.","(2:41) James Starks rush up the middle for 2 yards to the GB39. Tackled by Jordan Hicks.","(3:17) James Starks rush to the right for 3 yards to the GB37. Tackled by Vinny Curry.","(3:40) Aaron Rodgers pass to the right to Ty Montgomery for 9 yards to the GB34. Tackled by Leodis McKelvin.","(3:40) Caleb Sturgis kicks off to the endzone. Touchback.","(3:40) Caleb Sturgis extra point is good.","(3:49) Carson Wentz rush to the right for 1 yard for a TOUCHDOWN.","(4:27) Darren Sproles rush to the left for 2 yards to the GB1. Tackled by Ha Ha Clinton-Dix.","(5:06) Carson Wentz pass to the right to Dorial Green-Beckham for 10 yards to the GB3. Tackled by Morgan Burnett and Carl Bradford.","(5:42) Carson Wentz pass to the left to Dorial Green-Beckham for 6 yards to the GB13. Tackled by Ladarius Gunter.","(6:27) Carson Wentz pass to the middle to Dorial Green-Beckham for 24 yards to the GB19. Tackled by Joe Thomas.","(6:59) Bryce Treggs rush to the right for 3 yards to the GB43. Tackled by Morgan Burnett.","(7:36) Carson Wentz pass to the left to Jordan Matthews for 8 yards to the GB46. Tackled by Ladarius Gunter.","(7:56) Carson Wentz pass to the right to Dorial Green-Beckham for 13 yards to the Phi46. Tackled by Micah Hyde.","(8:34) Wendell Smallwood rush to the left for 2 yards to the Phi33. Tackled by Joe Thomas.","(9:08) Darren Sproles rush up the middle for 3 yards to the Phi31. Tackled by Letroy Guion and Nick Perry.","(9:45) Carson Wentz pass to the left to Trey Burton for 9 yards to the Phi28. Tackled by Clay Matthews.","(9:51) Mason Crosby kicks off to the Phi-2. Kenjon Barner return for 21 yards to Phi19. Tackled by Jayrone Elliott.","(9:51) Mason Crosby extra point is good.","(9:55) Aaron Rodgers pass to the right to Davante Adams for 12 yards for a TOUCHDOWN.","(10:34) Aaron Rodgers rush to the left for 9 yards to the Phi12.","(11:16) James Starks rush up the middle for 4 yards to the Phi21. Tackled by Brandon Graham.","(11:59) Aaron Rodgers pass to the right to Jared Cook for 7 yards to the Phi25. Tackled by Jaylen Watkins.","(12:04) Aaron Rodgers incomplete pass to the right intended for Richard Rodgers.","(12:38) Aaron Rodgers pass to the right to Randall Cobb for 6 yards to the Phi32. Tackled by Brandon Graham.","(13:15) Aaron Rodgers pass to the left to Randall Cobb for 12 yards to the Phi38. Tackled by Malcolm Jenkins.","(13:41) Aaron Rodgers rush to the right for 16 yards to the GB50.","(14:23) Aaron Rodgers pass to the left to Jordy Nelson for 10 yards to the GB34. Tackled by Jordan Hicks.","(15:00) James Starks rush to the right for a loss of 1 yard to the GB24. Tackled by Mychal Kendricks.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback."]