["(0:28) Derek Carr rush up the middle for a loss of 4 yards to the Oak46.","(0:53) Derek Carr rush up the middle for a loss of 5 yards to the Oak50.","(1:00) Cam Newton sacked at Car45 for a loss of 11 yards by Khalil Mack. FUMBLE, recovered by Oak (Khalil Mack). Tackled by Chris Scott.","(1:05) Cam Newton incomplete pass to the middle intended for Greg Olsen.","(1:05) Carolina Panthers timeout.","(1:10) Cam Newton incomplete pass to the right.","(1:15) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(1:20) Cam Newton pass to the right to Devin Funchess for 11 yards to the Oak44. Tackled by Sean Smith.","(1:45) Cam Newton pass to the right to Greg Olsen for 20 yards to the Car45. Tackled by Antonio Hamilton.","(1:45) Sebastian Janikowski kicks off to the endzone. Touchback.","(1:47) Sebastian Janikowski 23 yard field goal attempt is GOOD. Holder: Marquette King.","(1:51) Derek Carr incomplete pass to the middle intended for Michael Crabtree.","(1:55) Derek Carr incomplete pass to the left intended for Andre Holmes.","(1:55) Carolina Panthers timeout.","(2:00) Latavius Murray rush up the middle for 1 yard to the Car5. Tackled by Kawann Short and Daryl Worley.","(2:00) Two Minute Warning.","(2:29) Latavius Murray rush up the middle for 2 yards to the Car6. Tackled by Thomas Davis.","(2:29) Carolina Panthers timeout.","(2:35) Latavius Murray rush up the middle for 2 yards to the Car8. Tackled by James Bradberry and Kurt Coleman.","(3:20) Latavius Murray rush up the middle for 7 yards to the Car10. Tackled by Daryl Worley.","(3:25) Derek Carr pass to the left to Michael Crabtree for 15 yards to the Car17. Tackled by Daryl Worley.","(4:07) Latavius Murray rush up the middle for 5 yards to the Car32. Tackled by Kony Ealy.","(4:15) Derek Carr pass to the left to Michael Crabtree for 49 yards to the Car37. Tackled by A.J. Klein.","(5:00) Derek Carr pass to the left to Seth Roberts for 5 yards to the Oak14. Tackled by Thomas Davis.","(5:05) Derek Carr rush to the right for a loss of 4 yards to the Oak9. Tackled by James Bradberry.","(5:15) Michael Palardy punts for 49 yards to Oak11. Jalen Richard return for 2 yards to Oak13. Tackled by Robert McClain.","(5:56) Cam Newton pass to the right to Kelvin Benjamin for 9 yards to the Car40. Tackled by Sean Smith.","(6:41) Cam Newton pass to the right to Mike Tolbert for 7 yards to the Car31. Tackled by Jihad Ward and Malcolm Smith.","(7:16) Penalty: Holding on Carolina (Andrew Norwell) -10 yards.","(7:55) Jonathan Stewart rush up the middle for 3 yards to the Car34. Tackled by Dan Williams.","(8:31) Cam Newton pass to the right to Ted Ginn Jr. for 11 yards to the Car31. Tackled by Antonio Hamilton.","(8:37) Sebastian Janikowski kicks off to the Car2. Fozzy Whittaker return for 18 yards to Car20. Tackled by Brynden Trawick and Keith McGill.","(8:37) Derek Carr 2 pt conversion pass to Seth Roberts is GOOD.","(8:42) Derek Carr pass to the middle to Clive Walford for 12 yards for a TOUCHDOWN.","(9:23) Derek Carr pass to the left to Clive Walford for 14 yards to the Car12. Tackled by Kurt Coleman.","(9:29) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(10:07) Jalen Richard rush to the left for a loss of 1 yard to the Car26. Tackled by Kawann Short.","(10:43) Derek Carr pass to the right to Michael Crabtree for 7 yards to the Car25. Tackled by James Bradberry.","(11:22) Latavius Murray rush to the left for 2 yards to the Car32. Tackled by Daryl Worley and Kawann Short.","(11:59) Derek Carr pass to the middle to Latavius Murray for 5 yards to the Car34. Tackled by A.J. Klein.","(12:24) Jalen Richard rush to the right for 9 yards to the Oak46. Tackled by A.J. Klein. Penalty: Face Mask on Carolina (A.J. Klein) 15 yards.","(12:56) Latavius Murray rush up the middle for 3 yards to the Oak37. Tackled by Kurt Coleman.","(13:26) Derek Carr pass to the left to Michael Crabtree for 9 yards to the Oak34. Tackled by Daryl Worley.","(13:26) Graham Gano kicks off to the endzone. Touchback.","(13:26) Graham Gano extra point is good.","(13:34) Cam Newton pass to the left to Kelvin Benjamin for 44 yards for a TOUCHDOWN.","(14:16) Cam Newton pass to the right to Devin Funchess for 8 yards to the Oak44. Tackled by Antonio Hamilton.","(14:21) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(15:00) Cam Newton pass to the right to Greg Olsen for 12 yards to the Car48. Tackled by Malcolm Smith.","(0:28) Jonathan Stewart rush up the middle for 2 yards to the Car36. Tackled by Khalil Mack and Justin Ellis.","(0:34) Penalty: Holding on Oakland (DJ Hayden) 5 yards.","(1:21) Fozzy Whittaker rush to the left for 5 yards to the Car29. Tackled by Cory James.","(1:23) Cam Newton incomplete pass to the left intended for Ted Ginn Jr. defensed by Bruce Irvin.","(1:31) Marquette King punts for 51 yards to Car24. No return.","(1:37) Derek Carr incomplete pass to the left intended for Amari Cooper defensed by Daryl Worley.","(1:41) Derek Carr incomplete pass to the left intended for Seth Roberts.","(1:46) Derek Carr incomplete pass to the left intended for Latavius Murray defensed by A.J. Klein.","(1:46) Graham Gano kicks off to the endzone. Touchback.","(1:46) Cam Newton 2 pt conversion pass is NO GOOD - intended for Greg Olsen.","(1:51) Jonathan Stewart rush up the middle for 3 yards for a TOUCHDOWN.","(2:44) Cam Newton pass to the left to Ted Ginn Jr. for 13 yards to the Oak3. Tackled by Bruce Irvin.","(3:22) Jonathan Stewart rush up the middle for no gain to the Oak16. Tackled by Bruce Irvin and Darius Latham.","(4:03) Jonathan Stewart rush up the middle for 7 yards to the Oak16. Tackled by Karl Joseph and Malcolm Smith.","(4:29) Cam Newton pass to the right to Greg Olsen for 5 yards to the Oak23. Tackled by Reggie Nelson.","(4:40) Derek Carr pass intended for Amari Cooper INTERCEPTED by Thomas Davis and returned for 31 yards. Tackled by Gabe Jackson.","(5:20) Jalen Richard rush to the left for a loss of 3 yards to the Oak50. Tackled by Paul Soliai.","(5:56) Derek Carr pass to the right to Michael Crabtree for 3 yards to the Car47. Tackled by Kurt Coleman.","(6:36) Jalen Richard rush up the middle for 5 yards to the Oak50. Tackled by Tre Boston.","(7:02) Derek Carr pass to the left to Amari Cooper for 3 yards to the Oak45. Tackled by Daryl Worley.","(7:43) Derek Carr pass to the left to Clive Walford for 17 yards to the Oak42. Tackled by Kurt Coleman.","(7:43) Graham Gano kicks off to the endzone. Touchback.","(7:43) Cam Newton 2 pt conversion pass is NO GOOD - intended for Corey Brown.","(7:53) Cam Newton pass to the middle to Ted Ginn Jr. for 88 yards for a TOUCHDOWN.","(7:57) Cam Newton incomplete pass to the left intended for Kelvin Benjamin defensed by Sean Smith.","(8:40) Jonathan Stewart rush up the middle for 4 yards to the Car12. Tackled by Dan Williams.","(8:53) Marquette King punts for 56 yards to Car16. Ted Ginn Jr. - no return. Tackled by James Cowser. Penalty: Holding on Carolina (Jeremy Cash) -8 yards.","(8:58) Matt McGloin incomplete pass to the right.","(9:15) Penalty: Illegal Shift on Oakland -5 yards.","(9:53) Latavius Murray rush to the right for 4 yards to the Oak33. Tackled by Thomas Davis.","(10:33) Latavius Murray rush to the left for 4 yards to the Oak29. Tackled by Daryl Worley.","(10:33) Graham Gano kicks off to the endzone. Touchback.","(10:33) Graham Gano extra point is BLOCKED.","(10:37) Jonathan Stewart rush to the left for 1 yard for a TOUCHDOWN.","(11:17) Jonathan Stewart rush to the left for no gain to the Oak1. Tackled by Daren Bates and Reggie Nelson.","(11:40) Penalty: Offside on Oakland (Bruce Irvin) 0 yards.","(11:44) Penalty: Pass Interference on Oakland (DJ Hayden) 2 yards.","(12:15) Jonathan Stewart rush to the right for no gain to the Oak3. Tackled by Malcolm Smith and Reggie Nelson.","(12:57) Jonathan Stewart rush up the middle for 11 yards to the Oak3. Tackled by Khalil Mack and Karl Joseph.","(13:43) Jonathan Stewart rush up the middle for 3 yards to the Oak14. Tackled by Cory James and Bruce Irvin.","(14:12) Ted Ginn Jr. rush to the left for 13 yards to the Oak17. Tackled by Reggie Nelson.","(14:18) Derek Carr rush up the middle for no gain to the Oak31. FUMBLE, recovered by Car (Thomas Davis).","(14:56) Derek Carr pass to the right to Michael Crabtree for 9 yards to the Oak31. Tackled by James Bradberry.","(15:00) Graham Gano kicks off to the Oak4. Jalen Richard return for 18 yards to Oak22. Tackled by David Mayo.","(0:18) Fozzy Whittaker rush up the middle for 5 yards to the Car30. Tackled by Malcolm Smith.","(0:59) Fozzy Whittaker rush up the middle for no gain to the Car25. Tackled by Cory James.","(0:59) Sebastian Janikowski kicks off to the endzone. Touchback.","(0:59) Sebastian Janikowski extra point is good.","(1:04) Cam Newton pass intended for Fozzy Whittaker INTERCEPTED by Khalil Mack and returned for 6 yards for a TOUCHDOWN.","(1:46) Fozzy Whittaker rush to the right for 4 yards to the Car13. Tackled by Khalil Mack.","(1:53) Marquette King punts for 46 yards to Car9. No return.","(2:00) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(2:00) Two Minute Warning.","(2:38) Penalty: Offside on Carolina (Charles Johnson) 5 yards.","(2:46) Derek Carr sacked at Oak40 for a loss of 5 yards by Charles Johnson.","(3:29) Latavius Murray rush to the left for 3 yards to the Oak45. Tackled by Thomas Davis.","(3:42) Michael Palardy punts for 55 yards to Oak36. Jalen Richard return for 6 yards to Oak42. Tackled by Colin Jones.","(3:51) Cam Newton incomplete pass to the right intended for Kelvin Benjamin defensed by Sean Smith. Penalty: Unsports. Conduct on Carolina -8 yards.","(4:26) Cam Newton rush up the middle for 3 yards to the Car17. Tackled by Jihad Ward.","(4:30) Cam Newton incomplete pass to the left intended for Fozzy Whittaker.","(4:49) Penalty: Holding on Carolina (Devin Funchess) -10 yards.","(4:57) Marquette King punts for 39 yards to Car24. No return.","(5:01) Derek Carr incomplete pass to the left intended for Michael Crabtree.","(5:42) Jalen Richard rush to the right for 2 yards to the Oak37. Tackled by Tre Boston.","(6:20) Latavius Murray rush to the left for 2 yards to the Oak35. Tackled by Kony Ealy.","(6:30) Michael Palardy punts for 47 yards to Oak28. Jalen Richard return for 5 yards to Oak33. Tackled by Michael Griffin.","(6:35) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(6:42) Cam Newton incomplete pass to the right intended for Jonathan Stewart.","(6:42) Carolina Panthers timeout.","(6:49) Cam Newton incomplete pass to the left intended for Ted Ginn Jr. defensed by DJ Hayden.","(6:49) Sebastian Janikowski kicks off to the endzone. Touchback.","(6:53) Sebastian Janikowski 23 yard field goal attempt is GOOD. Holder: Marquette King.","(6:59) Derek Carr incomplete pass to the left intended for Amari Cooper defensed by Daryl Worley.","(7:05) Derek Carr incomplete pass to the right intended for Clive Walford.","(7:45) Latavius Murray rush to the left for 1 yard to the Car5. Tackled by Kony Ealy and Kawann Short.","(8:32) Derek Carr pass to the right to Michael Crabtree for 10 yards to the Car6. Tackled by Tre Boston.","(9:14) Derek Carr pass to the left to Amari Cooper for 3 yards to the Car16. Tackled by Daryl Worley.","(10:00) Jalen Richard rush to the left for 8 yards to the Car19. Tackled by Kurt Coleman and Thomas Davis.","(10:24) Derek Carr pass to the left to Michael Crabtree for 8 yards to the Car27. Tackled by Daryl Worley.","(10:30) Penalty: Pass Interference on Carolina (James Bradberry) 11 yards.","(10:41) Michael Palardy punts for 45 yards to Oak45. Jalen Richard return for 9 yards to Car46. Tackled by Jeremy Cash.","(11:16) Cam Newton sacked at Car10 for a loss of 6 yards by Bruce Irvin.","(12:03) Cam Newton rush up the middle for no gain to the Car16. FUMBLE, recovered by Car (Cam Newton).","(12:42) Jonathan Stewart rush to the right for 4 yards to the Car16. Tackled by Stacy McGee and Karl Joseph.","(12:48) Sebastian Janikowski kicks off to the Car1. Fozzy Whittaker return for 11 yards to Car12. Tackled by Johnny Holton.","(12:48) Sebastian Janikowski extra point is good.","(12:52) Latavius Murray rush to the left for 4 yards for a TOUCHDOWN.","(12:52) Oakland Raiders timeout.","(13:39) Derek Carr pass to the right to Johnny Holton for 30 yards to the Car4. Tackled by Kurt Coleman.","(14:17) Latavius Murray rush to the left for a loss of 3 yards to the Car34. Tackled by Daryl Worley.","(15:00) Latavius Murray rush to the right for 6 yards to the Car31. Tackled by Kyle Love.","(0:16) Derek Carr pass to the left to Amari Cooper for 7 yards to the Car37. Tackled by Tre Boston.","(0:20) Derek Carr incomplete pass to the middle intended for Michael Crabtree.","(1:00) Derek Carr pass to the left to Taiwan Jones for 15 yards to the Car44. Tackled by Thomas Davis.","(1:36) Latavius Murray rush to the left for 2 yards to the Oak41. Tackled by Kawann Short and Kurt Coleman.","(1:36) Oakland Raiders timeout.","(2:24) Derek Carr pass to the right to Mychal Rivera for 8 yards to the Oak39. Tackled by James Bradberry.","(3:05) Latavius Murray rush up the middle for 2 yards to the Oak31. Tackled by Kurt Coleman and Kawann Short.","(3:10) Graham Gano kicks off to the Oak1. Jalen Richard return for 28 yards to Oak29. Tackled by Jared Norris.","(3:10) Graham Gano extra point is good.","(3:16) Cam Newton rush to the left for 3 yards for a TOUCHDOWN.","(3:20) Penalty: Pass Interference on Oakland (Karl Joseph) 9 yards.","(4:05) Jonathan Stewart rush up the middle for 1 yard to the Oak12. Tackled by Khalil Mack and Denico Autry.","(4:43) Jonathan Stewart rush up the middle for 47 yards to the Oak13. Tackled by DJ Hayden.","(4:48) Penalty: Roughing Passer on Oakland (Stacy McGee) 15 yards.","(4:48) Sebastian Janikowski kicks off to the endzone. Touchback.","(4:48) Sebastian Janikowski extra point is good.","(4:54) Derek Carr pass to the left to Seth Roberts for 2 yards for a TOUCHDOWN.","(5:39) Derek Carr pass to the middle to Jamize Olawale for 8 yards to the Car2. Tackled by Kurt Coleman and Tre Boston.","(6:19) Latavius Murray rush to the left for a loss of 4 yards to the Car10. Tackled by Michael Griffin and Wes Horton.","(7:02) Derek Carr pass to the right to Seth Roberts for 24 yards to the Car6. Tackled by Tre Boston.","(7:19) Derek Carr pass to the right to Latavius Murray for 32 yards to the Car30. Tackled by James Bradberry.","(7:30) Michael Palardy punts for 42 yards to Oak26. Jalen Richard return for 12 yards to Oak38. Tackled by Jeremy Cash and Robert McClain.","(8:05) Cam Newton pass to the right to Mike Tolbert for 7 yards to the Car32. Tackled by Reggie Nelson and Sean Smith.","(8:10) Cam Newton incomplete pass to the right intended for Kelvin Benjamin defensed by Sean Smith.","(8:52) Jonathan Stewart rush up the middle for 2 yards to the Car25. Tackled by Khalil Mack.","(9:12) Cam Newton pass to the right to Greg Olsen for 8 yards to the Car23.","(9:54) Jonathan Stewart rush up the middle for 4 yards to the Car15. Tackled by Justin Ellis.","(10:01) Cam Newton incomplete pass to the left intended for Ted Ginn Jr..","(10:10) Marquette King punts for 47 yards to Car11. No return.","(10:21) Derek Carr rush to the right for 1 yard to the Oak42. Tackled by A.J. Klein. FUMBLE, recovered by Oak.","(10:59) Derek Carr pass to the right to Mychal Rivera for 5 yards to the Oak41. Tackled by A.J. Klein and Robert McClain.","(11:44) Jalen Richard rush to the right for 3 yards to the Oak36. Tackled by Kurt Coleman and Charles Johnson.","(12:21) Derek Carr pass to the left to Amari Cooper for 9 yards to the Oak33. Tackled by Daryl Worley.","(12:54) Derek Carr pass to the left to Latavius Murray for 6 yards to the Oak24. Tackled by Tre Boston and Daryl Worley.","(13:30) Latavius Murray rush to the right for 2 yards to the Oak18. Tackled by Thomas Davis.","(13:42) Michael Palardy punts for 42 yards to Oak26. No return. Penalty: Holding on Oakland (Antonio Hamilton) -10 yards.","(13:45) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(14:23) Jonathan Stewart rush to the left for 4 yards to the Car32. Tackled by Cory James and Malcolm Smith.","(15:00) Cam Newton pass to the right to Ted Ginn Jr. for 3 yards to the Car28. Tackled by DJ Hayden.","(15:00) Sebastian Janikowski kicks off to the endzone. Touchback."]