["(0:29) Marcus Mariota rush up the middle for a loss of 1 yard to the Ten6.","(0:34) Matt Barkley incomplete pass to the right intended for Deonte Thompson.","(0:38) Matt Barkley incomplete pass to the left intended for Deonte Thompson defensed by Brice McCain.","(0:42) Matt Barkley incomplete pass to the left intended for Daniel Brown defensed by Wesley Woodyard.","(0:47) Matt Barkley incomplete pass to the right intended for Joshua Bellamy.","(0:47) Tennessee Titans timeout.","(1:04) Matt Barkley pass to the left to Marquess Wilson for 23 yards to the Ten7. Tackled by LeShaun Sims.","(1:29) Matt Barkley pass to the left to Marquess Wilson for 21 yards to the Ten30. Tackled by Da'Norris Searcy.","(1:34) Matt Barkley incomplete pass to the right intended for Deonte Thompson.","(1:56) Matt Barkley pass to the middle to Marquess Wilson for 14 yards to the Chi49. Tackled by LeShaun Sims.","(2:06) Two Minute Warning.","(2:06) Brett Kern punts for 43 yards to Chi31. Eddie Royal return for 4 yards to Chi35. Tackled by Kevin Byard.","(2:06) Chicago Bears timeout.","(2:10) Marcus Mariota pass to the middle to DeMarco Murray for 1 yard to the Ten26. Tackled by Eddie Goldman.","(2:52) Derrick Henry rush to the right for 3 yards to the Ten25. Tackled by C.J. Wilson.","(2:52) Chicago Bears timeout.","(3:00) Derrick Henry rush to the left for 5 yards to the Ten22. Tackled by Cre'von LeBlanc.","(3:06) Connor Barth kicks off to the Ten4. Kendall Wright return for 13 yards to Ten17. Tackled by Chris Prosinski.","(3:06) Connor Barth extra point is good.","(3:11) Matt Barkley pass to the right to Deonte Thompson for 6 yards for a TOUCHDOWN.","(3:11) Chicago Bears timeout.","(3:28) Matt Barkley pass to the right to Deonte Thompson for 8 yards to the Ten6. Tackled by LeShaun Sims.","(3:32) Matt Barkley incomplete pass to the middle intended for Cameron Meredith.","(3:37) Matt Barkley incomplete pass to the left intended for Marquess Wilson.","(4:08) Matt Barkley pass to the right to Joshua Bellamy for 15 yards to the Ten14. Tackled by Perrish Cox.","(4:08) Penalty: False Start on Chicago (Cameron Meredith) -5 yards.","(4:36) Matt Barkley pass to the middle to Joshua Bellamy for 12 yards to the Ten24. Tackled by LeShaun Sims.","(4:42) Matt Barkley incomplete pass to the left intended for Joshua Bellamy.","(4:47) Penalty: Holding on Chicago (Cody Whitehair) -10 yards.","(5:20) Matt Barkley pass to the right to Deonte Thompson for 9 yards to the Ten26. Tackled by Perrish Cox.","(5:49) Matt Barkley pass to the middle to Marquess Wilson for 19 yards to the Ten35. Tackled by Kevin Byard.","(5:52) Matt Barkley incomplete pass to the right intended for Cameron Meredith.","(5:59) Matt Barkley incomplete pass to the right intended for Cameron Meredith defensed by Kevin Byard.","(6:29) Matt Barkley pass to the left to Jordan Howard for 15 yards to the Chi46. Tackled by Derrick Morgan.","(6:35) Matt Barkley incomplete pass to the left intended for Deonte Thompson.","(6:42) Brett Kern punts for 47 yards to Chi31. No return.","(6:53) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(7:41) DeMarco Murray rush to the left for 5 yards to the Ten22. Tackled by Willie Young.","(8:16) DeMarco Murray rush to the right for a loss of 2 yards to the Ten17. Tackled by Adrian Amos.","(8:23) Connor Barth kicks off to the Ten4. Kendall Wright return for 15 yards to Ten19. Tackled by Christian Jones.","(8:23) Connor Barth extra point is good.","(8:28) Matt Barkley pass to the right to Marquess Wilson for 8 yards for a TOUCHDOWN.","(8:55) Matt Barkley pass to the left to Joshua Bellamy for 5 yards to the Ten8. Tackled by Avery Williamson.","(9:24) Matt Barkley pass to the right to Cameron Meredith for 11 yards to the Ten13. Tackled by Perrish Cox.","(9:28) Matt Barkley incomplete pass to the left intended for Marquess Wilson.","(9:34) Matt Barkley incomplete pass to the left intended for Jeremy Langford defensed by Wesley Woodyard.","(10:06) Jordan Howard rush to the right for 2 yards to the Ten24. Tackled by Rashad Johnson and Karl Klug.","(10:45) Matt Barkley pass to the middle to Daniel Brown for 9 yards to the Ten26. Tackled by Kevin Byard.","(11:20) Matt Barkley pass to the left to Cameron Meredith for 8 yards to the Ten35. Tackled by Avery Williamson.","(11:58) Matt Barkley pass to the right to Jordan Howard for 5 yards to the Ten43. Tackled by Jurrell Casey.","(12:02) Matt Barkley incomplete pass to the left intended for Joshua Bellamy.","(12:29) Matt Barkley pass to the right to Daniel Brown for 8 yards to the Ten48. Tackled by Kevin Byard.","(12:37) Matt Barkley incomplete pass to the left intended for Marquess Wilson.","(13:14) Jordan Howard rush to the left for 5 yards to the Chi44. Tackled by Al Woods.","(13:45) Matt Barkley pass to the left to Deonte Thompson for 14 yards to the Chi39. Tackled by Jason McCourty.","(13:45) Ryan Succop kicks off to the endzone. Touchback.","(13:50) Ryan Succop 31 yard field goal attempt is GOOD. Holder: Brett Kern.","(14:37) Marcus Mariota pass to the left to DeMarco Murray for 16 yards to the Chi13. Tackled by Adrian Amos.","(14:46) Marcus Mariota incomplete pass to the right intended for Delanie Walker.","(14:53) Penalty: Face Mask on Tennessee (Taylor Lewan) -15 yards.","(15:00) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(0:05) Marcus Mariota pass to the left to Harry Douglas for 35 yards to the Chi14. Tackled by Bryce Callahan.","(0:49) DeMarco Murray rush to the left for a loss of 1 yard to the Chi49. Tackled by Danny Trevathan and Jonathan Bullard.","(1:18) Penalty: Holding on Tennessee (Anthony Fasano) -10 yards.","(1:58) DeMarco Murray rush to the right for 10 yards to the Chi38. Tackled by Nick Kwiatkoski.","(2:06) Patrick O'Donnell punts for 43 yards to Chi48. No return.","(2:45) Matt Barkley rush up the middle for no gain to the Chi17. FUMBLE, recovered by Chi (Jordan Howard).","(3:26) Jordan Howard rush to the left for 7 yards to the Chi17. Tackled by Wesley Woodyard.","(4:00) Jordan Howard rush to the left for 2 yards to the Chi10. Tackled by Austin Johnson.","(4:07) Ryan Succop kicks off to the Chi-1. Deonte Thompson return for 17 yards to Chi16. Tackled by Kevin Byard. Penalty: Holding on Chicago (Ben Braunecker) -8 yards.","(4:12) Ryan Succop 19 yard field goal attempt is GOOD. Holder: Brett Kern.","(4:59) DeMarco Murray rush to the right for no gain to the Chi1. Tackled by C.J. Wilson and Sam Acho.","(5:38) DeMarco Murray rush to the right for 2 yards to the Chi1. Tackled by Cornelius Washington.","(6:20) DeMarco Murray rush to the right for 3 yards to the Chi3. Tackled by Tracy Porter. FUMBLE, recovered by Ten (Anthony Fasano).","(7:09) Marcus Mariota rush to the right for 29 yards to the Chi6. Tackled by Deon Bush.","(7:51) Derrick Henry rush to the right for 6 yards to the Chi35. Tackled by Danny Trevathan.","(8:31) DeMarco Murray rush to the right for 3 yards to the Chi41. Tackled by Pernell McPhee.","(9:11) Marcus Mariota pass to the left to Rishard Matthews for 11 yards to the Chi44. Tackled by Nick Kwiatkoski.","(9:19) Marcus Mariota incomplete pass to the right intended for Kendall Wright.","(10:03) DeMarco Murray rush to the right for 1 yard to the Ten45. Tackled by Cornelius Washington.","(10:36) Marcus Mariota pass to the right to Rishard Matthews for 24 yards to the Ten44. Tackled by Bryce Callahan.","(10:44) Matt Barkley pass intended for Cameron Meredith INTERCEPTED by Da'Norris Searcy. No return. Touchback.","(10:48) Matt Barkley incomplete pass to the left intended for Cameron Meredith.","(11:29) Jordan Howard rush to the left for 1 yard to the Ten5. Tackled by Brian Orakpo.","(12:08) Matt Barkley pass to the right to Marquess Wilson for 17 yards to the Ten6. Tackled by Brice McCain.","(12:45) Jordan Howard rush to the left for 1 yard to the Ten23. Tackled by Jurrell Casey.","(13:17) Matt Barkley pass to the right to Ben Braunecker for 14 yards to the Ten24. Tackled by Kevin Byard.","(13:44) Matt Barkley pass to the right to Ka'Deem Carey for 12 yards to the Ten38. Tackled by Avery Williamson.","(14:28) Jordan Howard rush to the left for 2 yards to the Chi50. Tackled by Avery Williamson.","(14:58) Jordan Howard rush to the right for 5 yards to the Chi48. Tackled by Wesley Woodyard.","(15:00) Connor Barth onside kickoff to the Chi43. Onside kick recovered by kicking team by Adrian Amos.","(0:29) DeMarco Murray rush to the left for 6 yards to the Ten17. Tackled by Eddie Goldman.","(0:37) Penalty: Face Mask on Tennessee (Taylor Lewan) -10 yards.","(0:44) Patrick O'Donnell punts for 45 yards to Ten21. No return.","(0:49) Matt Barkley incomplete pass to the left intended for Joshua Bellamy.","(1:12) Matt Barkley pass to the left to Joshua Bellamy for 9 yards to the Chi34. Tackled by Jason McCourty.","(1:15) Matt Barkley incomplete pass to the left intended for Jeremy Langford.","(1:15) Ryan Succop kicks off to the endzone. Touchback.","(1:15) Ryan Succop extra point is good.","(1:23) Marcus Mariota pass to the right to Rishard Matthews for 29 yards for a TOUCHDOWN.","(1:25) Marcus Mariota incomplete pass to the middle intended for Rishard Matthews defensed by Tracy Porter.","(1:30) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(1:47) Marcus Mariota pass to the middle to Harry Douglas for 25 yards to the Chi29. Tackled by Bryce Callahan.","(2:00) Penalty: Illegal Use of Hands on Chicago (Akiem Hicks) 5 yards.","(2:00) Two Minute Warning.","(2:15) Marcus Mariota pass to the left to Tajae Sharpe for 6 yards to the Ten41. Tackled by Cre'von LeBlanc.","(2:25) Patrick O'Donnell punts for 55 yards to Ten27. Marc Mariani return for 8 yards to Ten35. Tackled by John Timu.","(3:15) Jordan Howard rush to the right for 10 yards to the Chi18. Tackled by Avery Williamson and Da'Norris Searcy.","(3:53) Matt Barkley pass to the left to Eddie Royal for a loss of 6 yards to the Chi8. Tackled by Wesley Woodyard.","(4:19) Penalty: Pass Interference on Chicago (Logan Paulsen) -10 yards.","(5:05) Jordan Howard rush to the left for 3 yards to the Chi24. Tackled by Avery Williamson.","(5:40) Jordan Howard rush to the right for 10 yards to the Chi21. Tackled by Wesley Woodyard.","(5:48) Brett Kern punts for 44 yards to Chi11. No return.","(5:53) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(6:38) DeMarco Murray rush to the right for 3 yards to the Ten45. Tackled by Sam Acho.","(7:18) DeMarco Murray rush to the right for 4 yards to the Ten42. Tackled by Pernell McPhee.","(7:23) Penalty: Holding on Chicago (Bryce Callahan) 5 yards.","(8:08) DeMarco Murray rush to the left for no gain to the Ten33. Tackled by Eddie Goldman.","(8:15) Marcus Mariota incomplete pass to the right intended for Anthony Fasano defensed by Adrian Amos.","(8:25) Matt Barkley pass intended for Ben Braunecker INTERCEPTED by Wesley Woodyard and returned for 21 yards. Tackled by Ted Larsen.","(8:57) Matt Barkley pass to the right to Marquess Wilson for 5 yards to the Ten16. Tackled by LeShaun Sims.","(9:05) Penalty: Pass Interference on Tennessee (LeShaun Sims) 45 yards.","(9:11) Ryan Succop kicks off to the Chi12. Ka'Deem Carey return for 22 yards to Chi34. Tackled by Nate Palmer.","(9:11) Ryan Succop extra point is good.","(9:16) Marcus Mariota pass to the left to Delanie Walker for 4 yards for a TOUCHDOWN.","(10:01) DeMarco Murray rush to the left for a loss of 1 yard to the Chi4. Tackled by Nick Kwiatkoski and Pernell McPhee.","(10:40) Derrick Henry rush to the left for 6 yards to the Chi3. Tackled by Adrian Amos and Nick Kwiatkoski.","(11:16) Derrick Henry rush to the left for 17 yards to the Chi9. Tackled by Deon Bush.","(12:02) Marcus Mariota pass to the right to DeMarco Murray for 14 yards to the Chi26. Tackled by Cornelius Washington.","(12:42) Marcus Mariota rush to the right for 11 yards to the Chi40. Tackled by Pernell McPhee.","(13:25) DeMarco Murray rush to the left for 6 yards to the Ten49. Tackled by Cre'von LeBlanc.","(14:11) Marcus Mariota rush to the right for 7 yards to the Ten43.","(14:17) Patrick O'Donnell punts for 39 yards to Ten36. No return.","(14:17) Penalty: False Start on Chicago (Sherrick McManis) -5 yards.","(14:24) Matt Barkley incomplete pass to the left intended for Cameron Meredith.","(15:00) Jordan Howard rush to the right for no gain to the Chi30. Tackled by Sean Spence.","(0:04) Jeremy Langford rush to the left for 5 yards to the Chi30. Tackled by Karl Klug.","(0:04) Ryan Succop kicks off to the endzone. Touchback.","(0:04) Ryan Succop extra point is good.","(0:10) Derrick Henry rush to the left for 11 yards for a TOUCHDOWN.","(0:51) Marcus Mariota pass to the right to Delanie Walker for 8 yards to the Chi11. Tackled by Adrian Amos.","(0:51) Tennessee Titans timeout.","(1:38) Marcus Mariota pass to the left to Tajae Sharpe for 5 yards to the Chi19. Tackled by Cre'von LeBlanc.","(2:23) DeMarco Murray rush to the right for a loss of 1 yard to the Chi24. Tackled by Willie Young.","(3:10) Marcus Mariota pass to the left to Delanie Walker for 38 yards to the Chi23. Tackled by Cre'von LeBlanc.","(3:48) DeMarco Murray rush to the right for 5 yards to the Ten39. Tackled by Danny Trevathan.","(4:27) Derrick Henry rush to the right for 9 yards to the Ten34. Tackled by Danny Trevathan.","(4:27) Connor Barth kicks off to the endzone. Touchback.","(4:27) Connor Barth extra point is good.","(4:32) Matt Barkley pass to the right to Daniel Brown for 7 yards for a TOUCHDOWN.","(4:36) Matt Barkley incomplete pass to the right intended for Jordan Howard.","(4:36) Chicago Bears timeout.","(5:25) Jordan Howard rush to the left for 2 yards to the Ten7. Tackled by Wesley Woodyard.","(6:12) Matt Barkley pass to the middle to Marquess Wilson for 18 yards to the Ten9. Tackled by Jason McCourty.","(6:17) Matt Barkley incomplete pass to the left intended for Jordan Howard.","(6:56) Jordan Howard rush to the right for 3 yards to the Ten27. Tackled by Jurrell Casey.","(7:29) Matt Barkley pass to the left to Deonte Thompson for 7 yards to the Ten30. Tackled by Jason McCourty.","(8:09) Ka'Deem Carey rush to the left for 6 yards to the Ten37. Tackled by Avery Williamson.","(8:43) Jordan Howard rush to the left for 22 yards to the Ten43. Tackled by Rashad Johnson.","(8:48) Matt Barkley incomplete pass to the right intended for Joshua Bellamy defensed by Derrick Morgan.","(9:30) Matt Barkley pass to the left to Jordan Howard for 23 yards to the Chi35. Tackled by Jason McCourty.","(10:09) Matt Barkley rush up the middle for no gain to the Chi16. FUMBLE, recovered by Chi (Matt Barkley).","(10:14) Matt Barkley incomplete pass to the right intended for Cameron Meredith.","(10:22) Brett Kern punts for 43 yards to Chi16. No return.","(10:59) Marcus Mariota pass to the right to DeMarco Murray for 5 yards to the Ten41. Tackled by Danny Trevathan.","(11:43) Derrick Henry rush to the right for 3 yards to the Ten36. Tackled by Eddie Goldman.","(12:28) Marcus Mariota pass to the right to DeMarco Murray for 5 yards to the Ten33. Tackled by Tracy Porter.","(12:55) Penalty: Illegal Formation on Tennessee (Dennis Kelly) -5 yards.","(13:01) Matt Barkley incomplete pass to the left intended for Logan Paulsen defensed by Da'Norris Searcy.","(13:40) Jordan Howard rush to the right for no gain to the Ten33. Tackled by Al Woods.","(14:16) Jordan Howard rush to the right for 1 yard to the Ten33. Tackled by Jurrell Casey.","(14:53) Jordan Howard rush to the left for 8 yards to the Ten34. Tackled by Al Woods.","(15:00) Penalty: Pass Interference on Tennessee (Jason McCourty) 33 yards.","(15:00) Ryan Succop kicks off to the endzone. Touchback."]