["(0:17) Tom Brady rush up the middle for a loss of 1 yard to the NYJ7.","(0:43) Tom Brady rush up the middle for a loss of 2 yards to the NYJ6.","(1:24) Tom Brady rush up the middle for a loss of 1 yard to the NYJ4.","(1:32) LeGarrette Blount rush to the left for 23 yards to the NYJ3. Tackled by Jordan Jenkins.","(1:32) New York Jets timeout.","(1:37) LeGarrette Blount rush up the middle for 5 yards to the NYJ26. Tackled by Darron Lee and Deon Simon.","(1:37) New York Jets timeout.","(1:43) LeGarrette Blount rush to the right for 3 yards to the NYJ31. Tackled by Deon Simon and Muhammad Wilkerson.","(1:51) Ryan Fitzpatrick sacked at NYJ30 for no gain by Chris Long. FUMBLE, recovered by NE (Trey Flowers) and returned for a loss of 3 yards. Tackled by Bilal Powell.","(1:56) Ryan Fitzpatrick pass to the right to Jalin Marshall for 5 yards to the NYJ30. Tackled by Logan Ryan.","(1:56) Stephen Gostkowski kicks off to the endzone. Touchback.","(1:56) Tom Brady 2 pt conversion pass to James White is NO GOOD.","(2:00) Tom Brady pass to the left to Malcolm Mitchell for 8 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:17) Tom Brady pass to the left to Chris Hogan for 25 yards to the NYJ8. Tackled by Calvin Pryor.","(2:53) Tom Brady pass to the right to James White for 4 yards to the NYJ33. Tackled by Darron Lee.","(3:30) Tom Brady pass to the right to Julian Edelman for 6 yards to the NYJ37. Tackled by Rontez Miles.","(3:34) Tom Brady incomplete pass to the middle intended for Julian Edelman.","(3:40) Tom Brady incomplete pass to the left intended for Dion Lewis.","(4:18) Tom Brady pass to the left to Dion Lewis for 16 yards to the NYJ43. Tackled by Darrelle Revis.","(5:00) Tom Brady pass to the right to Julian Edelman for 24 yards to the NE41. Tackled by Darrelle Revis.","(5:04) Tom Brady incomplete pass to the middle intended for Martellus Bennett.","(5:16) Lachlan Edwards punts for 43 yards to NE27. Danny Amendola - no return. Tackled by Rontez Miles. Penalty: Holding on New England (Devin McCourty) -10 yards.","(5:21) Ryan Fitzpatrick incomplete pass to the left intended for Bilal Powell.","(5:27) Ryan Fitzpatrick incomplete pass to the middle. Penalty: Intentional Grounding on New York (Ryan Fitzpatrick) -7 yards.","(6:10) Bilal Powell rush to the left for 6 yards to the NYJ37. Tackled by Kyle Van Noy.","(6:55) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 23 yards to the NYJ31. Tackled by Eric Rowe.","(7:02) Stephen Gostkowski kicks off to the NYJ0. Jeremy Ross return for 16 yards to NYJ16. Tackled by Brandon King and Shea McClellin. Penalty: Illegal Block on New York (Rontez Miles) -8 yards.","(7:06) Stephen Gostkowski 41 yard field goal attempt is GOOD. Holder: Ryan Allen.","(7:12) Tom Brady incomplete pass to the right intended for Malcolm Mitchell.","(7:16) Tom Brady incomplete pass to the left intended for James White defensed by Calvin Pryor.","(7:54) Dion Lewis rush to the left for 4 yards to the NYJ22. Tackled by Muhammad Wilkerson.","(8:26) Tom Brady pass to the left to Dion Lewis for 5 yards to the NYJ26. Tackled by Darrelle Revis.","(8:48) Tom Brady pass to the middle to Julian Edelman for 8 yards to the NYJ31. Tackled by David Harris and Darron Lee.","(9:37) Tom Brady pass to the middle to Chris Hogan for 23 yards to the NYJ39. Tackled by Darrelle Revis.","(10:17) Tom Brady pass to the left to Malcolm Mitchell for 13 yards to the NE38. Tackled by Darryl Roberts and David Harris.","(10:17) Nick Folk kicks off to the endzone. Touchback.","(10:17) Nick Folk extra point is good.","(10:26) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 22 yards for a TOUCHDOWN.","(10:32) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(11:18) Matt Forte rush to the left for 1 yard to the NE22. Tackled by Dont'a Hightower and Jabaal Sheard.","(12:01) Ryan Fitzpatrick pass to the middle to Brandon Bostick for 9 yards to the NE23. Tackled by Shea McClellin.","(12:44) Ryan Fitzpatrick pass to the right to Brandon Marshall for 13 yards to the NE32. Tackled by Malcolm Butler.","(13:29) Ryan Fitzpatrick pass to the left to Matt Forte for 15 yards to the NE45. Tackled by Eric Rowe.","(14:13) Matt Forte rush to the left for 4 yards to the NYJ40. Tackled by Eric Rowe and Trey Flowers.","(14:49) Ryan Fitzpatrick pass to the left to Robby Anderson for 9 yards to the NYJ36. Tackled by Logan Ryan.","(14:55) Ryan Allen punts for 47 yards to NYJ27. No return.","(15:00) Tom Brady incomplete pass to the right intended for Chris Hogan.","(0:42) Tom Brady pass to the right to Dion Lewis for 4 yards to the NE26. Tackled by Darryl Roberts.","(0:46) Tom Brady incomplete pass to the middle intended for Julian Edelman.","(1:18) Tom Brady pass to the left to James Develin for 5 yards to the NE22. Tackled by Buster Skrine and Jordan Jenkins.","(1:43) Penalty: Offside on New York (Deon Simon) 5 yards.","(2:24) LeGarrette Blount rush to the right for no gain to the NE12. Tackled by Sheldon Richardson.","(2:31) Lachlan Edwards punts for 41 yards to NE12. No return.","(2:41) Ryan Fitzpatrick pass to the middle to Jalin Marshall for 1 yard to the NYJ47. Tackled by Dont'a Hightower.","(2:47) Ryan Fitzpatrick incomplete pass to the left intended for C.J. Spiller.","(3:25) Matt Forte rush to the right for no gain to the NYJ46. Tackled by Dont'a Hightower.","(4:01) Bilal Powell rush to the left for 2 yards to the NYJ46. Tackled by Logan Ryan and Malcom Brown.","(4:43) Bilal Powell rush up the middle for 4 yards to the NYJ44. Tackled by Alan Branch.","(5:30) Ryan Fitzpatrick pass to the left to Brandon Bostick for 5 yards to the NYJ40. Tackled by Shea McClellin.","(6:09) Ryan Fitzpatrick rush up the middle for 2 yards to the NYJ35. Tackled by Malcom Brown and Alan Branch.","(6:58) Matt Forte rush to the left for 2 yards to the NYJ33. Tackled by Eric Rowe and Alan Branch.","(7:34) Matt Forte rush to the left for 6 yards to the NYJ31. Tackled by Patrick Chung and Shea McClellin.","(7:34) Stephen Gostkowski kicks off to the endzone. Touchback.","(7:37) Stephen Gostkowski 29 yard field goal attempt is GOOD. Holder: Ryan Allen.","(7:41) Tom Brady incomplete pass to the left intended for James White.","(7:46) Tom Brady incomplete pass to the middle intended for Dion Lewis defensed by Darron Lee.","(8:25) LeGarrette Blount rush to the left for 2 yards to the NYJ11. Tackled by Lorenzo Mauldin.","(8:41) Penalty: Offside on New York (Muhammad Wilkerson) 5 yards.","(9:24) Tom Brady pass to the left to James White for 11 yards to the NYJ18. Tackled by David Harris.","(9:24) New York Jets timeout.","(9:30) Tom Brady incomplete pass to the right intended for Dion Lewis.","(10:07) LeGarrette Blount rush to the left for a loss of 2 yards to the NYJ29. Tackled by Calvin Pryor.","(10:36) LeGarrette Blount rush to the left for 18 yards to the NYJ27. Tackled by Darryl Roberts.","(11:15) Dion Lewis rush to the right for 3 yards to the NYJ45. Tackled by David Harris.","(11:52) Tom Brady pass to the right to James White for 7 yards to the NYJ48. Tackled by Darron Lee.","(12:30) Tom Brady pass to the left to Julian Edelman for 10 yards to the NE45. Tackled by Buster Skrine.","(12:55) Martellus Bennett rush to the right for 4 yards to the NE35. Tackled by David Harris.","(13:07) Lachlan Edwards punts for 50 yards to NE23. Danny Amendola return for 8 yards to NE31. Tackled by Brandon Bostick.","(13:46) Ryan Fitzpatrick pass to the right to Bilal Powell for 7 yards to the NYJ27. Tackled by Logan Ryan.","(13:51) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(14:28) Bilal Powell rush to the left for 5 yards to the NYJ20. Tackled by Kyle Van Noy and Trey Flowers.","(15:00) Penalty: Holding on New York (Breno Giacomini) -10 yards.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback.","(0:02) Ryan Fitzpatrick rush up the middle for a loss of 1 yard to the NYJ28.","(0:06) 39 yard field goal attempt by Stephen Gostkowski is NO GOOD. Holder: Ryan Allen.","(0:12) Tom Brady incomplete pass to the left intended for Malcolm Mitchell defensed by Darryl Roberts.","(0:40) Tom Brady pass to the right to Chris Hogan for 14 yards to the NYJ21. Tackled by Darron Lee.","(1:22) Tom Brady pass to the right to Danny Amendola for 8 yards to the NYJ35. Tackled by Darron Lee.","(1:27) Tom Brady pass to the left to James White for no gain to the NYJ43. Tackled by David Harris.","(1:58) Tom Brady pass to the left to Malcolm Mitchell for 11 yards to the NYJ43. Tackled by Darryl Roberts.","(1:58) Two Minute Warning.","(2:05) Nick Folk 54 yard field goal attempt is BLOCKED by Alan Branch. Return blocked field goal by Dont'a Hightower to the NE46. Tackled by Dakota Dozier.","(2:11) Ryan Fitzpatrick incomplete pass to the left intended for Jalin Marshall defensed by Eric Rowe.","(2:11) New England Patriots timeout.","(2:40) Ryan Fitzpatrick pass to the right to Matt Forte for 3 yards to the NE36. Tackled by Jabaal Sheard.","(3:24) Matt Forte rush to the left for 3 yards to the NE39. Tackled by Shea McClellin.","(4:09) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 21 yards to the NE42. Tackled by Patrick Chung.","(4:14) Ryan Fitzpatrick incomplete pass to the left intended for Matt Forte defensed by Logan Ryan.","(4:54) Matt Forte rush to the right for 2 yards to the NYJ37. Tackled by Malcom Brown.","(5:13) Penalty: Offside on New England (Alan Branch) 5 yards.","(5:57) Matt Forte rush up the middle for 4 yards to the NYJ30. Tackled by Malcom Brown and Alan Branch.","(6:24) Ryan Fitzpatrick pass to the right to Matt Forte for 5 yards to the NYJ26. Tackled by Malcolm Butler.","(6:29) Stephen Gostkowski kicks off to the NYJ6. Jeremy Ross return for 15 yards to NYJ21. Tackled by Geneo Grissom and Devin McCourty.","(6:29) Stephen Gostkowski extra point is good.","(6:35)  FUMBLE, recovered by NE (Tom Brady). Tom Brady pass to the right to Malcolm Mitchell for 4 yards for a TOUCHDOWN.","(7:13) Dion Lewis rush to the left for 1 yard to the NYJ4. Tackled by Sheldon Richardson and Darron Lee.","(7:50) Dion Lewis rush to the right for 15 yards to the NYJ5. Tackled by Marcus Gilchrist and Darrelle Revis.","(8:25) Tom Brady pass to the middle to Julian Edelman for 7 yards to the NYJ20. Tackled by Buster Skrine.","(8:44) Tom Brady pass to the left to Martellus Bennett for 5 yards to the NYJ27. Tackled by Darron Lee and Calvin Pryor.","(9:25) LeGarrette Blount rush to the right for no gain to the NYJ32. Tackled by Jordan Jenkins and Darron Lee.","(9:46) Tom Brady pass to the right to Julian Edelman for 18 yards to the NYJ32.","(9:59) Ryan Fitzpatrick pass to the right to Robby Anderson for 25 yards to the NYJ50. Tackled by Malcolm Butler. FUMBLE, recovered by NE (Malcolm Butler). Tackled by Brandon Marshall.","(10:40) Matt Forte rush up the middle for 1 yard to the NYJ25. Tackled by Malcom Brown and Jabaal Sheard.","(10:45) Stephen Gostkowski kicks off to the NYJ3. Jeremy Ross return for 21 yards to NYJ24. Tackled by Jonathan Jones.","(10:48) Stephen Gostkowski 28 yard field goal attempt is GOOD. Holder: Ryan Allen.","(10:54) Tom Brady incomplete pass to the right intended for James White.","(11:36) Dion Lewis rush to the left for a loss of 2 yards to the NYJ10. Tackled by Sheldon Richardson.","(11:40) Tom Brady incomplete pass to the right intended for James White.","(11:46) Penalty: Pass Interference on New York (Darryl Roberts) 31 yards.","(12:25) LeGarrette Blount rush up the middle for 5 yards to the NYJ39. Tackled by Steve McLendon and David Harris.","(12:56) Tom Brady pass to the right to Chris Hogan for 8 yards to the NYJ44. Tackled by Darron Lee.","(13:34) Tom Brady pass to the left to Malcolm Mitchell for 6 yards to the NE48. Tackled by Darryl Roberts.","(13:34) New York Jets timeout.","(13:39) Tom Brady incomplete pass to the left intended for Julian Edelman.","(14:22) Tom Brady pass to the right to Martellus Bennett for 5 yards to the NE42. Tackled by Jordan Jenkins and David Harris.","(14:56) Tom Brady pass to the right to Martellus Bennett for 12 yards to the NE37. Tackled by Marcus Gilchrist.","(14:56) Nick Folk kicks off to the endzone. Touchback.","(14:56) Nick Folk extra point is good.","(15:00) Ryan Fitzpatrick pass to the right to Brandon Marshall for 1 yard for a TOUCHDOWN.","(0:15) Bilal Powell rush to the left for 6 yards to the NE1. Tackled by Trey Flowers and Patrick Chung.","(0:58) Bilal Powell rush up the middle for 4 yards to the NE7. Tackled by Trey Flowers.","(1:39) Bilal Powell rush up the middle for 7 yards to the NE11. Tackled by Logan Ryan and Patrick Chung.","(1:39) New York Jets timeout.","(2:27) Ryan Fitzpatrick pass to the left to Brandon Marshall for 11 yards to the NE18. Tackled by Logan Ryan.","(3:11) Matt Forte rush to the left for 1 yard to the NE29. Tackled by Eric Rowe.","(3:15) Ryan Fitzpatrick incomplete pass to the right intended for Bilal Powell.","(3:59) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 40 yards to the NE30. Tackled by Malcolm Butler.","(4:42) Ryan Fitzpatrick pass to the right to Austin Seferian-Jenkins for 9 yards to the NYJ30. Tackled by Alan Branch and Patrick Chung.","(4:49) Ryan Allen punts for 32 yards to NYJ21. No return.","(4:55) Tom Brady incomplete pass to the right intended for Rob Gronkowski.","(5:02) Tom Brady incomplete pass to the right intended for LeGarrette Blount.","(5:39) LeGarrette Blount rush to the left for 3 yards to the NE47. Tackled by Leonard Williams.","(6:12) Tom Brady pass to the middle to Julian Edelman for 10 yards to the NE44. Tackled by Darron Lee and David Harris.","(6:54) Tom Brady pass to the left to Julian Edelman for no gain to the NE34. Tackled by David Harris.","(7:02) Lachlan Edwards punts for 44 yards to NE34. No return.","(7:29) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 3 yards to the NYJ22. Tackled by Devin McCourty.","(8:11) Ryan Fitzpatrick pass to the left to Brandon Marshall for 9 yards to the NYJ19. Tackled by Logan Ryan.","(8:48) Matt Forte rush to the left for a loss of 3 yards to the NYJ10. Tackled by Elandon Roberts.","(8:56) Ryan Allen punts for 49 yards to NYJ13. Buster Skrine - no return. FUMBLE, recovered by NYJ (Jeremy Ross).","(9:04) Tom Brady incomplete pass to the middle intended for Rob Gronkowski.","(9:41) Dion Lewis rush to the left for 3 yards to the NE38. Tackled by Rontez Miles.","(9:46) Tom Brady incomplete pass to the left intended for James Develin.","(10:29) LeGarrette Blount rush to the left for 10 yards to the NE35. Tackled by David Harris and Marcus Gilchrist.","(10:29) Nick Folk kicks off to the endzone. Touchback.","(10:33) Nick Folk 51 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(10:40) Ryan Fitzpatrick incomplete pass to the middle intended for Brandon Marshall defensed by Logan Ryan.","(10:45) Ryan Fitzpatrick incomplete pass to the left intended for Austin Seferian-Jenkins.","(11:27) Bilal Powell rush to the right for 2 yards to the NE33. Tackled by Malcom Brown and Trey Flowers.","(11:56) Ryan Fitzpatrick pass to the right to Brandon Marshall for 20 yards to the NE35. Tackled by Devin McCourty.","(12:40) Matt Forte rush to the left for 3 yards to the NYJ45. Tackled by Devin McCourty.","(13:16) Matt Forte rush up the middle for 3 yards to the NYJ42. Tackled by Malcom Brown and Alan Branch.","(13:43) Ryan Fitzpatrick pass to the right to Brandon Marshall for 13 yards to the NYJ39. Tackled by Malcolm Butler.","(13:56) Ryan Allen punts for 55 yards to NYJ16. Jeremy Ross return for 10 yards to NYJ26. Tackled by Geneo Grissom and Jordan Richards.","(13:56) New England Patriots timeout.","(14:47) Tom Brady pass to the right to Dion Lewis for 9 yards to the NE29. Tackled by Leonard Williams.","(14:52) Tom Brady incomplete pass to the left intended for Martellus Bennett.","(14:55) Tom Brady incomplete pass to the left intended for James White.","(15:00) Nick Folk kicks off to the NE-4. Danny Amendola return for 24 yards to NE20. Tackled by Josh Martin."]