["(0:03) Brock Osweiler pass intended for Braxton Miller INTERCEPTED by Dexter McCoil. No return. Tackled by DeAndre Hopkins. Touchback.","(0:12) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by Dwight Lowery.","(0:14) Nick Novak onside kickoff to the SD41. Onside kick recovered by kicking team by Jonathan Grimes.","(0:18) Nick Novak 45 yard field goal attempt is GOOD. Holder: Shane Lechler.","(0:19) Brock Osweiler incomplete pass to the middle.","(0:37) Brock Osweiler pass to the left to Ryan Griffin for 12 yards to the SD27. Tackled by Craig Mager and Kyle Emanuel.","(1:01) Brock Osweiler pass to the middle to Lamar Miller for 5 yards to the SD39. Tackled by Kyle Emanuel.","(1:20) Brock Osweiler pass to the right to Ryan Griffin for 15 yards to the SD44. Tackled by Korey Toomer.","(1:47) Brock Osweiler rush up the middle for 21 yards to the Hou41. Tackled by Adrian Phillips.","(1:54) Brock Osweiler incomplete pass to the left intended for Lamar Miller.","(2:00) Brock Osweiler incomplete pass to the left intended for Will Fuller defensed by Trevor Williams.","(2:00) Two Minute Warning.","(2:17) Brock Osweiler pass to the left to Ryan Griffin for 7 yards to the Hou20. Tackled by Jahleel Addae.","(2:30) Drew Kaser punts for 38 yards to Hou13. No return.","(3:17) Penalty: Delay of Game on San Diego (Drew Kaser) -5 yards.","(3:17) Melvin Gordon rush up the middle for a loss of 3 yards to the Hou46. Tackled by Whitney Mercilus.","(3:17) Penalty: False Start on San Diego (D.J. Fluker) -5 yards.","(3:17) San Diego Chargers timeout.","(3:17) Houston Texans timeout.","(3:25) Melvin Gordon rush up the middle for 5 yards to the Hou38. Tackled by Benardrick McKinney.","(3:25) Houston Texans timeout.","(3:31) Melvin Gordon rush to the right for 4 yards to the Hou43. Tackled by Brian Cushing and Benardrick McKinney.","(3:31) Houston Texans timeout.","(3:42) Melvin Gordon rush up the middle for 8 yards to the Hou47. Tackled by Brian Cushing.","(4:25) Melvin Gordon rush up the middle for 7 yards to the SD45. Tackled by Andre Hal.","(4:34) Brock Osweiler incomplete pass to the left intended for Braxton Miller.","(4:34) San Diego Chargers timeout.","(4:55) Brock Osweiler rush to the right for 1 yard to the SD38. Tackled by Joey Bosa.","(5:00) Brock Osweiler incomplete pass to the left intended for Ryan Griffin.","(5:06) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(5:37) Brock Osweiler pass to the right to DeAndre Hopkins for 16 yards to the SD39. Tackled by Casey Hayward.","(5:46) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(6:14) Brock Osweiler pass to the right to Braxton Miller for 12 yards to the Hou45. Tackled by Trevor Williams and Denzel Perryman.","(6:39) Brock Osweiler pass to the middle to C.J. Fiedorowicz for 12 yards to the Hou33. Tackled by Dwight Lowery and Denzel Perryman.","(7:06) Lamar Miller rush up the middle for 1 yard to the Hou21. Tackled by Denzel Perryman and Corey Liuget.","(7:15) Drew Kaser punts for 52 yards to Hou0. Touchback.","(7:27) Penalty: Delay of Game on San Diego (Philip Rivers) -5 yards.","(8:17) Philip Rivers pass to the right to Jeremy Butler for 6 yards to the Hou47. Tackled by Johnathan Joseph.","(8:22) Philip Rivers incomplete pass to the right intended for Tyrell Williams defensed by Johnathan Joseph.","(9:04) Melvin Gordon rush to the right for 3 yards to the SD47. Tackled by Benardrick McKinney and Brian Cushing.","(9:17) Brock Osweiler pass intended for C.J. Fiedorowicz INTERCEPTED by Dwight Lowery and returned for 25 yards. Tackled by Will Fuller. Penalty: Unsports. Conduct on San Diego -15 yards.","(9:52) Brock Osweiler pass to the middle to C.J. Fiedorowicz for 16 yards to the Hou41. Tackled by Dwight Lowery and Craig Mager.","(9:52) Josh Lambo kicks off to the endzone. Touchback.","(9:52) Josh Lambo extra point is good.","(9:59) Philip Rivers pass to the right to Hunter Henry for 12 yards for a TOUCHDOWN.","(10:36) Philip Rivers pass to the right to Dontrelle Inman for 25 yards to the Hou25. Tackled by Kareem Jackson. Penalty: Unnecessary Roughness on Houston (Kareem Jackson) 13 yards.","(11:19) Philip Rivers pass to the left to Dontrelle Inman for 11 yards to the SD50. Tackled by Kareem Jackson and Eddie Pleasant.","(11:26) Philip Rivers incomplete pass to the left intended for Tyrell Williams defensed by Johnathan Joseph.","(12:14) Philip Rivers pass to the right to Melvin Gordon for 10 yards to the SD39. Tackled by Brian Cushing.","(12:48) Penalty: Holding on San Diego (King Dunlap) -10 yards.","(13:34) Melvin Gordon rush up the middle for 9 yards to the SD39. Tackled by Benardrick McKinney.","(14:09) Philip Rivers pass to the left to Melvin Gordon for 5 yards to the SD30. Tackled by A.J. Bouye and Quintin Demps.","(14:09) Nick Novak kicks off to the endzone. Touchback.","(14:13) Nick Novak 19 yard field goal attempt is GOOD. Holder: Shane Lechler.","(15:00) Brock Osweiler pass to the left to C.J. Fiedorowicz for 6 yards to the SD2. Tackled by Casey Hayward.","(0:26) Braxton Miller rush up the middle for 1 yard to the SD8. Tackled by Jahleel Addae and Korey Toomer.","(1:06) Lamar Miller rush to the left for a loss of 3 yards to the SD9. Tackled by Damion Square.","(1:46) Brock Osweiler pass to the left to Lamar Miller for 11 yards to the SD6. Tackled by Denzel Perryman.","(2:29) Lamar Miller rush to the left for 11 yards to the SD17. Tackled by Melvin Ingram.","(3:17) Brock Osweiler pass to the left to DeAndre Hopkins for 8 yards to the SD28. Tackled by Casey Hayward.","(4:02) Lamar Miller rush up the middle for a loss of 5 yards to the SD36. Tackled by Joey Bosa.","(4:37) Brock Osweiler pass to the right to Will Fuller for 7 yards to the SD31. Tackled by Craig Mager.","(4:49) Philip Rivers pass intended for Tyrell Williams INTERCEPTED by Quintin Demps defensed by A.J. Bouye and returned for 2 yards. Tackled by Travis Benjamin.","(5:34) Philip Rivers pass to the right to Dontrelle Inman for 11 yards to the SD21. Tackled by Johnathan Joseph.","(6:05) Penalty: Holding on San Diego (Orlando Franklin) -10 yards.","(6:47) Melvin Gordon rush up the middle for a loss of 1 yard to the SD20. Tackled by Jadeveon Clowney and Christian Covington.","(6:54) Lamar Miller rush up the middle for 20 yards to the SD23. Tackled by Dwight Lowery. FUMBLE, recovered by SD (Trevor Williams). Tackled by Will Fuller.","(6:59) Penalty: Holding on San Diego (Trevor Williams) 5 yards.","(7:36) Lamar Miller rush up the middle for no gain to the SD48. Tackled by Melvin Ingram and Korey Toomer.","(7:48) Drew Kaser punts for 53 yards to Hou25. Will Fuller return for 12 yards to Hou37. Tackled by Adrian Phillips. Penalty: Unnecessary Roughness on San Diego (Adrian Phillips) 15 yards.","(7:55) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(8:01) Philip Rivers incomplete pass to the middle intended for Travis Benjamin.","(8:45) Melvin Gordon rush to the left for 3 yards to the SD22. Tackled by Quintin Demps and Benardrick McKinney.","(9:28) Philip Rivers pass to the left to Tyrell Williams for 6 yards to the SD19. Tackled by Kareem Jackson.","(10:16) Philip Rivers pass to the middle to Hunter Henry for 8 yards to the SD13. Tackled by Brian Cushing and Benardrick McKinney.","(11:02) Melvin Gordon rush to the left for a loss of 3 yards to the SD5. Tackled by Brian Cushing and Quintin Demps.","(11:11) Shane Lechler punts for 38 yards to SD8. No return.","(11:48) Brock Osweiler pass to the right to Ryan Griffin for 2 yards to the SD46. Tackled by Jahleel Addae and Korey Toomer.","(12:31) Lamar Miller rush to the left for 2 yards to the SD48. Tackled by Trevor Williams and Korey Toomer.","(12:35) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins defensed by Casey Hayward.","(13:10) Brock Osweiler pass to the left to DeAndre Hopkins for 11 yards to the Hou50. Tackled by Denzel Perryman and Casey Hayward.","(13:47) Brock Osweiler pass to the left to DeAndre Hopkins for 16 yards to the Hou39. Tackled by Dwight Lowery.","(14:30) Lamar Miller rush up the middle for a loss of 2 yards to the Hou23. Tackled by Joey Bosa.","(15:00) Lamar Miller rush to the left for no gain to the Hou25. Tackled by Jahleel Addae and Korey Toomer.","(15:00) Josh Lambo kicks off to the endzone. Touchback.","(0:04) 54 yard field goal attempt by Josh Lambo is NO GOOD. Holder: Kellen Clemens.","(0:09) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(0:14) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(0:20) Philip Rivers pass to the right to Tyrell Williams for 15 yards to the Hou36. Tackled by Jadeveon Clowney.","(0:33) Shane Lechler punts for 45 yards to SD38. Isaiah Burse return for 11 yards to SD49. Tackled by Don Jones and Brian Peters.","(0:48) Penalty: Illegal Plyr Downfld on Houston (Brian Peters) -5 yards.","(0:48) Houston Texans timeout.","(1:34) Jonathan Grimes rush to the left for 5 yards to the Hou22. Tackled by Darius Philon.","(1:34) San Diego Chargers timeout.","(1:39) Jonathan Grimes rush up the middle for 9 yards to the Hou17. Tackled by Jahleel Addae.","(1:39) San Diego Chargers timeout.","(1:47) Brock Osweiler sacked at Hou8 for a loss of 7 yards by Damion Square and Joey Bosa.","(1:54) Penalty: Holding on Houston (Chris Clark) -10 yards.","(1:54) Josh Lambo kicks off to the endzone. Touchback.","(1:54) Josh Lambo extra point is good.","(2:00) Philip Rivers pass to the middle to Tyrell Williams for 21 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:35) Melvin Gordon rush to the right for 18 yards to the Hou21. Tackled by Quintin Demps.","(3:14) Melvin Gordon rush to the left for 1 yard to the Hou39. Tackled by Benardrick McKinney.","(3:58) Philip Rivers pass to the left to Travis Benjamin for 8 yards to the Hou40. Tackled by A.J. Bouye.","(4:47) Philip Rivers pass to the left to Dontrelle Inman for 15 yards to the Hou48. Tackled by Kareem Jackson.","(4:55) Brock Osweiler pass intended for DeAndre Hopkins INTERCEPTED by Casey Hayward and returned for 1 yard.","(5:31) Lamar Miller rush to the left for 4 yards to the Hou49. Tackled by Jahleel Addae and Joey Bosa.","(6:08) Lamar Miller rush to the right for 7 yards to the Hou45. Tackled by Denzel Perryman.","(6:44) Brock Osweiler pass to the left to Will Fuller for 13 yards to the Hou38.","(6:44) Josh Lambo kicks off to the endzone. Touchback.","(6:44) Josh Lambo extra point is good.","(6:52) Philip Rivers pass to the left to Dontrelle Inman for 52 yards for a TOUCHDOWN.","(7:36) Philip Rivers pass to the left to Tyrell Williams for 2 yards to the SD48. Tackled by Quintin Demps.","(8:21) Melvin Gordon rush to the right for 1 yard to the SD46. Tackled by Whitney Mercilus.","(9:04) Melvin Gordon rush to the right for 5 yards to the SD45. Tackled by Benardrick McKinney.","(9:48) Philip Rivers pass to the right to Tyrell Williams for 4 yards to the SD40. Tackled by Benardrick McKinney.","(9:55) Penalty: Illegal Use of Hands on Houston (A.J. Bouye) 5 yards.","(10:01) Philip Rivers incomplete pass to the left intended for Hunter Henry.","(11:04) Penalty: Offside on Houston (Antonio Smith) 5 yards.","(11:11) Nick Novak kicks off to the SD0. Isaiah Burse return for 26 yards to SD26. Tackled by Robert Nelson Jr..","(11:11) Nick Novak extra point is good.","(11:16) Brock Osweiler rush up the middle for 1 yard for a TOUCHDOWN.","(11:53) Lamar Miller rush to the right for 1 yard to the SD1. Tackled by Joey Bosa.","(11:58) Penalty: Pass Interference on San Diego (Casey Hayward) 3 yards.","(12:38) Lamar Miller rush to the right for 1 yard to the SD5. Tackled by Denzel Perryman.","(13:05) Brock Osweiler pass to the right to Will Fuller for 33 yards to the SD6. Tackled by Craig Mager.","(13:05) San Diego Chargers timeout.","(13:40) Lamar Miller rush up the middle for 4 yards to the SD39. Tackled by Korey Toomer.","(14:23) Lamar Miller rush to the left for 2 yards to the SD43. Tackled by Craig Mager and Korey Toomer.","(15:00) Brock Osweiler pass to the right to Stephen Anderson for 8 yards to the SD45. Tackled by Casey Hayward and Craig Mager.","(0:36) Akeem Hunt rush up the middle for 3 yards to the Hou47. Tackled by Jahleel Addae.","(0:45) Brock Osweiler incomplete pass to the right.","(1:27) Akeem Hunt rush to the left for 16 yards to the Hou44. Tackled by Jahleel Addae.","(1:41) Drew Kaser punts for 52 yards to Hou22. Will Fuller return for 6 yards to Hou28. Tackled by Joshua Perry. FUMBLE, recovered by Hou (Robert Nelson Jr.).","(2:09) Philip Rivers sacked at SD26 for a loss of 7 yards by Benardrick McKinney.","(2:54) Philip Rivers pass to the right to Dontrelle Inman for 5 yards to the SD33. Tackled by Max Bullough.","(3:38) Kenneth Farrow rush to the right for a loss of 3 yards to the SD28. Tackled by Whitney Mercilus and Andre Hal.","(3:44) Penalty: Illegal Use of Hands on Houston (A.J. Bouye) 5 yards.","(3:44) Penalty: Offside on Houston (Jadeveon Clowney) 5 yards.","(3:53) Shane Lechler punts for 53 yards to SD21. No return.","(4:33) Brock Osweiler pass to the right to Lamar Miller for 2 yards to the Hou26. Tackled by Korey Toomer.","(4:38) Penalty: Offside on San Diego (Melvin Ingram) 5 yards.","(5:22) Lamar Miller rush to the right for 1 yard to the Hou19. Tackled by Joey Bosa and Darius Philon.","(5:29) Brock Osweiler incomplete pass to the middle intended for DeAndre Hopkins defensed by Casey Hayward.","(5:53) Lamar Miller rush to the right for 5 yards to the Hou18. Tackled by Korey Toomer.","(6:29) Brock Osweiler pass to the right to C.J. Fiedorowicz for 8 yards to the Hou13. Tackled by Denzel Perryman.","(6:38) Drew Kaser punts for 38 yards to Hou5. No return.","(7:14) Philip Rivers pass to the right to Tyrell Williams for 4 yards to the Hou43. Tackled by A.J. Bouye.","(8:00) Philip Rivers pass to the left to Melvin Gordon for 3 yards to the Hou47. Tackled by Benardrick McKinney and Joel Heath.","(8:46) Melvin Gordon rush up the middle for a loss of 2 yards to the SD50. Tackled by Whitney Mercilus.","(9:22) Philip Rivers pass to the left to Tyrell Williams for 14 yards to the Hou48. Tackled by A.J. Bouye.","(10:10) Melvin Gordon rush to the left for 13 yards to the SD38. Tackled by A.J. Bouye and Benardrick McKinney.","(10:18) Penalty: Holding on Houston (A.J. Bouye) 5 yards.","(10:26) Shane Lechler punts for 53 yards to SD0. Touchback.","(11:03) Brock Osweiler pass to the right to Will Fuller for 7 yards to the Hou47. Tackled by Craig Mager and Korey Toomer.","(11:03) Penalty: False Start on Houston (Chris Clark) -5 yards.","(11:08) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(11:43) Lamar Miller rush to the left for 2 yards to the Hou45. Tackled by Korey Toomer and Corey Liuget.","(12:10) Brock Osweiler pass to the left to DeAndre Hopkins for 19 yards to the Hou43. Tackled by Denzel Perryman.","(12:46) Lamar Miller rush to the left for 6 yards to the Hou24. Tackled by Denzel Perryman and Korey Toomer.","(13:00) Drew Kaser punts for 59 yards to Hou9. Will Fuller return for 9 yards to Hou18. Tackled by Sean McGrath and Adrian Phillips.","(13:41) Philip Rivers pass to the left to Melvin Gordon for 1 yard to the SD32. Tackled by A.J. Bouye.","(14:22) Philip Rivers pass to the left to Tyrell Williams for 4 yards to the SD31. Tackled by A.J. Bouye.","(15:00) Melvin Gordon rush to the right for 2 yards to the SD27. Tackled by D.J. Reader and Brian Cushing.","(15:00) Nick Novak kicks off to the endzone. Touchback."]