["(0:39) Tyrod Taylor rush up the middle for a loss of 1 yard to the Jax37.","(1:20) LeSean McCoy rush to the left for 9 yards to the Jax36. Tackled by Tashaun Gipson.","(2:00) Tyrod Taylor rush to the right for 2 yards to the Jax45. Tackled by Telvin Smith.","(2:00) Two Minute Warning.","(2:25) Jonathan Williams rush up the middle for 1 yard to the Jax47. Tackled by Paul Posluszny and Malik Jackson.","(3:09) Tyrod Taylor pass to the right to Charles Clay for 7 yards to the Jax48. Tackled by Johnathan Cyprien.","(3:09) Jacksonville Jaguars timeout.","(3:18) LeSean McCoy rush to the right for no gain to the Buf45. Tackled by Myles Jack.","(3:19) Jacksonville Jaguars timeout.","(3:25) LeSean McCoy rush to the right for 3 yards to the Buf45. Tackled by Telvin Smith.","(3:33) Blake Bortles pass to the right to Marqise Lee for 4 yards to the Buf41. Tackled by Nickell Robey-Coleman.","(3:33) Penalty: Delay of Game on Jacksonville (Blake Bortles) -5 yards.","(3:38) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(4:15) Blake Bortles pass to the middle to Ben Koyack for 6 yards to the Buf40. Tackled by Preston Brown.","(4:50) Blake Bortles pass to the left to Allen Robinson for no gain to the Buf46. Tackled by Stephon Gilmore.","(5:26) Blake Bortles rush to the left for 15 yards to the Buf46. Tackled by Zach Brown.","(6:00) Blake Bortles pass to the left to Marqise Lee for 3 yards to the Jax39. Tackled by Corey Graham.","(6:07) Blake Bortles incomplete pass to the right intended for Neal Sterling defensed by Nickell Robey-Coleman.","(6:44) Denard Robinson rush up the middle for 9 yards to the Jax36. Tackled by Preston Brown.","(6:55) Colton Schmidt punts for 57 yards to Jax13. Bryan Walters return for 14 yards to Jax27. Tackled by Jonathan Meeks.","(6:55) Buffalo Bills timeout.","(7:55) Tyrod Taylor rush to the left for 11 yards to the Buf30. Tackled by Tashaun Gipson and Paul Posluszny.","(7:59) Tyrod Taylor incomplete pass to the right intended for Charles Clay.","(8:34) LeSean McCoy rush to the right for a loss of 2 yards to the Buf19. Tackled by Paul Posluszny and Dante Fowler Jr..","(8:43) Brad Nortman punts for 45 yards to Buf21. No return.","(9:31) Denard Robinson rush to the left for no gain to the Jax34. Tackled by Leger Douzable and Adolphus Washington.","(10:10) Blake Bortles rush up the middle for 5 yards to the Jax34. Tackled by Kyle Williams.","(10:46) Denard Robinson rush to the right for 4 yards to the Jax29. Tackled by Leger Douzable and Jerry Hughes.","(10:46) Jordan Gay kicks off to the endzone. Touchback.","(10:46) LeSean McCoy 2 pt rush attempt. Successful.","(10:52) Tyrod Taylor pass to the right to Justin Hunter for 16 yards for a TOUCHDOWN.","(11:37) LeSean McCoy rush to the right for a loss of 1 yard to the Jax16. Tackled by Telvin Smith.","(12:03) Tyrod Taylor pass to the left to Marquise Goodwin for 8 yards to the Jax15. Tackled by Prince Amukamara.","(12:42) LeSean McCoy rush up the middle for 2 yards to the Jax23. Tackled by Johnathan Cyprien and Yannick Ngakoue.","(12:49) Penalty: Pass Interference on Jacksonville (Prince Amukamara) 18 yards.","(13:31) Jonathan Williams rush up the middle for 5 yards to the Jax43. Tackled by Tyson Alualu and Myles Jack.","(13:37) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(14:08) Tyrod Taylor pass to the right to LeSean McCoy for 25 yards to the Jax48. Tackled by Malik Jackson.","(14:45) LeSean McCoy rush to the right for 3 yards to the Buf27. Tackled by Jalen Ramsey.","(14:52) Jason Myers kicks off to the Buf-1. Brandon Tate return for 25 yards to Buf24. Tackled by Peyton Thompson and Johnathan Cyprien.","(14:52) Jason Myers extra point is good.","(15:00) Blake Bortles pass to the left to Allen Hurns for 12 yards for a TOUCHDOWN.","(0:21) Blake Bortles pass to the right to Allen Robinson for 24 yards to the Buf12. Tackled by Corey White.","(0:56) Denard Robinson rush up the middle for 5 yards to the Buf36. Tackled by Leger Douzable and Preston Brown.","(1:25) Blake Bortles rush to the left for 9 yards to the Buf41.","(2:11) Blake Bortles rush to the left for 15 yards to the Jax50. Tackled by Stephon Gilmore.","(2:17) Blake Bortles incomplete pass to the right intended for Allen Hurns.","(2:53) Denard Robinson rush to the left for no gain to the Jax35. Tackled by Kyle Williams and Marcell Dareus.","(3:00) Jordan Gay kicks off to the Jax-1. Marqise Lee return for 36 yards to Jax35. Tackled by Ramon Humber.","(3:00) Dan Carpenter extra point is good.","(3:07) Tyrod Taylor rush to the left for 7 yards for a TOUCHDOWN.","(3:28) LeSean McCoy rush to the left for 1 yard to the Jax7. Tackled by Telvin Smith and Myles Jack.","(4:02) LeSean McCoy rush to the left for 5 yards to the Jax8. Tackled by Myles Jack.","(4:34) Tyrod Taylor pass to the right to Sammy Watkins for 62 yards to the Jax13. Tackled by Jalen Ramsey.","(4:42) Brad Nortman punts for 61 yards to Buf0. Touchback. Penalty: Illegal Formation on Jacksonville (Myles Jack) 5 yards.","(4:46) Blake Bortles incomplete pass to the left intended for Allen Hurns defensed by Lorenzo Alexander.","(4:51) Blake Bortles incomplete pass to the middle intended for Marqise Lee.","(5:34) Denard Robinson rush up the middle for no gain to the Jax39. Tackled by Jerry Hughes and Kyle Williams.","(6:15) T.J. Yeldon rush to the right for 3 yards to the Jax39. Tackled by Leger Douzable and Kyle Williams.","(6:38) Penalty: Offside on Buffalo (Jerry Hughes) 5 yards.","(7:11) Denard Robinson rush to the right for 2 yards to the Jax31. Tackled by Leger Douzable and Preston Brown.","(7:21) Colton Schmidt punts for 43 yards to Jax29. No return.","(8:00) Tyrod Taylor sacked at Buf28 for a loss of 5 yards by Malik Jackson.","(8:47) Tyrod Taylor rush to the left for 5 yards to the Buf33. Tackled by Johnathan Cyprien.","(9:26) LeSean McCoy rush to the left for 3 yards to the Buf28. Tackled by Malik Jackson.","(9:26) Jason Myers kicks off to the endzone. Touchback.","(9:26) Jason Myers extra point is good.","(9:32) Blake Bortles pass to the middle to Marqise Lee for 20 yards for a TOUCHDOWN.","(10:12) Denard Robinson rush to the right for 4 yards to the Buf20. Tackled by James Ihedigbo.","(10:16) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(10:47) Blake Bortles pass to the right to Neal Sterling for 10 yards to the Buf24. Tackled by Corey White.","(11:26) Denard Robinson rush up the middle for 1 yard to the Buf34. Tackled by Preston Brown and Leger Douzable.","(11:31) Blake Bortles incomplete pass to the right intended for Allen Hurns.","(12:07) T.J. Yeldon rush to the right for 6 yards to the Buf35. Tackled by Kyle Williams and Preston Brown.","(12:07) Jacksonville Jaguars timeout.","(12:52) Denard Robinson rush up the middle for 2 yards to the Buf41. Tackled by Preston Brown and Kyle Williams.","(13:29) Denard Robinson rush to the right for 3 yards to the Buf43. Tackled by Kyle Williams and Jerry Hughes.","(13:59) Blake Bortles pass to the left to Ben Koyack for 17 yards to the Buf46. Tackled by James Ihedigbo and Corey Graham.","(14:39) Denard Robinson rush to the right for 2 yards to the Jax37. Tackled by Marcell Dareus and Kyle Williams.","(14:47) Jordan Gay kicks off to the Jax23. Corey Grant return for 12 yards to Jax35. Tackled by Kevon Seymour.","(14:47) Dan Carpenter extra point is good.","(15:00) LeSean McCoy rush up the middle for 75 yards for a TOUCHDOWN.","(15:00) Jason Myers kicks off to the endzone. Touchback.","(0:15) Blake Bortles rush up the middle for a loss of 1 yard to the Jax27.","(0:20) Jordan Gay kicks off to the Jax15. Denard Robinson return for 13 yards to Jax28. Tackled by Ramon Humber.","(0:20) Dan Carpenter extra point is NO GOOD.","(0:24) LeSean McCoy rush to the right for 7 yards for a TOUCHDOWN.","(1:00) Jonathan Williams rush up the middle for 6 yards to the Jax7. Tackled by Johnathan Cyprien.","(1:00) Jacksonville Jaguars timeout.","(1:11) Tyrod Taylor pass to the left to Walt Powell for 1 yard to the Jax13. Tackled by Prince Amukamara.","(1:18) Tyrod Taylor pass to the right to Brandon Tate for 8 yards to the Jax14. Tackled by Telvin Smith.","(1:24) Tyrod Taylor incomplete pass to the left intended for Nick O'Leary.","(1:38) Brad Nortman punts for 43 yards to Buf30. Brandon Tate return for 43 yards to Jax27. Tackled by Peyton Thompson. Penalty: Illegal Formation on Jacksonville (Myles Jack) 5 yards.","(1:53) Penalty: Running into Kicker on Buffalo (Lerentee McCray) 5 yards.","(1:53) Buffalo Bills timeout.","(2:00) Denard Robinson rush to the right for 7 yards to the Jax22. Tackled by Preston Brown and Jerry Hughes.","(2:00) Two Minute Warning.","(2:38) Blake Bortles sacked at Jax15 for a loss of 5 yards by Marcell Dareus.","(3:14) T.J. Yeldon rush up the middle for a loss of 2 yards to the Jax20. Tackled by Zach Brown and Preston Brown.","(3:21) Colton Schmidt punts for 36 yards to Jax22. No return.","(3:27) Tyrod Taylor incomplete pass to the left intended for Jonathan Williams.","(4:06) Tyrod Taylor rush to the left for 8 yards to the Buf42. Tackled by Prince Amukamara.","(4:48) Tyrod Taylor sacked at Buf34 for no gain by Myles Jack and Tyson Alualu.","(5:08) LeSean McCoy rush up the middle for 2 yards to the Buf44. Tackled by Tyson Alualu. Penalty: Holding on Buffalo (Jordan Mills) -10 yards.","(5:38) Tyrod Taylor pass to the right to Marquise Goodwin for 5 yards to the Buf42. Tackled by Prince Amukamara.","(6:18) LeSean McCoy rush to the left for a loss of 1 yard to the Buf37. Tackled by Telvin Smith.","(6:57) Tyrod Taylor pass to the left to Sammy Watkins for 6 yards to the Buf38. Tackled by Prince Amukamara.","(7:30) Tyrod Taylor pass to the right to Sammy Watkins for 12 yards to the Buf32.","(7:38) Brad Nortman punts for 42 yards to Buf0. Touchback.","(7:42) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Corey White.","(8:27) T.J. Yeldon rush to the right for 5 yards to the Buf42. Tackled by Corey Graham.","(8:35) Blake Bortles incomplete pass to the right.","(8:53) Buffalo Bills timeout.","(8:53) Blake Bortles pass to the right to Neal Sterling for 6 yards to the Buf47. Tackled by Zach Brown.","(9:33) T.J. Yeldon rush up the middle for 1 yard to the Jax47. Tackled by Marcell Dareus.","(10:18) Blake Bortles pass to the left to T.J. Yeldon for 3 yards to the Jax46. Tackled by Preston Brown and Marcell Dareus.","(10:26) Colton Schmidt punts for 29 yards to Jax43. No return.","(10:33) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(10:34) Penalty: False Start on Buffalo (Jordan Mills) -5 yards.","(11:18) Tyrod Taylor sacked at Buf33 for a loss of 5 yards by Malik Jackson.","(11:58) LeSean McCoy rush to the right for a loss of 2 yards to the Buf38. Tackled by Tyson Alualu.","(12:05) Penalty: Pass Interference on Jacksonville (Tashaun Gipson) 22 yards.","(12:46) LeSean McCoy rush to the left for a loss of 2 yards to the Buf18. Tackled by Paul Posluszny.","(13:30) Tyrod Taylor rush up the middle for 6 yards to the Buf20. Tackled by Paul Posluszny and Telvin Smith.","(14:11) Tyrod Taylor pass to the right to LeSean McCoy for 6 yards to the Buf14. Tackled by Paul Posluszny.","(14:51) LeSean McCoy rush to the right for 1 yard to the Buf8. Tackled by Telvin Smith.","(15:00) Brad Nortman punts for 39 yards to Buf7. No return.","(0:36) Blake Bortles sacked at Buf46 for a loss of 3 yards by Marcell Dareus.","(0:41) Blake Bortles incomplete pass to the right intended for T.J. Yeldon.","(1:18) T.J. Yeldon rush to the left for 4 yards to the Buf43. Tackled by Kyle Williams and Corey Graham.","(2:07) Chris Ivory rush up the middle for 10 yards to the Buf47. Tackled by Jonathan Meeks.","(2:29) Marqise Lee rush to the right for 2 yards to the Jax43. Tackled by Corey Graham.","(2:41) Colton Schmidt punts for 52 yards to Jax31. Rashad Greene Sr. return for 10 yards to Jax41. FUMBLE, recovered by Jax (Rashad Greene Sr.).","(3:18) Tyrod Taylor sacked at Buf17 for a loss of 3 yards by Yannick Ngakoue.","(3:24) Tyrod Taylor incomplete pass to the left intended for Charles Clay.","(3:56) LeSean McCoy rush to the right for 3 yards to the Buf20. Tackled by Tyson Alualu.","(4:09) Brad Nortman punts for 43 yards to Buf17. Brandon Tate - no return. Tackled by Peyton Thompson.","(4:14) Blake Bortles incomplete pass to the left intended for Allen Hurns.","(4:20) Blake Bortles incomplete pass to the left intended for Allen Hurns defensed by Kevon Seymour.","(4:39) Blake Bortles pass to the right to Chris Ivory for 11 yards to the Jax40. Tackled by Ronald Darby and Zach Brown.","(4:53) Penalty: False Start on Jacksonville (Chris Reed) -5 yards.","(5:37) Chris Ivory rush to the right for 4 yards to the Jax34. Tackled by Jerry Hughes and Zach Brown.","(6:10) Blake Bortles rush to the right for 4 yards to the Jax30. Tackled by Ronald Darby.","(6:33) Penalty: Offside on Buffalo (Kyle Williams) 5 yards.","(6:42) Colton Schmidt punts for 47 yards to Jax23. Rashad Greene Sr. - no return. FUMBLE, recovered by Jax (Rashad Greene Sr.).","(7:04) Tyrod Taylor sacked at Buf30 for a loss of 2 yards by Johnathan Cyprien.","(7:39) Tyrod Taylor pass to the right to Charles Clay for 10 yards to the Buf32. Tackled by Telvin Smith.","(8:15) LeSean McCoy rush to the right for a loss of 3 yards to the Buf22. Tackled by Jalen Ramsey.","(8:15) Jason Myers kicks off to the endzone. Touchback.","(8:15) Jason Myers extra point is good.","(8:21) Chris Ivory rush to the right for 2 yards for a TOUCHDOWN.","(8:26) Penalty: Holding on Buffalo (Corey White) 1 yards.","(8:26) Jacksonville Jaguars timeout.","(9:01) Blake Bortles rush to the left for 7 yards to the Buf3. Tackled by Lorenzo Alexander.","(9:41) Chris Ivory rush to the right for a loss of 2 yards to the Buf10. Tackled by Marcell Dareus and Leger Douzable.","(10:16) Chris Ivory rush to the left for 14 yards to the Buf8. Tackled by Corey Graham.","(11:07) Blake Bortles rush to the left for 27 yards to the Buf22.","(11:50) Chris Ivory rush to the left for a loss of 2 yards to the Buf49. Tackled by Zach Brown and Preston Brown.","(12:34) Chris Ivory rush to the right for 6 yards to the Buf47. Tackled by Lorenzo Alexander.","(13:13) Blake Bortles pass to the right to Marqise Lee for 10 yards to the Jax47. Tackled by Ronald Darby.","(14:11) Chris Ivory rush to the left for 2 yards to the Jax37. Tackled by Marcell Dareus and Adolphus Washington.","(14:17) Blake Bortles incomplete pass to the right intended for Allen Hurns.","(15:00) Chris Ivory rush to the left for 10 yards to the Jax35. Tackled by Ronald Darby and James Ihedigbo.","(15:00) Jordan Gay kicks off to the endzone. Touchback."]