["(0:35) Russell Wilson rush up the middle for a loss of 1 yard to the Sea47.","(1:06) Russell Wilson rush up the middle for a loss of 1 yard to the Sea48.","(1:47) Russell Wilson rush up the middle for a loss of 2 yards to the Sea49.","(1:52) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(1:57) Carson Wentz incomplete pass to the right intended for Zach Ertz.","(1:57) Two Minute Warning.","(2:03) Penalty: Pass Interference on Philadelphia (Dorial Green-Beckham) -9 yards.","(2:07) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(2:32) Carson Wentz pass to the left to Dorial Green-Beckham for 9 yards to the Sea41. Tackled by Jeremy Lane.","(2:44) Carson Wentz pass to the left to Wendell Smallwood for 18 yards to the Phi50. Tackled by Bobby Wagner and Kam Chancellor.","(3:08) Carson Wentz pass to the left to Dorial Green-Beckham for 21 yards to the Phi32. Tackled by Steven Terrell.","(3:17) Penalty: Illegal Shift on Philadelphia -5 yards.","(3:28) Jon Ryan punts for 31 yards to Phi16. No return.","(3:28) Philadelphia Eagles timeout.","(3:32) Will Tukuafu rush up the middle for 2 yards to the Phi47. Tackled by Nigel Bradham and Beau Allen.","(3:32) Philadelphia Eagles timeout.","(3:37) Russell Wilson rush to the right for 4 yards to the Phi49. Tackled by Malcolm Jenkins.","(3:37) Philadelphia Eagles timeout.","(3:41) Trevone Boykin rush up the middle for a loss of 5 yards to the Sea47. Tackled by Fletcher Cox.","(3:42) Caleb Sturgis onside kickoff to the Phi48. Onside kick recovered by receiving team by Luke Willson.","(3:42) Carson Wentz 2 pt conversion pass to Nelson Agholor is GOOD.","(3:46) Carson Wentz pass to the left to Dorial Green-Beckham for 5 yards for a TOUCHDOWN.","(4:12) Carson Wentz pass to the left to Wendell Smallwood for 4 yards to the Sea5. Tackled by K.J. Wright and Steven Terrell.","(4:36) Carson Wentz pass to the left to Dorial Green-Beckham for 8 yards to the Sea9. Tackled by DeAndre Elliott.","(5:14) Wendell Smallwood rush to the right for a loss of 2 yards to the Sea17. Tackled by Bobby Wagner.","(5:37) Wendell Smallwood rush up the middle for 4 yards to the Sea15. Tackled by Jarran Reed.","(5:42) Carson Wentz incomplete pass to the left intended for Nelson Agholor.","(5:47) Penalty: Offside on Seattle (Cassius Marsh) 5 yards.","(6:08) Carson Wentz pass to the left to Jordan Matthews for 11 yards to the Sea24. Tackled by Neiko Thorpe.","(6:11) Carson Wentz incomplete pass to the right intended for Jordan Matthews defensed by Jarran Reed.","(6:39) Carson Wentz pass to the left to Wendell Smallwood for 5 yards to the Sea35. Tackled by K.J. Wright.","(7:15) Carson Wentz pass to the left to Jordan Matthews for 26 yards to the Sea40. Tackled by Steven Terrell.","(7:19) 44 yard field goal attempt by Steven Hauschka is NO GOOD. Holder: Jon Ryan.","(7:30) Russell Wilson incomplete pass to the right.","(8:13) Thomas Rawls rush to the left for 3 yards to the Phi26. Tackled by Nolan Carroll.","(8:50) Thomas Rawls rush to the left for 2 yards to the Phi29. Tackled by Fletcher Cox.","(9:20) Russell Wilson pass to the right to Doug Baldwin for 17 yards to the Phi31. Tackled by Jordan Hicks.","(9:55) Thomas Rawls rush to the right for 2 yards to the Phi48. Tackled by Connor Barwin and Bennie Logan.","(10:38) Thomas Rawls rush to the left for 9 yards to the Sea50. Tackled by Malcolm Jenkins.","(10:42) Carson Wentz incomplete pass to the right intended for Zach Ertz defensed by K.J. Wright.","(11:25) Carson Wentz pass to the right to Zach Ertz for 7 yards to the Sea41. Tackled by Jeremy Lane.","(11:29) Carson Wentz incomplete pass to the left intended for Zach Ertz defensed by Tony McDaniel.","(11:33) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(11:54) Carson Wentz pass to the left to Jordan Matthews for 12 yards to the Sea48. Tackled by Jeremy Lane.","(12:37) Wendell Smallwood rush to the left for 3 yards to the Phi40. Tackled by Jeremy Lane and Bobby Wagner.","(12:43) Carson Wentz incomplete pass to the left intended for Zach Ertz.","(13:09) Wendell Smallwood rush to the left for 6 yards to the Phi37. Tackled by Bobby Wagner and Frank Clark.","(13:34) Carson Wentz pass to the left to Jordan Matthews for 6 yards to the Phi31. Tackled by Bobby Wagner.","(13:34) Steven Hauschka kicks off to the endzone. Touchback.","(13:37) Steven Hauschka 35 yard field goal attempt is GOOD. Holder: Jon Ryan.","(13:43) Russell Wilson incomplete pass to the middle intended for Jimmy Graham.","(13:45) Russell Wilson incomplete pass to the left intended for Tyler Lockett.","(13:51) Russell Wilson incomplete pass to the right intended for Jimmy Graham defensed by Rodney McLeod.","(14:21) Russell Wilson pass to the right to Tyler Lockett for 9 yards to the Phi17. Tackled by Jalen Mills.","(15:00) Troymaine Pope rush to the left for 2 yards to the Phi26. Tackled by Fletcher Cox and Jordan Hicks.","(0:40) Russell Wilson pass to the right to Paul Richardson for 6 yards to the Phi28. Tackled by Leodis McKelvin and Jaylen Watkins.","(1:16) Russell Wilson rush up the middle for 7 yards to the Phi34. Tackled by Nigel Bradham.","(1:27) Donnie Jones punts for 43 yards to Sea40. Tyler Lockett return for 19 yards to Phi41. Tackled by Wendell Smallwood.","(1:50) Carson Wentz sacked at Phi17 for a loss of 14 yards by Cliff Avril. FUMBLE, recovered by Phi (Halapoulivaati Vaitai).","(2:36) Kenjon Barner rush up the middle for no gain to the Phi31. Tackled by Bobby Wagner and Frank Clark.","(3:16) Wendell Smallwood rush to the left for 4 yards to the Phi31. Tackled by Jarran Reed and Kam Chancellor.","(3:56) Wendell Smallwood rush to the right for 18 yards to the Phi27. Tackled by Richard Sherman and Steven Terrell.","(3:59) Carson Wentz incomplete pass to the right intended for Trey Burton.","(4:09) Jon Ryan punts for 52 yards to Phi18. Kenjon Barner - no return. Tackled by DeAndre Elliott and Neiko Thorpe. Penalty: Unnecessary Roughness on Philadelphia (Trey Burton) -9 yards.","(4:42) Russell Wilson pass to the right to Thomas Rawls for 2 yards to the Sea30. Tackled by Leodis McKelvin.","(5:28) Russell Wilson rush to the right for 3 yards to the Sea28. Tackled by Jordan Hicks.","(6:03) Thomas Rawls rush up the middle for 3 yards to the Sea25. Tackled by Bennie Logan.","(6:13) Donnie Jones punts for 56 yards to Sea11. Tyler Lockett return for 11 yards to Sea22. Tackled by Kamu Grugier-Hill and Wendell Smallwood.","(6:17) Carson Wentz incomplete pass to the middle intended for Jordan Matthews.","(6:17) Seattle Seahawks timeout.","(6:56) Carson Wentz pass to the left to Wendell Smallwood for 4 yards to the Phi33. Tackled by K.J. Wright.","(7:31) Wendell Smallwood rush to the left for 4 yards to the Phi29. Tackled by K.J. Wright.","(7:31) Steven Hauschka kicks off to the endzone. Touchback.","(7:31) Steven Hauschka extra point is good.","(7:38) Doug Baldwin pass to the left to Russell Wilson for 15 yards for a TOUCHDOWN.","(8:14) Thomas Rawls rush up the middle for 2 yards to the Phi15. Tackled by Brandon Graham and Jaylen Watkins.","(8:50) Russell Wilson pass to the right to Thomas Rawls for 9 yards to the Phi17. Tackled by Nigel Bradham.","(9:15) Russell Wilson pass to the right to Doug Baldwin for 34 yards to the Phi26. Tackled by Jaylen Watkins.","(9:38) Thomas Rawls rush up the middle for a loss of 1 yard to the Sea40. Tackled by Bennie Logan and Jordan Hicks.","(9:47) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(9:56) Carson Wentz pass intended for Bryce Treggs INTERCEPTED by Richard Sherman. No return. Tackled by Bryce Treggs.","(10:35) Wendell Smallwood rush to the left for 4 yards to the Phi6. Tackled by Jeremy Lane.","(10:48) Jon Ryan punts for 58 yards to Phi2. No return.","(11:22) Russell Wilson sacked at Sea40 for no gain by Vinny Curry and Marcus Smith.","(12:06) Troymaine Pope rush to the left for 1 yard to the Sea40. Tackled by Destiny Vaeao and Marcus Smith.","(12:38) Russell Wilson rush to the left for 3 yards to the Sea39. Tackled by Vinny Curry.","(13:02)  FUMBLE, recovered by Sea (Russell Wilson). Russell Wilson pass to the left to Doug Baldwin for 9 yards to the Sea36. Tackled by Nolan Carroll.","(13:18) Russell Wilson incomplete pass to the left intended for Doug Baldwin defensed by Leodis McKelvin.","(14:01) Thomas Rawls rush up the middle for 5 yards to the Sea27. Tackled by Leodis McKelvin.","(14:13) Donnie Jones punts for 60 yards to Sea21. Tyler Lockett return for 1 yard to Sea22. Tackled by Bryan Braman.","(14:19) Carson Wentz incomplete pass to the right intended for Kenjon Barner.","(14:19) Penalty: False Start on Philadelphia (Jason Peters) -5 yards.","(14:24) Carson Wentz incomplete pass to the right intended for Jordan Matthews defensed by Richard Sherman.","(15:00) Wendell Smallwood rush to the left for a loss of 1 yard to the Phi24. Tackled by K.J. Wright.","(15:00) Steven Hauschka kicks off to the endzone. Touchback.","(0:04) Russell Wilson pass to the left to Thomas Rawls for 20 yards to the Phi40. Tackled by Jordan Hicks.","(0:10) Russell Wilson incomplete pass to the left intended for Paul Richardson.","(0:16) Russell Wilson incomplete pass to the right intended for C.J. Prosise.","(0:24) Carson Wentz pass intended for Dorial Green-Beckham INTERCEPTED by Kam Chancellor and returned for 5 yards. Tackled by Zach Ertz.","(0:45) Carson Wentz pass to the middle to Zach Ertz for 3 yards to the Phi50. Tackled by K.J. Wright and Bobby Wagner.","(1:10) Carson Wentz pass to the right to Zach Ertz for 3 yards to the Phi47. Tackled by Bobby Wagner.","(1:34) Kenjon Barner rush to the left for 6 yards to the Phi44. Tackled by K.J. Wright and Earl Thomas.","(1:45) Jon Ryan punts for 43 yards to Phi23. Darren Sproles return for 15 yards to Phi38. Tackled by Nolan Frese and Brock Coyle.","(1:45) Philadelphia Eagles timeout.","(1:53) Russell Wilson pass to the left to Luke Willson for 12 yards to the Sea34. Tackled by Malcolm Jenkins and Jalen Mills.","(1:53) Philadelphia Eagles timeout.","(1:59) Russell Wilson pass to the right to C.J. Prosise for 5 yards to the Sea22. Tackled by Jordan Hicks.","(1:59) Two Minute Warning.","(2:04) C.J. Prosise rush to the right for 2 yards to the Sea17. Tackled by Nigel Bradham.","(2:24) Penalty: False Start on Seattle (Garry Gilliam) -5 yards.","(2:47) Penalty: Holding on Seattle (Mark Glowinski) -10 yards.","(2:53) Donnie Jones punts for 37 yards to Sea30. No return.","(2:56) Carson Wentz incomplete pass to the right intended for Jordan Matthews defensed by Kam Chancellor.","(3:42) Darren Sproles rush to the right for 8 yards to the Phi33. Tackled by Richard Sherman.","(3:47) Carson Wentz incomplete pass to the middle intended for Nelson Agholor.","(3:47) Steven Hauschka kicks off to the endzone. Touchback.","(3:50) Steven Hauschka 21 yard field goal attempt is GOOD. Holder: Jon Ryan.","(3:52) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(3:58) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(4:29) Thomas Rawls rush up the middle for no gain to the Phi3. Tackled by Brandon Graham.","(4:47) Russell Wilson pass to the left to Tyler Lockett for 30 yards to the Phi3. Tackled by Rodney McLeod.","(5:32) Russell Wilson pass to the right to Doug Baldwin for 44 yards to the Phi33. Tackled by Malcolm Jenkins.","(5:38) Donnie Jones punts for 39 yards to Sea23. No return.","(5:45) Carson Wentz incomplete pass to the left intended for Nelson Agholor.","(5:57) Penalty: Illegal Formation on Philadelphia -5 yards.","(6:40) Wendell Smallwood rush to the right for no gain to the Phi43. Tackled by Bobby Wagner and John Jenkins.","(7:20) Carson Wentz pass to the middle to Jordan Matthews for 4 yards to the Phi43. Tackled by K.J. Wright.","(7:52) Carson Wentz pass to the middle to Zach Ertz for 11 yards to the Phi39. Tackled by Bobby Wagner.","(8:20) Wendell Smallwood rush to the left for 3 yards to the Phi28. Tackled by Kam Chancellor and John Jenkins.","(8:20) Steven Hauschka kicks off to the endzone. Touchback.","(8:20) Steven Hauschka extra point is good.","(8:30) Russell Wilson pass to the left to Jimmy Graham for 35 yards for a TOUCHDOWN.","(8:36) Penalty: Offside on Philadelphia (Brandon Graham) 5 yards.","(9:01) Penalty: Pass Interference on Seattle (Jermaine Kearse) -10 yards.","(9:38) Thomas Rawls rush to the left for 1 yard to the Phi30. Tackled by Fletcher Cox and Malcolm Jenkins.","(10:09) Thomas Rawls rush to the left for 3 yards to the Phi31. Tackled by Mychal Kendricks and Connor Barwin.","(10:45) Thomas Rawls rush to the left for 18 yards to the Phi34. Tackled by Nolan Carroll and Rodney McLeod.","(11:22) Thomas Rawls rush up the middle for 1 yard to the Sea48. Tackled by Nigel Bradham.","(11:56) Thomas Rawls rush to the right for 9 yards to the Sea47. Tackled by Mychal Kendricks.","(12:03) Penalty: Holding on Philadelphia (Malcolm Jenkins) 5 yards.","(12:38) Russell Wilson pass to the right to Jimmy Graham for 6 yards to the Sea33. Tackled by Jaylen Watkins.","(13:06) Russell Wilson pass to the left to Jermaine Kearse for 17 yards to the Sea27. Tackled by Nolan Carroll.","(13:06) Penalty: False Start on Seattle (Mark Glowinski) -5 yards.","(13:14) Russell Wilson incomplete pass to the left intended for Thomas Rawls defensed by Nolan Carroll.","(13:41) Penalty: False Start on Seattle (George Fant) -5 yards.","(14:07) Russell Wilson pass to the left to Jermaine Kearse for 12 yards to the Sea20. Tackled by Nolan Carroll.","(14:13) Caleb Sturgis kicks off to the Sea1. Tyler Lockett return for 7 yards to Sea8. Tackled by Jaylen Watkins.","(14:13) Caleb Sturgis extra point is good.","(14:19) Carson Wentz pass to the left to Zach Ertz for 4 yards for a TOUCHDOWN.","(15:00) Ryan Mathews rush to the right for 5 yards to the Sea4. Tackled by Bobby Wagner and Earl Thomas.","(0:23) Carson Wentz pass to the middle to Brent Celek for 19 yards to the Sea9. Tackled by Richard Sherman and Kam Chancellor.","(0:57) Ryan Mathews rush to the left for 1 yard to the Sea28. Tackled by Jeremy Lane.","(1:37) Carson Wentz rush up the middle for 2 yards to the Sea29. Tackled by Frank Clark.","(2:02) Ryan Mathews rush to the right for 2 yards to the Sea31. Tackled by John Jenkins and Bobby Wagner.","(2:38) Darren Sproles rush to the left for 7 yards to the Sea33. Tackled by Neiko Thorpe and Bobby Wagner.","(3:14) Wendell Smallwood rush to the right for 4 yards to the Sea40. Tackled by Richard Sherman.","(4:14) Carson Wentz pass to the left to Darren Sproles for 6 yards to the Sea44. Tackled by K.J. Wright.","(4:58) Wendell Smallwood rush to the left for 1 yard to the Phi50. Tackled by Neiko Thorpe and Damontre Moore.","(5:34) Carson Wentz pass to the right to Dorial Green-Beckham for 11 yards to the Phi49. Tackled by Kam Chancellor and Neiko Thorpe.","(6:08) Carson Wentz pass to the right to Zach Ertz for 7 yards to the Phi38. Tackled by Kam Chancellor.","(6:48) Ryan Mathews rush to the right for a loss of 1 yard to the Phi31. Tackled by Bobby Wagner and Brock Coyle.","(7:02) Jon Ryan punts for 49 yards to Phi32. No return.","(7:08) Russell Wilson incomplete pass to the left intended for Paul Richardson.","(7:51) C.J. Prosise rush to the left for a loss of 6 yards to the Sea19. Tackled by Nigel Bradham and Malcolm Jenkins.","(8:31) Russell Wilson pass to the right to Jimmy Graham for 5 yards to the Sea25. Tackled by Malcolm Jenkins.","(8:39) Donnie Jones punts for 54 yards to Sea0. Touchback.","(9:02) Carson Wentz sacked at Phi46 for a loss of 9 yards by Bobby Wagner.","(9:02) Philadelphia Eagles timeout.","(9:47) Ryan Mathews rush to the right for 1 yard to the Sea45. Tackled by K.J. Wright and Brock Coyle.","(9:54) Carson Wentz incomplete pass to the middle intended for Bryce Treggs defensed by Earl Thomas.","(10:32) Kenjon Barner rush to the left for 11 yards to the Sea46. Tackled by Earl Thomas.","(11:02) Ryan Mathews rush to the left for 18 yards to the Phi43. Tackled by Earl Thomas and Kam Chancellor.","(11:02) Steven Hauschka kicks off to the endzone. Touchback.","(11:02) Steven Hauschka extra point is BLOCKED.","(11:14) C.J. Prosise rush to the right for 72 yards for a TOUCHDOWN.","(11:50) C.J. Prosise rush up the middle for 8 yards to the Sea28. Tackled by Rodney McLeod.","(11:58) Donnie Jones punts for 55 yards to Sea0. Touchback.","(12:07) Carson Wentz incomplete pass to the left.","(12:11) Carson Wentz incomplete pass to the right intended for Wendell Smallwood.","(12:15) Carson Wentz incomplete pass to the right intended for Zach Ertz.","(12:19) Penalty: Pass Interference on Seattle (Richard Sherman) 8 yards.","(13:18) Penalty: False Start on Philadelphia (Jason Peters) -5 yards.","(13:18) Ryan Mathews rush up the middle for 5 yards to the Phi42. Tackled by Cliff Avril.","(13:47) Carson Wentz pass to the right to Trey Burton for 14 yards to the Phi37. Tackled by Kam Chancellor and Deshawn Shead.","(13:54) Jon Ryan punts for 46 yards to Phi23. No return.","(14:28) Russell Wilson rush up the middle for 6 yards to the Sea31. Tackled by Connor Barwin.","(14:31) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(15:00) Russell Wilson pass to the left to C.J. Prosise for no gain to the Sea25. Tackled by Mychal Kendricks and Nolan Carroll.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback."]