["(0:02) Drew Brees pass to the left to Michael Thomas for 21 yards to the Car43. Tackled by Daryl Worley and Thomas Davis.","(0:06) Drew Brees pass to the left to Michael Thomas for 11 yards to the NO36. Tackled by Daryl Worley.","(0:14) Drew Brees pass to the left to Tim Hightower for 11 yards to the NO25.","(0:28) Michael Palardy punts for 52 yards to NO13. Marcus Murphy return for 11 yards to NO24. Tackled by Jared Norris and Shaq Thompson. Penalty: Holding on New Orleans (Nate Stupar) -10 yards.","(0:28) Carolina Panthers timeout.","(1:14) Fozzy Whittaker rush to the right for no gain to the Car35. Tackled by Craig Robertson and Dannell Ellerbe.","(2:00) Mike Tolbert rush up the middle for no gain to the Car35. Tackled by Kenny Vaccaro and Cameron Jordan.","(2:00) Two Minute Warning.","(2:26) Jonathan Stewart rush up the middle for 2 yards to the Car35. Tackled by Nate Stupar and Sheldon Rankins.","(2:26) New Orleans Saints timeout.","(2:39) Cam Newton pass to the left to Kelvin Benjamin for 18 yards to the Car33. Tackled by Sterling Moore.","(2:39) New Orleans Saints timeout.","(2:43) Cam Newton rush to the right for no gain to the Car15. Tackled by Nate Stupar.","(2:47) Cam Newton incomplete pass to the right intended for Jonathan Stewart.","(2:52) Wil Lutz kicks off to the Car0. Joe Webb return for 15 yards to Car15. Tackled by Shiloh Keo.","(2:52) Wil Lutz extra point is good.","(2:56) Drew Brees pass to the middle to Coby Fleener for 8 yards for a TOUCHDOWN.","(3:01) Drew Brees incomplete pass to the left intended for Josh Hill defensed by Kony Ealy.","(3:43) Penalty: False Start on New Orleans (Zach Strief) -5 yards.","(3:43) Drew Brees pass to the right to Willie Snead for 6 yards to the Car3. Tackled by David Mayo.","(3:49) Drew Brees pass to the left to Michael Thomas for 9 yards to the Car9. Tackled by Thomas Davis.","(3:55) Penalty: Offside on Carolina (Star Lotulelei) 5 yards.","(4:20) Drew Brees pass to the left to Tim Hightower for 10 yards to the Car23. Tackled by Charles Johnson and Tre Boston.","(4:56) Tim Hightower rush to the right for 4 yards to the Car33. Tackled by Robert McClain and Luke Kuechly.","(5:04) Drew Brees pass to the left to Tim Hightower for 8 yards to the Car37. Tackled by Daryl Worley.","(5:26) Drew Brees pass to the right to Brandin Cooks for 3 yards to the Car45. Tackled by James Bradberry and Robert McClain.","(5:38) Drew Brees pass to the left to Michael Thomas for 11 yards to the Car48. Tackled by Daryl Worley.","(6:08) Drew Brees pass to the left to Tim Hightower for 4 yards to the NO41. Tackled by Thomas Davis.","(6:41) Tim Hightower rush to the left for 3 yards to the NO37. Tackled by Charles Johnson and Vernon Butler.","(7:13) Tim Hightower rush to the right for 5 yards to the NO34. Tackled by Tre Boston.","(7:33) Penalty: Holding on Carolina (Luke Kuechly) 5 yards.","(8:03) Tim Hightower rush to the left for no gain to the NO24. Tackled by Charles Johnson and Kurt Coleman.","(8:14) Michael Palardy punts for 56 yards to NO29. Marcus Murphy return for 5 yards to NO34. Tackled by David Mayo. Penalty: Illegal Block on New Orleans (Nate Stupar) -10 yards.","(8:14) New Orleans Saints timeout.","(8:28) Cam Newton rush to the right for 12 yards to the Car15. Tackled by Paul Kruger and Kenny Vaccaro.","(9:14) Mike Tolbert rush up the middle for a loss of 1 yard to the Car3. Tackled by Paul Kruger.","(9:55) Jonathan Stewart rush up the middle for a loss of 3 yards to the Car4. Tackled by Nick Fairley.","(10:05) Thomas Morstead punts for 50 yards to Car8. Ted Ginn Jr. return for a loss of 1 yard to Car7. FUMBLE, recovered by Car (Ted Ginn Jr.).","(10:12) Drew Brees incomplete pass to the left intended for Brandon Coleman defensed by Tre Boston.","(10:17) Drew Brees incomplete pass to the right intended for Willie Snead defensed by Luke Kuechly.","(10:44) Drew Brees pass to the left to John Kuhn for 3 yards to the NO42. Tackled by Daryl Worley.","(10:55) Michael Palardy punts for 41 yards to NO31. Marcus Murphy return for 8 yards to NO39. Tackled by J.J. Jansen and David Mayo.","(11:02) Penalty: Illegal Plyr Downfld on Carolina (Joe Webb) -5 yards.","(11:07) Cam Newton incomplete pass to the right intended for Kelvin Benjamin defensed by Ken Crawley.","(11:11) Cam Newton incomplete pass to the right intended for Jonathan Stewart.","(11:15) Cam Newton incomplete pass to the right intended for Greg Olsen.","(11:22) Wil Lutz kicks off to the Car-1. Joe Webb return for 34 yards to Car33. Tackled by Josh Hill and Stephone Anthony.","(11:22) Wil Lutz extra point is good.","(11:27) Drew Brees pass to the left to Brandon Coleman for 9 yards for a TOUCHDOWN.","(12:05) Tim Hightower rush to the left for 4 yards to the Car9. Tackled by Kyle Love and Kurt Coleman.","(12:30) Tim Hightower rush to the right for 27 yards to the Car13. Tackled by Kurt Coleman.","(12:59) Tim Hightower rush up the middle for 11 yards to the Car40. Tackled by Robert McClain.","(13:15) Michael Palardy punts for 50 yards to NO27. Marcus Murphy return for 22 yards to NO49. Tackled by Fozzy Whittaker.","(13:24) Cam Newton incomplete pass to the right intended for Greg Olsen.","(14:06) Jonathan Stewart rush to the right for 3 yards to the Car23. Tackled by Jairus Byrd.","(14:51) Jonathan Stewart rush to the right for 1 yard to the Car20. Tackled by Darryl Tapp and Nate Stupar.","(14:56) Wil Lutz kicks off to the Car12. Fozzy Whittaker return for 7 yards to Car19. Tackled by Shiloh Keo.","(15:00) Wil Lutz 30 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(0:38) Drew Brees pass to the left to Tim Hightower for 4 yards to the Car12. Tackled by Daryl Worley and Luke Kuechly.","(1:16) Drew Brees sacked at Car16 for a loss of 4 yards by Kony Ealy.","(1:50) John Kuhn rush to the right for 1 yard to the Car12. Tackled by Star Lotulelei and Luke Kuechly.","(2:27) Drew Brees rush up the middle for 1 yard to the Car13. Tackled by Star Lotulelei.","(2:57) Brandin Cooks rush to the right for 3 yards to the Car14. Tackled by Leonard Johnson.","(3:31) Drew Brees pass to the left to Marcus Murphy for 3 yards to the Car17. Tackled by Daryl Worley.","(4:10) Tim Hightower rush up the middle for 3 yards to the Car20. Tackled by Luke Kuechly.","(4:39) Drew Brees pass to the left to Tim Hightower for 8 yards to the Car23. Tackled by Vernon Butler.","(5:13) Tim Hightower rush to the right for 2 yards to the Car31. Tackled by Kyle Love and James Bradberry.","(5:43) Drew Brees pass to the right to Brandin Cooks for 6 yards to the Car33. Tackled by James Bradberry.","(6:31) Drew Brees pass to the middle to Willie Snead for 4 yards to the Car39. Tackled by Leonard Johnson.","(7:09) Drew Brees pass to the right to Brandin Cooks for 1 yard to the Car43. Tackled by Luke Kuechly.","(7:14) Drew Brees incomplete pass to the right intended for Josh Hill.","(7:34) Mark Ingram rush to the right for 13 yards to the Car44. Tackled by Kurt Coleman.","(7:39) Penalty: Roughing Passer on Carolina (Charles Johnson) 15 yards.","(8:17) Mark Ingram rush to the right for a loss of 2 yards to the NO28. Tackled by Shaq Thompson and James Bradberry.","(8:17) Graham Gano kicks off to the endzone. Touchback. Penalty: Offside on Carolina (Corey Brown) 5 yards.","(8:23) Graham Gano 42 yard field goal attempt is GOOD. Holder: Michael Palardy.","(9:00) Cam Newton pass to the right to Ted Ginn Jr. for a loss of 2 yards to the NO24. Tackled by Sterling Moore.","(9:04) Cam Newton incomplete pass to the right intended for Corey Brown.","(9:09) Cam Newton incomplete pass to the right intended for Devin Funchess.","(9:48) Cam Newton pass to the left to Greg Olsen for 12 yards to the NO22. Tackled by Kenny Vaccaro and Vonn Bell.","(10:29) Jonathan Stewart rush up the middle for a loss of 5 yards to the NO34. Tackled by Cameron Jordan.","(11:15) Jonathan Stewart rush to the right for 5 yards to the NO29. Tackled by Vonn Bell and Sheldon Rankins.","(11:53) Cam Newton rush up the middle for 1 yard to the NO34. Tackled by Craig Robertson.","(12:32) Jonathan Stewart rush to the right for 9 yards to the NO35. Tackled by Sheldon Rankins and Craig Robertson.","(12:32) Carolina Panthers timeout.","(12:40) Cam Newton incomplete pass to the left.","(13:17) Cam Newton pass to the right to Kelvin Benjamin for 19 yards to the NO44. Tackled by Craig Robertson and Sterling Moore.","(13:55) Cam Newton pass to the left to Greg Olsen for 3 yards to the Car37. Tackled by Vonn Bell.","(14:24) Jonathan Stewart rush up the middle for 1 yard to the Car34. Tackled by Craig Robertson.","(15:00) Cam Newton pass to the right to Ted Ginn Jr. for 8 yards to the Car33. Tackled by Sterling Moore.","(15:00) Wil Lutz kicks off to the endzone. Touchback.","(0:16) Drew Brees rush up the middle for a loss of 1 yard to the NO24.","(0:16) Graham Gano kicks off to the endzone. Touchback.","(0:16) Graham Gano extra point is good.","(0:23) Cam Newton pass to the middle to Ted Ginn Jr. for 40 yards for a TOUCHDOWN.","(0:39) Wil Lutz 38 yard field goal attempt is BLOCKED by Vernon Butler. Return blocked field goal by Luke Kuechly to the NO30. Penalty: Illegal Block on Carolina (James Bradberry) -10 yards.","(0:42) Drew Brees incomplete pass to the left intended for Mark Ingram.","(0:42) Penalty: False Start on New Orleans (Coby Fleener) -5 yards.","(0:42) New Orleans Saints timeout.","(0:57) Drew Brees pass to the left to Mark Ingram for 15 yards to the Car15. Tackled by Leonard Johnson.","(1:25) Drew Brees sacked at Car30 for a loss of 10 yards by Mario Addison.","(1:25) New Orleans Saints timeout.","(1:41) Drew Brees pass to the left to Mark Ingram for 22 yards to the Car20. Tackled by Tre Boston.","(2:00) Drew Brees pass to the right to Willie Snead for 9 yards to the Car42. Tackled by Thomas Davis.","(2:00) Two Minute Warning.","(2:17) Drew Brees pass to the right to Coby Fleener for 8 yards to the NO49. Tackled by Luke Kuechly.","(2:50) Drew Brees pass to the right to Michael Thomas for 16 yards to the NO41. Tackled by Tre Boston.","(2:50) Graham Gano kicks off to the endzone. Touchback.","(2:55) Graham Gano 49 yard field goal attempt is GOOD. Holder: Michael Palardy.","(3:02) Cam Newton incomplete pass to the right intended for Corey Brown defensed by Vonn Bell.","(3:09) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(3:40) Jonathan Stewart rush up the middle for 2 yards to the NO32. Tackled by Paul Kruger and Nate Stupar.","(4:12) Cam Newton pass to the left to Mike Tolbert for 17 yards to the NO34. Tackled by B.W. Webb.","(4:18) Thomas Morstead punts for 41 yards to Car49. No return.","(4:22) Drew Brees incomplete pass to the right intended for Tim Hightower defensed by Charles Johnson.","(5:01) Tim Hightower rush to the right for 4 yards to the NO10. Tackled by James Bradberry and Thomas Davis.","(5:39) Drew Brees pass to the right to Brandin Cooks for 5 yards to the NO6. Tackled by James Bradberry.","(5:40) Graham Gano kicks off to the NO1. Marcus Murphy - no return.","(5:40) Graham Gano extra point is good.","(5:43) Jonathan Stewart rush up the middle for 1 yard for a TOUCHDOWN.","(6:23) Jonathan Stewart rush to the right for no gain to the NO1. Tackled by Cameron Jordan and Roman Harper.","(7:01) Cam Newton pass to the right to Greg Olsen for 10 yards to the NO1. Tackled by Sterling Moore.","(7:06) Cam Newton incomplete pass to the left intended for Devin Funchess defensed by B.W. Webb.","(7:42) Jonathan Stewart rush to the right for no gain to the NO11. Tackled by Sheldon Rankins and Tyeler Davison.","(8:06) Cam Newton rush to the right for 2 yards to the NO23. Tackled by Dannell Ellerbe. Penalty: Unnecessary Roughness on New Orleans (Vonn Bell) 12 yards.","(8:06) Carolina Panthers timeout.","(8:43) Cam Newton pass to the right to Greg Olsen for 8 yards to the NO25. Tackled by Vonn Bell.","(9:17) Jonathan Stewart rush up the middle for 1 yard to the NO33. Tackled by Craig Robertson and Tyeler Davison.","(9:31) Drew Brees pass intended for Coby Fleener INTERCEPTED by Kurt Coleman and returned for 12 yards. Tackled by Andrus Peat.","(9:32) Michael Palardy punts for 38 yards to NO0. Touchback.","(10:16) Cam Newton sacked at NO38 for a loss of 8 yards by Dannell Ellerbe.","(10:20) Cam Newton incomplete pass to the left intended for Jonathan Stewart.","(10:24) Cam Newton incomplete pass to the right intended for Ed Dickson.","(10:56) Cam Newton pass to the left to Devin Funchess for 20 yards to the NO30. Tackled by B.W. Webb.","(11:29) Cam Newton pass to the left to Devin Funchess for 12 yards to the Car50. Tackled by Jairus Byrd and B.W. Webb.","(11:41) Thomas Morstead punts for 50 yards to Car27. Ted Ginn Jr. return for 11 yards to Car38. Tackled by Josh Hill.","(11:47) Drew Brees incomplete pass to the right intended for Coby Fleener.","(12:21) Drew Brees pass to the right to John Kuhn for 6 yards to the NO23. Tackled by Luke Kuechly.","(12:58) Mark Ingram rush to the left for a loss of 2 yards to the NO17. Tackled by Luke Kuechly.","(13:29) Drew Brees pass to the middle to Mark Ingram for 10 yards to the NO19. Tackled by Thomas Davis and Luke Kuechly.","(13:36) Michael Palardy punts for 43 yards to NO9. No return.","(13:42) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by Ken Crawley.","(14:17) Jonathan Stewart rush up the middle for a loss of 2 yards to the Car48. Tackled by Sheldon Rankins and Vonn Bell.","(14:26) Cam Newton incomplete pass to the right intended for Devin Funchess.","(15:00) Cam Newton pass to the middle to Kelvin Benjamin for 19 yards to the Car50. Tackled by Kenny Vaccaro.","(0:30) Jonathan Stewart rush to the right for 6 yards to the Car31. Tackled by Vonn Bell and Craig Robertson.","(0:36) Cam Newton incomplete pass to the middle intended for Greg Olsen.","(0:36) Wil Lutz kicks off to the endzone. Touchback.","(0:40) Wil Lutz 27 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(1:04) Drew Brees pass to the right to Coby Fleener for 1 yard to the Car9. Tackled by Kurt Coleman. FUMBLE, recovered by NO (Coby Fleener).","(1:52) Drew Brees pass to the left to Brandin Cooks for 4 yards to the Car10. Tackled by Shaq Thompson.","(2:29) Brandin Cooks rush to the left for 4 yards to the Car14. Tackled by Daryl Worley.","(3:14) Drew Brees pass to the left to Willie Snead for 14 yards to the Car18. Tackled by Vernon Butler and Daryl Worley.","(3:52) Tim Hightower rush to the right for 2 yards to the Car32. Tackled by Kurt Coleman.","(4:33) Drew Brees pass to the left to John Phillips for no gain to the Car34. Tackled by Thomas Davis.","(5:04) John Kuhn rush up the middle for 2 yards to the Car34. Tackled by Mario Addison and Star Lotulelei.","(5:39) Mark Ingram rush to the left for 3 yards to the Car36. Tackled by Luke Kuechly.","(6:16) Drew Brees pass to the left to Tim Hightower for 6 yards to the Car39. Tackled by Luke Kuechly and Kawann Short.","(6:47) Tim Hightower rush to the left for 4 yards to the Car45. Tackled by Kurt Coleman.","(7:17) Drew Brees pass to the left to Tim Hightower for 6 yards to the Car49. Tackled by Shaq Thompson and Luke Kuechly.","(7:49) Mark Ingram rush to the right for 14 yards to the NO45. Tackled by Luke Kuechly.","(8:23) Drew Brees pass to the right to Brandin Cooks for 11 yards to the NO31. Tackled by James Bradberry.","(8:29) Graham Gano kicks off to the NO1. Marcus Murphy return for 19 yards to NO20. Tackled by Fozzy Whittaker.","(8:34) Graham Gano 32 yard field goal attempt is GOOD. Holder: Michael Palardy.","(8:39) Cam Newton incomplete pass to the right intended for Devin Funchess.","(8:45) Cam Newton incomplete pass to the middle intended for Mike Tolbert defensed by Cameron Jordan.","(9:26) Cam Newton rush to the left for a loss of 8 yards to the NO14. Tackled by Dannell Ellerbe and Paul Kruger.","(9:30) Penalty: Running into Kicker on New Orleans (Kenny Vaccaro) 6 yards.","(9:36) Cam Newton incomplete pass to the right intended for Corey Brown defensed by Tyeler Davison.","(10:23) Cam Newton sacked at NO12 for a loss of 11 yards by Nate Stupar.","(11:05) Jonathan Stewart rush to the left for no gain to the NO1. Tackled by Stephone Anthony and Darryl Tapp.","(11:24) Ted Ginn Jr. rush to the left for 13 yards to the NO1. Tackled by Craig Robertson and B.W. Webb.","(12:06) Cam Newton pass to the right to Jonathan Stewart for 8 yards to the NO14. Tackled by Darryl Tapp.","(12:49) Jonathan Stewart rush up the middle for 10 yards to the NO22. Tackled by Kenny Vaccaro and Vonn Bell.","(13:15) Jonathan Stewart rush to the left for no gain to the NO32. Tackled by Craig Robertson.","(13:23) Drew Brees sacked at NO32 for a loss of 7 yards by Mario Addison. FUMBLE, recovered by Car (Mario Addison). Tackled by Drew Brees.","(13:58) Mark Ingram rush to the left for 1 yard to the NO39. Tackled by Luke Kuechly.","(14:28) Mark Ingram rush up the middle for 1 yard to the NO38. Tackled by Thomas Davis and Wes Horton.","(14:57) Drew Brees pass to the right to Brandin Cooks for 12 yards to the NO37. Tackled by Kurt Coleman.","(15:00) Drew Brees incomplete pass to the right intended for Brandin Cooks.","(15:00) Graham Gano kicks off to the endzone. Touchback."]
