["(0:41) Kirk Cousins rush up the middle for a loss of 1 yard to the GB35.","(1:21) Kirk Cousins rush up the middle for a loss of 1 yard to the GB34.","(1:31) Brett Hundley pass intended for Ty Montgomery INTERCEPTED by Martrell Spaight and returned for 8 yards. Tackled by Kyle Murphy.","(1:36) Brett Hundley incomplete pass to the left intended for Jared Cook.","(2:00) Brett Hundley pass to the right to Jordy Nelson for 9 yards to the GB33. Tackled by Donte Whitner and Martrell Spaight.","(2:00) Two Minute Warning.","(2:26)  FUMBLE, recovered by GB (Brett Hundley) and advanced for a loss of 1 yard. Brett Hundley rush up the middle for no gain to the GB24. Tackled by Su'a Cravens.","(2:26) Dustin Hopkins kicks off to the endzone. Touchback.","(2:26) Dustin Hopkins extra point is good.","(2:30) Rob Kelley rush to the right for 4 yards for a TOUCHDOWN. Penalty: Unnecessary Roughness on Green Bay (Datone Jones) 15 yards.","(2:30) Green Bay Packers timeout.","(2:52) Rob Kelley rush to the right for 66 yards to the GB4. Tackled by Ladarius Gunter.","(2:52) Green Bay Packers timeout.","(2:59) Rob Kelley rush to the right for 2 yards to the Was30. Tackled by Kenny Clark.","(3:05) Aaron Rodgers pass to the right to Jared Cook for 6 yards to the Was32. Tackled by Josh Norman. FUMBLE, recovered by Was (Will Compton). Tackled by Jared Cook.","(3:29) Aaron Rodgers pass to the left to Ty Montgomery for 8 yards to the Was38. Tackled by Preston Smith.","(3:40) Aaron Rodgers pass to the middle to Davante Adams for 37 yards to the Was46.","(3:47) Aaron Rodgers incomplete pass to the left.","(3:54) Dustin Hopkins kicks off to the GB3. Ty Montgomery return for 14 yards to GB17. Tackled by Deshazor Everett and Kendall Fuller.","(3:54) Dustin Hopkins extra point is NO GOOD.","(3:59) Rob Kelley rush to the left for 1 yard for a TOUCHDOWN.","(4:44) Kirk Cousins pass to the left to Jamison Crowder for 53 yards to the GB1. Tackled by Kentrell Brice.","(4:51) Kirk Cousins incomplete pass to the left intended for Pierre Garcon defensed by Ladarius Gunter.","(5:28) Rob Kelley rush to the left for 3 yards to the Was46. Tackled by Ha Ha Clinton-Dix.","(6:12) Kirk Cousins rush to the right for 2 yards to the Was43. Tackled by Letroy Guion.","(6:45) Rob Kelley rush up the middle for 1 yard to the Was41. Tackled by Nick Perry.","(7:26) Rob Kelley rush to the left for 2 yards to the Was40. Tackled by Mike Daniels.","(8:11) Rob Kelley rush to the left for 6 yards to the Was38. Tackled by Blake Martinez.","(8:35) Kirk Cousins pass to the right to DeSean Jackson for 6 yards to the Was32.","(9:18) Kirk Cousins pass to the right to DeSean Jackson for 11 yards to the Was26.","(9:55) Rob Kelley rush to the left for a loss of 4 yards to the Was15. Tackled by Blake Martinez.","(10:04) Mason Crosby kicks off to the Was3. Chris Thompson return for 16 yards to Was19. Tackled by Kyler Fackrell.","(10:04) Mason Crosby extra point is good.","(10:08) Aaron Rodgers pass to the left to Jared Cook for 6 yards for a TOUCHDOWN.","(10:46) Aaron Rodgers pass to the left to Jared Cook for 8 yards to the Was6. Tackled by Will Compton.","(11:30) Aaron Rodgers pass to the right to James Starks for 6 yards to the Was14. Tackled by Will Compton and Chris Baker.","(12:09) James Starks rush to the left for 8 yards to the Was20. Tackled by Donte Whitner.","(12:51) Aaron Rodgers rush up the middle for 9 yards to the Was28. Tackled by Will Compton.","(13:35) Aaron Rodgers pass to the middle to Randall Cobb for 47 yards to the Was37. Tackled by Donte Whitner.","(13:42) Aaron Rodgers incomplete pass to the middle intended for Jared Cook.","(14:18) James Starks rush to the right for a loss of 2 yards to the GB16. Tackled by Trent Murphy and Cullen Jenkins.","(14:25) Dustin Hopkins kicks off to the GB7. Ty Montgomery return for 11 yards to GB18. Tackled by Duke Ihenacho.","(14:25) Dustin Hopkins extra point is good.","(14:36) Kirk Cousins pass to the middle to Pierre Garcon for 70 yards for a TOUCHDOWN.","(14:51) Kirk Cousins pass to the right to Pierre Garcon for 5 yards to the Was30.","(14:51) Mason Crosby kicks off to the endzone. Touchback.","(14:51) Mason Crosby extra point is good.","(15:00) Aaron Rodgers pass to the right to James Starks for 31 yards for a TOUCHDOWN.","(0:09) Ty Montgomery rush to the left for 7 yards to the Was31. Tackled by Will Blackmon.","(0:14) Aaron Rodgers incomplete pass to the right intended for Davante Adams.","(0:52) Aaron Rodgers pass to the left to Jared Cook for 29 yards to the Was38. Tackled by Duke Ihenacho.","(1:33) James Starks rush to the right for 5 yards to the GB33. Tackled by Trent Murphy and Will Compton.","(2:00) James Starks rush to the right for 3 yards to the GB28. Tackled by Su'a Cravens and Will Compton.","(2:00) Dustin Hopkins kicks off to the endzone. Touchback.","(2:00) Kirk Cousins 2 pt rush attempt.","(2:07) Kirk Cousins pass to the middle to Jamison Crowder for 44 yards for a TOUCHDOWN.","(2:07) Penalty: Delay of Game on Washington (Kirk Cousins) -5 yards.","(2:13) Kirk Cousins incomplete pass to the left intended for Rob Kelley.","(2:56) Rob Kelley rush to the right for 4 yards to the GB39. Tackled by Mike Daniels and Blake Martinez.","(3:38) Kirk Cousins pass to the right to DeSean Jackson for 17 yards to the GB43. Tackled by Ladarius Gunter.","(4:10) Kirk Cousins pass to the left to Chris Thompson for 9 yards to the Was40. Tackled by Joe Thomas.","(4:57) Kirk Cousins pass to the left to Jordan Reed for 2 yards to the Was31. Tackled by Micah Hyde.","(5:34) Rob Kelley rush to the left for 3 yards to the Was29. Tackled by Morgan Burnett and Mike Daniels.","(5:39) 36 yard field goal attempt by Mason Crosby is NO GOOD. Holder: Jacob Schum.","(5:45) Aaron Rodgers incomplete pass to the left intended for Geronimo Allison.","(6:28) Penalty: False Start on Green Bay (Jason Spriggs) -5 yards.","(6:28) Aaron Rodgers pass to the left to Davante Adams for 2 yards to the Was13. Tackled by Su'a Cravens.","(6:32) Aaron Rodgers incomplete pass to the left intended for Jared Cook defensed by Trent Murphy.","(7:17) Aaron Rodgers pass to the left to Randall Cobb for 22 yards to the Was20. Tackled by Kendall Fuller. Penalty: Delay of Game on Washington (Bashaud Breeland) 5 yards.","(7:58) Aaron Rodgers pass to the right to Richard Rodgers for 2 yards to the Was42. Tackled by Donte Whitner.","(8:36) Aaron Rodgers pass to the right to Jared Cook for 47 yards to the Was44. Tackled by Will Blackmon.","(8:41) Aaron Rodgers incomplete pass to the right intended for Davante Adams.","(9:20) Aaron Ripkowski rush up the middle for 7 yards to the GB9. Tackled by Donte Whitner and Preston Smith.","(9:23) Dustin Hopkins kicks off to the GB2. Richard Rodgers - no return.","(9:28) Dustin Hopkins 37 yard field goal attempt is GOOD. Holder: Tress Way.","(10:06) Kirk Cousins sacked at GB19 for a loss of 4 yards by Julius Peppers.","(10:48) Rob Kelley rush up the middle for a loss of 1 yard to the GB15. Tackled by Julius Peppers and Letroy Guion.","(11:36) Rob Kelley rush to the right for 7 yards to the GB14. Tackled by Kenny Clark.","(12:20) Kirk Cousins pass to the middle to Jordan Reed for 28 yards to the GB21. Tackled by Kentrell Brice and Ladarius Gunter.","(12:58) Rob Kelley rush up the middle for 3 yards to the GB49. Tackled by Nick Perry.","(13:35) Rob Kelley rush to the left for 2 yards to the Was48. Tackled by Nick Perry.","(13:41) Penalty: Roughing Passer on Green Bay (Mike Daniels) 14 yards.","(14:13) Chris Thompson rush to the right for 1 yard to the Was32. Tackled by Morgan Burnett.","(14:49) Rob Kelley rush to the right for 3 yards to the Was31. Tackled by Clay Matthews.","(15:00) Mason Crosby kicks off to the Was4. Chris Thompson return for 24 yards to Was28. Tackled by Aaron Ripkowski and Joe Kerridge.","(0:32) Dustin Hopkins kicks off to the GB11. Jeff Janis return for 7 yards to GB18. Tackled by Terence Garvin and Martrell Spaight. FUMBLE, recovered by GB (Aaron Rodgers). Aaron Rodgers sacked at GB8 for a loss of 10 yards by Chris Baker.","(0:39) Chris Thompson 2 pt rush attempt.","(0:45) Rob Kelley rush to the right for 10 yards for a TOUCHDOWN.","(0:45) Washington Redskins timeout.","(0:52) Kirk Cousins pass to the left to Jamison Crowder for 5 yards to the GB10. Tackled by Micah Hyde.","(1:24) Kirk Cousins pass to the right to Jordan Reed for 18 yards to the GB15. Tackled by Quinten Rollins.","(2:00) Kirk Cousins pass to the middle to Jordan Reed for 5 yards to the GB33. Tackled by Blake Martinez and Joe Thomas.","(2:00) Two Minute Warning.","(2:18) Rob Kelley rush to the right for 5 yards to the GB38. Tackled by Morgan Burnett.","(2:57) Kirk Cousins pass to the middle to Jordan Reed for 26 yards to the GB43. Tackled by Kentrell Brice and Morgan Burnett.","(3:29) Chris Thompson rush to the right for 9 yards to the Was31. Tackled by Ha Ha Clinton-Dix.","(3:29) Green Bay Packers timeout.","(3:37) Rob Kelley rush up the middle for a loss of 3 yards to the Was22. Tackled by Mike Daniels and Kenny Clark.","(3:37) Mason Crosby kicks off to the endzone. Touchback.","(3:41) Mason Crosby 36 yard field goal attempt is GOOD. Holder: Jacob Schum.","(4:19) Aaron Rodgers sacked at Was18 for a loss of 10 yards by Ryan Kerrigan.","(5:02) James Starks rush to the left for a loss of 2 yards to the Was8. Tackled by Will Compton.","(5:02) Green Bay Packers timeout.","(5:47) Aaron Rodgers rush to the left for 17 yards to the Was6. Tackled by Bashaud Breeland.","(6:17) Penalty: Holding on Green Bay (Don Barclay) -10 yards.","(6:56) Aaron Rodgers pass to the right to Richard Rodgers for 11 yards to the Was13. Tackled by Donte Whitner.","(7:35) Aaron Rodgers pass to the middle to James Starks for 5 yards to the Was29. Tackled by Josh Norman and Su'a Cravens. Penalty: Delay of Game on Washington (Josh Norman) 5 yards.","(8:13) Aaron Rodgers pass to the left to Randall Cobb for 15 yards to the Was34. Tackled by Kendall Fuller.","(8:20) Aaron Rodgers incomplete pass to the middle intended for Jeff Janis.","(8:59) James Starks rush to the right for 7 yards to the Was49. Tackled by Donte Whitner.","(9:10) Tress Way punts for 46 yards to GB34. Randall Cobb return for 10 yards to GB44. Tackled by Terence Garvin.","(9:16) Kirk Cousins incomplete pass to the right intended for Chris Thompson defensed by Julius Peppers.","(9:16) Penalty: False Start on Washington (Jamison Crowder) -5 yards.","(9:21) Kirk Cousins incomplete pass to the right intended for Chris Thompson.","(9:27) Kirk Cousins incomplete pass to the left intended for Rob Kelley.","(9:27) Mason Crosby kicks off to the endzone. Touchback.","(9:27) Mason Crosby extra point is good.","(9:34) Aaron Rodgers pass to the right to Jordy Nelson for 13 yards for a TOUCHDOWN. Penalty: Roughing Passer on Washington (Su'a Cravens) 15 yards.","(9:39) Penalty: Holding on Green Bay (Don Barclay) -10 yards.","(10:17) Aaron Rodgers pass to the left to Davante Adams for 3 yards to the Was3. Tackled by Bashaud Breeland.","(10:22) Aaron Rodgers incomplete pass to the left intended for Jared Cook.","(11:01) Aaron Rodgers pass to the left to Jared Cook for 9 yards to the Was6. Tackled by Bashaud Breeland.","(11:40) Ty Montgomery rush to the left for 3 yards to the Was15. Tackled by Will Compton and Cullen Jenkins.","(12:20) Aaron Rodgers rush to the right for 7 yards to the Was18.","(13:02) Aaron Rodgers pass to the left to James Starks for 4 yards to the Was25. Tackled by Josh Norman and Donte Whitner.","(13:06) Aaron Rodgers incomplete pass to the right intended for James Starks.","(13:49) James Starks rush to the right for 4 yards to the Was29. Tackled by Ziggy Hood.","(13:56) Penalty: Illegal Use of Hands on Washington (Bashaud Breeland) 5 yards.","(14:00) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Su'a Cravens.","(14:23) Penalty: Delay of Game on Green Bay (Aaron Rodgers) -5 yards.","(15:00) Aaron Rodgers pass to the left to Jordy Nelson for 6 yards to the Was33. Tackled by Bashaud Breeland.","(0:30) James Starks rush to the left for 2 yards to the Was39. Tackled by Will Compton and Ricky Jean Francois.","(1:09) Aaron Rodgers pass to the left to Ty Montgomery for 10 yards to the Was41. Tackled by Bashaud Breeland.","(1:49) Aaron Rodgers pass to the left to Richard Rodgers for 10 yards to the GB49. Tackled by Donte Whitner and Bashaud Breeland.","(2:28) Aaron Rodgers pass to the right to Ty Montgomery for 9 yards to the GB39. Tackled by Donte Whitner.","(2:32) Aaron Rodgers incomplete pass to the left intended for Randall Cobb.","(2:56) Aaron Rodgers pass to the right to Richard Rodgers for 5 yards to the GB30. Tackled by Su'a Cravens.","(2:56) Dustin Hopkins kicks off to the endzone. Touchback.","(2:56) Dustin Hopkins extra point is good.","(3:03) Kirk Cousins pass to the middle to DeSean Jackson for 17 yards for a TOUCHDOWN.","(3:46) Rob Kelley rush up the middle for 3 yards to the GB17. Tackled by Joe Thomas.","(4:23) Kirk Cousins pass to the left to Pierre Garcon for 5 yards to the GB20. Tackled by Ladarius Gunter and Micah Hyde.","(5:05) Kirk Cousins pass to the middle to Maurice Harris for 14 yards to the GB25. Tackled by Ladarius Gunter.","(5:40) Kirk Cousins rush to the right for 4 yards to the GB39. Tackled by Quinten Rollins.","(5:45) Kirk Cousins incomplete pass to the right intended for Vernon Davis defensed by Morgan Burnett.","(6:26) Kirk Cousins pass to the right to Ryan Grant for 4 yards to the GB43. Tackled by Quinten Rollins.","(6:48) Kirk Cousins pass to the left to Pierre Garcon for 8 yards to the GB47. Tackled by Ha Ha Clinton-Dix and Ladarius Gunter.","(6:58) Jacob Schum punts for 46 yards to Was37. Jamison Crowder return for 8 yards to Was45. Tackled by Kyler Fackrell.","(7:02) Aaron Rodgers incomplete pass to the left intended for Davante Adams defensed by Bashaud Breeland.","(7:34) Ty Montgomery rush to the right for 3 yards to the GB17. Tackled by Ricky Jean Francois.","(8:00) Ty Montgomery rush to the left for 4 yards to the GB14. Tackled by Bashaud Breeland.","(8:07) Tress Way punts for 40 yards to GB10. No return.","(8:14) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(8:19) Kirk Cousins incomplete pass to the left intended for Jordan Reed defensed by Blake Martinez.","(9:00) Rob Kelley rush to the right for 1 yard to the Was50. Tackled by Datone Jones and Joe Thomas.","(9:40) Kirk Cousins pass to the middle to Pierre Garcon for 17 yards to the Was49. Tackled by Ladarius Gunter.","(10:16) Rob Kelley rush up the middle for 18 yards to the Was32. Tackled by Ha Ha Clinton-Dix.","(10:49) Kirk Cousins pass to the left to Pierre Garcon for 11 yards to the Was14.","(11:29) Rob Kelley rush to the right for a loss of 3 yards to the Was3. Tackled by Joe Thomas.","(11:41) Jacob Schum punts for 58 yards to Was6. No return.","(12:16) Aaron Rodgers pass to the left to James Starks for no gain to the GB36. Tackled by Bashaud Breeland.","(12:21) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(12:50) Aaron Ripkowski rush to the right for 2 yards to the GB36. Tackled by Will Compton.","(12:58) Tress Way punts for 28 yards to GB34. No return.","(13:31) Kirk Cousins sacked at Was38 for a loss of 7 yards by Nick Perry.","(13:35) Kirk Cousins incomplete pass to the middle intended for DeSean Jackson.","(13:59) Rob Kelley rush to the right for 4 yards to the Was45. Tackled by Blake Martinez.","(14:07) Jacob Schum punts for 34 yards to Was41. No return.","(14:15) Aaron Rodgers incomplete pass to the right intended for Jared Cook.","(14:52) James Starks rush to the right for no gain to the GB25. Tackled by Kendall Fuller and Chris Baker.","(15:00) Aaron Rodgers incomplete pass to the right intended for Randall Cobb.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback."]