["(0:05) Joe Flacco incomplete pass to the right intended for Kamar Aiken.","(0:14) Joe Flacco pass to the right to Kyle Juszczyk for 8 yards to the Dal41. Tackled by Anthony Brown.","(0:27) Penalty: False Start on Baltimore -5 yards.","(0:45) Joe Flacco pass to the right to Kyle Juszczyk for 13 yards to the Dal44. Tackled by Anthony Brown and Byron Jones.","(0:50) Joe Flacco incomplete pass to the right intended for Kenneth Dixon.","(1:15) Joe Flacco pass to the right to Dennis Pitta for 18 yards to the Bal43. Tackled by Jeff Heath and Orlando Scandrick.","(1:40) Joe Flacco pass to the left to Dennis Pitta for 8 yards to the Bal25. Tackled by Byron Jones.","(1:50) Joe Flacco pass to the middle to Steve Smith Sr. for 7 yards to the Bal32. Tackled by Sean Lee. Penalty: Unnecessary Roughness on Baltimore (Steve Smith Sr.) -15 yards.","(1:50) Dan Bailey kicks off to the endzone. Touchback.","(1:54) Dan Bailey 21 yard field goal attempt is GOOD. Holder: Chris Jones.","(1:54) Baltimore Ravens timeout.","(2:00) Ezekiel Elliott rush up the middle for 6 yards to the Bal3. Tackled by Zachary Orr.","(2:00) Two Minute Warning.","(2:07) Ezekiel Elliott rush to the left for no gain to the Bal9. Tackled by Zachary Orr.","(2:07) Baltimore Ravens timeout.","(2:12) Ezekiel Elliott rush to the left for 3 yards to the Bal9. Tackled by Zachary Orr and Albert McClellan.","(2:12) Baltimore Ravens timeout.","(2:18) Ezekiel Elliott rush to the left for 11 yards to the Bal12. Tackled by Shareece Wright.","(3:01) Ezekiel Elliott rush to the left for 2 yards to the Bal23. Tackled by Terrell Suggs.","(3:49) Dak Prescott pass to the middle to Cole Beasley for 17 yards to the Bal25. Tackled by Jerraud Powers.","(4:31) Ezekiel Elliott rush to the right for 1 yard to the Bal42. Tackled by Michael Pierce.","(5:17) Dak Prescott pass to the right to Brice Butler for 8 yards to the Bal43. Tackled by C.J. Mosley and Tavon Young.","(5:56) Ezekiel Elliott rush to the right for 2 yards to the Dal49. Tackled by Eric Weddle and Michael Pierce.","(6:40) Dak Prescott pass to the left to Cole Beasley for 17 yards to the Dal47. Tackled by Albert McClellan.","(7:25) Ezekiel Elliott rush to the right for no gain to the Dal30. Tackled by Terrell Suggs and Brandon Williams.","(8:10) Ezekiel Elliott rush to the right for 5 yards to the Dal30. Tackled by Brandon Williams.","(8:16) Justin Tucker kicks off to the endzone. Touchback.","(8:16) Penalty: Offside on Baltimore (Matt Judon) -5 yards.","(8:16) Justin Tucker extra point is good.","(8:21) Joe Flacco pass to the right to Steve Smith Sr. for 5 yards for a TOUCHDOWN.","(8:31) Joe Flacco incomplete pass to the left intended for Kamar Aiken.","(9:13) Joe Flacco pass to the right to Steve Smith Sr. for 17 yards to the Dal5. Tackled by Justin Durant.","(9:34) Joe Flacco sacked at Dal37 for a loss of 2 yards by Jack Crawford. Penalty: Face Mask on Dallas (Tyrone Crawford) 15 yards.","(10:17) Joe Flacco incomplete pass to the left intended for Dennis Pitta defensed by David Irving.","(10:49) Joe Flacco pass to the middle to Kamar Aiken for 18 yards to the Dal35. Tackled by Orlando Scandrick.","(11:24) Joe Flacco pass to the right to Steve Smith Sr. for 22 yards to the Bal47. Tackled by Byron Jones.","(11:30) Joe Flacco incomplete pass to the right intended for Terrance West.","(11:30) Dan Bailey kicks off to the endzone. Touchback.","(11:30) Dan Bailey extra point is good.","(11:37) Dak Prescott pass to the right to Dez Bryant for 13 yards for a TOUCHDOWN.","(12:14) Ezekiel Elliott rush to the right for 2 yards to the Bal13. Tackled by Lawrence Guy and Zachary Orr.","(12:56) Dak Prescott pass to the right to Gavin Escobar for 14 yards to the Bal15. Tackled by Za'Darius Smith and Lardarius Webb.","(13:36) Ezekiel Elliott rush to the left for a loss of 2 yards to the Bal29. Tackled by Terrell Suggs.","(14:15) Dak Prescott pass to the right to Jason Witten for 9 yards to the Bal27. Tackled by C.J. Mosley and Patrick Onwuasor.","(15:00) Ezekiel Elliott rush up the middle for 2 yards to the Bal36. Tackled by Zachary Orr.","(0:16) Dak Prescott pass to the right to Jason Witten for 11 yards to the Bal38. Tackled by Zachary Orr.","(0:54) Lance Dunbar rush to the right for 2 yards to the Bal49. Tackled by Brandon Williams and Michael Pierce.","(1:40) Dak Prescott pass to the right to Ezekiel Elliott for 17 yards to the Dal49. Tackled by Eric Weddle.","(2:27) Ezekiel Elliott rush to the right for a loss of 1 yard to the Dal32. Tackled by C.J. Mosley.","(3:08) Dak Prescott pass to the left to Jason Witten for 6 yards to the Dal33. Tackled by Zachary Orr.","(3:49) Ezekiel Elliott rush up the middle for 9 yards to the Dal27. Tackled by Eric Weddle.","(4:24) Ezekiel Elliott rush to the right for 6 yards to the Dal18. Tackled by C.J. Mosley.","(4:37) Sam Koch punts for 48 yards to Dal9. Lucky Whitehead return for 3 yards to Dal12. Tackled by Albert McClellan.","(5:19) Joe Flacco pass to the left to Mike Wallace for 2 yards to the Bal43. Tackled by J.J. Wilcox.","(6:00) Joe Flacco pass to the middle to Mike Wallace for 11 yards to the Bal41. Tackled by Brandon Carr.","(6:27) Kenneth Dixon rush to the right for 9 yards to the Bal45. Tackled by J.J. Wilcox and Anthony Brown. Penalty: Unnecessary Roughness on Baltimore (Jeremy Zuttah) -15 yards.","(7:00) Joe Flacco rush to the right for 6 yards to the Bal36. Tackled by J.J. Wilcox.","(7:31) Joe Flacco pass to the right to Steve Smith Sr. for 5 yards to the Bal30. Tackled by Orlando Scandrick.","(7:31) Dan Bailey kicks off to the endzone. Touchback.","(7:31) Dan Bailey extra point is good.","(7:37) Dak Prescott pass to the left to Dez Bryant for 4 yards for a TOUCHDOWN.","(8:10) Dak Prescott pass to the left to Jason Witten for 7 yards to the Bal4. Tackled by Lardarius Webb.","(8:48) Ezekiel Elliott rush to the left for 6 yards to the Bal11. Tackled by Eric Weddle and Timmy Jernigan.","(8:56)  FUMBLE, recovered by Dal (Dak Prescott). Dak Prescott incomplete pass to the left intended for Gavin Escobar defensed by Shareece Wright.","(9:04) Penalty: Pass Interference on Baltimore (Tavon Young) 33 yards.","(9:48) Ezekiel Elliott rush to the right for 3 yards to the Dal50. Tackled by Brandon Williams and C.J. Mosley.","(10:32) Dak Prescott pass to the right to Ezekiel Elliott for 8 yards to the Dal47. Tackled by Jerraud Powers.","(11:14) Ezekiel Elliott rush to the left for 14 yards to the Dal39. Tackled by Lardarius Webb.","(12:00) Dak Prescott pass to the right to Dez Bryant for 9 yards to the Dal25. Tackled by Tavon Young.","(12:41) Dak Prescott pass to the middle to Ezekiel Elliott for 6 yards to the Dal16. Tackled by Zachary Orr.","(13:20) Ezekiel Elliott rush to the right for 2 yards to the Dal10. Tackled by Brandon Williams.","(13:27) Sam Koch punts for 45 yards to Dal8. No return.","(13:34) Joe Flacco incomplete pass to the right intended for Mike Wallace defensed by Anthony Brown.","(13:41) Joe Flacco incomplete pass to the middle intended for Mike Wallace.","(14:20) Terrance West rush to the left for no gain to the Bal47. Tackled by Sean Lee.","(15:00) Joe Flacco pass to the right to Steve Smith Sr. for 22 yards to the Bal47. Tackled by Brandon Carr.","(15:00) Dan Bailey kicks off to the endzone. Touchback.","(0:04) Dan Bailey kicks off to the Bal0. Devin Hester return for 17 yards to Bal17. Tackled by Kyle Wilber. Penalty: Illegal Block on Baltimore (Kamalei Correa) -8 yards.","(0:08) Dan Bailey 30 yard field goal attempt is GOOD. Holder: Chris Jones.","(0:13) Dak Prescott pass to the left to Jason Witten for 4 yards to the Bal12.","(0:18) Dak Prescott pass to the left to Lance Dunbar for 8 yards to the Bal16. Tackled by Shareece Wright.","(0:18) Dallas Cowboys timeout.","(0:25) Dak Prescott pass to the left to Dez Bryant for 26 yards to the Bal24. Tackled by Eric Weddle.","(0:43) Penalty: False Start on Dallas (Jason Witten) -5 yards.","(1:04) Dak Prescott pass to the left to Dez Bryant for 16 yards to the Bal45. Tackled by Shareece Wright.","(1:10) Dak Prescott incomplete pass to the right intended for Cole Beasley.","(1:16) Dak Prescott pass to the left to Cole Beasley for 8 yards to the Dal39. Tackled by Shareece Wright.","(1:37) Dak Prescott pass to the middle to Lance Dunbar for 6 yards to the Dal31. Tackled by Lardarius Webb.","(1:37) Justin Tucker kicks off to the endzone. Touchback.","(1:42) Justin Tucker 46 yard field goal attempt is GOOD. Holder: Sam Koch.","(1:52) Joe Flacco pass to the right to Kamar Aiken for 12 yards to the Dal28. Tackled by Byron Jones.","(2:00) Penalty: Holding on Baltimore (Jeremy Zuttah) -10 yards.","(2:00) Two Minute Warning.","(2:37) Terrance West rush to the right for 6 yards to the Dal30. Tackled by Maliek Collins.","(2:48) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(3:24) Kenneth Dixon rush to the right for 5 yards to the Dal36. Tackled by Anthony Hitchens and Byron Jones.","(3:24) Dallas Cowboys timeout.","(3:56) Joe Flacco pass to the left to Terrance West for 11 yards to the Dal41. Tackled by J.J. Wilcox.","(4:34) Terrance West rush up the middle for a loss of 3 yards to the Bal48. Tackled by David Irving.","(5:18) Joe Flacco pass to the middle to Mike Wallace for 15 yards to the Bal47. Tackled by Cedric Thornton. FUMBLE, recovered by Bal (Kamar Aiken).","(5:55) Joe Flacco pass to the left to Mike Wallace for 7 yards to the Bal32. Tackled by Damien Wilson.","(5:55) Dan Bailey kicks off to the endzone. Touchback.","(5:55) Dan Bailey extra point is good.","(6:01) Dak Prescott pass to the right to Cole Beasley for 3 yards for a TOUCHDOWN. Penalty: Roughing Passer on Baltimore (C.J. Mosley) 15 yards.","(6:08) Dak Prescott incomplete pass to the middle intended for Jason Witten.","(6:33) Dak Prescott rush to the left for 4 yards to the Bal3. Tackled by Zachary Orr.","(7:15) Dak Prescott pass to the left to Brice Butler for 41 yards to the Bal7. Tackled by Shareece Wright.","(7:57) Dak Prescott pass to the left to Dez Bryant for 12 yards to the Bal48. Tackled by Shareece Wright.","(8:39) Dak Prescott rush to the left for 12 yards to the Dal40. Tackled by Eric Weddle.","(9:05) Penalty: Holding on Dallas (Tyron Smith) -10 yards.","(9:31) Penalty: Illegal Block on Dallas (Travis Frederick) -10 yards.","(9:41) Sam Koch punts for 36 yards to Dal38. No return. Penalty: Holding on Baltimore (Anthony Levine Sr.) 10 yards.","(10:22) Joe Flacco pass to the right to Kyle Juszczyk for 11 yards to the Bal26. Tackled by Justin Durant and Anthony Brown.","(11:08) Terrance West rush to the right for no gain to the Bal15. Tackled by Maliek Collins.","(11:36) Penalty: Holding on Baltimore (Jeremy Zuttah) -10 yards.","(12:11) Terrance West rush to the right for 5 yards to the Bal25. Tackled by Sean Lee and Anthony Brown.","(12:23) Chris Jones punts for 61 yards to Bal0. Touchback.","(12:28) Dak Prescott incomplete pass to the right intended for Jason Witten.","(12:37) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Shareece Wright.","(13:15) Alfred Morris rush to the right for 2 yards to the Dal39. Tackled by Michael Pierce and Brandon Williams.","(13:29) Sam Koch punts for 59 yards to Dal16. Lucky Whitehead return for 21 yards to Dal37. Tackled by Patrick Onwuasor.","(13:35) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(13:42) Joe Flacco incomplete pass to the right intended for Dennis Pitta.","(14:11) Kenneth Dixon rush to the right for 4 yards to the Bal25. Tackled by Justin Durant and Sean Lee.","(14:21) Dallas Cowboys timeout.","(14:21) Joe Flacco pass to the right to Steve Smith Sr. for 13 yards to the Bal21.","(15:00) Kenneth Dixon rush up the middle for a loss of 2 yards to the Bal8. Tackled by Tyrone Crawford.","(0:04) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(0:11) Chris Jones punts for 36 yards to Bal10. No return.","(0:20) Penalty: Illegal Touch on Dallas (Byron Jones) -5 yards.","(0:25) Dak Prescott incomplete pass to the right intended for Lance Dunbar.","(0:25) Baltimore Ravens timeout.","(1:08) Ezekiel Elliott rush to the right for no gain to the Bal41. Tackled by Lardarius Webb.","(1:52) Dak Prescott pass to the right to Ezekiel Elliott for a loss of 1 yard to the Bal41. Tackled by Tavon Young.","(2:39) Ezekiel Elliott rush to the right for 11 yards to the Bal40. Tackled by C.J. Mosley.","(3:20) Dak Prescott pass to the right to Terrance Williams for 11 yards to the Dal49. Tackled by Lardarius Webb.","(4:01) Ezekiel Elliott rush to the left for 4 yards to the Dal38. Tackled by Zachary Orr.","(4:44) Alfred Morris rush up the middle for 1 yard to the Dal34. Tackled by Za'Darius Smith and Brandon Williams.","(5:28) Ezekiel Elliott rush to the right for 8 yards to the Dal33. Tackled by Lardarius Webb.","(5:28) Justin Tucker kicks off to the endzone. Touchback.","(5:28) Justin Tucker extra point is good.","(5:35) Terrance West rush to the left for 18 yards for a TOUCHDOWN.","(6:18) Terrance West rush up the middle for 16 yards to the Dal18. Tackled by Terrell McClain and J.J. Wilcox.","(6:56) Kenneth Dixon rush to the left for 20 yards to the Dal34. Tackled by J.J. Wilcox.","(7:31) Joe Flacco pass to the right to Kamar Aiken for 5 yards to the Bal46. Tackled by Sean Lee.","(8:01) Joe Flacco pass to the middle to Mike Wallace for 27 yards to the Bal41. Tackled by Byron Jones.","(8:37) Kenneth Dixon rush to the right for 4 yards to the Bal14. Tackled by Anthony Hitchens.","(8:48) Chris Jones punts for 39 yards to Bal10. No return.","(8:54) Dak Prescott incomplete pass to the right intended for Terrance Williams.","(8:54) Penalty: Offside on Baltimore (Matt Judon) 5 yards.","(9:00) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(9:09) Dak Prescott incomplete pass to the left intended for Ezekiel Elliott.","(9:25) Penalty: Offside on Baltimore (Lawrence Guy) 5 yards.","(10:02) Dak Prescott pass to the left to Gavin Escobar for 7 yards to the Dal41. Tackled by C.J. Mosley.","(10:35) Dak Prescott pass to the right to Cole Beasley for 14 yards to the Dal34. Tackled by Lardarius Webb.","(10:45) Sam Koch punts for 49 yards to Dal0. Touchback.","(10:50) Joe Flacco incomplete pass to the left intended for Steve Smith Sr..","(11:29) Joe Flacco pass to the left to Dennis Pitta for 4 yards to the Dal49. Tackled by Byron Jones.","(12:03) Terrance West rush to the right for no gain to the Bal47. Tackled by Tyrone Crawford and Terrell McClain.","(12:34) Mike Wallace rush to the left for 13 yards to the Bal47. Tackled by J.J. Wilcox.","(13:05) Joe Flacco pass to the right to Steve Smith Sr. for 8 yards to the Bal34. Tackled by Anthony Hitchens.","(13:15) Chris Jones punts for 48 yards to Bal26. Devin Hester - no return. Tackled by Vince Mayle.","(13:49) Dak Prescott sacked at Dal26 for a loss of 2 yards by Albert McClellan.","(14:29) Ezekiel Elliott rush to the left for 2 yards to the Dal28. Tackled by Shareece Wright and Zachary Orr.","(15:00) Ezekiel Elliott rush to the left for 1 yard to the Dal26. Tackled by Michael Pierce and Brandon Williams.","(15:00) Justin Tucker kicks off to the endzone. Touchback."]