["(0:50) Eli Manning rush up the middle for a loss of 1 yard to the NYG22.","(1:11) Eli Manning rush up the middle for a loss of 1 yard to the NYG23.","(1:19) Jay Cutler pass intended for Marquess Wilson INTERCEPTED by Landon Collins and returned for 3 yards. Tackled by Marquess Wilson.","(1:23) Penalty: Illegal Shift on Chicago (Cameron Meredith) -5 yards.","(2:00) Jay Cutler sacked at NYG44 for a loss of 14 yards by Jason Pierre-Paul. FUMBLE, recovered by Chi (Mike Adams).","(2:00) Two Minute Warning.","(2:39) Jay Cutler pass to the middle to Joshua Bellamy for 23 yards to the NYG30. Tackled by Landon Collins.","(2:47) Penalty: Holding on Chicago (Ted Larsen) -10 yards.","(2:54) Jay Cutler incomplete pass to the middle intended for Marquess Wilson defensed by Jonathan Casillas.","(3:00) Jay Cutler pass to the right to Marquess Wilson for 35 yards to the NYG43. Tackled by Eli Apple.","(3:13) Brad Wing punts for 45 yards to Chi32. Eddie Royal - no return. Tackled by Zak DeOssie and Dwayne Harris. Penalty: Holding on Chicago (Chris Prosinski) -10 yards.","(3:18) Eli Manning incomplete pass to the right intended for Rashad Jennings defensed by Demontre Hurst.","(3:18) Chicago Bears timeout.","(3:25) Rashad Jennings rush to the right for 1 yard to the NYG23. Tackled by Demontre Hurst and C.J. Wilson.","(3:25) Chicago Bears timeout.","(3:31) Rashad Jennings rush up the middle for a loss of 1 yard to the NYG22. Tackled by Pernell McPhee and C.J. Wilson.","(3:40) Patrick O'Donnell punts for 44 yards to NYG23. No return.","(3:47) Jay Cutler incomplete pass to the right intended for Jordan Howard defensed by Keenan Robinson.","(4:00) Jay Cutler incomplete pass to the right.","(4:37) Jay Cutler rush to the right for 3 yards to the Chi33. Tackled by Janoris Jenkins.","(4:47) Brad Wing punts for 46 yards to Chi26. Eddie Royal return for 4 yards to Chi30. Tackled by Keenan Robinson.","(4:54) Eli Manning pass to the left to Odell Beckham Jr. for 6 yards to the NYG28. Tackled by Sam Acho. FUMBLE, recovered by NYG.","(5:37) Rashad Jennings rush to the left for no gain to the NYG22. Tackled by Danny Trevathan.","(6:07) Rashad Jennings rush to the left for 3 yards to the NYG22. Tackled by Akiem Hicks.","(6:40) Rashad Jennings rush to the left for 12 yards to the NYG19. Tackled by Bryce Callahan and Deon Bush.","(7:14) Rashad Jennings rush up the middle for 1 yard to the NYG7. Tackled by Danny Trevathan and Akiem Hicks.","(7:25) Patrick O'Donnell punts for 67 yards to NYG6. No return.","(8:10) Jay Cutler pass to the left to Cameron Meredith for 17 yards to the Chi27. Tackled by Eli Apple.","(8:56) Jay Cutler sacked at Chi10 for a loss of 6 yards by Johnathan Hankins and Jason Pierre-Paul.","(9:37) Jordan Howard rush to the right for a loss of 2 yards to the Chi16. Tackled by Jonathan Casillas.","(9:47) Brad Wing punts for 42 yards to Chi18. No return.","(10:24) Eli Manning pass to the left to Odell Beckham Jr. for 3 yards to the NYG40. Tackled by Danny Trevathan.","(11:06) Rashad Jennings rush to the right for 4 yards to the NYG37. Tackled by Jerrell Freeman.","(11:48) Rashad Jennings rush to the right for 2 yards to the NYG33. Tackled by Jerrell Freeman and Cornelius Washington.","(12:01) Patrick O'Donnell punts for 54 yards to NYG40. Dwayne Harris - no return. FUMBLE, recovered by NYG (Eli Apple).","(12:06) Jay Cutler incomplete pass to the right intended for Jordan Howard.","(12:10) Jay Cutler incomplete pass to the right intended for Jordan Howard.","(12:49) Jay Cutler sacked at Chi6 for a loss of 8 yards by Olivier Vernon.","(12:56) Brad Wing punts for 43 yards to Chi14. No return.","(12:59) Eli Manning incomplete pass to the middle intended for Will Tye.","(13:04) Eli Manning incomplete pass to the right intended for Will Tye defensed by Jerrell Freeman.","(13:32) Paul Perkins rush to the left for 2 yards to the NYG43. Tackled by Jerrell Freeman and Danny Trevathan.","(13:37) 51 yard field goal attempt by Connor Barth is NO GOOD. Holder: Patrick O'Donnell.","(14:21) Jay Cutler pass to the right to Eddie Royal for 11 yards to the NYG33. Tackled by Nat Berhe.","(15:00) Jay Cutler sacked at NYG44 for a loss of 2 yards by Jason Pierre-Paul.","(0:14) Jeremy Langford rush to the left for a loss of 7 yards to the NYG42. Tackled by Olivier Vernon.","(0:59) Jay Cutler pass to the left to Jordan Howard for 22 yards to the NYG35. Tackled by Damon Harrison and Eli Apple.","(1:36) Jordan Howard rush to the left for 2 yards to the Chi43. Tackled by Johnathan Hankins and Olivier Vernon.","(2:18) Jay Cutler pass to the right to Cameron Meredith for 18 yards to the Chi41. Tackled by Dominique Rodgers-Cromartie.","(2:18) Chicago Bears timeout.","(3:06) Jordan Howard rush to the right for 3 yards to the Chi23. Tackled by Devon Kennard.","(3:11) Jay Cutler incomplete pass to the middle intended for Jordan Howard.","(3:19) Brad Wing punts for 36 yards to Chi20. No return.","(3:24) Eli Manning incomplete pass to the left intended for Jerell Adams.","(3:32) Eli Manning incomplete pass to the left intended for Victor Cruz.","(4:03) Rashad Jennings rush to the left for 1 yard to the NYG44. Tackled by Jerrell Freeman and Adrian Amos.","(4:37) Rashad Jennings rush to the left for 10 yards to the NYG43. Tackled by Bryce Callahan and Jerrell Freeman.","(5:13) Rashad Jennings rush to the left for 6 yards to the NYG33. Tackled by Danny Trevathan and Deon Bush.","(5:26) Patrick O'Donnell punts for 50 yards to NYG19. Dwayne Harris return for 8 yards to NYG27. Tackled by Sherrick McManis.","(5:33) Jay Cutler incomplete pass to the left intended for Marquess Wilson defensed by Janoris Jenkins.","(6:10) Jordan Howard rush to the right for 1 yard to the Chi31. Tackled by Damon Harrison.","(6:43) Jordan Howard rush to the left for 1 yard to the Chi30. Tackled by Johnathan Hankins.","(6:49) Robbie Gould kicks off to the Chi2. Deonte Thompson return for 27 yards to Chi29. Tackled by Paul Perkins and Eli Apple.","(6:49) Robbie Gould extra point is NO GOOD.","(6:54) Eli Manning pass to the right to Sterling Shepard for 15 yards for a TOUCHDOWN.","(7:36) Eli Manning pass to the middle to Paul Perkins for 6 yards to the Chi15. Tackled by Jerrell Freeman and Deon Bush.","(7:42) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(8:22) Eli Manning pass to the right to Victor Cruz for 48 yards to the Chi21. Tackled by Adrian Amos.","(8:57) Eli Manning rush to the left for 4 yards to the NYG31. Tackled by Tracy Porter.","(9:35) Eli Manning pass to the left to Sterling Shepard for 5 yards to the NYG27. Tackled by Demontre Hurst.","(10:04) Paul Perkins rush to the right for 1 yard to the NYG22. Tackled by Danny Trevathan and Willie Young.","(10:16) Patrick O'Donnell punts for 46 yards to NYG25. Dwayne Harris return for 6 yards to NYG31. Tackled by Patrick Scales. Penalty: Illegal Block on New York (Orleans Darkwa) -10 yards.","(10:21) Jay Cutler incomplete pass to the left intended for Eddie Royal defensed by Landon Collins.","(10:26) Jay Cutler incomplete pass to the middle intended for Logan Paulsen.","(11:04) Jeremy Langford rush to the left for 4 yards to the Chi29. Tackled by Devon Kennard.","(11:04) Robbie Gould kicks off to the endzone. Touchback.","(11:04) Robbie Gould extra point is good.","(11:09) Eli Manning pass to the right to Will Tye for 9 yards for a TOUCHDOWN.","(11:15) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(11:45) Eli Manning pass to the right to Odell Beckham Jr. for 20 yards to the Chi9. Tackled by Tracy Porter.","(12:14) Eli Manning pass to the right to Sterling Shepard for 12 yards to the Chi29. Tackled by Demontre Hurst.","(12:49) Rashad Jennings rush up the middle for 2 yards to the Chi41. Tackled by Akiem Hicks and Jonathan Bullard.","(12:53) Eli Manning incomplete pass to the middle intended for Sterling Shepard.","(13:35) Rashad Jennings rush to the right for 4 yards to the Chi43. Tackled by Jerrell Freeman.","(14:21) Eli Manning pass to the left to Will Tye for 3 yards to the Chi47. Tackled by Danny Trevathan.","(14:53) Rashad Jennings rush to the left for 6 yards to the NYG50. Tackled by Adrian Amos and Willie Young.","(15:00) Connor Barth kicks off to the NYG-2. Dwayne Harris return for 46 yards to NYG44. Tackled by Demontre Hurst.","(0:07) Eli Manning rush up the middle for a loss of 1 yard to the NYG13.","(0:14) Patrick O'Donnell punts for 28 yards to NYG14. No return.","(0:14) New York Giants timeout.","(0:24) Jay Cutler pass to the left to Jeremy Langford for 4 yards to the NYG42. Tackled by Trevin Wade.","(0:31) Penalty: Holding on Chicago (Mike Adams) -10 yards.","(0:38) Jay Cutler incomplete pass to the left intended for Jordan Howard defensed by Landon Collins.","(0:43) Jay Cutler incomplete pass to the right intended for Jordan Howard defensed by Jason Pierre-Paul.","(1:22) Paul Lasike rush up the middle for 5 yards to the NYG36. Tackled by Kelvin Sheppard and Devon Kennard.","(2:00) Jay Cutler pass to the left to Zach Miller for 8 yards to the NYG41. Tackled by Janoris Jenkins and Jonathan Casillas.","(2:00) Two Minute Warning.","(2:16) Jordan Howard rush to the left for 1 yard to the NYG49. Tackled by Damon Harrison and Eli Apple.","(2:54) Jordan Howard rush to the right for 8 yards to the Chi50. Tackled by Johnathan Hankins.","(3:27) Jay Cutler pass to the middle to Joshua Bellamy for 9 yards to the Chi42. Tackled by Kelvin Sheppard.","(3:33) Robbie Gould kicks off to the Chi6. Deonte Thompson return for 27 yards to Chi33. Tackled by Mark Herzlich and Eli Apple.","(3:38) Robbie Gould 46 yard field goal attempt is GOOD. Holder: Brad Wing.","(3:38) New York Giants timeout.","(3:43) Eli Manning incomplete pass to the middle intended for Will Tye defensed by Adrian Amos.","(3:47) Eli Manning incomplete pass to the left intended for Sterling Shepard defensed by Bryce Callahan.","(3:52) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(4:21) Eli Manning pass to the left to Rashad Jennings for 5 yards to the Chi28. Tackled by Deon Bush.","(5:07) Eli Manning pass to the left to Rashad Jennings for 10 yards to the Chi33. Tackled by Cre'von LeBlanc and Danny Trevathan.","(5:14) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(5:58) Rashad Jennings rush up the middle for a loss of 2 yards to the Chi43. Tackled by Leonard Floyd.","(6:35) Rashad Jennings rush to the right for 21 yards to the Chi41. Tackled by Cre'von LeBlanc.","(7:24) Eli Manning pass to the left to Roger Lewis for 8 yards to the NYG38. Tackled by Bryce Callahan.","(7:30) Eli Manning incomplete pass to the right intended for Sterling Shepard.","(8:02) Rashad Jennings rush to the left for 3 yards to the NYG30. Tackled by Jerrell Freeman and Deon Bush.","(8:26) Eli Manning pass to the right to Rashad Jennings for 12 yards to the NYG27. Tackled by Danny Trevathan.","(8:29) Eli Manning incomplete pass to the right intended for Roger Lewis defensed by Tracy Porter.","(8:35) Connor Barth kicks off to the NYG-2. Dwayne Harris return for 17 yards to NYG15. Tackled by Adrian Amos.","(8:35) Connor Barth extra point is good.","(8:39) Jeremy Langford rush to the left for 1 yard for a TOUCHDOWN.","(8:57) Penalty: Too Many Men on Field on New York 0 yards.","(9:34) Jeremy Langford rush to the right for 6 yards to the NYG1. Tackled by Eli Apple and Andrew Adams.","(10:02) Jordan Howard rush to the right for 27 yards to the NYG7. Tackled by Landon Collins.","(10:39) Jordan Howard rush to the left for 4 yards to the NYG34. Tackled by Kelvin Sheppard and Damon Harrison.","(11:17) Jay Cutler pass to the right to Cameron Meredith for 16 yards to the NYG38. Tackled by Landon Collins.","(11:54) Jay Cutler pass to the left to Deonte Thompson for 10 yards to the Chi46. Tackled by Landon Collins.","(12:30) Jordan Howard rush to the right for 3 yards to the Chi36. Tackled by Johnathan Hankins.","(13:10) Jordan Howard rush to the left for 12 yards to the Chi33. Tackled by Landon Collins and Andrew Adams.","(13:25) Brad Wing punts for 55 yards to Chi13. Eddie Royal return for 8 yards to Chi22. FUMBLE, recovered by Chi (Eddie Royal).","(13:59) Eli Manning pass to the right to Paul Perkins for 13 yards to the NYG32. Tackled by Adrian Amos.","(14:32) Eli Manning pass to the right to Sterling Shepard for 3 yards to the NYG19. Tackled by Bryce Callahan.","(15:00) Penalty: Holding on New York (Ereck Flowers) -10 yards.","(0:24) Rashad Jennings rush to the left for 1 yard to the NYG26. Tackled by C.J. Wilson and Akiem Hicks.","(0:24) Connor Barth kicks off to the endzone. Touchback.","(0:29) Connor Barth 40 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(1:07) Jay Cutler pass to the right to Eddie Royal for 2 yards to the NYG22. Tackled by Nat Berhe and Keenan Robinson.","(1:07) Chicago Bears timeout.","(1:15) Jay Cutler incomplete pass to the right intended for Jordan Howard.","(1:49) Jordan Howard rush to the left for 2 yards to the NYG24. Tackled by Damon Harrison and Johnathan Hankins.","(2:33) Jay Cutler pass to the middle to Zach Miller for 34 yards to the NYG26. Tackled by Keenan Robinson and Nat Berhe.","(3:18) Jordan Howard rush to the left for 3 yards to the Chi40. Tackled by Damon Harrison and Jonathan Casillas.","(3:57) Jay Cutler pass to the left to Cameron Meredith for a loss of 2 yards to the Chi37. Tackled by Eli Apple.","(4:04) Robbie Gould kicks off to the Chi-1. Deonte Thompson return for 40 yards to Chi39. Tackled by Robbie Gould.","(4:04) Robbie Gould extra point is NO GOOD.","(4:07) Rashad Jennings rush to the left for 2 yards for a TOUCHDOWN.","(4:35) Eli Manning pass to the left to Sterling Shepard for 15 yards to the Chi2. Tackled by Cre'von LeBlanc and Jerrell Freeman.","(5:20) Eli Manning pass to the left to Odell Beckham Jr. for 6 yards to the Chi17. Tackled by Bryce Callahan.","(5:57) Paul Perkins rush to the right for 2 yards to the Chi23. Tackled by Adrian Amos and Akiem Hicks.","(6:02) Eli Manning incomplete pass to the right intended for Sterling Shepard defensed by Tracy Porter.","(6:43) Paul Perkins rush to the right for 11 yards to the Chi25. Tackled by Deon Bush and Adrian Amos.","(7:21) Eli Manning pass to the left to Rashad Jennings for 1 yard to the Chi36. Tackled by Danny Trevathan.","(8:04) Eli Manning pass to the left to Odell Beckham Jr. for 11 yards to the Chi37. Tackled by Cre'von LeBlanc.","(8:38) Eli Manning pass to the right to Rashad Jennings for 16 yards to the Chi48. Tackled by Deon Bush and Cornelius Washington.","(9:05) Rashad Jennings rush to the right for 2 yards to the NYG36. Tackled by Danny Trevathan and Willie Young.","(9:12) Penalty: Holding on Chicago (Tracy Porter) 5 yards.","(9:41) Rashad Jennings rush to the left for 7 yards to the NYG29. Tackled by Jerrell Freeman and Leonard Floyd.","(9:46) Connor Barth kicks off to the NYG0. Dwayne Harris return for 22 yards to NYG22. Tackled by Sherrick McManis and Christian Jones.","(9:46) Connor Barth extra point is NO GOOD.","(9:54) Jay Cutler pass to the right to Zach Miller for 19 yards for a TOUCHDOWN.","(10:32) Jeremy Langford rush to the right for 4 yards to the NYG19. Tackled by Landon Collins and Devon Kennard.","(11:02) Jay Cutler pass to the left to Jeremy Langford for 12 yards to the NYG23. Tackled by Eli Apple.","(11:42) Jeremy Langford rush to the right for no gain to the NYG35. Tackled by Dominique Rodgers-Cromartie and Keenan Robinson.","(12:15) Jay Cutler pass to the left to Jeremy Langford for 14 yards to the NYG35. Tackled by Kelvin Sheppard.","(12:55) Jordan Howard rush to the left for 3 yards to the NYG49. Tackled by Kelvin Sheppard.","(13:38) Jordan Howard rush to the left for 4 yards to the Chi48. Tackled by Kelvin Sheppard and Andrew Adams.","(14:16) Jordan Howard rush to the left for 4 yards to the Chi44. Tackled by Jason Pierre-Paul.","(14:23) Penalty: Roughing Passer on New York (Olivier Vernon) 15 yards.","(14:54) Jordan Howard rush to the left for 1 yard to the Chi25. Tackled by Jason Pierre-Paul.","(15:00) Robbie Gould kicks off to the Chi2. Deonte Thompson return for 22 yards to Chi24. Tackled by Romeo Okwara."]