["(0:41) Aaron Rodgers rush up the middle for a loss of 1 yard to the GB39.","(0:48) Matt Barkley pass intended for Jordan Howard INTERCEPTED by Nick Perry. No return. Tackled by Jordan Howard.","(1:08) Matt Barkley pass to the right to Alshon Jeffery for 11 yards to the GB42. Tackled by Ladarius Gunter.","(1:31) Matt Barkley pass to the left to Zach Miller for 26 yards to the Chi47. Tackled by Micah Hyde and Ha Ha Clinton-Dix.","(1:35) Matt Barkley incomplete pass to the right intended for Zach Miller defensed by Datone Jones.","(1:41) Mason Crosby 31 yard field goal attempt is BLOCKED by Akiem Hicks.","(1:41) Chicago Bears timeout.","(1:51) Aaron Rodgers pass to the left to Ty Montgomery for 7 yards to the Chi13. Tackled by Jerrell Freeman.","(2:00) Penalty: Illegal Plyr Downfld on Green Bay (T.J. Lang) -5 yards.","(2:00) Two Minute Warning.","(2:45) Knile Davis rush to the left for 1 yard to the Chi15. Tackled by Danny Trevathan.","(3:33) Aaron Ripkowski rush up the middle for 2 yards to the Chi16. Tackled by Jerrell Freeman.","(3:42) Aaron Rodgers pass to the middle to Randall Cobb for 25 yards to the Chi18. Tackled by Harold Jones-Quartey.","(3:44) Penalty: False Start on Green Bay (Jeff Janis) -5 yards.","(4:27) Knile Davis rush to the right for no gain to the Chi38. Tackled by Danny Trevathan.","(4:41) Matt Barkley pass intended for Zach Miller INTERCEPTED by Blake Martinez defensed by Morgan Burnett and returned for 4 yards. Tackled by Bobby Massie.","(4:47) Matt Barkley incomplete pass to the right intended for Zach Miller.","(5:17) Green Bay Packers timeout.","(5:17) Matt Barkley pass to the right to Zach Miller for 14 yards to the Chi30. Tackled by Joe Thomas and Micah Hyde.","(5:23) Matt Barkley incomplete pass to the middle intended for Cameron Meredith defensed by Blake Martinez.","(5:31) Matt Barkley incomplete pass to the right intended for Alshon Jeffery.","(5:35) Mason Crosby kicks off to the Chi4. Deonte Thompson return for 12 yards to Chi16. Tackled by Marwin Evans.","(5:35) Mason Crosby extra point is NO GOOD.","(5:35) Penalty: False Start on Green Bay (Jason Spriggs) -5 yards.","(5:39) Aaron Rodgers pass to the right to Randall Cobb for 2 yards for a TOUCHDOWN.","(6:21) Aaron Rodgers pass to the right to Ty Montgomery for no gain to the Chi2. Tackled by Nick Kwiatkoski.","(7:05) Randall Cobb rush to the left for no gain to the Chi2. Tackled by Jerrell Freeman.","(7:13) Penalty: Holding on Chicago (De'Vante Bausby) 2 yards.","(7:49) Aaron Rodgers rush to the right for 8 yards to the Chi4. Tackled by Jerrell Freeman.","(8:32) Ty Montgomery rush to the left for 3 yards to the Chi12. Tackled by Adrian Amos and Sam Acho.","(9:17) Ty Montgomery rush to the left for 1 yard to the Chi15. Tackled by Sam Acho.","(9:22) Penalty: Illegal Contact on Chicago (De'Vante Bausby) 5 yards.","(9:47) Penalty: Delay of Game on Green Bay (Aaron Rodgers) -5 yards.","(10:19) Aaron Ripkowski rush to the right for 2 yards to the Chi31. Tackled by Cornelius Washington and Sam Acho. Penalty: Face Mask on Chicago (Cornelius Washington) 15 yards.","(11:08) Aaron Rodgers pass to the right to Davante Adams for 16 yards to the Chi33. Tackled by Jerrell Freeman.","(11:47) Randall Cobb rush to the left for 14 yards to the Chi49. Tackled by Danny Trevathan.","(11:50) Aaron Rodgers incomplete pass to the right intended for Randall Cobb defensed by Willie Young.","(12:34) Randall Cobb rush to the right for 3 yards to the GB37. Tackled by Jerrell Freeman.","(12:34) Green Bay Packers timeout.","(13:19) Aaron Rodgers pass to the left to Aaron Ripkowski for 8 yards to the GB34. Tackled by Adrian Amos.","(14:08) Aaron Rodgers pass to the left to Randall Cobb for no gain to the GB26. Tackled by Jerrell Freeman and Mitch Unrein.","(14:08) Patrick O'Donnell punts for 48 yards to GB26. No return.","(14:21) Matt Barkley incomplete pass to the right intended for Joshua Bellamy defensed by Micah Hyde.","(14:51) Ka'Deem Carey rush to the left for 1 yard to the Chi26. Tackled by Nick Perry and Blake Martinez.","(14:55) Matt Barkley incomplete pass to the middle intended for Alshon Jeffery defensed by Mike Pennel.","(14:55) Mason Crosby kicks off to the endzone. Touchback.","(14:55) Mason Crosby extra point is good.","(15:00) Aaron Rodgers pass to the left to Davante Adams for 4 yards for a TOUCHDOWN.","(0:01) Penalty: Offside on Chicago (Willie Young) 4 yards.","(0:40) Aaron Rodgers pass to the left to Ty Montgomery for 13 yards to the Chi8. Tackled by Adrian Amos.","(1:25) Aaron Rodgers pass to the left to Richard Rodgers for 7 yards to the Chi21. Tackled by Jerrell Freeman.","(2:12) Aaron Rodgers pass to the right to Davante Adams for 24 yards to the Chi28. Tackled by Jacoby Glenn and Harold Jones-Quartey.","(2:52) Ty Montgomery rush to the left for 11 yards to the GB48. Tackled by Cre'von LeBlanc and Harold Jones-Quartey.","(3:25) Aaron Rodgers pass to the right to Davante Adams for 15 yards to the GB37. Tackled by Jacoby Glenn.","(4:03) Aaron Rodgers pass to the right to Davante Adams for 7 yards to the GB22. Tackled by De'Vante Bausby.","(4:35) Ty Montgomery rush to the right for 3 yards to the GB15. Tackled by Akiem Hicks and Mitch Unrein.","(4:43) Patrick O'Donnell punts for 47 yards to GB12. No return.","(5:26) Jordan Howard rush up the middle for 11 yards to the Chi41. Tackled by Nick Perry.","(5:56) Penalty: Illegal Plyr Downfld on Chicago (Ted Larsen) -5 yards.","(6:33) Penalty: Delay of Game on Chicago (Matt Barkley) -5 yards.","(6:33) Matt Barkley sacked at Chi40 for a loss of 10 yards by Nick Perry.","(7:10) Ka'Deem Carey rush to the right for 1 yard to the Chi50. Tackled by Mike Daniels.","(7:46) Matt Barkley pass to the middle to Cameron Meredith for 12 yards to the Chi49. Tackled by Demetri Goodson.","(8:30) Ka'Deem Carey rush up the middle for 8 yards to the Chi37. Tackled by Jake Ryan and Mike Daniels.","(9:11) Ka'Deem Carey rush to the right for 4 yards to the Chi29. Tackled by Letroy Guion and Clay Matthews.","(9:11) Mason Crosby kicks off to the endzone. Touchback.","(9:11) Mason Crosby extra point is good.","(9:15) Aaron Rodgers pass to the right to Davante Adams for 5 yards for a TOUCHDOWN.","(9:21) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(9:28) Aaron Rodgers incomplete pass to the right intended for Ty Montgomery.","(9:47) Chicago Bears timeout.","(9:47) Aaron Rodgers pass to the right to Ty Montgomery for 7 yards to the Chi5. Tackled by Adrian Amos.","(10:29) Aaron Rodgers pass to the right to Randall Cobb for 2 yards to the Chi12. Tackled by Cre'von LeBlanc.","(11:11) Aaron Ripkowski rush to the left for 4 yards to the Chi14. Tackled by Jonathan Bullard and Jerrell Freeman.","(11:40) Aaron Rodgers pass to the right to Randall Cobb for 18 yards to the Chi18. Tackled by Cre'von LeBlanc.","(11:43) Aaron Rodgers incomplete pass to the middle intended for Randall Cobb defensed by Cre'von LeBlanc.","(12:12) Aaron Rodgers pass to the right to Davante Adams for 5 yards to the Chi36. Tackled by De'Vante Bausby.","(12:47) Aaron Rodgers pass to the right to Ty Montgomery for 6 yards to the Chi41. Tackled by Danny Trevathan.","(13:27) Ty Montgomery rush to the right for 3 yards to the Chi47. Tackled by Adrian Amos.","(13:53) Aaron Rodgers pass to the left to Ty Montgomery for 5 yards to the GB50. Tackled by Jerrell Freeman.","(14:25) Ty Montgomery rush up the middle for 30 yards to the GB45. Tackled by De'Vante Bausby and Adrian Amos.","(14:30) Connor Barth kicks off to the GB-3. Knile Davis return for 18 yards to GB15. Tackled by Deon Bush.","(14:30) Connor Barth extra point is good.","(14:43) Aaron Rodgers sacked at GB1 for a loss of 14 yards by Leonard Floyd. FUMBLE, recovered by Chi (Leonard Floyd) for a TOUCHDOWN.","(14:50) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(14:55) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(15:00) Connor Barth kicks off to the GB-2. Jeff Janis return for 17 yards to GB15. Tackled by Sherrick McManis.","(0:17) Matt Barkley rush up the middle for a loss of 1 yard to the Chi24.","(0:17) Mason Crosby kicks off to the endzone. Touchback.","(0:22) Mason Crosby 40 yard field goal attempt is GOOD. Holder: Jacob Schum.","(0:27) Aaron Rodgers incomplete pass to the left intended for Randall Cobb.","(0:32) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(0:32) Chicago Bears timeout.","(0:35) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(0:40) Aaron Rodgers pass to the right to Randall Cobb for 13 yards to the Chi22. Tackled by Harold Jones-Quartey.","(0:46) Aaron Rodgers pass to the left to Randall Cobb for 7 yards to the Chi35. Tackled by Cre'von LeBlanc.","(1:13) Aaron Rodgers pass to the right to Davante Adams for 19 yards to the Chi42. Tackled by De'Vante Bausby.","(1:13) Green Bay Packers timeout.","(1:22) Aaron Rodgers sacked at GB39 for a loss of 9 yards by Leonard Floyd.","(1:30) Penalty: Pass Interference on Chicago (De'Vante Bausby) 18 yards.","(1:37) Aaron Rodgers incomplete pass to the left intended for Ty Montgomery.","(1:56) Aaron Rodgers pass to the right to Davante Adams for 5 yards to the GB30. Tackled by De'Vante Bausby.","(1:56) Connor Barth kicks off to the endzone. Touchback.","(2:00) Connor Barth 39 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(2:00) Two Minute Warning.","(2:43) Matt Barkley pass to the left to Joshua Bellamy for 7 yards to the GB21. Tackled by Micah Hyde.","(2:49) Matt Barkley incomplete pass to the right intended for Alshon Jeffery.","(3:24) Ka'Deem Carey rush to the left for a loss of 1 yard to the GB28. Tackled by Kenny Clark.","(4:09) Jordan Howard rush to the left for 3 yards to the GB27. Tackled by Kenny Clark.","(4:46) Jordan Howard rush to the left for 9 yards to the GB30. Tackled by Morgan Burnett.","(5:25) Matt Barkley pass to the right to Alshon Jeffery for 11 yards to the GB39. Tackled by Ladarius Gunter and Demetri Goodson.","(6:01) Ka'Deem Carey rush to the left for 1 yard to the Chi50. Tackled by Jake Ryan and Blake Martinez.","(6:34) Ka'Deem Carey rush to the right for 24 yards to the Chi49. Tackled by Morgan Burnett.","(6:41) Jacob Schum punts for 46 yards to Chi25. No return.","(6:49) Penalty: Illegal Formation on Green Bay -5 yards.","(6:52) Aaron Rodgers incomplete pass to the left intended for Jeff Janis.","(7:33) Aaron Rodgers pass to the left to Davante Adams for 5 yards to the GB34. Tackled by De'Vante Bausby.","(8:10) Aaron Rodgers pass to the left to Ty Montgomery for 2 yards to the GB29. Tackled by Adrian Amos.","(8:15) Penalty: Illegal Contact on Chicago (Cre'von LeBlanc) 5 yards.","(8:50) Aaron Rodgers pass to the left to Randall Cobb for 5 yards to the GB22. Tackled by Harold Jones-Quartey.","(9:35) Don Jackson rush up the middle for 5 yards to the GB17. Tackled by Willie Young.","(10:13) Randall Cobb rush to the left for 4 yards to the GB12. Tackled by Jonathan Bullard.","(10:21) Patrick O'Donnell punts for 42 yards to GB8. No return.","(10:24) Brian Hoyer incomplete pass to the middle intended for Alshon Jeffery.","(10:24) Penalty: Offside on Green Bay (Datone Jones) 5 yards.","(10:29) Brian Hoyer incomplete pass to the left intended for Deonte Thompson defensed by Ladarius Gunter.","(11:11) Jordan Howard rush to the left for a loss of 1 yard to the Chi45. Tackled by Micah Hyde.","(11:49) Brian Hoyer pass to the left to Ka'Deem Carey for 9 yards to the Chi46. Tackled by Blake Martinez.","(12:30) Ka'Deem Carey rush to the left for 1 yard to the Chi37. Tackled by Blake Martinez and Jake Ryan.","(12:34) Penalty: Pass Interference on Green Bay (Micah Hyde) 16 yards.","(12:59) Penalty: Offside on Chicago (Alshon Jeffery) -5 yards.","(13:42) Brian Hoyer pass to the left to Deonte Thompson for 4 yards to the Chi25. Tackled by Demetri Goodson and Blake Martinez.","(14:23) Ka'Deem Carey rush up the middle for 9 yards to the Chi21. Tackled by Jake Ryan.","(15:00) Brian Hoyer pass to the right to Alshon Jeffery for 11 yards to the Chi12. Tackled by Ladarius Gunter and Morgan Burnett.","(0:15) Ka'Deem Carey rush up the middle for no gain to the Chi1. Tackled by Clay Matthews.","(0:21) Ty Montgomery rush to the left for no gain to the Chi1. Tackled by Cre'von LeBlanc.","(0:21) Green Bay Packers timeout.","(1:07) Aaron Rodgers pass to the right to Jeff Janis for 2 yards to the Chi1. Tackled by Harold Jones-Quartey and Tracy Porter.","(1:13) Aaron Rodgers incomplete pass to the right intended for Ty Montgomery.","(1:53) Ty Montgomery rush to the right for 7 yards to the Chi3. Tackled by Leonard Floyd and Jerrell Freeman.","(2:50) Aaron Rodgers pass to the left to Ty Montgomery for 8 yards to the Chi10. Tackled by Cre'von LeBlanc.","(3:31) Aaron Rodgers pass to the right to Randall Cobb for 2 yards to the Chi18. Tackled by Cre'von LeBlanc.","(3:39) Penalty: Pass Interference on Chicago (Adrian Amos) 44 yards.","(4:19) Don Jackson rush to the right for 1 yard to the GB36. Tackled by Danny Trevathan.","(5:00) Aaron Rodgers pass to the left to Davante Adams for 12 yards to the GB35. Tackled by Bryce Callahan.","(5:42) Aaron Rodgers pass to the middle to Jeff Janis for 7 yards to the GB23. Tackled by Danny Trevathan and Jerrell Freeman.","(6:37) Penalty: False Start on Green Bay (Bryan Bulaga) -5 yards.","(6:37) Aaron Rodgers pass to the left to Ty Montgomery for 12 yards to the GB21. Tackled by Harold Jones-Quartey.","(6:39) Aaron Rodgers incomplete pass to the left intended for Jeff Janis defensed by Sam Acho.","(6:47) Patrick O'Donnell punts for 44 yards to GB9. No return.","(6:52) Brian Hoyer incomplete pass to the middle intended for Joshua Bellamy.","(6:56) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery defensed by Julius Peppers.","(7:31) Jordan Howard rush to the left for no gain to the Chi47. Tackled by Mike Pennel.","(8:08) Brian Hoyer pass to the left to Joshua Bellamy for 25 yards to the Chi47. Tackled by Demetri Goodson.","(8:14) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery.","(8:49) Jordan Howard rush to the right for no gain to the Chi22. Tackled by Nick Perry.","(8:53) Mason Crosby kicks off to the Chi6. Deonte Thompson return for 16 yards to Chi22. Tackled by Kentrell Brice.","(8:56) Mason Crosby 32 yard field goal attempt is GOOD. Holder: Jacob Schum.","(9:01) Aaron Rodgers incomplete pass to the right intended for Randall Cobb defensed by Cre'von LeBlanc.","(9:21) Aaron Rodgers pass to the left to Ty Montgomery for 6 yards to the Chi14. Tackled by Adrian Amos.","(9:29) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(10:07) Aaron Rodgers pass to the left to Jordy Nelson for 9 yards to the Chi20. Tackled by Harold Jones-Quartey.","(10:57) Aaron Rodgers pass to the right to Davante Adams for 6 yards to the Chi29. Tackled by Jerrell Freeman and De'Vante Bausby.","(11:05) Aaron Rodgers incomplete pass to the left intended for Jeff Janis.","(11:41) Randall Cobb rush to the right for no gain to the Chi35. Tackled by Akiem Hicks.","(12:22) Aaron Rodgers pass to the left to Randall Cobb for 10 yards to the Chi35. Tackled by Chris Prosinski.","(12:54) Aaron Rodgers pass to the right to Davante Adams for 9 yards to the Chi45. Tackled by De'Vante Bausby.","(13:30) Aaron Rodgers pass to the middle to Randall Cobb for 11 yards to the GB46. Tackled by Tracy Porter.","(13:37) Aaron Rodgers incomplete pass to the right intended for Don Jackson.","(14:12) Ty Montgomery rush to the right for 2 yards to the GB35. Tackled by Harold Jones-Quartey.","(14:22) Patrick O'Donnell punts for 44 yards to GB26. Trevor Davis return for 6 yards to GB32. Tackled by Joshua Bellamy. FUMBLE, recovered by GB (Aaron Ripkowski).","(14:27) Brian Hoyer incomplete pass to the middle intended for Alshon Jeffery.","(14:30) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery.","(15:00) Jordan Howard rush to the left for no gain to the Chi30. Tackled by Clay Matthews.","(15:00) Penalty: Encroachment on Green Bay (Letroy Guion) 5 yards.","(15:00) Mason Crosby kicks off to the endzone. Touchback."]