["(0:42) Eli Manning rush up the middle for a loss of 1 yard to the NYG19.","(0:50) Case Keenum pass intended for Brian Quick INTERCEPTED by Dominique Rodgers-Cromartie. No return. Touchback.","(0:50) New York Giants timeout.","(0:56) Case Keenum incomplete pass to the left intended for Mike Thomas.","(1:01) Case Keenum incomplete pass to the left intended for Bradley Marquez.","(1:26) Case Keenum pass to the right to Benny Cunningham for 5 yards to the NYG15. Tackled by Keenan Robinson.","(1:48) Case Keenum pass to the right to Lance Kendricks for 6 yards to the NYG20. Tackled by Leon Hall.","(1:55) Case Keenum incomplete pass to the right intended for Kenny Britt.","(1:57) Case Keenum pass to the left to Brian Quick for 23 yards to the NYG26.","(1:57) Two Minute Warning.","(2:06)  FUMBLE, recovered by LA (Case Keenum). Case Keenum pass to the right to Brian Quick for 15 yards to the NYG49. Tackled by Andrew Adams.","(2:06) Los Angeles Rams timeout.","(2:06) Penalty: False Start on Los Angeles (Rob Havenstein) -5 yards.","(2:10) Case Keenum incomplete pass to the right intended for Brian Quick.","(2:32) Case Keenum pass to the left to Todd Gurley for 5 yards to the LA41. Tackled by Keenan Robinson.","(2:39) Case Keenum incomplete pass to the right.","(3:03) Case Keenum pass to the right to Lance Kendricks for 11 yards to the LA36. Tackled by Janoris Jenkins.","(3:10) Brad Wing punts for 49 yards to LA25. No return.","(3:18) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(3:18) Los Angeles Rams timeout.","(3:23) Rashad Jennings rush to the left for 4 yards to the NYG26. Tackled by Alec Ogletree.","(4:00) Rashad Jennings rush to the left for 2 yards to the NYG22. Tackled by Alec Ogletree.","(4:09) Case Keenum pass intended for Tavon Austin INTERCEPTED by Dominique Rodgers-Cromartie. No return. Touchback.","(4:16) Case Keenum incomplete pass to the left intended for Brian Quick.","(4:58) Case Keenum pass to the right to Tavon Austin for 8 yards to the NYG37. Tackled by Keenan Robinson.","(5:41) Todd Gurley rush to the right for 1 yard to the NYG45. Tackled by Keenan Robinson.","(6:21) Case Keenum pass to the left to Tavon Austin for 6 yards to the NYG46. Tackled by Eli Apple.","(7:24) Case Keenum pass to the right to Tavon Austin for 6 yards to the LA48. Tackled by Dominique Rodgers-Cromartie.","(8:09) Todd Gurley rush to the left for 6 yards to the LA42. Tackled by Johnathan Hankins.","(8:13) Case Keenum incomplete pass to the right intended for Lance Kendricks.","(8:52) Case Keenum pass to the left to Kenny Britt for 26 yards to the LA36. Tackled by Andrew Adams.","(9:11) Case Keenum sacked at LA10 for a loss of 12 yards by Damon Harrison.","(9:17) Case Keenum incomplete pass to the middle intended for Todd Gurley.","(9:23) Robbie Gould kicks off to the LA2. Benny Cunningham return for 20 yards to LA22. Tackled by Orleans Darkwa.","(9:23) Robbie Gould extra point is good.","(9:27) Rashad Jennings rush to the left for 1 yard for a TOUCHDOWN.","(10:08) Rashad Jennings rush to the left for 2 yards to the LA1. Tackled by Aaron Donald.","(10:38) Rashad Jennings rush to the left for 3 yards to the LA3. Tackled by Alec Ogletree.","(11:20) Eli Manning pass to the left to Odell Beckham Jr. for 22 yards to the LA6. Tackled by Maurice Alexander.","(12:01) Eli Manning pass to the right to Roger Lewis for 7 yards to the LA28. Tackled by E.J. Gaines.","(12:06) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by Mark Barron.","(12:20) Case Keenum pass intended for Tavon Austin INTERCEPTED by Landon Collins defensed by Keenan Robinson and returned for 18 yards. Tackled by Tavon Austin.","(12:35) Brad Wing punts for 46 yards to LA13. Tavon Austin return for 19 yards to LA32. Tackled by Jonathan Casillas.","(12:40) Eli Manning incomplete pass to the left intended for Will Tye.","(13:20) Eli Manning pass to the left to Sterling Shepard for 3 yards to the NYG41. Tackled by Troy Hill.","(13:24) Eli Manning incomplete pass to the right intended for Victor Cruz.","(13:43) Eli Manning pass to the middle to Sterling Shepard for 7 yards to the NYG38. Tackled by Lamarcus Joyner.","(14:18) Eli Manning pass to the left to Sterling Shepard for 6 yards to the NYG31. Tackled by Troy Hill.","(14:43) Eli Manning pass to the right to Victor Cruz for 14 yards to the NYG25. Tackled by E.J. Gaines.","(14:55) Johnny Hekker punts for 57 yards to NYG10. Dwayne Harris return for 1 yard to NYG11. Tackled by Cody Davis.","(15:00) Case Keenum incomplete pass to the right intended for Kenny Britt defensed by Janoris Jenkins.","(0:38) Case Keenum sacked at LA33 for a loss of 5 yards by Jay Bromley.","(1:17) Benny Cunningham rush to the left for 2 yards to the LA38. Tackled by Damon Harrison.","(1:58) Case Keenum rush to the right for 3 yards to the LA36. Tackled by Kelvin Sheppard.","(2:36) Todd Gurley rush to the left for 8 yards to the LA33. Tackled by Janoris Jenkins.","(3:20) Case Keenum pass to the left to Todd Gurley for 20 yards to the LA25. Tackled by Landon Collins.","(3:29) Brad Wing punts for 55 yards to LA5. No return.","(3:34) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(4:05) Rashad Jennings rush to the right for 4 yards to the NYG40. Tackled by William Hayes.","(4:36) Eli Manning pass to the right to Sterling Shepard for 5 yards to the NYG36. Tackled by Maurice Alexander.","(5:09) Rashad Jennings rush to the left for 5 yards to the NYG31. Tackled by Alec Ogletree.","(5:46) Eli Manning pass to the right to Victor Cruz for 7 yards to the NYG26. Tackled by E.J. Gaines.","(6:05) Eli Manning pass to the left to Odell Beckham Jr. for 18 yards to the NYG19. Tackled by Maurice Alexander.","(6:47) Rashad Jennings rush to the left for a loss of 2 yards to the NYG1. Tackled by Alec Ogletree.","(6:56) Johnny Hekker punts for 38 yards to NYG3. No return.","(7:29) Case Keenum pass to the right to Kenny Britt for 3 yards to the NYG41. Tackled by Janoris Jenkins.","(8:01) Case Keenum pass to the right to Todd Gurley for 2 yards to the NYG44. Tackled by Landon Collins.","(8:07) Case Keenum incomplete pass to the right intended for Kenny Britt defensed by Janoris Jenkins.","(8:50) Todd Gurley rush to the right for 3 yards to the NYG46. Tackled by Keenan Robinson.","(9:30) Todd Gurley rush to the left for 4 yards to the NYG49. Tackled by Damon Harrison.","(9:52) Case Keenum pass to the middle to Tavon Austin for 5 yards to the LA47. Tackled by Olivier Vernon.","(9:59) Brad Wing punts for 43 yards to NYG48. No return. Penalty: Holding on Los Angeles (Malcolm Brown) -10 yards.","(10:04) Eli Manning incomplete pass to the left intended for Rashad Jennings.","(10:41) Eli Manning pass to the left to Rashad Jennings for no gain to the NYG5. Tackled by Troy Hill.","(11:09) Rashad Jennings rush to the left for no gain to the NYG5. Tackled by Mark Barron.","(11:20) Johnny Hekker punts for 50 yards to NYG10. Odell Beckham Jr. - no return. Tackled by Chase Reynolds and Bradley Marquez. Penalty: Holding on New York (Coty Sensabaugh) -5 yards.","(12:00) Case Keenum pass to the left to Brian Quick for 6 yards to the LA40. Tackled by Dominique Rodgers-Cromartie.","(12:46) Todd Gurley rush to the right for a loss of 1 yard to the LA34. Tackled by Johnathan Hankins.","(13:26) Case Keenum pass to the right to Lance Kendricks for 2 yards to the LA35. Tackled by Andrew Adams.","(14:05) Case Keenum pass to the middle to Lance Kendricks for 7 yards to the LA33. Tackled by Dominique Rodgers-Cromartie.","(14:47) Todd Gurley rush to the right for 7 yards to the LA26. Tackled by Olivier Vernon.","(14:56) Case Keenum incomplete pass to the left intended for Kenny Britt.","(15:00) Robbie Gould kicks off to the LA2. Benny Cunningham return for 17 yards to LA19. Tackled by Roger Lewis.","(0:01) Eli Manning rush up the middle for a loss of 1 yard to the NYG17.","(0:12) Johnny Hekker punts for 47 yards to NYG15. Dwayne Harris return for 3 yards to NYG18. Tackled by Cory Littleton.","(0:12) Penalty: False Start on Los Angeles (Mike Thomas) -5 yards.","(0:18) Case Keenum pass to the right to Tavon Austin for 6 yards to the LA43. Tackled by Olivier Vernon.","(0:22) Case Keenum incomplete pass to the left intended for Lance Kendricks.","(0:30)  FUMBLE, recovered by LA (Case Keenum). Case Keenum incomplete pass to the right intended for Tavon Austin defensed by Eli Apple.","(0:30) Los Angeles Rams timeout.","(0:37) Case Keenum pass to the left to Kenny Britt for 14 yards to the LA37. Tackled by Keenan Robinson.","(0:49) Brad Wing punts for 47 yards to LA11. Tavon Austin return for 12 yards to LA23. Tackled by Orleans Darkwa.","(0:49) Los Angeles Rams timeout.","(0:58) Eli Manning pass to the right to Will Tye for 5 yards to the NYG42. Tackled by Mark Barron.","(1:01) Eli Manning incomplete pass to the right intended for Larry Donnell defensed by T.J. McDonald.","(1:24) Eli Manning pass to the right to Bobby Rainey for a loss of 2 yards to the NYG37. Tackled by Aaron Donald.","(1:33) Johnny Hekker punts for 60 yards to NYG30. Dwayne Harris return for 9 yards to NYG39. Tackled by Bryce Hager.","(1:41) Case Keenum incomplete pass to the left intended for Kenny Britt defensed by Janoris Jenkins.","(1:41) New York Giants timeout.","(1:46) Case Keenum pass to the left to Todd Gurley for 4 yards to the LA10. Tackled by Damon Harrison.","(1:46) New York Giants timeout.","(1:55) Case Keenum pass to the right to Tavon Austin for 3 yards to the LA6. Tackled by Landon Collins.","(1:56) Penalty: False Start on Los Angeles (Tyler Higbee) -3 yards.","(1:56) Two Minute Warning.","(2:06) Penalty: Holding on Los Angeles (Rob Havenstein) -5 yards.","(2:19) Brad Wing punts for 49 yards to LA14. Tavon Austin return for a loss of 3 yards to LA11. Tackled by Roger Lewis. FUMBLE, recovered by LA (Tavon Austin).","(2:24) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(3:01) Eli Manning pass to the right to Jerell Adams for 5 yards to the NYG37. Tackled by Mark Barron.","(3:30) Rashad Jennings rush up the middle for 1 yard to the NYG32. Tackled by Dominique Easley.","(4:00) Eli Manning pass to the right to Rashad Jennings for 24 yards to the NYG31. Tackled by Troy Hill.","(4:36) Rashad Jennings rush to the right for 1 yard to the NYG7. Tackled by Cam Thomas.","(4:45) Johnny Hekker punts for 39 yards to NYG6. No return.","(5:32) Case Keenum pass to the right to Tavon Austin for 5 yards to the NYG45. Tackled by Dominique Rodgers-Cromartie.","(6:13) Todd Gurley rush to the left for 3 yards to the LA50. Tackled by Devon Kennard.","(6:17) Case Keenum incomplete pass to the middle intended for Brian Quick.","(6:56) Case Keenum pass to the right to Lance Kendricks for 11 yards to the LA47. Tackled by Landon Collins.","(7:04) Case Keenum incomplete pass to the right intended for Brian Quick defensed by Dominique Rodgers-Cromartie.","(7:10) Robbie Gould kicks off to the LA11. Benny Cunningham return for 25 yards to LA36. Tackled by Mark Herzlich.","(7:10) Robbie Gould extra point is good.","(7:10) Case Keenum pass intended for Tavon Austin INTERCEPTED by Landon Collins and returned for 44 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on New York (Bobby Hart) -15 yards.","(8:15) Todd Gurley rush to the right for 5 yards to the LA30. Tackled by Andrew Adams.","(8:15) Robbie Gould kicks off to the endzone. Touchback.","(8:19) Robbie Gould 29 yard field goal attempt is GOOD. Holder: Brad Wing.","(8:24) Eli Manning incomplete pass to the right intended for Sterling Shepard defensed by Lamarcus Joyner.","(8:56) Eli Manning pass to the left to Odell Beckham Jr. for 3 yards to the LA12. Tackled by Troy Hill.","(9:36) Paul Perkins rush to the left for no gain to the LA15. Tackled by Ethan Westbrooks.","(9:57) Eli Manning pass to the right to Victor Cruz for 25 yards to the LA15. Tackled by T.J. McDonald.","(10:01) Eli Manning incomplete pass to the right intended for Larry Donnell defensed by E.J. Gaines.","(10:24) Eli Manning pass to the right to Victor Cruz for 5 yards to the LA40. Tackled by E.J. Gaines.","(11:03) Eli Manning pass to the right to Victor Cruz for 4 yards to the LA45. Tackled by T.J. McDonald.","(11:42) Bobby Rainey rush to the left for 1 yard to the LA49. Tackled by Aaron Donald.","(12:14) Eli Manning pass to the left to Odell Beckham Jr. for 12 yards to the NYG50. Tackled by Troy Hill.","(12:41) Paul Perkins rush to the right for 10 yards to the NYG38. Tackled by Alec Ogletree.","(13:18) Paul Perkins rush to the right for 2 yards to the NYG28. Tackled by Alec Ogletree.","(13:42) Penalty: Offside on Los Angeles (Aaron Donald) 5 yards.","(14:16) Eli Manning pass to the right to Paul Perkins for 4 yards to the NYG21. Tackled by Mark Barron.","(14:53) Paul Perkins rush to the right for no gain to the NYG17. Tackled by Eugene Sims and Mark Barron.","(15:00) Johnny Hekker punts for 31 yards to NYG17. No return.","(15:00) Penalty: Delay of Game on Los Angeles (Case Keenum) -5 yards.","(0:19) Case Keenum pass to the right to Tavon Austin for 1 yard to the NYG43. Tackled by Jonathan Casillas.","(0:55) Case Keenum pass to the right to Todd Gurley for 2 yards to the NYG44.","(1:34) Todd Gurley rush to the left for 3 yards to the NYG46. Tackled by Damon Harrison and Keenan Robinson.","(2:12) Case Keenum pass to the right to Lance Kendricks for 11 yards to the NYG49. Tackled by Landon Collins.","(2:19) Penalty: Pass Interference on New York (Eli Apple) 13 yards.","(3:03) Case Keenum pass to the right to Tyler Higbee for 4 yards to the LA27. Tackled by Landon Collins.","(3:46) Todd Gurley rush to the right for 4 yards to the LA23. Tackled by Owamagbe Odighizuwa.","(3:46) Penalty: False Start on Los Angeles (Greg Robinson) -5 yards.","(3:53) Brad Wing punts for 48 yards to LA24. No return.","(4:00) Eli Manning incomplete pass to the right intended for Victor Cruz defensed by E.J. Gaines.","(4:37) Eli Manning pass to the left to Odell Beckham Jr. for a loss of 6 yards to the NYG28. Tackled by Troy Hill.","(5:13) Eli Manning pass to the right to Will Tye for 9 yards to the NYG34. Tackled by T.J. McDonald.","(5:13) Greg Zuerlein kicks off to the endzone. Touchback.","(5:15) Greg Zuerlein 36 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(6:01) Case Keenum sacked at NYG18 for a loss of 3 yards by Kerry Wynn and Jason Pierre-Paul.","(6:46) Case Keenum pass to the right to Todd Gurley for 2 yards to the NYG15. Tackled by Landon Collins.","(7:26) Benny Cunningham rush to the left for no gain to the NYG17. Tackled by Olivier Vernon.","(8:03) Case Keenum pass to the left to Tavon Austin for 7 yards to the NYG17. Tackled by Eli Apple.","(8:41) Benny Cunningham rush to the right for 2 yards to the NYG24. Tackled by Jonathan Casillas.","(9:21) Todd Gurley rush to the right for 6 yards to the NYG26. Tackled by Devon Kennard.","(9:45) Case Keenum pass to the right to Brian Quick for 48 yards to the NYG32. Tackled by Janoris Jenkins.","(9:54) Brad Wing punts for 61 yards to LA0. Touchback.","(9:59) Eli Manning incomplete pass to the right intended for Sterling Shepard.","(10:04) Eli Manning incomplete pass to the right intended for Victor Cruz.","(10:39) Rashad Jennings rush to the left for 3 yards to the NYG39. Tackled by Ethan Westbrooks.","(11:15) Eli Manning pass to the right to Sterling Shepard for 11 yards to the NYG36. Tackled by T.J. McDonald.","(11:15) Greg Zuerlein kicks off to the endzone. Touchback.","(11:15) Greg Zuerlein extra point is good.","(11:21) Case Keenum pass to the middle to Tavon Austin for 10 yards for a TOUCHDOWN.","(11:24) Case Keenum incomplete pass to the left intended for Tavon Austin defensed by Jonathan Casillas.","(12:09) Todd Gurley rush to the left for 4 yards to the NYG10. Tackled by Damon Harrison.","(12:39) Tavon Austin rush to the right for 10 yards to the NYG14. Tackled by Eli Apple. FUMBLE, recovered by LA.","(13:14) Todd Gurley rush to the right for 2 yards to the NYG24. Tackled by Landon Collins.","(13:49) Case Keenum pass to the left to Lance Kendricks for 7 yards to the NYG26. Tackled by Keenan Robinson.","(14:25) Todd Gurley rush to the right for 2 yards to the NYG33. Tackled by Jonathan Casillas.","(14:31) Eli Manning pass to the right to Larry Donnell for 8 yards to the NYG34. Tackled by Lamarcus Joyner. FUMBLE, recovered by LA (E.J. Gaines). Tackled by Larry Donnell.","(15:00) Rashad Jennings rush to the right for 1 yard to the NYG26. Tackled by Maurice Alexander.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback."]