["(0:04) Matt Prater 40 yard field goal attempt is GOOD. Holder: Sam Martin.","(0:04) Detroit Lions timeout.","(0:30) Matthew Stafford rush up the middle for a loss of 2 yards to the Min22.","(0:30) Minnesota Vikings timeout.","(0:38) Sam Bradford pass intended for Adam Thielen INTERCEPTED by Darius Slay and returned for 13 yards. Tackled by Cordarrelle Patterson.","(0:43) Penalty: Illegal Formation on Minnesota (Cordarrelle Patterson) -5 yards.","(1:21) Sam Bradford pass to the middle to Cordarrelle Patterson for 3 yards to the Min33. Tackled by Darius Slay.","(1:45) Sam Bradford pass to the right to Kyle Rudolph for 5 yards to the Min30. Tackled by Tahir Whitehead and Josh Bynes.","(1:45) Sam Martin kicks off to the endzone. Touchback.","(1:49) Matt Prater 48 yard field goal attempt is GOOD. Holder: Sam Martin.","(1:49) Minnesota Vikings timeout.","(1:54) Matthew Stafford pass to the right to Theo Riddick for a loss of 1 yard to the Min30. Tackled by Eric Kendricks.","(2:00) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(2:00) Two Minute Warning.","(2:13) Matthew Stafford pass to the right to Anquan Boldin for 9 yards to the Min29. Tackled by Trae Waynes.","(2:56) Matthew Stafford pass to the left to Marvin Jones Jr. for 15 yards to the Min38. Tackled by Trae Waynes.","(3:03) Matthew Stafford pass to the left to Anquan Boldin for 29 yards to the Det47. Tackled by Captain Munnerlyn.","(3:08) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(3:51) Matthew Stafford pass to the right to Theo Riddick for 2 yards to the Det18. Tackled by Eric Kendricks.","(4:29) Theo Riddick rush to the right for 7 yards to the Det16. Tackled by Andrew Sendejo and Danielle Hunter.","(5:02) Matthew Stafford pass to the right to Golden Tate for 7 yards to the Det9. Tackled by Xavier Rhodes.","(5:13) Jeff Locke punts for 57 yards to Det3. No return. Penalty: Holding on Detroit (Antwione Williams) -1 yards.","(5:57) Sam Bradford pass to the left to Jerick McKinnon for 2 yards to the Min40. Tackled by Josh Bynes.","(6:28) Sam Bradford pass to the left to Kyle Rudolph for 10 yards to the Min38. Tackled by Tahir Whitehead.","(7:01) Sam Bradford pass to the right to Kyle Rudolph for 2 yards to the Min28. Tackled by Tavon Wilson.","(7:23) Penalty: Delay of Game on Minnesota (Sam Bradford) -5 yards.","(8:10) Zach Line rush to the left for 2 yards to the Min31. Tackled by Antwione Williams and Glover Quin.","(8:38) Matt Asiata rush up the middle for no gain to the Min29. Tackled by Tahir Whitehead.","(9:17) Sam Bradford pass to the right to Charles Johnson for 9 yards to the Min29. Tackled by Nevin Lawson.","(9:26) Sam Martin punts for 40 yards to Min19. Adam Thielen return for 1 yard to Min20. Tackled by Adairius Barnes.","(10:05) Theo Riddick rush up the middle for 3 yards to the Det41. Tackled by Andrew Sendejo and Eric Kendricks.","(10:09) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(10:47) Theo Riddick rush up the middle for 3 yards to the Det38. Tackled by Anthony Barr.","(11:16) Matthew Stafford rush to the right for 15 yards to the Det35. Tackled by Harrison Smith.","(11:26) Matthew Stafford incomplete pass to the right intended for Andre Roberts.","(11:52) Penalty: Offside on Minnesota (Everson Griffen) 5 yards.","(12:38) Matthew Stafford sacked at Det15 for a loss of 10 yards by Andrew Sendejo and Danielle Hunter.","(12:38) Kai Forbath kicks off to the endzone. Touchback.","(12:41) Kai Forbath 28 yard field goal attempt is GOOD. Holder: Jeff Locke.","(13:21) Sam Bradford pass to the middle to Kyle Rudolph for 6 yards to the Det10. Tackled by Tahir Whitehead.","(13:54) Sam Bradford pass to the left to Matt Asiata for 5 yards to the Det16. Tackled by Glover Quin.","(14:34) Sam Bradford pass to the middle to Adam Thielen for 4 yards to the Det21. Tackled by Tahir Whitehead.","(15:00) Penalty: Illegal Block on Minnesota (T.J. Clemmings) -15 yards.","(0:32) Matt Asiata rush up the middle for 15 yards to the Det10. Tackled by Rafael Bush and Glover Quin.","(1:13) Cordarrelle Patterson rush to the left for 22 yards to the Det25. Tackled by Glover Quin and Rafael Bush.","(1:53) Sam Bradford pass to the right to Adam Thielen for 9 yards to the Det47. Tackled by Darius Slay.","(2:36) Matt Asiata rush to the left for 4 yards to the Min44. Tackled by Tavon Wilson and Anthony Zettel.","(3:14) Sam Bradford pass to the left to Cordarrelle Patterson for 10 yards to the Min40. Tackled by Miles Killebrew.","(3:14) Minnesota Vikings timeout.","(3:20) Sam Bradford incomplete pass to the left intended for Rhett Ellison.","(3:57) Sam Bradford pass to the right to Adam Thielen for 3 yards to the Min30. Tackled by Quandre Diggs.","(4:32) Jerick McKinnon rush to the left for 10 yards to the Min27. Tackled by Tahir Whitehead.","(5:14) Matt Asiata rush up the middle for 3 yards to the Min17. Tackled by Quandre Diggs.","(5:27) Sam Martin punts for 51 yards to Min15. Adam Thielen return for a loss of 1 yard to Min14. Tackled by Miles Killebrew and Don Muhlbach.","(5:31) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(5:35) Matthew Stafford incomplete pass to the right intended for Anquan Boldin.","(6:19) Theo Riddick rush to the left for 2 yards to the Det34. Tackled by Everson Griffen and Andrew Sendejo.","(6:57) Matthew Stafford pass to the middle to Anquan Boldin for 10 yards to the Det32. Tackled by Captain Munnerlyn.","(7:03) Kai Forbath kicks off to the Det-2. Andre Roberts return for 24 yards to Det22. Tackled by Anthony Harris.","(7:07) Kai Forbath 30 yard field goal attempt is GOOD. Holder: Jeff Locke.","(7:48) Sam Bradford pass to the left to Matt Asiata for 3 yards to the Det12. Tackled by Miles Killebrew.","(8:28) Sam Bradford pass to the left to Charles Johnson for 3 yards to the Det15. Tackled by Quandre Diggs.","(9:08) Jerick McKinnon rush up the middle for 2 yards to the Det18. Tackled by Tahir Whitehead.","(9:45) Sam Bradford pass to the right to Jerick McKinnon for 41 yards to the Det20. Tackled by Tavon Wilson.","(9:53) Sam Martin punts for 47 yards to Min39. No return.","(10:28) Matthew Stafford pass to the left to Golden Tate for 7 yards to the Det14. Tackled by Captain Munnerlyn and Andrew Sendejo.","(11:11) Matthew Stafford sacked at Det7 for a loss of 8 yards by Anthony Barr.","(11:54) Dwayne Washington rush up the middle for 2 yards to the Det15. Tackled by Andrew Sendejo and Chad Greenway.","(12:07) Jeff Locke punts for 52 yards to Det10. Andre Roberts return for 3 yards to Det13. Tackled by Charles Johnson and Cordarrelle Patterson.","(12:47) Sam Bradford pass to the left to Jerick McKinnon for 2 yards to the Min38. Tackled by Miles Killebrew.","(13:19) Jerick McKinnon rush to the left for 7 yards to the Min36. Tackled by Rafael Bush and Antwione Williams.","(13:53) Sam Bradford pass to the left to Kyle Rudolph for 4 yards to the Min29. Tackled by Tahir Whitehead.","(14:24) Penalty: Holding on Minnesota (Kyle Rudolph) -10 yards.","(15:00) Sam Bradford pass to the right to Adam Thielen for 10 yards to the Min35. Tackled by Tahir Whitehead.","(15:00) Sam Martin kicks off to the endzone. Touchback.","(0:05) Matthew Stafford incomplete pass to the right intended for Golden Tate defensed by Andrew Sendejo.","(0:10) Matthew Stafford incomplete pass to the right intended for Anquan Boldin.","(0:15) Matthew Stafford incomplete pass to the left intended for Eric Ebron.","(0:15) Matthew Stafford incomplete pass to the middle.","(0:31) Matthew Stafford pass to the right to Andre Roberts for 14 yards to the Min49. Tackled by Xavier Rhodes.","(0:31) Matthew Stafford incomplete pass to the middle.","(0:49) Matthew Stafford pass to the left to Marvin Jones Jr. for 12 yards to the Det37. Tackled by Trae Waynes.","(1:06) Matthew Stafford pass to the left to Theo Riddick for 11 yards to the Det25. Tackled by Captain Munnerlyn.","(1:13) Jeff Locke punts for 36 yards to Det14. No return.","(1:13) Detroit Lions timeout.","(1:20) Sam Bradford pass to the left to Kyle Rudolph for 5 yards to the Min50. Tackled by Miles Killebrew.","(1:26) Sam Bradford incomplete pass to the left intended for Adam Thielen defensed by Josh Bynes.","(2:00) Sam Bradford pass to the left to Cordarrelle Patterson for a loss of 4 yards to the Min45. Tackled by Tahir Whitehead.","(2:00) Two Minute Warning.","(2:00) Detroit Lions timeout.","(2:07) Zach Zenner rush up the middle for no gain to the Min49. Tackled by Brian Robison.","(2:07) Detroit Lions timeout.","(2:51) Matthew Stafford pass to the left to Theo Riddick for 1 yard to the Min49. Tackled by Eric Kendricks.","(2:57) Matthew Stafford incomplete pass to the left intended for Andre Roberts.","(3:40) Dwayne Washington rush up the middle for 8 yards to the Det50. Tackled by Harrison Smith.","(3:45) Sam Bradford incomplete pass to the middle intended for Adam Thielen defensed by Haloti Ngata.","(4:30) Sam Bradford pass to the left to Adam Thielen for 7 yards to the Det41. Tackled by Tahir Whitehead.","(4:35) Sam Bradford incomplete pass to the middle intended for Kyle Rudolph defensed by A'Shawn Robinson.","(5:00) Sam Bradford pass to the right to Cordarrelle Patterson for 1 yard to the Det48. Tackled by Darius Slay.","(5:54) Sam Bradford pass to the left to Rhett Ellison for 21 yards to the Det49. Tackled by Tavon Wilson.","(6:39) Jerick McKinnon rush up the middle for 7 yards to the Min30. Tackled by Darius Slay.","(6:39) Penalty: Too Many Men on Field on Detroit 5 yards.","(6:45) Sam Martin kicks off to the Min-2. Cordarrelle Patterson return for 20 yards to Min18. Tackled by Thurston Armbrister.","(6:49) Matt Prater 29 yard field goal attempt is GOOD. Holder: Sam Martin.","(6:54) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr. defensed by Trae Waynes.","(7:38) Matthew Stafford pass to the left to Anquan Boldin for 6 yards to the Min11. Tackled by Captain Munnerlyn.","(8:21) Matthew Stafford pass to the right to Theo Riddick for no gain to the Min17. Tackled by Chad Greenway.","(9:03) Theo Riddick rush up the middle for 12 yards to the Min17. Tackled by Trae Waynes and Linval Joseph.","(9:50) Matthew Stafford pass to the left to Golden Tate for 41 yards to the Min29. Tackled by Harrison Smith.","(9:59) Jeff Locke punts for 50 yards to Det30. No return.","(10:32) Sam Bradford pass to the left to Matt Asiata for 6 yards to the Min20. Tackled by Tahir Whitehead.","(11:15) Jerick McKinnon rush to the left for a loss of 4 yards to the Min14. Tackled by Josh Bynes.","(11:54) Sam Bradford pass to the left to Adam Thielen for 6 yards to the Min18. Tackled by Antwione Williams.","(12:01) Sam Martin punts for 30 yards to Min12. No return.","(12:06) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(12:11) Matthew Stafford incomplete pass to the right.","(12:52) Dwayne Washington rush to the left for 2 yards to the Min42. Tackled by Brian Robison.","(13:29) Matthew Stafford rush to the left for 11 yards to the Min44. Tackled by Harrison Smith.","(13:33) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(13:39) Matthew Stafford incomplete pass to the left intended for Golden Tate.","(14:17) Matthew Stafford pass to the middle to Golden Tate for 18 yards to the Det45. Tackled by Andrew Sendejo.","(15:00) Dwayne Washington rush to the right for 2 yards to the Det27. Tackled by Linval Joseph.","(0:33) Matthew Stafford pass to the right to Andre Roberts for 5 yards to the Det25. Tackled by Trae Waynes.","(0:40) Kai Forbath kicks off to the Det-5. Andre Roberts return for 25 yards to Det20. Tackled by Justin Trattou.","(0:40) Kai Forbath extra point is good.","(0:44) Matt Asiata rush to the left for 5 yards for a TOUCHDOWN.","(1:17) Sam Bradford pass to the left to Kyle Rudolph for 9 yards to the Det5. Tackled by Quandre Diggs.","(1:57) Jerick McKinnon rush to the right for 1 yard to the Det14. Tackled by Tavon Wilson and Antwione Williams.","(2:10) Penalty: Pass Interference on Detroit (Darius Slay) 5 yards.","(2:13) Sam Bradford incomplete pass to the middle.","(2:55) Jerick McKinnon rush up the middle for 2 yards to the Det20. Tackled by Haloti Ngata.","(3:00) Penalty: Holding on Detroit (Nevin Lawson) 5 yards.","(3:41) Sam Bradford pass to the right to Adam Thielen for 6 yards to the Det27. Tackled by Tavon Wilson.","(4:20) Jerick McKinnon rush up the middle for 1 yard to the Det33. Tackled by Tavon Wilson.","(4:52) Sam Bradford pass to the right to Kyle Rudolph for 18 yards to the Det34. Tackled by Quandre Diggs.","(5:24) Sam Bradford pass to the right to Adam Thielen for 8 yards to the Min48. Tackled by Tavon Wilson.","(6:03) Sam Bradford pass to the left to Cordarrelle Patterson for 5 yards to the Min40. Tackled by Quandre Diggs.","(6:41) Jerick McKinnon rush up the middle for 5 yards to the Min35. Tackled by A'Shawn Robinson.","(7:14) Sam Bradford pass to the right to Kyle Rudolph for 5 yards to the Min30. Tackled by Josh Bynes.","(7:14) Sam Martin kicks off to the endzone. Touchback.","(7:14) Matt Prater extra point is good.","(7:20) Matthew Stafford pass to the right to Anquan Boldin for 2 yards for a TOUCHDOWN.","(8:04) Matthew Stafford pass to the left to Anquan Boldin for 8 yards to the Min2. Tackled by Andrew Sendejo.","(8:53) Matthew Stafford rush to the left for 6 yards to the Min10. Tackled by Chad Greenway.","(9:35) Theo Riddick rush up the middle for 1 yard to the Min16. Tackled by Shamar Stephen.","(10:20) Matthew Stafford pass to the right to Marvin Jones Jr. for 7 yards to the Min17. Tackled by Xavier Rhodes.","(11:03) Dwayne Washington rush to the left for 5 yards to the Min24. Tackled by Anthony Barr.","(11:37) Matthew Stafford pass to the left to Marvin Jones Jr. for 20 yards to the Min29. Tackled by Harrison Smith.","(12:20) Theo Riddick rush up the middle for 12 yards to the Min49. Tackled by Harrison Smith.","(13:05) Theo Riddick rush to the left for 2 yards to the Det39. Tackled by Anthony Barr.","(13:44) Matthew Stafford pass to the left to Anquan Boldin for 5 yards to the Det37. Tackled by Eric Kendricks.","(14:25) Theo Riddick rush up the middle for 3 yards to the Det32. Tackled by Audie Cole.","(15:00) Matthew Stafford pass to the left to Golden Tate for 4 yards to the Det29. Tackled by Chad Greenway.","(15:00) Kai Forbath kicks off to the endzone. Touchback."]