["(0:37) Malcolm Brown rush to the left for 4 yards to the LA29. Tackled by Darryl Tapp.","(1:19) Malcolm Brown rush to the right for 4 yards to the LA25. Tackled by Darryl Tapp.","(1:53) Malcolm Brown rush to the right for 1 yard to the LA21. Tackled by Nate Stupar.","(2:00) Thomas Morstead punts for 39 yards to LA0. Touchback.","(2:00) Two Minute Warning.","(2:33) Drew Brees pass to the left to Willie Snead for 2 yards to the LA39. Tackled by Aaron Donald.","(3:20) Mark Ingram rush to the left for 4 yards to the LA41. Tackled by Mark Barron and Alec Ogletree.","(3:25) Penalty: Holding on New Orleans (John Kuhn) -10 yards.","(4:05) Tim Hightower rush to the left for a loss of 3 yards to the LA35. Tackled by Mark Barron.","(4:50) Tim Hightower rush to the right for 30 yards to the LA32. Tackled by Maurice Alexander and E.J. Gaines.","(5:24) Drew Brees pass to the right to Michael Thomas for 11 yards to the NO38. Tackled by Mark Barron.","(5:38) Johnny Hekker punts for 68 yards to NO27. No return.","(6:19) Jared Goff sacked at LA5 for a loss of 10 yards by Dannell Ellerbe.","(6:24) Jared Goff incomplete pass to the left intended for Kenny Britt.","(6:50) Jared Goff pass to the middle to Todd Gurley for 3 yards to the LA15. Tackled by Kenny Vaccaro.","(7:04) Thomas Morstead punts for 59 yards to LA4. Tavon Austin return for 8 yards to LA12. Tackled by Shiloh Keo.","(7:08) Drew Brees incomplete pass to the right intended for Tommylee Lewis defensed by Alec Ogletree.","(7:50) Mark Ingram rush to the left for 2 yards to the NO37. Tackled by Cory Littleton.","(8:32) Mark Ingram rush to the right for 2 yards to the NO35. Tackled by T.J. McDonald.","(8:37) Todd Gurley rush to the left for no gain to the NO33. Tackled by Cameron Jordan.","(9:09) Jared Goff pass to the left to Kenny Britt for 6 yards to the NO33. Tackled by Kenny Vaccaro.","(9:42) Todd Gurley rush to the left for a loss of 2 yards to the NO39. Tackled by Nick Fairley.","(10:05) Jared Goff pass to the right to Lance Kendricks for 5 yards to the NO37. Tackled by Craig Robertson.","(10:15) Wil Lutz kicks off to the LA-3. Benny Cunningham return for 61 yards to NO42. Tackled by Nate Stupar.","(10:15) Wil Lutz extra point is good.","(10:26) Willie Snead pass to the right to Tim Hightower for 50 yards for a TOUCHDOWN.","(11:09) Mark Ingram rush to the left for 15 yards to the NO50. Tackled by Lamarcus Joyner.","(11:32) Penalty: Holding on New Orleans (Jahri Evans) -10 yards.","(12:15) Tim Hightower rush to the left for 2 yards to the NO45. Tackled by Alec Ogletree.","(13:00) Drew Brees pass to the left to Michael Thomas for 6 yards to the NO43. Tackled by E.J. Gaines.","(13:47) Tim Hightower rush to the left for 4 yards to the NO37. Tackled by Alec Ogletree.","(14:22) Tommylee Lewis rush to the left for 7 yards to the NO33.","(15:00) Tim Hightower rush to the left for 7 yards to the NO26. Tackled by Alec Ogletree.","(0:04) Johnny Hekker punts for 43 yards to NO21. Tommylee Lewis - no return. FUMBLE, recovered by NO (Shiloh Keo).","(0:37) Jared Goff pass to the left to Benny Cunningham for 12 yards to the LA36. Tackled by Vonn Bell and Craig Robertson.","(1:21) Jared Goff sacked at LA24 for a loss of 9 yards by Cameron Jordan and Dannell Ellerbe.","(1:59) Jared Goff pass to the right to Tavon Austin for 5 yards to the LA33. Tackled by Delvin Breaux.","(2:21) Penalty: False Start on Los Angeles (Tyler Higbee) -5 yards.","(2:44) Penalty: False Start on Los Angeles (Andrew Donnal) -5 yards.","(3:11) Penalty: Holding on New Orleans (Dannell Ellerbe) 5 yards.","(3:16) Jared Goff incomplete pass to the right intended for Brian Quick.","(3:42) Todd Gurley rush to the right for 8 yards to the LA33. Tackled by Craig Robertson.","(3:42) Wil Lutz kicks off to the endzone. Touchback.","(3:42) Wil Lutz extra point is good.","(3:49) Drew Brees pass to the left to Michael Thomas for 21 yards for a TOUCHDOWN.","(4:20) John Kuhn rush to the right for 4 yards to the LA21. Tackled by Mark Barron.","(4:53) Mark Ingram rush to the left for 9 yards to the LA25. Tackled by Alec Ogletree.","(5:24) Drew Brees pass to the left to Josh Hill for 21 yards to the LA34. Tackled by Trumaine Johnson.","(6:10) Drew Brees pass to the left to Michael Thomas for 35 yards to the NO45. Tackled by Cody Davis.","(6:14) Drew Brees incomplete pass to the right intended for Mark Ingram.","(6:59) Drew Brees pass to the right to Michael Thomas for 2 yards to the NO10. Tackled by Cory Littleton.","(7:07) Johnny Hekker punts for 53 yards to NO8. No return.","(7:55) Jared Goff pass to the left to Brian Quick for 3 yards to the LA39. Tackled by Kenny Vaccaro.","(8:37) Todd Gurley rush to the left for no gain to the LA36. Tackled by Cameron Jordan and Tyeler Davison.","(9:17) Jared Goff pass to the left to Kenny Britt for 6 yards to the LA36. Tackled by Delvin Breaux.","(9:58) Tavon Austin rush to the left for 10 yards to the LA30. Tackled by Dannell Ellerbe.","(10:05) Thomas Morstead punts for 42 yards to LA0. Touchback.","(10:10) Drew Brees incomplete pass to the right intended for Michael Thomas.","(10:55) Tim Hightower rush to the left for 3 yards to the LA42. Tackled by T.J. McDonald.","(11:35) Drew Brees pass to the right to Tim Hightower for 4 yards to the LA45. Tackled by Mark Barron and Trumaine Johnson.","(11:38) Jared Goff pass intended for Lance Kendricks INTERCEPTED by Kenny Vaccaro. No return. Tackled by Lance Kendricks.","(11:45) Jared Goff incomplete pass to the left intended for Kenny Britt.","(12:13) Todd Gurley rush to the left for 7 yards to the LA43. Tackled by Cameron Jordan.","(12:53) Jared Goff pass to the right to Todd Gurley for 7 yards to the LA36. Tackled by Dannell Ellerbe.","(12:58) Wil Lutz kicks off to the LA0. Benny Cunningham return for 29 yards to LA29. Tackled by Travaris Cadet.","(12:58) Wil Lutz extra point is good.","(13:05) Drew Brees pass to the right to Mark Ingram for 21 yards for a TOUCHDOWN.","(13:43) Drew Brees sacked at LA21 for a loss of 6 yards by Robert Quinn.","(14:18) Tim Hightower rush to the right for a loss of 1 yard to the LA15. Tackled by William Hayes.","(15:00) Mark Ingram rush to the right for 61 yards to the LA14. Tackled by T.J. McDonald.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback.","(0:08) Drew Brees pass to the left to Josh Hill for 1 yard to the NO42. Tackled by E.J. Gaines.","(0:09) Penalty: Delay of Game on New Orleans (Drew Brees) -5 yards.","(0:09) Drew Brees incomplete pass to the middle.","(0:26) Drew Brees pass to the right to Josh Hill for 4 yards to the NO46. Tackled by Mark Barron.","(0:26) New Orleans Saints timeout.","(0:33) Drew Brees pass to the left to Michael Thomas for 10 yards to the NO42. Tackled by Mark Barron and E.J. Gaines.","(0:55) Drew Brees pass to the left to Willie Snead for 7 yards to the NO32. Tackled by William Hayes and E.J. Gaines.","(0:55) Greg Zuerlein kicks off to the endzone. Touchback.","(0:55) Greg Zuerlein extra point is good.","(1:00) Jared Goff pass to the left to Lance Kendricks for 15 yards for a TOUCHDOWN.","(1:00) Jared Goff incomplete pass to the middle.","(1:20) Jared Goff pass to the left to Kenny Britt for 17 yards to the NO15. Tackled by B.W. Webb.","(1:25) Jared Goff pass to the left to Lance Kendricks for 24 yards to the NO32. Tackled by Dannell Ellerbe.","(1:25) Los Angeles Rams timeout.","(1:30) Jared Goff incomplete pass to the right intended for Kenny Britt.","(2:00) Jared Goff pass to the left to Tavon Austin for 8 yards to the LA44. Tackled by Sheldon Rankins.","(2:00) Two Minute Warning.","(2:12) Jared Goff pass to the left to Bradley Marquez for 12 yards to the LA36. Tackled by Jairus Byrd.","(2:12) New Orleans Saints timeout.","(2:18) Todd Gurley rush to the right for 3 yards to the LA24. Tackled by Nick Fairley.","(2:24) Wil Lutz kicks off to the LA6. Benny Cunningham return for 15 yards to LA21. Tackled by Josh Hill.","(2:24) Wil Lutz extra point is good.","(2:29) Drew Brees pass to the left to Michael Thomas for 6 yards for a TOUCHDOWN.","(3:08) Tim Hightower rush to the left for 1 yard to the LA6. Tackled by Mark Barron.","(3:32) Drew Brees pass to the right to Josh Hill for 35 yards to the LA7. Tackled by E.J. Gaines.","(4:08) Drew Brees pass to the right to Josh Hill for 8 yards to the LA42. Tackled by Michael Brockers.","(4:50) Drew Brees pass to the middle to Coby Fleener for 11 yards to the NO50. Tackled by Maurice Alexander and Alec Ogletree.","(5:26) Mark Ingram rush to the left for a loss of 2 yards to the NO39. Tackled by Dominique Easley.","(5:32) Penalty: Pass Interference on Los Angeles (Lamarcus Joyner) 24 yards.","(5:36) Drew Brees incomplete pass to the left. Penalty: Intentional Grounding on New Orleans (Drew Brees) -10 yards.","(6:09) Drew Brees pass to the left to Michael Thomas for 5 yards to the NO27. Tackled by E.J. Gaines.","(6:19) Johnny Hekker punts for 47 yards to NO14. Tommylee Lewis return for 8 yards to NO22. Tackled by Cory Littleton.","(6:22) Jared Goff incomplete pass to the left intended for Brian Quick.","(6:26) Jared Goff incomplete pass to the left intended for Lance Kendricks defensed by Vonn Bell.","(7:06) Todd Gurley rush to the left for 3 yards to the LA39. Tackled by Craig Robertson.","(7:44) Todd Gurley rush to the right for 13 yards to the LA36. Tackled by David Onyemata and Sterling Moore.","(7:46) Wil Lutz kicks off to the LA23. Chase Reynolds - no return. Tackled by Shiloh Keo.","(7:46) Wil Lutz extra point is good.","(7:47) Drew Brees rush up the middle for 1 yard for a TOUCHDOWN.","(7:47) New Orleans Saints timeout.","(8:10) Tim Hightower rush to the left for no gain to the LA1. Tackled by Alec Ogletree.","(8:49) Tim Hightower rush to the right for 4 yards to the LA1. Tackled by Trumaine Johnson and Maurice Alexander.","(9:25) Drew Brees pass to the right to Coby Fleener for 5 yards to the LA5. Tackled by T.J. McDonald.","(9:32) Jared Goff sacked at LA10 for a loss of 17 yards by Sheldon Rankins. FUMBLE, recovered by NO (Paul Kruger). Tackled by Todd Gurley.","(9:38) Wil Lutz kicks off to the LA-6. Benny Cunningham return for 33 yards to LA27. Tackled by B.W. Webb.","(9:38) Wil Lutz extra point is good.","(9:43) Mark Ingram rush to the left for 10 yards for a TOUCHDOWN.","(10:22) Mark Ingram rush to the left for no gain to the LA10. Tackled by Mark Barron.","(11:09) Drew Brees pass to the right to Josh Hill for 5 yards to the LA10. Tackled by T.J. McDonald.","(11:42) Mark Ingram rush up the middle for 4 yards to the LA15. Tackled by Mark Barron and Alec Ogletree.","(12:04) Drew Brees pass to the middle to Coby Fleener for 31 yards to the LA19. Tackled by Mark Barron.","(12:45) Tim Hightower rush to the left for a loss of 1 yard to the NO50. Tackled by Aaron Donald.","(13:26) Mark Ingram rush to the right for 15 yards to the LA49. Tackled by Alec Ogletree.","(14:06) Drew Brees pass to the right to Willie Snead for 8 yards to the NO36. Tackled by T.J. McDonald.","(14:43) Mark Ingram rush to the right for 3 yards to the NO28. Tackled by T.J. McDonald.","(14:43) Greg Zuerlein kicks off to the endzone. Touchback.","(14:43) Greg Zuerlein extra point is good.","(14:47) Jared Goff pass to the right to Kenny Britt for 6 yards for a TOUCHDOWN.","(14:54) Drew Brees sacked at NO6 for a loss of 8 yards by Aaron Donald. FUMBLE, recovered by LA (Mark Barron). Tackled by Jahri Evans.","(15:00) Johnny Hekker punts for 40 yards to NO14. No return.","(0:04) Jared Goff incomplete pass to the left intended for Kenny Britt.","(0:27) Penalty: False Start on Los Angeles (Kenny Britt) -5 yards.","(1:14) Jared Goff pass to the middle to Tavon Austin for 8 yards to the NO49. Tackled by Jairus Byrd.","(1:21) Jared Goff incomplete pass to the left intended for Tyler Higbee.","(2:00) Todd Gurley rush to the left for 3 yards to the LA43. Tackled by Craig Robertson and Kasim Edebali.","(2:39) Todd Gurley rush to the left for 9 yards to the LA40. Tackled by Vonn Bell and Sterling Moore.","(2:45) Wil Lutz kicks off to the LA1. Benny Cunningham return for 25 yards to LA26. Tackled by Chris Banjo. Penalty: Offside on New Orleans (Chris Banjo) 5 yards.","(2:45) Wil Lutz extra point is good.","(2:49) Drew Brees pass to the middle to Brandon Coleman for 3 yards for a TOUCHDOWN.","(3:24) Mark Ingram rush to the right for 5 yards to the LA3. Tackled by Alec Ogletree.","(3:28) Drew Brees incomplete pass to the middle intended for Willie Snead defensed by T.J. McDonald.","(4:11) Drew Brees pass to the left to Coby Fleener for 12 yards to the LA8. Tackled by E.J. Gaines and Alec Ogletree.","(4:55) Drew Brees pass to the left to Willie Snead for 16 yards to the LA20. Tackled by E.J. Gaines.","(5:35) Tim Hightower rush to the left for a loss of 2 yards to the LA36. Tackled by Mark Barron.","(6:09) Drew Brees pass to the middle to Willie Snead for 5 yards to the LA34. Tackled by Alec Ogletree.","(6:46) Tim Hightower rush to the left for 3 yards to the LA39. Tackled by Dominique Easley.","(7:18) Tim Hightower rush to the right for 9 yards to the LA42. Tackled by Mark Barron.","(7:24) Johnny Hekker punts for 43 yards to NO49. No return.","(7:29) Jared Goff incomplete pass to the left intended for Lance Kendricks.","(7:48) Jared Goff pass to the right to Lance Kendricks for 7 yards to the LA16. Tackled by Sterling Moore. Penalty: Illegal Block on Los Angeles (Tavon Austin) -8 yards.","(8:27) Todd Gurley rush to the left for 3 yards to the LA9. Tackled by Kenny Vaccaro.","(9:10) Jared Goff pass to the left to Todd Gurley for a loss of 2 yards to the LA6. Tackled by Jairus Byrd.","(9:17) Thomas Morstead punts for 39 yards to LA8. No return.","(9:23) Drew Brees incomplete pass to the right intended for Willie Snead.","(10:05) Drew Brees pass to the left to John Kuhn for 3 yards to the LA47. Tackled by Mark Barron.","(10:42) Tim Hightower rush to the right for a loss of 5 yards to the NO50. Tackled by Aaron Donald.","(11:27) Mark Ingram rush to the left for 18 yards to the LA45. Tackled by Maurice Alexander.","(11:58) Drew Brees pass to the right to Michael Thomas for 12 yards to the NO37. Tackled by E.J. Gaines.","(12:03) Drew Brees incomplete pass to the right intended for Tommylee Lewis.","(12:08) Greg Zuerlein kicks off to the NO7. Tommylee Lewis return for 18 yards to NO25. Tackled by Bradley Marquez.","(12:08) Greg Zuerlein extra point is good.","(12:08) Jared Goff pass to the left to Tavon Austin for 24 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Los Angeles (Kenny Britt) -15 yards.","(12:17) Jared Goff incomplete pass to the right intended for Kenny Britt.","(12:57) Todd Gurley rush to the right for 3 yards to the NO24. Tackled by Tyeler Davison and Craig Robertson.","(13:35) Jared Goff pass to the left to Kenny Britt for 17 yards to the NO27. Tackled by Vonn Bell.","(14:20) Todd Gurley rush to the left for no gain to the NO44. Tackled by Nick Fairley.","(15:00) Jared Goff pass to the left to Todd Gurley for 31 yards to the NO44. Tackled by Jairus Byrd.","(15:00) Wil Lutz kicks off to the endzone. Touchback."]