["(0:11) Sam Koch rush up the middle for a loss of 23 yards to the Bal0. Safety.","(0:11) Penalty: Delay of Game on Baltimore (Sam Koch) -5 yards.","(0:55) Kenneth Dixon rush to the left for 6 yards to the Bal28. Tackled by Vontaze Burfict.","(0:55) Cincinnati Bengals timeout.","(0:59) Mike Wallace rush to the right for a loss of 1 yard to the Bal22. Tackled by Will Clarke.","(0:59) Cincinnati Bengals timeout.","(1:05) Kenneth Dixon rush to the right for 2 yards to the Bal23. Tackled by Michael Johnson.","(1:12) Andy Dalton sacked at Bal21 for a loss of 5 yards by Elvis Dumervil. FUMBLE, recovered by Bal (Lawrence Guy). Tackled by Kevin Zeitler.","(1:17) Andy Dalton incomplete pass to the left intended for Tyler Boyd defensed by Brent Urban.","(1:21) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(1:27) Andy Dalton pass to the right to Tyler Eifert for 13 yards to the Bal16. Tackled by C.J. Mosley.","(1:30) Andy Dalton incomplete pass to the left intended for Brandon LaFell defensed by Matt Judon.","(1:55) Andy Dalton pass to the right to Tyler Boyd for 7 yards to the Bal29. Tackled by Lardarius Webb.","(2:00) Andy Dalton incomplete pass to the left intended for Tyler Eifert defensed by Matt Judon.","(2:00) Two Minute Warning.","(2:21) Andy Dalton pass to the left to Tyler Boyd for 9 yards to the Bal36. Tackled by Lardarius Webb.","(2:27) Andy Dalton incomplete pass to the left intended for Tyler Eifert defensed by Terrell Suggs.","(3:01) Andy Dalton pass to the right to Jeremy Hill for 8 yards to the Bal45. Tackled by Tavon Young.","(3:07) Rex Burkhead rush to the right for 7 yards to the Cin47. Tackled by Tavon Young.","(3:43) Rex Burkhead rush to the right for 4 yards to the Cin40. Tackled by Tavon Young.","(4:17) Rex Burkhead rush to the left for 17 yards to the Cin36. Tackled by Eric Weddle.","(4:31) Sam Koch punts for 63 yards to Cin19. No return.","(5:15) Joe Flacco pass to the right to Dennis Pitta for 9 yards to the Bal18. Tackled by Michael Johnson.","(5:20) Joe Flacco incomplete pass to the right intended for Kyle Juszczyk.","(5:48) Terrance West rush to the left for no gain to the Bal9. Tackled by Michael Johnson.","(6:00) Mike Nugent kicks off to the Bal1. Devin Hester return for 17 yards to Bal18. Tackled by Cedric Peerman. Penalty: Holding on Baltimore (Anthony Levine Sr.) -9 yards.","(6:04) Mike Nugent 36 yard field goal attempt is GOOD. Holder: Kevin Huber.","(6:08) Andy Dalton incomplete pass to the right intended for Brandon LaFell defensed by Tavon Young.","(6:43) Andy Dalton pass to the right to Tyler Eifert for 7 yards to the Bal18. Tackled by Lardarius Webb.","(6:45) Andy Dalton incomplete pass to the right intended for Tyler Eifert.","(6:53) Penalty: Illegal Use of Hands on Baltimore (Albert McClellan) 5 yards.","(6:55) Andy Dalton incomplete pass to the left intended for Brandon LaFell.","(7:24) Andy Dalton sacked at Bal30 for a loss of 7 yards by Terrell Suggs. FUMBLE, recovered by Cin (Cedric Ogbuehi).","(7:24) Penalty: False Start on Cincinnati (Andrew Whitworth) -5 yards.","(7:29) Penalty: Holding on Baltimore (Tavon Young) 5 yards.","(8:04) Andy Dalton pass to the right to Rex Burkhead for 17 yards to the Bal23. Tackled by Lardarius Webb.","(8:29) Andy Dalton pass to the right to James Wright for 11 yards to the Bal40. Tackled by Lardarius Webb.","(8:50) Andy Dalton pass to the right to Rex Burkhead for 2 yards to the Cin49. Tackled by Zachary Orr.","(9:02) Sam Koch punts for 44 yards to Cin36. Alex Erickson return for 11 yards to Cin47. Tackled by Chris Moore.","(9:09) Joe Flacco incomplete pass to the right.","(9:40) Joe Flacco pass to the left to Darren Waller for 8 yards to the Bal20. Tackled by George Iloka.","(10:20) Terrance West rush to the left for 2 yards to the Bal12. Tackled by Vontaze Burfict.","(10:43) Penalty: Pass Interference on Baltimore (Steve Smith Sr.) -10 yards.","(10:52) Kevin Huber punts for 63 yards to Bal0. Touchback.","(10:56) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(11:00) Andy Dalton incomplete pass to the right intended for James Wright.","(11:35) Jeremy Hill rush up the middle for no gain to the Cin37. Tackled by Eric Weddle.","(12:16) Andy Dalton rush to the left for 12 yards to the Cin37. Tackled by Shareece Wright.","(12:16) Justin Tucker kicks off to the endzone. Touchback.","(12:20) Justin Tucker 36 yard field goal attempt is GOOD. Holder: Sam Koch.","(13:06) Joe Flacco pass to the left to Kenneth Dixon for 3 yards to the Cin18. Tackled by Adam Jones.","(13:43) Terrance West rush to the left for a loss of 2 yards to the Cin21. Tackled by Vontaze Burfict.","(14:22) Terrance West rush to the left for 8 yards to the Cin19. Tackled by Carlos Dunlap.","(15:00) Kenneth Dixon rush to the left for 8 yards to the Cin27. Tackled by Dre Kirkpatrick.","(0:14) Joe Flacco pass to the middle to Steve Smith Sr. for 8 yards to the Cin35. Tackled by Clayton Fejedelem.","(0:14) Cincinnati Bengals timeout.","(0:48) Kenneth Dixon rush to the left for a loss of 2 yards to the Cin43. Tackled by Clayton Fejedelem.","(1:32) Kenneth Dixon rush up the middle for 3 yards to the Cin41. Tackled by Wallace Gilberry.","(2:19) Joe Flacco pass to the middle to Darren Waller for 6 yards to the Cin44. Tackled by Karlos Dansby.","(2:55) Kenneth Dixon rush to the left for 4 yards to the Bal50. Tackled by Clayton Fejedelem.","(3:33) Joe Flacco pass to the middle to Kyle Juszczyk for 16 yards to the Bal46. Tackled by Josh Shaw.","(4:10) Terrance West rush to the right for 7 yards to the Bal30. Tackled by Darqueze Dennard.","(4:16) Mike Nugent kicks off to the Bal-5. Devin Hester return for 28 yards to Bal23. Tackled by Tyler Kroft.","(4:16) Mike Nugent extra point is NO GOOD.","(4:23) Andy Dalton pass to the right to Tyler Eifert for 3 yards for a TOUCHDOWN.","(4:23) Baltimore Ravens timeout.","(4:59) Andy Dalton pass to the right to Alex Erickson for 7 yards to the Bal3. Tackled by Jerraud Powers and C.J. Mosley.","(5:06) Andy Dalton incomplete pass to the right.","(5:47) Andy Dalton pass to the left to Tyler Boyd for 22 yards to the Bal10. Tackled by Lardarius Webb.","(5:51) Andy Dalton incomplete pass to the right intended for Tyler Boyd.","(6:24) Andy Dalton pass to the middle to Jeremy Hill for 3 yards to the Bal32. Tackled by Zachary Orr.","(7:00) Andy Dalton pass to the middle to Tyler Eifert for 25 yards to the Bal35. Tackled by Eric Weddle and C.J. Mosley.","(7:27) Andy Dalton sacked at Cin40 for a loss of 10 yards by Terrell Suggs. FUMBLE, recovered by Cin.","(8:04) Andy Dalton pass to the left to Jeremy Hill for 24 yards to the Cin50. Tackled by Eric Weddle.","(8:43) Jeremy Hill rush to the left for 2 yards to the Cin26. Tackled by Michael Pierce and Brandon Williams.","(9:14) Andy Dalton pass to the right to Jeremy Hill for 10 yards to the Cin24. Tackled by Lardarius Webb.","(9:22) Sam Koch punts for 37 yards to Cin14. No return.","(9:26) Joe Flacco incomplete pass to the right intended for Dennis Pitta defensed by Dre Kirkpatrick.","(10:06) Kenneth Dixon rush to the right for 2 yards to the Bal49. Tackled by Darqueze Dennard and Dre Kirkpatrick.","(10:36) Joe Flacco rush to the right for 3 yards to the Bal47. Tackled by Wallace Gilberry.","(11:13) Joe Flacco pass to the left to Mike Wallace for 19 yards to the Bal44. Tackled by Vontaze Burfict.","(11:53) Kenneth Dixon rush to the left for 4 yards to the Bal25. Tackled by Vontaze Burfict.","(12:37) Joe Flacco pass to the middle to Steve Smith Sr. for 4 yards to the Bal21. Tackled by Darqueze Dennard and Vincent Rey.","(13:09) Terrance West rush up the middle for 7 yards to the Bal17. Tackled by Vontaze Burfict.","(13:16) Kevin Huber punts for 28 yards to Bal10. No return.","(13:20) Andy Dalton incomplete pass to the left intended for James Wright.","(13:29) Andy Dalton incomplete pass to the right intended for Tyler Eifert.","(13:57) Andy Dalton pass to the middle to Brandon LaFell for 3 yards to the Bal38. Tackled by Eric Weddle.","(14:22) Andy Dalton pass to the right to Tyler Eifert for 20 yards to the Cin44. Tackled by Eric Weddle and Zachary Orr. Penalty: Unnecessary Roughness on Baltimore (Eric Weddle) 15 yards.","(14:55) Jeremy Hill rush to the right for a loss of 1 yard to the Cin24. Tackled by C.J. Mosley.","(15:00) Justin Tucker kicks off to the Cin-5. Alex Erickson return for 30 yards to Cin25. Tackled by Patrick Onwuasor.","(0:02) Justin Tucker 54 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:02) Cincinnati Bengals timeout.","(0:02) Joe Flacco incomplete pass to the middle.","(0:25) Joe Flacco pass to the right to Steve Smith Sr. for 5 yards to the Cin36. Tackled by Darqueze Dennard and Vontaze Burfict.","(0:30) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(0:30) Baltimore Ravens timeout.","(0:35) Joe Flacco pass to the middle to Dennis Pitta for 7 yards to the Cin41. Tackled by Vontaze Burfict.","(0:35) Baltimore Ravens timeout.","(0:40) Joe Flacco pass to the left to Mike Wallace for 7 yards to the Cin48. Tackled by Adam Jones.","(1:01) Joe Flacco pass to the middle to Dennis Pitta for 18 yards to the Bal45. Tackled by Josh Shaw.","(1:15) Kevin Huber punts for 60 yards to Bal12. Devin Hester return for 15 yards to Bal29. FUMBLE, recovered by Bal (Devin Hester).","(1:15) Baltimore Ravens timeout.","(1:20) Rex Burkhead rush to the right for a loss of 2 yards to the Cin28. Tackled by Zachary Orr.","(1:25) Andy Dalton incomplete pass to the left intended for Brandon LaFell.","(1:28) Andy Dalton incomplete pass to the middle intended for Tyler Boyd defensed by Lardarius Webb.","(1:34) Penalty: Illegal Contact on Baltimore (Shareece Wright) 5 yards.","(1:40) Justin Tucker kicks off to the Cin0. Alex Erickson return for 25 yards to Cin25. Tackled by Patrick Onwuasor.","(1:45) Justin Tucker 57 yard field goal attempt is GOOD. Holder: Sam Koch.","(1:53) Joe Flacco sacked at Cin39 for a loss of 5 yards by Michael Johnson.","(2:00) Joe Flacco pass to the right to Kyle Juszczyk for 2 yards to the Cin34. Tackled by Vontaze Burfict.","(2:00) Two Minute Warning.","(2:39) Kenneth Dixon rush to the right for 4 yards to the Cin36. Tackled by Karlos Dansby.","(3:12) Joe Flacco pass to the left to Mike Wallace for 31 yards to the Cin40. Tackled by Josh Shaw.","(4:00) Joe Flacco pass to the right to Terrance West for 9 yards to the Bal29. Tackled by Carlos Dunlap.","(4:35) Joe Flacco pass to the right to Kyle Juszczyk for no gain to the Bal20. Tackled by Karlos Dansby.","(4:42) Kevin Huber punts for 42 yards to Bal20. No return.","(4:46) Andy Dalton incomplete pass to the right intended for Ryan Hewitt defensed by C.J. Mosley.","(5:23) Rex Burkhead rush to the right for 3 yards to the Cin38. Tackled by Timmy Jernigan and Zachary Orr.","(5:48) Jeremy Hill rush to the left for 2 yards to the Cin35. Tackled by Zachary Orr and Shareece Wright.","(6:20) Andy Dalton pass to the left to Brandon LaFell for 23 yards to the Cin33. Tackled by Shareece Wright.","(6:57) Jeremy Hill rush up the middle for 3 yards to the Cin10. Tackled by Eric Weddle.","(7:03) Sam Koch punts for 39 yards to Cin7. No return.","(7:37) Terrance West rush to the left for a loss of 2 yards to the Cin46. Tackled by Wallace Gilberry.","(8:03) Kenneth Dixon rush to the right for a loss of 2 yards to the Cin44. Tackled by Vontaze Burfict.","(8:32) Joe Flacco pass to the right to Kenneth Dixon for 9 yards to the Cin42. Tackled by Josh Shaw.","(8:41) Kevin Huber punts for 41 yards to Bal43. Devin Hester return for 6 yards to Bal49. Tackled by Chykie Brown.","(8:41) Cincinnati Bengals timeout.","(9:24) Andy Dalton pass to the right to James Wright for 3 yards to the Cin16. Tackled by Lardarius Webb and Zachary Orr.","(10:09) Andy Dalton pass to the middle to Tyler Boyd for 6 yards to the Cin13. Tackled by Jerraud Powers.","(10:47) Jeremy Hill rush to the left for no gain to the Cin7. Tackled by Matt Judon.","(10:57) Sam Koch punts for 39 yards to Cin7. No return.","(11:01) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(11:05) Joe Flacco incomplete pass to the right.","(11:33) Kenneth Dixon rush to the right for 3 yards to the Cin46. Tackled by Pat Sims and Karlos Dansby.","(12:12) Joe Flacco rush to the right for 16 yards to the Cin49. Tackled by Darqueze Dennard.","(12:20) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(12:50) Terrance West rush to the right for no gain to the Bal35. Tackled by Pat Sims.","(13:17) Terrance West rush to the right for 16 yards to the Bal35. Tackled by Darqueze Dennard.","(13:57) Andy Dalton rush up the middle for no gain to the Bal16. FUMBLE, recovered by Bal (Elvis Dumervil). Tackled by Andy Dalton.","(13:57) Jeremy Hill rush to the left for no gain to the Bal16. Tackled by Brandon Williams and Zachary Orr.","(14:36) Jeremy Hill rush to the left for 3 yards to the Bal16. Tackled by Michael Pierce.","(14:45) Joe Flacco pass intended for Dennis Pitta INTERCEPTED by Rey Maualuga defensed by Carlos Dunlap and returned for 9 yards. Tackled by Vladimir Ducasse.","(14:50) Mike Nugent kicks off to the Bal5. Devin Hester return for 18 yards to Bal23. Tackled by Vincent Rey.","(14:53) Mike Nugent 23 yard field goal attempt is GOOD. Holder: Kevin Huber.","(14:56) Andy Dalton incomplete pass to the left intended for Brandon LaFell.","(15:00) Andy Dalton incomplete pass to the right intended for Tyler Eifert defensed by Tavon Young.","(0:12) Andy Dalton pass to the right to Jeremy Hill for 7 yards to the Bal4. Tackled by Zachary Orr.","(0:47) Andy Dalton pass to the right to Tyler Boyd for 18 yards to the Bal11. Tackled by Jerraud Powers.","(0:52) Andy Dalton incomplete pass to the middle intended for Tyler Eifert.","(1:37) Jeremy Hill rush to the left for no gain to the Bal29. Tackled by Zachary Orr.","(2:15) Andy Dalton pass to the right to Brandon LaFell for 12 yards to the Bal29. Tackled by Zachary Orr.","(2:57) Jeremy Hill rush up the middle for 2 yards to the Bal41. Tackled by Brandon Williams.","(3:28) Andy Dalton pass to the right to James Wright for 9 yards to the Bal43. Tackled by Tavon Young.","(4:12) Jeremy Hill rush to the right for 7 yards to the Cin48. Tackled by Brandon Williams.","(4:20) Andy Dalton incomplete pass to the right intended for James Wright defensed by Eric Weddle.","(4:55) Andy Dalton pass to the right to Ryan Hewitt for 5 yards to the Cin41. Tackled by Albert McClellan.","(5:32) Andy Dalton pass to the left to Jeremy Hill for 9 yards to the Cin36. Tackled by Shareece Wright.","(5:39) Justin Tucker kicks off to the Cin2. Alex Erickson return for 25 yards to Cin27. Tackled by Darren Waller.","(5:44) Justin Tucker 52 yard field goal attempt is GOOD. Holder: Sam Koch.","(6:11) Joe Flacco sacked at Cin19 for a loss of 10 yards by Carlos Dunlap. Penalty: Unnecessary Roughness on Baltimore (Steve Smith Sr.) -15 yards.","(6:46) Terrance West rush to the right for 4 yards to the Cin9. Tackled by Karlos Dansby.","(7:15) Joe Flacco pass to the right to Terrance West for 1 yard to the Cin13. Tackled by Josh Shaw.","(7:51) Joe Flacco pass to the right to Kamar Aiken for 19 yards to the Cin14. Tackled by George Iloka.","(7:55) Joe Flacco incomplete pass to the left intended for Kyle Juszczyk.","(8:20) Joe Flacco pass to the right to Kenneth Dixon for 3 yards to the Cin33. Tackled by Vontaze Burfict.","(8:33) Kevin Huber punts for 49 yards to Bal36. Devin Hester return for 28 yards to Cin36. Tackled by Ryan Hewitt.","(9:03) Andy Dalton rush to the right for 2 yards to the Cin15. Tackled by Albert McClellan.","(9:32) Penalty: Holding on Cincinnati (Tyler Eifert) -10 yards.","(9:36) Andy Dalton incomplete pass to the right intended for Cody Core.","(10:09) Jeremy Hill rush to the left for 3 yards to the Cin23. Tackled by Lawrence Guy.","(10:15) Justin Tucker kicks off to the Cin-2. Alex Erickson return for 22 yards to Cin20. Tackled by Matt Elam.","(10:15) Justin Tucker extra point is good.","(10:21) Joe Flacco pass to the right to Breshad Perriman for 14 yards for a TOUCHDOWN.","(10:54) Joe Flacco pass to the right to Steve Smith Sr. for 3 yards to the Cin14. Tackled by Rey Maualuga.","(11:20) Terrance West rush to the left for 2 yards to the Cin17. Tackled by Pat Sims.","(11:55) Kenneth Dixon rush to the right for 15 yards to the Cin19. Tackled by George Iloka and Josh Shaw.","(12:12) Joe Flacco pass to the left to Kenneth Dixon for 16 yards to the Cin34. Tackled by Darqueze Dennard.","(12:39) Kenneth Dixon rush to the right for 2 yards to the Bal50. Tackled by Vontaze Burfict and Pat Sims.","(13:16) Joe Flacco pass to the middle to Kamar Aiken for 11 yards to the Bal48. Tackled by Adam Jones.","(14:00) Terrance West rush to the left for 1 yard to the Bal37. Tackled by Michael Johnson.","(14:06) Joe Flacco incomplete pass to the right intended for Terrance West defensed by Carlos Dunlap.","(14:38) Joe Flacco pass to the right to Terrance West for 6 yards to the Bal36. Tackled by Vontaze Burfict and Darqueze Dennard.","(14:39) Terrance West rush to the right for 5 yards to the Bal30. Tackled by Michael Johnson.","(15:00) Mike Nugent kicks off to the endzone. Touchback."]