["(0:31) Marcus Mariota rush up the middle for a loss of 2 yards to the Ten45.","(1:13) Marcus Mariota rush up the middle for a loss of 1 yard to the Ten47.","(1:58) DeMarco Murray rush to the left for 14 yards to the Ten48. Tackled by Michael Thomas and Neville Hewitt.","(1:58) Two Minute Warning.","(2:14) DeMarco Murray rush up the middle for a loss of 3 yards to the Ten34. Tackled by Isa Abdul-Quddus and Julius Warmsley.","(2:14) Penalty: Encroachment on Miami (Jordan Phillips) 5 yards.","(2:20) Ryan Tannehill pass intended for Kenny Stills INTERCEPTED by Daimion Stafford and returned for 4 yards. Tackled by Kenny Stills.","(2:55) Ryan Tannehill pass to the right to DeVante Parker for 20 yards to the Mia43. Tackled by Daimion Stafford.","(3:06) Brett Kern punts for 26 yards to Mia11. Jarvis Landry return for 12 yards to Mia23. Tackled by Sean Spence.","(3:06) Miami Dolphins timeout.","(3:12) Marcus Mariota pass to the right to DeMarco Murray for 3 yards to the Mia37. Tackled by Kiko Alonso.","(3:12) Miami Dolphins timeout.","(3:18) DeMarco Murray rush up the middle for a loss of 3 yards to the Mia40. Tackled by Michael Thomas.","(4:00) DeMarco Murray rush up the middle for a loss of 2 yards to the Mia37. Tackled by Kiko Alonso and Donald Butler.","(4:41) DeMarco Murray rush up the middle for 2 yards to the Mia35. Tackled by Andre Branch.","(5:21) DeMarco Murray rush to the left for no gain to the Mia37. Tackled by Donald Butler.","(6:08) DeMarco Murray rush to the left for 9 yards to the Mia37. Tackled by Tony Lippett.","(6:18) Matt Darr punts for 35 yards to Mia46. No return.","(7:00) Ryan Tannehill sacked at Mia11 for a loss of 10 yards by Brian Orakpo.","(7:41) Ryan Tannehill pass to the middle to Jarvis Landry for 9 yards to the Mia21. Tackled by Brice McCain.","(8:16) Ryan Tannehill sacked at Mia12 for a loss of 9 yards by Brian Orakpo.","(8:23) Ryan Succop kicks off to the Mia0. Jakeem Grant return for 21 yards to Mia21. Tackled by Aaron Wallace.","(8:23) Ryan Succop extra point is BLOCKED.","(8:30) Marcus Mariota pass to the right to Rishard Matthews for 4 yards for a TOUCHDOWN.","(8:55) Penalty: Offside on Miami (Andre Branch) 4 yards.","(9:36) Marcus Mariota pass to the middle to DeMarco Murray for no gain to the Mia8. Tackled by Spencer Paysinger.","(10:04) Marcus Mariota pass to the left to Rishard Matthews for 11 yards to the Mia17. Tackled by Tony Lippett. Penalty: Roughing Passer on Miami (Jason Jones) 9 yards.","(10:27) DeMarco Murray rush up the middle for 7 yards to the Mia28. Tackled by Bobby McCain.","(11:07) DeMarco Murray rush to the right for 8 yards to the Mia35. Tackled by Bobby McCain.","(11:17) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(11:57) Marcus Mariota rush to the left for 19 yards to the Mia43. Tackled by Michael Thomas.","(12:40) DeMarco Murray rush up the middle for 4 yards to the Ten38. Tackled by Jason Jones.","(13:17) DeMarco Murray rush to the right for no gain to the Ten34. Tackled by Isa Abdul-Quddus.","(13:32) Matt Darr punts for 57 yards to Ten34. Marc Mariani - no return. Tackled by Matt Darr.","(14:15) Ryan Tannehill sacked at Mia9 for a loss of 5 yards by Jurrell Casey.","(15:00) Jay Ajayi rush to the right for a loss of 5 yards to the Mia14. Tackled by Austin Johnson.","(0:12) Jay Ajayi rush to the right for 5 yards to the Mia19. Tackled by Kevin Byard.","(0:20) Brett Kern punts for 29 yards to Mia14. No return.","(0:38) Marcus Mariota pass to the right to Delanie Walker for 10 yards to the Mia43. Tackled by Bobby McCain.","(1:05) Marcus Mariota pass to the left to Andre Johnson for 8 yards to the Ten47. Tackled by Tony Lippett.","(1:47) Marcus Mariota pass to the left to Delanie Walker for 7 yards to the Ten39. Tackled by Tony Lippett.","(1:52) Penalty: Illegal Use of Hands on Tennessee (Taylor Lewan) -10 yards.","(2:22) Penalty: Holding on Tennessee (Taylor Lewan) -10 yards.","(3:04) Marcus Mariota rush to the left for 10 yards to the Mia48. Tackled by Reshad Jones.","(3:48) DeMarco Murray rush up the middle for 4 yards to the Ten42. Tackled by Donald Butler.","(4:31) Marcus Mariota pass to the left to Anthony Fasano for 10 yards to the Ten38. Tackled by Tony Lippett and Neville Hewitt.","(5:10) DeMarco Murray rush to the left for 3 yards to the Ten28. Tackled by Cameron Wake.","(5:10) Andrew Franks kicks off to the endzone. Touchback.","(5:13) Andrew Franks 24 yard field goal attempt is GOOD. Holder: Matt Darr.","(6:01) Ryan Tannehill pass to the right to Damien Williams for 9 yards to the Ten6. Tackled by Perrish Cox.","(6:42) Ryan Tannehill sacked at Ten15 for a loss of 2 yards by Derrick Morgan.","(7:07) Penalty: Offside on Tennessee (Jurrell Casey) 6 yards.","(7:13) Penalty: Holding on Miami (Jarvis Landry) -10 yards.","(7:52) Jay Ajayi rush to the left for 2 yards to the Ten9. Tackled by Sean Spence and David Bass.","(7:52) Miami Dolphins timeout.","(8:38) Ryan Tannehill pass to the left to DeVante Parker for 50 yards to the Ten11. Tackled by Jason McCourty.","(9:18) Kenyan Drake rush to the left for 6 yards to the Mia39. Tackled by Sean Spence and Brian Orakpo.","(10:00) Jay Ajayi rush to the right for 2 yards to the Mia33. Tackled by Brian Orakpo.","(10:33) Ryan Tannehill pass to the right to Dion Sims for 6 yards to the Mia31. Tackled by Brian Orakpo.","(10:33) Ryan Succop kicks off to the endzone. Touchback.","(10:37) Ryan Succop 40 yard field goal attempt is GOOD. Holder: Brett Kern.","(10:42) Marcus Mariota incomplete pass to the left intended for Andre Johnson.","(11:20) Marcus Mariota pass to the right to DeMarco Murray for 2 yards to the Mia22. Tackled by Reshad Jones.","(11:58) DeMarco Murray rush to the left for no gain to the Mia24. Tackled by Tony Lippett.","(12:08) Ryan Tannehill pass intended for DeVante Parker INTERCEPTED by Jason McCourty and returned for 1 yard. Tackled by DeVante Parker. Penalty: Unsports. Conduct on Miami (Jay Ajayi) 15 yards.","(12:27) Penalty: Holding on Miami (Jermon Bushrod) -10 yards.","(12:58) Ryan Tannehill pass to the left to Kenyan Drake for 9 yards to the Mia46. Tackled by Daimion Stafford.","(13:40) Ryan Tannehill pass to the right to Jarvis Landry for 11 yards to the Mia37. Tackled by Jason McCourty.","(14:22) Ryan Tannehill pass to the left to Dominique Jones for a loss of 1 yard to the Mia26. Tackled by Brian Orakpo.","(15:00) Jay Ajayi rush to the left for 2 yards to the Mia27. Tackled by Karl Klug and Sean Spence.","(15:00) Ryan Succop kicks off to the endzone. Touchback.","(0:02) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe.","(0:07) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(0:13) Marcus Mariota pass to the left to DeMarco Murray for 4 yards to the Mia48.","(0:19) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe.","(0:26) Matt Darr punts for 46 yards to Ten33. No return. Penalty: FC Interference on Miami (Walt Aikens) 15 yards.","(0:26) Tennessee Titans timeout.","(0:33) Kenyan Drake rush to the right for a loss of 2 yards to the Mia21. Tackled by DaQuan Jones.","(0:33) Tennessee Titans timeout.","(0:42) Ryan Tannehill sacked at Mia23 for a loss of 9 yards by Jurrell Casey.","(0:47) Ryan Tannehill pass to the right to Kenyan Drake for 7 yards to the Mia32. Tackled by Sean Spence.","(0:47) Ryan Succop kicks off to the endzone. Touchback.","(0:47) Ryan Succop extra point is good.","(0:52) Marcus Mariota pass to the left to Delanie Walker for 20 yards for a TOUCHDOWN.","(0:52) Tennessee Titans timeout.","(1:00) Marcus Mariota pass to the right to Rishard Matthews for 7 yards to the Mia20. Tackled by Byron Maxwell.","(1:28) Marcus Mariota rush to the right for 21 yards to the Mia27. Tackled by Isa Abdul-Quddus.","(1:34) Marcus Mariota pass to the left to Tajae Sharpe for 8 yards to the Mia48. Tackled by Spencer Paysinger.","(1:54) Marcus Mariota pass to the middle to Rishard Matthews for 10 yards to the Ten44. Tackled by Kiko Alonso.","(2:00) Marcus Mariota pass to the left to Tajae Sharpe for 9 yards to the Ten34. Tackled by Tony Lippett.","(2:00) Andrew Franks kicks off to the endzone. Touchback.","(2:00) Two Minute Warning.","(2:00) Andrew Franks extra point is good.","(2:01) Jay Ajayi rush to the left for 4 yards for a TOUCHDOWN.","(2:36) Jay Ajayi rush to the left for 4 yards to the Ten4. Tackled by Daimion Stafford.","(3:06) Jay Ajayi rush to the left for 5 yards to the Ten8. Tackled by Sean Spence.","(3:57) Jay Ajayi rush to the left for 4 yards to the Ten13. Tackled by David Bass.","(4:48) Ryan Tannehill pass to the left to Damien Williams for 58 yards to the Ten17. Tackled by David Bass.","(5:24) Jay Ajayi rush to the right for 4 yards to the Mia25. Tackled by Avery Williamson.","(5:30) Ryan Succop kicks off to the Mia-5. Jakeem Grant return for 26 yards to Mia21. Tackled by David Bass.","(5:30) Ryan Succop extra point is good.","(5:34) Marcus Mariota pass to the middle to Andre Johnson for 5 yards for a TOUCHDOWN.","(5:38) Marcus Mariota incomplete pass to the left intended for DeMarco Murray.","(6:17) DeMarco Murray rush to the left for no gain to the Mia5. Tackled by Kiko Alonso.","(7:02) DeMarco Murray rush to the right for 10 yards to the Mia5. Tackled by Reshad Jones and Jordan Phillips.","(7:39) Derrick Henry rush to the right for 5 yards to the Mia15. Tackled by Kiko Alonso.","(8:17) Derrick Henry rush up the middle for 22 yards to the Mia20. Tackled by Reshad Jones and Isa Abdul-Quddus.","(8:54) Derrick Henry rush up the middle for 2 yards to the Mia42. Tackled by Kiko Alonso.","(9:34) Derrick Henry rush to the left for 8 yards to the Mia44. Tackled by Jason Jones.","(10:16) Marcus Mariota rush to the right for 8 yards to the Ten48. Tackled by Jordan Phillips.","(10:59) DeMarco Murray rush to the left for 8 yards to the Ten40. Tackled by Tony Lippett.","(11:38) DeMarco Murray rush up the middle for 3 yards to the Ten32. Tackled by Kiko Alonso.","(12:15) DeMarco Murray rush to the right for 5 yards to the Ten29. Tackled by Donald Butler.","(12:23) Andrew Franks kicks off to the Ten4. Marc Mariani return for 20 yards to Ten24. Tackled by Michael Thomas.","(12:23) Andrew Franks extra point is good.","(12:44) Brett Kern punts for 51 yards to Mia26. Jakeem Grant return for 74 yards for a TOUCHDOWN.","(13:22) Marcus Mariota pass to the right to Kendall Wright for 9 yards to the Ten23. Tackled by Ndamukong Suh.","(14:05) Derrick Henry rush up the middle for 5 yards to the Ten14. Tackled by Donald Butler.","(14:08) Marcus Mariota incomplete pass to the right.","(14:44) Penalty: Illegal Block on Tennessee (Tajae Sharpe) -9 yards.","(14:56) Matt Darr punts for 57 yards to Ten9. Marc Mariani return for 9 yards to Ten18. Tackled by Michael Thomas.","(15:00) Ryan Tannehill incomplete pass to the middle intended for Dion Sims defensed by Austin Johnson.","(0:19) Jay Ajayi rush to the left for 9 yards to the Mia34. Tackled by Sean Spence.","(0:23) Ryan Tannehill incomplete pass to the right intended for Dion Sims defensed by Wesley Woodyard.","(0:23) Ryan Succop kicks off to the endzone. Touchback.","(0:23) Ryan Succop extra point is good.","(0:30) Marcus Mariota rush to the right for 5 yards for a TOUCHDOWN.","(1:09) DeMarco Murray rush to the left for 5 yards to the Mia5. Tackled by Tony Lippett.","(1:53) DeMarco Murray rush to the left for 13 yards to the Mia10. Tackled by Reshad Jones.","(2:32) DeMarco Murray rush to the left for 9 yards to the Mia23. Tackled by Kiko Alonso and Andre Branch.","(3:12) Marcus Mariota pass to the middle to Delanie Walker for 29 yards to the Mia32. Tackled by Isa Abdul-Quddus.","(3:23) Matt Darr punts for 46 yards to Ten30. Marc Mariani return for 9 yards to Ten39. Tackled by Walt Aikens and Michael Thomas.","(3:29) Ryan Tannehill incomplete pass to the left intended for Kenyan Drake.","(4:12) Jay Ajayi rush up the middle for 3 yards to the Mia24. Tackled by Derrick Morgan.","(4:48) Damien Williams rush to the right for 3 yards to the Mia21. Tackled by Karl Klug.","(4:58) Brett Kern punts for 28 yards to Mia18. No return.","(5:04) Marcus Mariota incomplete pass to the left intended for Andre Johnson.","(5:47) Derrick Henry rush to the right for 5 yards to the Mia46. Tackled by Terrence Fede.","(6:18) Derrick Henry rush to the left for 7 yards to the Ten49. Tackled by Terrence Fede and Kiko Alonso.","(6:53) Penalty: Illegal Plyr Downfld on Tennessee (Quinton Spain) -5 yards.","(7:19) Marcus Mariota pass to the left to DeMarco Murray for 7 yards to the Ten47. Tackled by Neville Hewitt and Donald Butler.","(7:48) DeMarco Murray rush to the left for 4 yards to the Ten40. Tackled by Cameron Wake.","(8:13) DeMarco Murray rush to the right for 2 yards to the Ten21. Tackled by Byron Maxwell. Penalty: Face Mask on Miami (Byron Maxwell) 15 yards.","(8:23) Matt Darr punts for 57 yards to Ten17. Marc Mariani return for 2 yards to Ten19. Tackled by Bobby McCain.","(8:32) Ryan Tannehill incomplete pass to the right intended for Jay Ajayi.","(9:10) Ryan Tannehill sacked at Mia26 for a loss of 7 yards by Derrick Morgan.","(9:57) Ryan Tannehill pass to the right to Dominique Jones for 5 yards to the Mia33. Tackled by Avery Williamson.","(10:37) Ryan Tannehill pass to the left to Jarvis Landry for 8 yards to the Mia28. Tackled by Rashad Johnson.","(11:18) Jarvis Landry rush to the right for 2 yards to the Mia20. Tackled by Derrick Morgan.","(12:00) Jay Ajayi rush to the right for 3 yards to the Mia18. Tackled by Avery Williamson.","(12:08) Brett Kern punts for 41 yards to Mia15. No return.","(12:16) Marcus Mariota incomplete pass to the right intended for Delanie Walker.","(13:06) Marcus Mariota pass to the right to Delanie Walker for no gain to the Ten44. Tackled by Byron Maxwell. FUMBLE, recovered by Ten (Delanie Walker).","(13:46) DeMarco Murray rush up the middle for a loss of 1 yard to the Ten44. Tackled by Kiko Alonso.","(14:26) DeMarco Murray rush to the left for 12 yards to the Ten45. Tackled by Reshad Jones and Kiko Alonso.","(15:00) DeMarco Murray rush to the left for 8 yards to the Ten33. Tackled by Kiko Alonso.","(15:00) Andrew Franks kicks off to the endzone. Touchback."]