["(0:07) Andrew Luck rush up the middle for a loss of 1 yard to the Ind39.","(0:48) Andrew Luck rush up the middle for a loss of 1 yard to the Ind40.","(0:48) Chicago Bears timeout.","(0:57) Frank Gore rush to the right for 13 yards to the Ind41. Tackled by Jacoby Glenn.","(1:02) Brian Hoyer incomplete pass to the right intended for Cameron Meredith.","(1:47) Brian Hoyer pass to the left to Eddie Royal for 7 yards to the Ind28. Tackled by T.Y. McGill.","(1:52) Penalty: Holding on Chicago (Bobby Massie) -10 yards.","(1:52) Indianapolis Colts timeout.","(1:56) Brian Hoyer pass to the right to Zach Miller for 5 yards to the Ind25. Tackled by Clayton Geathers.","(2:00) Brian Hoyer incomplete pass to the right intended for Alshon Jeffery.","(2:00) Two Minute Warning.","(2:18) Brian Hoyer pass to the right to Zach Miller for 17 yards to the Ind30. Tackled by Darius Butler.","(2:23) Brian Hoyer pass to the left to Alshon Jeffery for 15 yards to the Ind47.","(2:28) Brian Hoyer pass to the right to Cameron Meredith for 13 yards to the Chi38. Tackled by Rashaan Melvin.","(2:28) Pat McAfee kicks off to the endzone. Touchback.","(2:33) Adam Vinatieri 46 yard field goal attempt is GOOD. Holder: Pat McAfee.","(2:39) Andrew Luck incomplete pass to the right intended for Phillip Dorsett defensed by Cre'von LeBlanc.","(2:39) Penalty: Delay of Game on Indianapolis (Andrew Luck) -5 yards.","(2:39) Chicago Bears timeout.","(2:45) Frank Gore rush up the middle for 6 yards to the Chi23. Tackled by Jerrell Freeman.","(3:29) Frank Gore rush to the right for 5 yards to the Chi29. Tackled by Willie Young.","(3:29) Penalty: False Start on Indianapolis (Jack Mewhort) -5 yards.","(3:38) Brian Hoyer pass to the right to Cameron Meredith for 12 yards to the Chi27. Tackled by Rashaan Melvin. FUMBLE, recovered by Ind (D'Qwell Jackson). Tackled by Jordan Howard.","(3:43) Pat McAfee kicks off to the Chi-4. Deonte Thompson return for 19 yards to Chi15. Tackled by Josh Ferguson.","(3:43) Adam Vinatieri extra point is good.","(3:51) Andrew Luck pass to the left to T.Y. Hilton for 35 yards for a TOUCHDOWN.","(4:33) Frank Gore rush to the left for 3 yards to the Chi35. Tackled by Akiem Hicks and Danny Trevathan.","(5:10) Andrew Luck pass to the left to T.Y. Hilton for 8 yards to the Chi38. Tackled by Danny Trevathan.","(5:38) Andrew Luck pass to the left to Dwayne Allen for 6 yards to the Chi46. Tackled by Jacoby Glenn.","(6:34) Penalty: Offside on Chicago (Willie Young) 5 yards.","(6:34) Andrew Luck pass to the left to Dwayne Allen for 20 yards to the Ind43. Tackled by Chris Prosinski.","(6:58) Andrew Luck pass to the left to T.Y. Hilton for 5 yards to the Ind23. Tackled by Jacoby Glenn.","(7:04) Connor Barth kicks off to the Ind-3. Jordan Todman return for 21 yards to Ind18. Tackled by DeAndre Houston-Carson and Sherrick McManis.","(7:04) Connor Barth extra point is good.","(7:12) Brian Hoyer pass to the left to Jordan Howard for 21 yards for a TOUCHDOWN.","(7:48) Brian Hoyer pass to the left to Cameron Meredith for 14 yards to the Ind21. Tackled by Zach Kerr.","(8:34) Jordan Howard rush to the left for 6 yards to the Ind35. Tackled by Antonio Morrison.","(9:04) Brian Hoyer pass to the left to Eddie Royal for 5 yards to the Ind41. Tackled by Mike Adams.","(9:48) Brian Hoyer pass to the right to Zach Miller for 23 yards to the Ind46. Tackled by Clayton Geathers.","(9:48) Indianapolis Colts timeout.","(10:13) Jordan Howard rush to the left for 12 yards to the Chi31. Tackled by Erik Walden.","(10:46) Brian Hoyer pass to the left to Zach Miller for 3 yards to the Chi19. Tackled by Clayton Geathers.","(11:20) Jordan Howard rush to the left for 4 yards to the Chi16. Tackled by David Parry.","(11:49) Brian Hoyer pass to the right to Alshon Jeffery for 8 yards to the Chi12. Tackled by Vontae Davis.","(12:04) Pat McAfee punts for 74 yards to Chi4. No return.","(12:45) Andrew Luck sacked at Ind22 for a loss of 5 yards by Willie Young.","(13:25) Frank Gore rush up the middle for 2 yards to the Ind27. Tackled by Danny Trevathan.","(13:31) Andrew Luck incomplete pass to the right intended for Jack Doyle.","(13:31) Connor Barth kicks off to the endzone. Touchback.","(13:36) Connor Barth 24 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(13:40) Brian Hoyer incomplete pass to the left intended for Eddie Royal.","(14:22) Brian Hoyer pass to the right to Cameron Meredith for 5 yards to the Ind6. Tackled by Rashaan Melvin.","(15:00) Jordan Howard rush to the left for no gain to the Ind11. Tackled by Erik Walden.","(0:12) Brian Hoyer pass to the left to Joshua Bellamy for 14 yards to the Ind11. Tackled by Clayton Geathers.","(0:49) Brian Hoyer pass to the middle to Zach Miller for 10 yards to the Ind25. Tackled by Patrick Robinson and D'Qwell Jackson.","(1:23) Brian Hoyer pass to the right to Alshon Jeffery for 8 yards to the Ind35. Tackled by D'Qwell Jackson.","(2:02) Jordan Howard rush to the right for 3 yards to the Ind43. Tackled by D'Qwell Jackson and Antonio Morrison.","(2:46) Brian Hoyer pass to the right to Alshon Jeffery for 38 yards to the Ind46. Tackled by Patrick Robinson.","(2:53) Pat McAfee punts for 50 yards to Chi16. No return.","(2:59) Andrew Luck incomplete pass to the right intended for Josh Ferguson. Penalty: Intentional Grounding on Indianapolis (Andrew Luck) -13 yards.","(3:37) Andrew Luck pass to the middle to T.Y. Hilton for 6 yards to the Ind47. Tackled by Adrian Amos.","(4:01) Frank Gore rush to the right for 2 yards to the Ind41. Tackled by Cornelius Washington.","(4:06) 49 yard field goal attempt by Connor Barth is NO GOOD. Holder: Patrick O'Donnell.","(4:11) Penalty: Running into Kicker on Indianapolis (T.J. Green) 5 yards.","(4:16) Brian Hoyer incomplete pass to the left intended for Eddie Royal.","(4:56) Brian Hoyer pass to the left to Jordan Howard for 6 yards to the Ind36. Tackled by Antonio Morrison.","(4:56) Penalty: Delay of Game on Chicago (Brian Hoyer) -5 yards.","(5:02) Brian Hoyer incomplete pass to the right intended for Logan Paulsen.","(5:25) Jordan Howard rush to the left for 10 yards to the Chi48. Tackled by Clayton Geathers and Henry Anderson. Penalty: Unnecessary Roughness on Indianapolis (Henry Anderson) 15 yards.","(5:52) Brian Hoyer pass to the middle to Cameron Meredith for 13 yards to the Chi38. Tackled by Darius Butler.","(5:52) Pat McAfee kicks off to the endzone. Touchback.","(5:58) Adam Vinatieri 41 yard field goal attempt is GOOD. Holder: Pat McAfee.","(6:36) Andrew Luck sacked at Chi23 for a loss of 3 yards by Jonathan Bullard.","(7:17) Frank Gore rush up the middle for 6 yards to the Chi20. Tackled by Jonathan Bullard.","(7:44) Frank Gore rush to the right for a loss of 1 yard to the Chi26. Tackled by Adrian Amos and Willie Young.","(8:04) Andrew Luck pass to the left to Chester Rogers for 19 yards to the Chi25.","(8:50) Andrew Luck sacked at Chi44 for a loss of 8 yards by Akiem Hicks.","(9:32) Andrew Luck pass to the left to Quan Bray for 7 yards to the Chi36. Tackled by Bryce Callahan.","(10:11) Andrew Luck pass to the left to Dwayne Allen for 17 yards to the Chi43. Tackled by Chris Prosinski.","(10:17) Andrew Luck incomplete pass to the middle intended for Chester Rogers.","(10:22) Penalty: Illegal Contact on Chicago (Bryce Callahan) 5 yards.","(10:28) Andrew Luck incomplete pass to the left intended for Chester Rogers defensed by Bryce Callahan.","(11:00) Frank Gore rush to the left for 3 yards to the Ind35. Tackled by Mitch Unrein.","(11:15) Patrick O'Donnell punts for 46 yards to Ind12. Quan Bray return for 20 yards to Ind32. Tackled by Sam Acho.","(11:21) Brian Hoyer incomplete pass to the right.","(11:25) Brian Hoyer incomplete pass to the left intended for Cameron Meredith.","(12:01) Jordan Howard rush to the right for 2 yards to the Chi42. Tackled by Kendall Langford.","(12:31) Brian Hoyer pass to the right to Cameron Meredith for 18 yards to the Chi40.","(13:05) Jordan Howard rush up the middle for 2 yards to the Chi22. Tackled by D'Qwell Jackson.","(13:17) Pat McAfee punts for 66 yards to Chi0. Touchback.","(13:52) Andrew Luck rush up the middle for 3 yards to the Ind34. Tackled by Danny Trevathan.","(14:32) Andrew Luck pass to the right to Jack Doyle for 4 yards to the Ind31. Tackled by Jerrell Freeman.","(15:00) Frank Gore rush to the right for 2 yards to the Ind27. Tackled by Jerrell Freeman.","(15:00) Connor Barth kicks off to the endzone. Touchback.","(0:11) Brian Hoyer rush up the middle for a loss of 1 yard to the Chi24.","(0:11) Pat McAfee kicks off to the endzone. Touchback.","(0:16) Adam Vinatieri 26 yard field goal attempt is GOOD. Holder: Pat McAfee.","(0:16) Indianapolis Colts timeout.","(0:22) Andrew Luck sacked at Chi8 for a loss of 7 yards by Willie Young.","(0:22) Indianapolis Colts timeout.","(0:27) Andrew Luck pass to the left to Chester Rogers for 4 yards to the Chi1. Tackled by Bryce Callahan.","(0:27) Indianapolis Colts timeout.","(0:35) Andrew Luck pass to the right to Phillip Dorsett for 5 yards to the Chi5. Tackled by Tracy Porter.","(0:59) Andrew Luck pass to the middle to T.Y. Hilton for 21 yards to the Chi10. Tackled by Chris Prosinski.","(1:20) Josh Ferguson rush up the middle for 3 yards to the Chi31. Tackled by Mitch Unrein.","(1:31) Andrew Luck pass to the right to T.Y. Hilton for 20 yards to the Chi34. Tackled by Tracy Porter.","(1:36) Andrew Luck incomplete pass to the right intended for T.Y. Hilton defensed by Tracy Porter.","(2:00) Andrew Luck pass to the left to Josh Ferguson for 1 yard to the Ind46. Tackled by Bryce Callahan.","(2:00) Two Minute Warning.","(2:18) Penalty: False Start on Indianapolis (Ryan Kelly) -5 yards.","(2:50) Andrew Luck pass to the right to T.Y. Hilton for 31 yards to the Ind50. Tackled by Adrian Amos.","(3:14) Penalty: Illegal Use of Hands on Indianapolis (Joe Haeg) -10 yards.","(3:35) Frank Gore rush up the middle for 4 yards to the Ind29. Tackled by Akiem Hicks and Sam Acho.","(3:35) Connor Barth kicks off to the endzone. Touchback.","(3:35) Connor Barth extra point is good.","(3:43) Brian Hoyer pass to the right to Cameron Meredith for 14 yards for a TOUCHDOWN.","(3:49) Penalty: Holding on Chicago (Logan Paulsen) -10 yards.","(4:33) Jordan Howard rush to the right for no gain to the Ind4. Tackled by Mike Adams.","(4:53) Brian Hoyer pass to the right to Cameron Meredith for 11 yards to the Ind4. Tackled by Patrick Robinson. FUMBLE, recovered by Chi (Cameron Meredith).","(5:33) Jordan Howard rush to the left for 3 yards to the Ind15. Tackled by Josh McNary.","(6:08) Jordan Howard rush to the right for 57 yards to the Ind18. Tackled by Mike Adams.","(6:08) Pat McAfee kicks off to the endzone. Touchback.","(6:13) Adam Vinatieri 53 yard field goal attempt is GOOD. Holder: Pat McAfee.","(6:19) Andrew Luck incomplete pass to the right intended for Chester Rogers.","(6:59) Andrew Luck pass to the left to Josh Ferguson for 9 yards to the Chi35. Tackled by Chris Prosinski and Jerrell Freeman.","(7:04) Andrew Luck incomplete pass to the middle intended for Quan Bray defensed by Cre'von LeBlanc.","(7:36) Andrew Luck pass to the right to T.Y. Hilton for 22 yards to the Chi44. Tackled by Chris Prosinski.","(8:15) Andrew Luck rush up the middle for no gain to the Ind38. FUMBLE, recovered by Ind (Andrew Luck).","(8:22) Connor Barth kicks off to the Ind-1. Quan Bray return for 39 yards to Ind38. Tackled by Christian Jones and DeAndre Houston-Carson.","(8:27) Connor Barth 49 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(8:35) Brian Hoyer incomplete pass to the left.","(9:04) Penalty: Holding on Chicago (Kyle Long) -10 yards.","(9:58) Brian Hoyer pass to the left to Eddie Royal for 4 yards to the Ind21. Tackled by Darius Butler. FUMBLE, recovered by Chi (Josh Sitton).","(10:33) Jordan Howard rush to the right for 3 yards to the Ind25. Tackled by Kendall Langford.","(11:04) Brian Hoyer pass to the right to Cameron Meredith for 30 yards to the Ind28. Tackled by Antonio Morrison.","(11:41) Brian Hoyer pass to the right to Eddie Royal for 12 yards to the Chi42. Tackled by D'Qwell Jackson.","(12:22) Brian Hoyer pass to the right to Zach Miller for 7 yards to the Chi30. Tackled by Mike Adams.","(12:58) Jordan Howard rush to the left for a loss of 2 yards to the Chi23. Tackled by D'Qwell Jackson.","(12:58) Pat McAfee kicks off to the endzone. Touchback.","(12:58) Adam Vinatieri extra point is good.","(13:03) Andrew Luck pass to the right to Dwayne Allen for 1 yard for a TOUCHDOWN.","(13:48) Andrew Luck pass to the left to Chester Rogers for 1 yard to the Chi1. Tackled by Bryce Callahan.","(13:58) Andrew Luck incomplete pass to the right defensed by Harold Jones-Quartey.","(14:28) Andrew Luck pass to the right to Dwayne Allen for 3 yards to the Chi2. Tackled by Adrian Amos. FUMBLE, recovered by Ind.","(15:00) Andrew Luck pass to the right to Phillip Dorsett for 21 yards to the Chi5. Tackled by Cre'von LeBlanc.","(15:00) Penalty: False Start on Indianapolis (Dwayne Allen) -5 yards.","(0:09) Andrew Luck pass to the left to Frank Gore for 4 yards to the Chi21. Tackled by Jerrell Freeman.","(0:27) Penalty: False Start on Indianapolis (Andrew Luck) -5 yards.","(0:59) Andrew Luck pass to the right to Jack Doyle for 4 yards to the Chi20. Tackled by Jerrell Freeman.","(1:28) Frank Gore rush to the left for 16 yards to the Chi24. Tackled by Chris Prosinski and Bryce Callahan.","(2:06) Andrew Luck pass to the middle to Quan Bray for 22 yards to the Chi40. Tackled by Chris Prosinski.","(2:30) Frank Gore rush up the middle for 3 yards to the Ind38. Tackled by Mitch Unrein and Jerrell Freeman.","(3:08) Andrew Luck pass to the left to T.Y. Hilton for 8 yards to the Ind35. Tackled by Danny Trevathan.","(3:42) Quan Bray rush to the left for 7 yards to the Ind27. Tackled by Danny Trevathan and Mitch Unrein.","(3:50) Patrick O'Donnell punts for 46 yards to Ind20. No return.","(4:22) Brian Hoyer pass to the right to Eddie Royal for 9 yards to the Chi34.","(4:27) Brian Hoyer incomplete pass to the right intended for Cameron Meredith defensed by Akeem Ayers.","(5:02) Jordan Howard rush up the middle for no gain to the Chi25. Tackled by Hassan Ridgeway and Curt Maggitt.","(5:10) Pat McAfee kicks off to the Chi3. Deonte Thompson return for 22 yards to Chi25. Tackled by Jordan Todman.","(5:15) Adam Vinatieri 54 yard field goal attempt is GOOD. Holder: Pat McAfee.","(5:22) Andrew Luck incomplete pass to the left intended for Josh Ferguson.","(6:05) Andrew Luck sacked at Chi36 for a loss of 1 yard by Willie Young.","(6:10) Andrew Luck incomplete pass to the left intended for Frank Gore.","(6:37) Andrew Luck pass to the left to T.Y. Hilton for 15 yards to the Chi35. Tackled by Bryce Callahan.","(7:14) Frank Gore rush up the middle for 11 yards to the Ind50. Tackled by Chris Prosinski.","(7:20) Penalty: Too Many Men on Field on Chicago 5 yards.","(7:41) Andrew Luck pass to the right to Dwayne Allen for 3 yards to the Ind34. Tackled by Tracy Porter.","(8:18) Andrew Luck rush to the right for 12 yards to the Ind31. Tackled by Tracy Porter.","(8:24) Connor Barth kicks off to the Ind6. Quan Bray return for 13 yards to Ind19. Tackled by Harold Jones-Quartey and Joshua Bellamy.","(8:29) Connor Barth 35 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(8:34) Brian Hoyer incomplete pass to the left intended for Zach Miller.","(9:16) Brian Hoyer pass to the right to Eddie Royal for 1 yard to the Ind17. Tackled by Darius Butler.","(9:45) Cameron Meredith rush to the left for 6 yards to the Ind3. Tackled by Patrick Robinson. Penalty: Face Mask on Chicago (Jordan Howard) -15 yards.","(10:19) Ka'Deem Carey rush to the left for 2 yards to the Ind9. Tackled by D'Qwell Jackson.","(10:49) Brian Hoyer pass to the right to Ka'Deem Carey for 15 yards to the Ind11. Tackled by Clayton Geathers.","(11:30) Brian Hoyer pass to the left to Jordan Howard for 18 yards to the Ind26. Tackled by Clayton Geathers.","(11:59) Brian Hoyer pass to the left to Eddie Royal for 5 yards to the Ind44. Tackled by Darius Butler.","(12:32) Penalty: Holding on Chicago (Josh Sitton) -10 yards.","(12:49) Penalty: False Start on Chicago (Logan Paulsen) -5 yards.","(13:23) Jordan Howard rush up the middle for 11 yards to the Ind34. Tackled by Clayton Geathers.","(13:43) Brian Hoyer pass to the left to Zach Miller for 8 yards to the Ind45. Tackled by D'Qwell Jackson.","(14:19) Jordan Howard rush to the right for 7 yards to the Chi47. Tackled by David Parry.","(14:53) Brian Hoyer pass to the right to Alshon Jeffery for 8 yards to the Chi40. Tackled by Patrick Robinson and Clayton Geathers.","(15:00) Pat McAfee kicks off to the Chi0. Deonte Thompson return for 32 yards to Chi32. Tackled by Antonio Morrison."]