["(0:14) Kirk Cousins rush up the middle for a loss of 1 yard to the Was20.","(0:20) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(0:20) Baltimore Ravens timeout.","(0:27) Joe Flacco incomplete pass to the right intended for Kamar Aiken defensed by Kendall Fuller.","(0:33) Joe Flacco pass to the left to Breshad Perriman for 2 yards to the Was21.","(0:39) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(0:48) Joe Flacco pass to the right to Mike Wallace for 11 yards to the Was23.","(1:08) Joe Flacco pass to the right to Mike Wallace for 13 yards to the Was34. Tackled by Duke Ihenacho.","(1:12) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(1:12) Baltimore Ravens timeout.","(1:15) Joe Flacco pass to the middle to Dennis Pitta for 10 yards to the Was47. Tackled by Mason Foster.","(1:37) Joe Flacco pass to the left to Kyle Juszczyk for 6 yards to the Bal43. Tackled by Will Blackmon.","(1:55) Joe Flacco pass to the middle to Kyle Juszczyk for 6 yards to the Bal37. Tackled by Mason Foster.","(1:55) Two Minute Warning.","(2:02) Joe Flacco rush to the left for 6 yards to the Bal31. Tackled by Greg Toler.","(2:07) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(2:27) Joe Flacco pass to the middle to Kyle Juszczyk for 8 yards to the Bal25. Tackled by Terence Garvin.","(2:33) Joe Flacco incomplete pass to the right intended for Kyle Juszczyk.","(2:45) Tress Way punts for 47 yards to Bal28. Devin Hester - no return. Tackled by Deshazor Everett. Penalty: Illegal Block on Baltimore (Anthony Levine Sr.) -10 yards.","(2:50) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(2:50) Penalty: False Start on Washington (Jamison Crowder) -5 yards.","(2:50) Washington Redskins timeout.","(3:33) Kirk Cousins pass to the right to Jamison Crowder for 7 yards to the Was30. Tackled by Jerraud Powers.","(4:11) Kirk Cousins pass to the left to DeSean Jackson for 2 yards to the Was23. Tackled by Jimmy Smith.","(4:55) Matt Jones rush to the right for 4 yards to the Was21. Tackled by Albert McClellan.","(5:34) Kirk Cousins pass to the right to DeSean Jackson for 6 yards to the Was17. Tackled by Tavon Young.","(5:44) Sam Koch punts for 54 yards to Was17. Jamison Crowder return for 4 yards to Was21. Tackled by Kamar Aiken. Penalty: Illegal Block on Washington (Rob Kelley) -10 yards.","(5:48) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(6:24) Joe Flacco pass to the right to Crockett Gillmore for 9 yards to the Bal29. Tackled by Will Compton.","(6:59) Joe Flacco pass to the right to Crockett Gillmore for a loss of 3 yards to the Bal20. Tackled by Will Compton.","(7:34) Joe Flacco pass to the right to Crockett Gillmore for 15 yards to the Bal23. Tackled by Duke Ihenacho.","(7:46) Tress Way punts for 46 yards to Bal8. No return.","(7:56)  FUMBLE, recovered by Was (Kirk Cousins). Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(8:40) Kirk Cousins pass to the left to Chris Thompson for 10 yards to the Was46. Tackled by Brent Urban and Zachary Orr.","(9:18) Rob Kelley rush to the right for a loss of 1 yard to the Was36. Tackled by Zachary Orr.","(9:23) Sam Koch punts for 52 yards to Was37. No return.","(10:00) Joe Flacco pass to the left to Dennis Pitta for 6 yards to the Bal11. Tackled by Will Compton.","(10:07) Joe Flacco incomplete pass to the left intended for Crockett Gillmore.","(10:45) Joe Flacco pass to the left to Dennis Pitta for no gain to the Bal5. Tackled by Mason Foster.","(10:55) Tress Way punts for 34 yards to Bal5. No return.","(11:00) Kirk Cousins incomplete pass to the right intended for Jordan Reed.","(11:44) Matt Jones rush to the left for 1 yard to the Bal39. Tackled by Anthony Levine Sr..","(12:23) Kirk Cousins pass to the right to Rashad Ross for 8 yards to the Bal40. Tackled by Albert McClellan.","(12:58) Kirk Cousins pass to the left to DeSean Jackson for 27 yards to the Bal48. Tackled by Lardarius Webb.","(13:35) Matt Jones rush to the right for no gain to the Was25. Tackled by Michael Pierce and Terrell Suggs.","(13:35) Penalty: Encroachment on Baltimore (Michael Pierce) 5 yards.","(13:43) Sam Koch punts for 44 yards to Was0. Touchback.","(13:50) Joe Flacco incomplete pass to the right intended for Kamar Aiken defensed by Chris Baker.","(14:27) Terrance West rush to the right for 1 yard to the Was44. Tackled by Trent Murphy.","(15:00) Javorius Allen rush to the left for 3 yards to the Was45. Tackled by Greg Toler.","(0:14) Terrance West rush to the left for 27 yards to the Was48. Tackled by Quinton Dunbar.","(0:14) Dustin Hopkins kicks off to the endzone. Touchback.","(0:18) Dustin Hopkins 27 yard field goal attempt is GOOD. Holder: Tress Way.","(0:24) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(0:53) Kirk Cousins pass to the right to Jamison Crowder for 5 yards to the Bal8.","(1:39) Matt Jones rush to the right for 1 yard to the Bal13. Tackled by Timmy Jernigan and Brandon Williams.","(2:18) Kirk Cousins pass to the right to Pierre Garcon for 9 yards to the Bal14. Tackled by Jerraud Powers.","(3:01) Rob Kelley rush to the left for 3 yards to the Bal23. Tackled by Timmy Jernigan.","(3:41) Matt Jones rush to the right for 3 yards to the Bal26. Tackled by Eric Weddle.","(4:23) Kirk Cousins pass to the left to Matt Jones for 13 yards to the Bal29. Tackled by Lardarius Webb.","(4:54) Kirk Cousins pass to the left to Pierre Garcon for 10 yards to the Bal42.","(5:36) Rob Kelley rush to the left for 16 yards to the Was48. Tackled by Eric Weddle and Albert McClellan.","(6:09) Matt Jones rush to the right for 12 yards to the Was32. Tackled by Lardarius Webb and Eric Weddle.","(6:09) Baltimore Ravens timeout.","(6:20) Kirk Cousins pass intended for Jordan Reed INTERCEPTED by C.J. Mosley and returned for 12 yards. Tackled by Ty Nsekhe. FUMBLE, recovered by Was. Touchback.","(6:58) Matt Jones rush to the left for 2 yards to the Was3. Tackled by Brent Urban.","(7:09) Sam Koch punts for 68 yards to Was1. No return.","(7:47) Joe Flacco pass to the left to Mike Wallace for 10 yards to the Bal31. Tackled by Quinton Dunbar.","(7:51) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(8:28) Joe Flacco pass to the left to Terrance West for a loss of 4 yards to the Bal21. Tackled by Mason Foster.","(8:28) Dustin Hopkins kicks off to the endzone. Touchback.","(8:28) Dustin Hopkins extra point is good.","(8:35) Kirk Cousins pass to the left to Pierre Garcon for 21 yards for a TOUCHDOWN.","(9:13) Kirk Cousins pass to the middle to Vernon Davis for 6 yards to the Bal21. Tackled by Albert McClellan.","(10:01) Kirk Cousins pass to the middle to Jamison Crowder for 23 yards to the Bal27. Tackled by Eric Weddle and C.J. Mosley.","(10:09) Sam Koch punts for 36 yards to Bal50. No return.","(10:51) Joe Flacco sacked at Bal14 for a loss of 8 yards by Terence Garvin and Trent Murphy.","(11:31) Terrance West rush to the left for 2 yards to the Bal22. Tackled by Will Compton.","(12:07) Penalty: Illegal Formation on Baltimore -5 yards.","(12:37) Terrance West rush to the left for 5 yards to the Bal25. Tackled by Will Compton and Duke Ihenacho.","(12:45) Tress Way punts for 61 yards to Bal0. Touchback.","(13:19) Kirk Cousins pass to the right to Jordan Reed for 5 yards to the Was39. Tackled by Tavon Young.","(13:25) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(13:57) Kirk Cousins pass to the left to Jordan Reed for 6 yards to the Was34. Tackled by C.J. Mosley.","(14:16) Penalty: Illegal Shift on Washington -5 yards.","(14:22) Penalty: Illegal Contact on Baltimore (Jimmy Smith) 5 yards.","(15:00) Chris Thompson rush to the right for 3 yards to the Was28. Tackled by C.J. Mosley and Eric Weddle.","(15:00) Justin Tucker kicks off to the endzone. Touchback.","(0:01) Joe Flacco sacked at Bal40 for a loss of 6 yards by Ryan Kerrigan.","(0:01) Baltimore Ravens timeout.","(0:06) 56 yard field goal attempt by Dustin Hopkins is NO GOOD. Holder: Tress Way.","(0:06) Washington Redskins timeout.","(0:12) Kirk Cousins pass to the right to Jordan Reed for 4 yards to the Bal38. Tackled by Lardarius Webb.","(0:19) Kirk Cousins pass to the middle to Chris Thompson for 8 yards to the Bal42. Tackled by Tavon Young.","(0:20) Kirk Cousins incomplete pass to the middle.","(0:34) Kirk Cousins pass to the middle to Chris Thompson for 8 yards to the Was50. Tackled by Jerraud Powers.","(0:34) Washington Redskins timeout.","(0:40) Kirk Cousins pass to the middle to Chris Thompson for 7 yards to the Was42. Tackled by C.J. Mosley.","(0:44) Kirk Cousins pass to the right to Jordan Reed for 6 yards to the Was35.","(0:53) Sam Koch punts for 42 yards to Was29. No return.","(0:58) Joe Flacco incomplete pass to the right intended for Kamar Aiken.","(1:02) Joe Flacco incomplete pass to the middle intended for Kyle Juszczyk.","(1:21) Joe Flacco pass to the left to Dennis Pitta for 9 yards to the Bal29. Tackled by Will Compton.","(1:28) Matt Jones rush up the middle for no gain to the Bal20. Tackled by Michael Pierce.","(1:32) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(2:00) Kirk Cousins pass to the left to Jordan Reed for 6 yards to the Bal20. Tackled by Lardarius Webb.","(2:00) Two Minute Warning.","(2:26) Matt Jones rush to the left for 3 yards to the Bal26. Tackled by Jerraud Powers.","(3:02) Kirk Cousins pass to the right to Jordan Reed for 9 yards to the Bal29. Tackled by C.J. Mosley.","(3:08) Kirk Cousins incomplete pass to the right.","(3:08) Penalty: Offside on Baltimore (Timmy Jernigan) 5 yards.","(3:15) Penalty: Roughing Passer on Baltimore (Lawrence Guy) 15 yards.","(3:40) Kirk Cousins pass to the right to Jordan Reed for 16 yards to the Was42. Tackled by Albert McClellan.","(4:07) Kirk Cousins pass to the right to Vernon Davis for 3 yards to the Was26. Tackled by Lardarius Webb.","(4:28) Kirk Cousins pass to the middle to Vernon Davis for 6 yards to the Was23. Tackled by Terrell Suggs.","(4:34) Justin Tucker incomplete pass to the right intended for Crockett Gillmore defensed by Duke Ihenacho.","(5:11) Terrance West rush to the right for a loss of 3 yards to the Was17. Tackled by Duke Ihenacho.","(5:11) Baltimore Ravens timeout.","(5:54) Joe Flacco pass to the left to Terrance West for a loss of 2 yards to the Was14. Tackled by Preston Smith.","(6:31) Joe Flacco pass to the right to Mike Wallace for 3 yards to the Was12. Tackled by Mason Foster.","(6:38) Matt Jones rush up the middle for a loss of 2 yards to the Was15. Tackled by Zachary Orr. FUMBLE, recovered by Bal (Zachary Orr). Tackled by Matt Jones.","(7:07) Kirk Cousins pass to the left to Pierre Garcon for 10 yards to the Was17. Tackled by Jimmy Smith.","(7:48) Kirk Cousins pass to the right to Jordan Reed for 1 yard to the Was7. Tackled by Zachary Orr.","(7:56) Sam Koch punts for 40 yards to Was6. No return.","(8:31) Joe Flacco pass to the left to Dennis Pitta for 12 yards to the Was46. Tackled by Kendall Fuller.","(9:12) Joe Flacco sacked at Bal42 for a loss of 8 yards by Ziggy Hood.","(9:19) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(9:46) Joe Flacco pass to the right to Dennis Pitta for 14 yards to the Bal50. Tackled by Mason Foster.","(10:22) Terrance West rush to the right for 3 yards to the Bal36. Tackled by Ziggy Hood and Matt Ioannidis.","(10:54) Joe Flacco pass to the right to Mike Wallace for 13 yards to the Bal33. Tackled by Greg Toler.","(11:03) Tress Way punts for 40 yards to Bal0. Touchback.","(11:43) Kirk Cousins sacked at Bal40 for a loss of 10 yards by Terrell Suggs.","(12:25) Matt Jones rush to the right for a loss of 1 yard to the Bal30. Tackled by Timmy Jernigan.","(13:01) Matt Jones rush to the left for 2 yards to the Bal29. Tackled by Michael Pierce.","(13:20) Penalty: Offside on Baltimore (Terrell Suggs) 5 yards.","(13:54) Matt Jones rush to the right for 3 yards to the Bal36. Tackled by C.J. Mosley.","(13:59) Kirk Cousins incomplete pass to the right intended for Vernon Davis.","(13:59) Washington Redskins timeout.","(14:42) Chris Thompson rush to the right for 9 yards to the Bal39. Tackled by Lardarius Webb.","(14:46) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(14:56) Justin Tucker kicks off to the Was7. Will Blackmon return for 45 yards to Bal48. Tackled by Kendrick Lewis.","(15:00) Justin Tucker 31 yard field goal attempt is GOOD. Holder: Sam Koch.","(15:00) Penalty: Delay of Game on Baltimore (Joe Flacco) -5 yards.","(0:21) Joe Flacco pass to the right to Breshad Perriman for 9 yards to the Was8. Tackled by Josh Norman.","(0:32) Joe Flacco incomplete pass to the left intended for Terrance West.","(1:06) Kenneth Dixon rush to the right for a loss of 1 yard to the Was17. Tackled by Will Compton.","(1:42) Terrance West rush up the middle for 9 yards to the Was16. Tackled by Duke Ihenacho.","(2:14) Javorius Allen rush to the left for 6 yards to the Was25. Tackled by Duke Ihenacho.","(2:19) Penalty: Pass Interference on Washington (Will Compton) 26 yards.","(2:23) Joe Flacco incomplete pass to the right intended for Dennis Pitta.","(2:28) Joe Flacco incomplete pass to the right intended for Crockett Gillmore.","(2:52) Joe Flacco pass to the left to Steve Smith Sr. for 7 yards to the Bal43. Tackled by Greg Toler.","(3:32) Terrance West rush to the right for no gain to the Bal36. Tackled by Matt Ioannidis.","(4:09) Joe Flacco pass to the middle to Dennis Pitta for 8 yards to the Bal36. Tackled by Will Compton.","(4:47) Terrance West rush up the middle for 12 yards to the Bal28. Tackled by Duke Ihenacho.","(4:52) Dustin Hopkins kicks off to the Bal-3. Devin Hester return for 19 yards to Bal16. Tackled by Houston Bates.","(4:52) Dustin Hopkins extra point is NO GOOD.","(5:11) Sam Koch punts for 45 yards to Was15. Jamison Crowder return for 85 yards for a TOUCHDOWN.","(5:47) Joe Flacco pass to the left to Steve Smith Sr. for 7 yards to the Bal40. Tackled by Kendall Fuller.","(6:27) Kenneth Dixon rush to the right for a loss of 1 yard to the Bal33. Tackled by Trent Murphy.","(7:10) Joe Flacco pass to the left to Javorius Allen for no gain to the Bal34. Tackled by Mason Foster.","(7:31) Penalty: Holding on Baltimore (Mike Wallace) -10 yards.","(8:16) Joe Flacco pass to the left to Steve Smith Sr. for 15 yards to the Bal44. Tackled by Quinton Dunbar.","(8:25) Tress Way punts for 25 yards to Bal29. No return.","(8:31) Kirk Cousins incomplete pass to the right intended for Jordan Reed.","(9:01) Kirk Cousins pass to the left to Pierre Garcon for 6 yards to the Was46. Tackled by Jimmy Smith.","(9:37) Matt Jones rush to the right for 3 yards to the Was40. Tackled by Lawrence Guy and Timmy Jernigan.","(10:13) Kirk Cousins pass to the middle to Matt Jones for 12 yards to the Was37. Tackled by Zachary Orr.","(10:13) Justin Tucker kicks off to the endzone. Touchback.","(10:13) Justin Tucker extra point is good.","(10:19) Joe Flacco pass to the right to Crockett Gillmore for 7 yards for a TOUCHDOWN.","(10:55) Joe Flacco pass to the left to Mike Wallace for 6 yards to the Was7. Tackled by Quinton Dunbar.","(11:37) Joe Flacco pass to the left to Kenneth Dixon for 6 yards to the Was13. Tackled by Kendall Fuller.","(12:14) Kenneth Dixon rush to the right for 1 yard to the Was19. Tackled by Ricky Jean Francois.","(12:48) Terrance West rush to the left for 35 yards to the Was20. Tackled by Will Blackmon.","(13:18) Javorius Allen rush to the left for 2 yards to the Bal45. Tackled by Duke Ihenacho.","(13:48) Javorius Allen rush to the left for 7 yards to the Bal43. Tackled by Quinton Dunbar.","(14:24) Joe Flacco pass to the right to Mike Wallace for 7 yards to the Bal36. Tackled by Will Compton.","(15:00) Terrance West rush to the right for 4 yards to the Bal29. Tackled by Duke Ihenacho.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback."]