["(0:14) Tyrod Taylor rush up the middle for a loss of 1 yard to the LA19.","(1:02) LeSean McCoy rush to the left for a loss of 3 yards to the LA18. Tackled by Matt Longacre.","(1:48) LeSean McCoy rush to the right for a loss of 1 yard to the LA15. Tackled by Aaron Donald.","(2:00) Case Keenum pass intended for Tavon Austin INTERCEPTED by Nickell Robey-Coleman and returned for 3 yards. Tackled by Tavon Austin.","(2:00) Two Minute Warning.","(2:17) Case Keenum sacked at LA16 for a loss of 8 yards by Lorenzo Alexander.","(2:24) Case Keenum incomplete pass to the left intended for Kenny Britt.","(2:30) Case Keenum incomplete pass to the right intended for Tyler Higbee.","(2:37) Dan Carpenter kicks off to the LA3. Mike Thomas return for 21 yards to LA24. Tackled by Ramon Humber.","(2:37) Dan Carpenter extra point is good.","(2:43) Tyrod Taylor pass to the left to Marquise Goodwin for 6 yards for a TOUCHDOWN.","(2:48) Penalty: Illegal Formation on Buffalo (Cordy Glenn) -5 yards.","(2:48) Los Angeles Rams timeout.","(2:55) LeSean McCoy rush up the middle for no gain to the LA1. Tackled by Dominique Easley.","(3:41) LeSean McCoy rush to the left for 24 yards to the LA1. Tackled by Dominique Easley.","(3:47) Bradley Marquez rush to the right for 2 yards to the LA25. Tackled by Ronald Darby.","(3:54) Case Keenum incomplete pass to the left intended for Lance Kendricks defensed by Lorenzo Alexander.","(4:30) Todd Gurley rush up the middle for 2 yards to the LA23. Tackled by Kyle Williams.","(4:35) Case Keenum pass to the left to Todd Gurley for 3 yards to the LA21. Tackled by Lorenzo Alexander.","(4:42) Colton Schmidt punts for 50 yards to LA18. No return.","(4:47) Tyrod Taylor incomplete pass to the right intended for Walt Powell defensed by E.J. Gaines.","(5:10) Tyrod Taylor rush to the right for 3 yards to the Buf32. Tackled by Ethan Westbrooks.","(5:51) LeSean McCoy rush to the right for 4 yards to the Buf29. Tackled by Mark Barron.","(5:51) Greg Zuerlein kicks off to the endzone. Touchback.","(5:55) Greg Zuerlein 22 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(6:34) Case Keenum pass to the left to Todd Gurley for 9 yards to the Buf4. Tackled by Stephon Gilmore and Robert Blanton.","(6:41) Case Keenum incomplete pass to the right intended for Tavon Austin defensed by Adolphus Washington.","(7:06) Todd Gurley rush to the left for a loss of 5 yards to the Buf13. Tackled by Lorenzo Alexander.","(7:50) Todd Gurley rush up the middle for 2 yards to the Buf8. Tackled by Corbin Bryant.","(8:17) Tavon Austin rush to the left for 9 yards to the Buf10. Tackled by Corey Graham.","(8:58) Case Keenum pass to the right to Kenny Britt for 10 yards to the Buf19. Tackled by Robert Blanton.","(9:36) Todd Gurley rush to the right for 1 yard to the Buf29. Tackled by Zach Brown and Preston Brown.","(9:47) Penalty: Holding on Buffalo (Stephon Gilmore) 5 yards.","(10:27) Case Keenum pass to the right to Malcolm Brown for 26 yards to the Buf35. Tackled by Preston Brown.","(10:46) Penalty: Delay of Game on Los Angeles (Case Keenum) -5 yards.","(11:41) Case Keenum pass to the right to Brian Quick for 31 yards to the LA44. Tackled by Zach Brown.","(11:59) Penalty: Delay of Game on Los Angeles (Case Keenum) -5 yards.","(12:47) Todd Gurley rush to the left for 2 yards to the LA18. Tackled by Jerry Hughes. FUMBLE, recovered by LA (Todd Gurley).","(13:31) Todd Gurley rush to the left for 1 yard to the LA16. Tackled by Zach Brown.","(14:07) Case Keenum pass to the left to Brian Quick for 8 yards to the LA15. Tackled by Stephon Gilmore.","(14:17) Colton Schmidt punts for 32 yards to LA7. No return.","(14:27) Tyrod Taylor incomplete pass to the right.","(15:00) Mike Gillislee rush up the middle for 1 yard to the LA39. Tackled by Mark Barron.","(0:46) Tyrod Taylor pass to the left to LeSean McCoy for 3 yards to the LA40. Tackled by Dominique Easley and Mark Barron.","(1:24) LeSean McCoy rush to the right for 13 yards to the LA43. Tackled by Mark Barron.","(1:48) Tyrod Taylor pass to the right to Marquise Goodwin for 7 yards to the Buf44. Tackled by T.J. McDonald.","(1:58) Johnny Hekker punts for 52 yards to Buf37. Brandon Tate - no return. Tackled by Troy Hill.","(2:36) Case Keenum sacked at LA11 for a loss of 11 yards by Lorenzo Alexander.","(3:10) Case Keenum pass to the left to Tavon Austin for 4 yards to the LA22. Tackled by Stephon Gilmore.","(3:48) Todd Gurley rush to the left for 2 yards to the LA18. Tackled by Jerel Worthy.","(3:54) Dan Carpenter kicks off to the LA-3. Mike Thomas return for 19 yards to LA16. Tackled by Lorenzo Alexander.","(3:54) Dan Carpenter extra point is good.","(4:05) Case Keenum pass intended for Pharoh Cooper INTERCEPTED by Nickell Robey-Coleman and returned for 41 yards for a TOUCHDOWN.","(4:47) Todd Gurley rush up the middle for a loss of 4 yards to the LA31. Tackled by Jerel Worthy.","(5:23) Case Keenum pass to the left to Lance Kendricks for 21 yards to the LA35. Tackled by Jerry Hughes and Aaron Williams.","(5:32) Colton Schmidt punts for 39 yards to LA17. Tavon Austin return for a loss of 3 yards to LA14. Tackled by Colt Anderson.","(5:38) Tyrod Taylor incomplete pass to the left intended for Robert Woods.","(5:38) Buffalo Bills timeout.","(5:47) Tyrod Taylor incomplete pass to the right.","(6:22) LeSean McCoy rush up the middle for 3 yards to the Buf44. Tackled by E.J. Gaines.","(6:37) Penalty: Running into Kicker on Los Angeles (Josh Forrest) 15 yards.","(6:42) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(7:28) Reggie Bush rush to the right for 3 yards to the Buf26. Tackled by Mark Barron.","(7:58) LeSean McCoy rush to the left for 1 yard to the Buf23. Tackled by Alec Ogletree and Josh Forrest.","(8:05) Greg Zuerlein kicks off to the Buf0. Brandon Tate return for 22 yards to Buf22. Tackled by Cory Littleton.","(8:11) Greg Zuerlein 54 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(8:51) Case Keenum sacked at Buf36 for no gain by Lorenzo Alexander.","(9:34) Case Keenum pass to the right to Kenny Britt for 5 yards to the Buf36. Tackled by Ronald Darby.","(10:15) Malcolm Brown rush to the right for 2 yards to the Buf41. Tackled by Adolphus Washington.","(10:48) Todd Gurley rush to the left for 4 yards to the Buf43. Tackled by Preston Brown.","(11:27) Case Keenum pass to the left to Lance Kendricks for 3 yards to the Buf47. Tackled by Preston Brown.","(12:07) Todd Gurley rush to the right for 4 yards to the LA50. Tackled by Preston Brown.","(12:44) Todd Gurley rush up the middle for 16 yards to the LA46. Tackled by Lorenzo Alexander.","(13:18) Case Keenum pass to the right to Kenny Britt for 14 yards to the LA30. Tackled by Aaron Williams.","(13:29) Colton Schmidt punts for 58 yards to LA16. No return.","(13:37) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(14:17) Tyrod Taylor pass to the right to Charles Clay for 6 yards to the Buf26. Tackled by Alec Ogletree and Lamarcus Joyner.","(14:53) LeSean McCoy rush to the left for a loss of 2 yards to the Buf20. Tackled by Eugene Sims.","(15:00) Greg Zuerlein kicks off to the Buf3. Brandon Tate return for 19 yards to Buf22. Tackled by Marqui Christian.","(0:03) Dan Carpenter 23 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(0:03) Buffalo Bills timeout.","(0:09) Tyrod Taylor pass to the left to Charles Clay for 14 yards to the LA5. Tackled by E.J. Gaines.","(0:16) Tyrod Taylor rush to the left for 4 yards to the LA19. Tackled by Alec Ogletree.","(0:24) LeSean McCoy rush up the middle for 17 yards to the LA23. Tackled by T.J. McDonald.","(0:24) Buffalo Bills timeout.","(0:30) Tyrod Taylor sacked at LA40 for a loss of 5 yards by Ethan Westbrooks.","(0:57) Tyrod Taylor pass to the left to Robert Woods for 17 yards to the LA35. Tackled by Maurice Alexander.","(1:01) Tyrod Taylor incomplete pass to the left intended for Robert Woods.","(1:01) Buffalo Bills timeout.","(1:09) LeSean McCoy rush to the right for 9 yards to the Buf48. Tackled by Lamarcus Joyner.","(1:33) Tyrod Taylor pass to the right to Robert Woods for 9 yards to the Buf39. Tackled by Trumaine Johnson.","(1:56) Tyrod Taylor pass to the right to LeSean McCoy for 5 yards to the Buf30. Tackled by Mark Barron.","(1:56) Greg Zuerlein kicks off to the endzone. Touchback.","(1:56) Greg Zuerlein extra point is good.","(2:00) Todd Gurley rush to the right for 1 yard for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:37) Tavon Austin rush to the right for 9 yards to the Buf1. Tackled by Ronald Darby.","(2:48) Penalty: Too Many Men on Field on Buffalo 5 yards.","(3:27) Case Keenum pass to the left to Brian Quick for 12 yards to the Buf15. Tackled by Stephon Gilmore.","(4:04) Case Keenum pass to the right to Tavon Austin for 5 yards to the Buf27. Tackled by Ronald Darby.","(4:41) Malcolm Brown rush to the left for no gain to the Buf32. Tackled by Leger Douzable.","(5:22) Case Keenum pass to the right to Kenny Britt for 18 yards to the Buf32. Tackled by Ronald Darby.","(6:02) Todd Gurley rush to the right for 2 yards to the LA50. Tackled by Kyle Williams and Zach Brown.","(6:35) Todd Gurley rush to the left for 12 yards to the LA48. Tackled by Kyle Williams.","(6:49) Colton Schmidt punts for 52 yards to LA31. Tavon Austin return for 5 yards to LA36. Tackled by Colt Anderson.","(6:57) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin defensed by Alec Ogletree.","(7:02) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin defensed by Trumaine Johnson.","(7:38) LeSean McCoy rush to the right for 2 yards to the Buf17. Tackled by Lamarcus Joyner and Dominique Easley.","(7:38) Penalty: Encroachment on Los Angeles (Cam Thomas) 5 yards.","(7:46) Greg Zuerlein kicks off to the Buf-2. Brandon Tate return for 22 yards to Buf20. Tackled by Bradley Marquez. Penalty: Illegal Block on Buffalo (Corbin Bryant) -10 yards.","(7:49) Greg Zuerlein 32 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(8:34) Case Keenum pass to the right to Tavon Austin for 1 yard to the Buf13. Tackled by Nickell Robey-Coleman and Preston Brown.","(9:19) Todd Gurley rush to the left for 5 yards to the Buf14. Tackled by Preston Brown.","(9:26) Case Keenum incomplete pass to the right intended for Todd Gurley.","(9:53) Penalty: Face Mask on Buffalo (Corbin Bryant) 15 yards.","(10:19) Case Keenum pass to the left to Tavon Austin for 31 yards to the Buf34.","(10:26) Colton Schmidt punts for 45 yards to LA35. No return.","(11:12) Tyrod Taylor pass to the middle to Charles Clay for 12 yards to the Buf20. Tackled by Lamarcus Joyner.","(11:39) LeSean McCoy rush to the left for 4 yards to the Buf8. Tackled by Mark Barron.","(12:15) Tyrod Taylor sacked at Buf4 for a loss of 7 yards by Aaron Donald and Dominique Easley.","(12:25) Johnny Hekker punts for 57 yards to Buf13. Brandon Tate return for a loss of 2 yards to Buf11. Tackled by Mike Thomas.","(12:33) Case Keenum incomplete pass to the right intended for Brian Quick.","(13:15) Todd Gurley rush to the left for 2 yards to the LA30. Tackled by Zach Brown.","(13:52) Todd Gurley rush up the middle for 7 yards to the LA28. Tackled by Adolphus Washington.","(13:59) Dan Carpenter kicks off to the LA-2. Pharoh Cooper return for 23 yards to LA21. Tackled by Robert Blanton.","(13:59) Dan Carpenter extra point is BLOCKED.","(14:05) Mike Gillislee rush to the right for 5 yards for a TOUCHDOWN.","(14:52) LeSean McCoy rush up the middle for 53 yards to the LA5. Tackled by E.J. Gaines.","(15:00) Penalty: Offside on Los Angeles (Matt Longacre) 5 yards.","(0:10) Todd Gurley rush up the middle for 1 yard to the Buf38. Tackled by Lerentee McCray. FUMBLE, recovered by Buf (Corey Graham). Tackled by Lance Kendricks.","(0:52) Case Keenum sacked at Buf39 for a loss of 9 yards by Adolphus Washington.","(1:38) Case Keenum pass to the right to Kenny Britt for 28 yards to the Buf30. Tackled by Corey Graham.","(2:14) Todd Gurley rush to the left for 2 yards to the LA42. Tackled by Preston Brown and Zach Brown.","(2:22) Penalty: Roughing Passer on Buffalo (Adolphus Washington) 15 yards.","(2:22) Dan Carpenter kicks off to the endzone. Touchback.","(2:22) Dan Carpenter extra point is good.","(2:32) Tyrod Taylor pass to the left to Justin Hunter for 4 yards for a TOUCHDOWN.","(3:09) LeSean McCoy rush to the left for no gain to the LA4. Tackled by Alec Ogletree.","(3:21) Tyrod Taylor incomplete pass to the left intended for Robert Woods.","(4:11) Tyrod Taylor pass to the left to Charles Clay for 29 yards to the LA4. Tackled by T.J. McDonald.","(4:18) Tyrod Taylor incomplete pass to the right intended for Robert Woods defensed by Ethan Westbrooks.","(4:49) Jerome Felton rush to the right for 6 yards to the LA33. Tackled by T.J. McDonald.","(5:25) Tyrod Taylor pass to the middle to Charles Clay for 12 yards to the LA39. Tackled by Mark Barron.","(5:58) LeSean McCoy rush to the left for 2 yards to the Buf49. Tackled by Mark Barron.","(6:27) Penalty: Illegal Shift on Buffalo -5 yards.","(7:16) Tyrod Taylor rush up the middle for 22 yards to the LA48. Tackled by Trumaine Johnson.","(8:02) LeSean McCoy rush to the left for 9 yards to the Buf30. Tackled by Alec Ogletree.","(8:48) Tyrod Taylor rush up the middle for no gain to the Buf39. FUMBLE, recovered by Buf (Tyrod Taylor) and advanced for a loss of 3 yards.","(9:24) LeSean McCoy rush to the left for 15 yards to the Buf39. Tackled by T.J. McDonald.","(9:31) Greg Zuerlein kicks off to the Buf-3. Brandon Tate return for 27 yards to Buf24. Tackled by Josh Forrest.","(9:36) Greg Zuerlein 37 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(9:43) Case Keenum incomplete pass to the left intended for Tavon Austin.","(9:43) Penalty: False Start on Los Angeles (Rodger Saffold) -5 yards.","(9:48) Case Keenum incomplete pass to the middle intended for Todd Gurley.","(10:27) Todd Gurley rush to the left for 2 yards to the Buf14. Tackled by Zach Brown.","(11:01) Todd Gurley rush up the middle for 3 yards to the Buf16. Tackled by Kyle Williams.","(11:39) Tavon Austin rush up the middle for 8 yards to the Buf19. Tackled by Jerry Hughes and Robert Blanton.","(12:05) Todd Gurley rush up the middle for 6 yards to the Buf27. Tackled by Robert Blanton.","(12:32) Case Keenum pass to the left to Tavon Austin for 4 yards to the Buf33. Tackled by Jerry Hughes.","(13:02) Case Keenum pass to the right to Tavon Austin for 10 yards to the Buf37.","(13:45) Case Keenum pass to the left to Todd Gurley for 24 yards to the Buf47. Tackled by Zach Brown.","(14:20) Todd Gurley rush up the middle for 4 yards to the LA29. Tackled by Zach Brown.","(14:55) Case Keenum pass to the right to Tavon Austin for 4 yards to the LA25. Tackled by Ronald Darby.","(15:00) Dan Carpenter kicks off to the LA-1. Mike Thomas return for 22 yards to LA21. Tackled by Robert Blanton."]