["(0:05) Jay Cutler pass to the right to Eddie Royal for 24 yards to the TB26.","(0:06) Chicago Bears timeout.","(0:14) Jeremy Langford rush to the right for 3 yards to the Chi50. Tackled by John Hughes III.","(0:27) Penalty: Holding on Chicago (Josh Sitton) -10 yards.","(0:27) Chicago Bears timeout.","(0:35) Jay Cutler pass to the right to Zach Miller for 11 yards to the TB43. Tackled by Adarius Glanton.","(0:40) Jay Cutler incomplete pass to the middle intended for Zach Miller.","(1:16) Jay Cutler pass to the right to Jeremy Langford for 5 yards to the Chi46. Tackled by Alterraun Verner.","(1:26) Jay Cutler pass to the middle to Zach Miller for 5 yards to the Chi26. Tackled by Cameron Lynch and Adarius Glanton. Penalty: Unnecessary Roughness on Tampa Bay (DaVonte Lambert) 15 yards.","(1:59) Jay Cutler rush up the middle for 7 yards to the Chi21. Tackled by Adarius Glanton.","(1:59) Two Minute Warning.","(2:06) Jay Cutler pass to the middle to Zach Miller for 12 yards to the Chi29. Tackled by Kwon Alexander. Penalty: Unnecessary Roughness on Chicago (Ted Larsen) -15 yards.","(2:36) Jay Cutler pass to the right to Jeremy Langford for a loss of 1 yard to the Chi17. Tackled by Lavonte David.","(2:46) Bryan Anger punts for 44 yards to Chi33. Eddie Royal - no return. Tackled by Noah Spence. Penalty: Holding on Chicago (Patrick Scales) -15 yards.","(2:46) Chicago Bears timeout.","(2:54) Peyton Barber rush to the right for 7 yards to the TB23. Tackled by Jerrell Freeman.","(3:39) Peyton Barber rush up the middle for a loss of 2 yards to the TB16. Tackled by Chris Prosinski and Cornelius Washington.","(4:31) Peyton Barber rush up the middle for 3 yards to the TB18. Tackled by Jonathan Bullard.","(4:39) Patrick O'Donnell punts for 53 yards to TB15. No return.","(4:44) Jay Cutler incomplete pass to the right intended for Zach Miller.","(5:22) Ka'Deem Carey rush to the left for a loss of 2 yards to the Chi32. Tackled by Robert Ayers Jr..","(5:55) Jordan Howard rush to the right for 9 yards to the Chi34. Tackled by Bradley McDougald.","(5:55) Roberto Aguayo kicks off to the endzone. Touchback.","(5:55) Roberto Aguayo extra point is good.","(6:00) Doug Martin rush to the left for 1 yard for a TOUCHDOWN.","(6:42) Doug Martin rush up the middle for 3 yards to the Chi1. Tackled by Chris Prosinski.","(7:26) Doug Martin rush up the middle for a loss of 3 yards to the Chi4. Tackled by Jerrell Freeman.","(7:30) Penalty: Pass Interference on Chicago (Harold Jones-Quartey) 4 yards.","(7:30) Tampa Bay Buccaneers timeout.","(7:36) Jameis Winston incomplete pass to the right intended for Cecil Shorts III.","(8:14) Peyton Barber rush to the left for 3 yards to the Chi5. Tackled by Jerrell Freeman.","(8:58) Jameis Winston pass to the middle to Mike Evans for 12 yards to the Chi8. Tackled by Adrian Amos.","(9:38) Peyton Barber rush to the left for no gain to the Chi20. Tackled by Jerrell Freeman.","(9:38) Tampa Bay Buccaneers timeout.","(10:18) Peyton Barber rush to the left for 7 yards to the Chi20. Tackled by Cre'von LeBlanc.","(10:59) Peyton Barber rush to the right for 4 yards to the Chi27. Tackled by Eddie Goldman and Danny Trevathan.","(11:40) Peyton Barber rush to the left for 6 yards to the Chi31. Tackled by Cornelius Washington and Willie Young.","(11:49) Penalty: Illegal Contact on Chicago (Jerrell Freeman) 5 yards.","(11:49) Tampa Bay Buccaneers timeout.","(12:33) Jameis Winston sacked at Chi42 for a loss of 4 yards by Willie Young and Leonard Floyd.","(13:09) Peyton Barber rush up the middle for 3 yards to the Chi38. Tackled by Danny Trevathan and Akiem Hicks.","(13:37) Jameis Winston pass to the left to Adam Humphries for 10 yards to the Chi41. Tackled by Danny Trevathan.","(13:42) Jameis Winston incomplete pass intended for Mike Evans defensed by Danny Trevathan.","(14:23) Peyton Barber rush to the right for no gain to the TB49. Tackled by Eddie Goldman.","(15:00) Jameis Winston pass to the left to Mike Evans for 8 yards to the TB49. Tackled by Tracy Porter.","(0:46) Peyton Barber rush to the left for 3 yards to the TB41. Tackled by Danny Trevathan.","(0:51) Patrick O'Donnell kicks off to the TB29. Adam Humphries return for 9 yards to TB38. Tackled by Christian Jones.","(0:58) Jay Cutler sacked at Chi0 for a loss of 3 yards by Robert Ayers Jr.. FUMBLE, recovered by Chi. Safety.","(1:06) Jay Cutler incomplete pass to the left intended for Alshon Jeffery.","(1:46) Ka'Deem Carey rush to the left for 1 yard to the Chi3. Tackled by William Gholston.","(1:59) Bryan Anger punts for 54 yards to Chi5. Eddie Royal return for a loss of 3 yards to Chi2. Tackled by Josh Robinson.","(2:39) Mike James rush up the middle for 8 yards to the TB41. Tackled by Danny Trevathan.","(3:21) Jameis Winston sacked at TB33 for a loss of 6 yards by Eddie Goldman.","(3:56) Doug Martin rush to the left for 4 yards to the TB39. Tackled by Jerrell Freeman.","(3:56) Penalty: False Start on Tampa Bay -5 yards.","(4:04) Patrick O'Donnell punts for 43 yards to TB40. No return.","(4:48) Jay Cutler pass to the right to Jeremy Langford for 2 yards to the Chi17. Tackled by Brent Grimes.","(4:53) Jay Cutler incomplete pass to the left intended for Jeremy Langford.","(5:14) Penalty: Holding on Chicago (Alshon Jeffery) -10 yards.","(5:19) Jay Cutler incomplete pass to the right intended for Cameron Meredith defensed by Brent Grimes.","(5:19) Roberto Aguayo kicks off to the endzone. Touchback.","(5:23) Roberto Aguayo 27 yard field goal attempt is GOOD. Holder: Bryan Anger.","(6:09) Jameis Winston pass to the middle to Doug Martin for 13 yards to the Chi9. Tackled by Danny Trevathan and Chris Prosinski.","(6:49) Doug Martin rush to the left for a loss of 1 yard to the Chi22. Tackled by Akiem Hicks and Cre'von LeBlanc.","(7:27) Jameis Winston sacked at Chi21 for a loss of 15 yards by Pernell McPhee.","(7:32) Penalty: Roughing Passer on Chicago (Pernell McPhee) 5 yards.","(8:13) Jameis Winston pass to the middle to Adam Humphries for 14 yards to the Chi11. Tackled by Demontre Hurst.","(8:23) Jameis Winston incomplete pass to the left intended for Luke Stocker.","(9:02) Jameis Winston pass to the left to Adam Humphries for 4 yards to the Chi25. Tackled by Cre'von LeBlanc.","(9:23) Jameis Winston pass to the right to Cameron Brate for 14 yards to the Chi29. Tackled by Harold Jones-Quartey.","(9:56) Jameis Winston pass to the right to Mike Evans for 7 yards to the Chi43. Tackled by Tracy Porter.","(10:37) Doug Martin rush to the right for no gain to the TB50. Tackled by Danny Trevathan and Eddie Goldman.","(11:17) Jameis Winston pass to the left to Luke Stocker for 11 yards to the TB50. Tackled by Jerrell Freeman.","(11:28) Patrick O'Donnell punts for 51 yards to TB34. Adam Humphries return for 5 yards to TB39. Tackled by Chris Prosinski.","(11:43) Penalty: False Start on Chicago (Ben Braunecker) -5 yards.","(12:28) Jay Cutler sacked at Chi20 for a loss of 7 yards by Robert Ayers Jr. and Gerald McCoy.","(12:32) Jay Cutler incomplete pass to the left.","(13:05) Jordan Howard rush to the left for 2 yards to the Chi27. Tackled by Bradley McDougald.","(13:05) Roberto Aguayo kicks off to the endzone. Touchback.","(13:05) Roberto Aguayo extra point is good.","(13:15) Jameis Winston pass to the right to Freddie Martino for 43 yards for a TOUCHDOWN.","(14:14) Penalty: Delay of Game on Tampa Bay (Jameis Winston) -5 yards.","(14:14) Jameis Winston pass to the middle to Mike Evans for 39 yards to the Chi38. Tackled by Tracy Porter.","(14:22) Jameis Winston incomplete pass to the left intended for Cecil Shorts III.","(14:54) Doug Martin rush up the middle for no gain to the TB23. Tackled by Will Sutton.","(15:00) Connor Barth kicks off to the TB1. Ryan Smith return for 22 yards to TB23. Tackled by Harold Jones-Quartey.","(0:00) Connor Barth extra point is good.","(0:05) Jay Cutler pass to the left to Cameron Meredith for 50 yards for a TOUCHDOWN.","(0:05) Tampa Bay Buccaneers timeout.","(0:12) Jay Cutler pass to the right to Ka'Deem Carey for 16 yards to the Chi50. Tackled by Jude Adjei-Barimah.","(0:12) Chicago Bears timeout.","(0:18) Jay Cutler pass to the left to Jeremy Langford for 4 yards to the Chi34. Tackled by Kwon Alexander.","(0:19) Chicago Bears timeout.","(0:26) Jeremy Langford rush to the right for 13 yards to the Chi30. Tackled by Chris Conte.","(0:31) Roberto Aguayo kicks off to the Chi-2. Deonte Thompson return for 19 yards to Chi17. Tackled by Keith Tandy.","(0:35) Roberto Aguayo 30 yard field goal attempt is GOOD. Holder: Bryan Anger.","(0:41) Jameis Winston incomplete pass to the left intended for Adam Humphries.","(0:48) Jameis Winston pass to the left to Adam Humphries for 6 yards to the Chi12. Tackled by Leonard Floyd.","(0:48) Tampa Bay Buccaneers timeout.","(0:55) Mike James rush to the right for a loss of 1 yard to the Chi18. Tackled by Jerrell Freeman and Akiem Hicks.","(1:01) Jameis Winston pass to the right to Cecil Shorts III for 16 yards to the Chi17.","(1:18) Jameis Winston pass to the right to Cameron Brate for 10 yards to the Chi33. Tackled by Adrian Amos.","(1:39) Jameis Winston pass to the left to Cameron Brate for 10 yards to the Chi43. Tackled by Danny Trevathan.","(1:45) Jameis Winston incomplete pass to the left intended for Adam Humphries.","(1:54) Patrick O'Donnell punts for 43 yards to TB47. No return.","(2:00) Jay Cutler incomplete pass to the left intended for Alshon Jeffery.","(2:00) Penalty: False Start on Chicago (Alshon Jeffery) -5 yards.","(2:00) Two Minute Warning.","(2:43) Jordan Howard rush up the middle for 1 yard to the Chi15. Tackled by Akeem Spence.","(3:28) Jay Cutler pass to the right to Zach Miller for 4 yards to the Chi14. Tackled by William Gholston.","(3:33) Roberto Aguayo kicks off to the Chi-4. Deonte Thompson return for 14 yards to Chi10. Tackled by Josh Robinson.","(3:33) Roberto Aguayo extra point is good.","(3:38) Jameis Winston pass to the middle to Cameron Brate for 10 yards for a TOUCHDOWN.","(4:18) Doug Martin rush to the left for 3 yards to the Chi10. Tackled by Adrian Amos.","(4:58) Jameis Winston pass to the right to Cameron Brate for 16 yards to the Chi13. Tackled by Harold Jones-Quartey.","(5:37) Doug Martin rush to the right for no gain to the Chi29. Tackled by Pernell McPhee and Danny Trevathan.","(5:48) Jordan Howard rush to the right for 10 yards to the Chi30. Tackled by William Gholston and Chris Conte. FUMBLE, recovered by TB (Bradley McDougald) and returned for 6 yards.","(5:53) Jay Cutler incomplete pass to the left intended for Alshon Jeffery.","(6:27) Jordan Howard rush up the middle for 15 yards to the Chi20. Tackled by Kwon Alexander.","(6:40) Bryan Anger punts for 42 yards to Chi5. No return.","(7:21) Jameis Winston sacked at Chi47 for a loss of 7 yards by Leonard Floyd.","(7:25) Jameis Winston incomplete pass to the left intended for Adam Humphries.","(7:31) Jameis Winston incomplete pass to the left intended for Doug Martin.","(7:45) Penalty: Holding on Tampa Bay (Luke Stocker) -10 yards.","(8:20) Jameis Winston pass to the right to Cameron Brate for 14 yards to the Chi30. Tackled by Deon Bush.","(9:02) Jameis Winston pass to the left to Mike James for 5 yards to the Chi44. Tackled by Sam Acho.","(9:48) Doug Martin rush up the middle for 10 yards to the Chi49. Tackled by Harold Jones-Quartey and Danny Trevathan.","(10:12) Penalty: Holding on Tampa Bay (Demar Dotson) -10 yards.","(10:55) Jameis Winston pass to the right to Cecil Shorts III for 22 yards to the Chi49. Tackled by Harold Jones-Quartey.","(11:32) Adam Humphries rush to the left for 2 yards to the TB29. Tackled by Danny Trevathan and Sam Acho.","(12:13) Jameis Winston pass to the middle to Cameron Brate for 10 yards to the TB27. Tackled by Demontre Hurst.","(12:28) Penalty: False Start on Tampa Bay (Demar Dotson) -5 yards.","(13:08) Doug Martin rush to the right for no gain to the TB22. Tackled by Willie Young and Harold Jones-Quartey.","(13:42) Doug Martin rush to the left for 8 yards to the TB22. Tackled by Adrian Amos.","(13:53) Jay Cutler sacked at TB10 for a loss of 6 yards by Noah Spence. FUMBLE, recovered by TB (Kwon Alexander) and returned for 4 yards. Tackled by Jeremy Langford.","(14:25) Jay Cutler pass to the middle to Paul Lasike for 3 yards to the TB4. Tackled by Robert Ayers Jr..","(14:32) Jay Cutler incomplete pass to the left intended for Alshon Jeffery defensed by Keith Tandy.","(15:00) Jordan Howard rush to the left for 9 yards to the TB7. Tackled by Chris Conte.","(0:45) Jay Cutler pass to the right to Alshon Jeffery for 7 yards to the TB16. Tackled by Brent Grimes.","(1:28) Jordan Howard rush to the left for 1 yard to the TB23. Tackled by Gerald McCoy.","(1:33) Jameis Winston pass intended for Cecil Shorts III INTERCEPTED by Harold Jones-Quartey. No return. Tackled by Cecil Shorts III.","(1:58) Penalty: Holding on Tampa Bay (Demar Dotson) -10 yards.","(2:36) Peyton Barber rush up the middle for 4 yards to the TB19. Tackled by Jerrell Freeman and Danny Trevathan.","(2:42) Penalty: Illegal Use of Hands on Tampa Bay (Donovan Smith) -10 yards.","(2:42) Connor Barth kicks off to the endzone. Touchback.","(2:47) Connor Barth 54 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(2:51) Jay Cutler incomplete pass to the left intended for Eddie Royal.","(3:34) Jordan Howard rush up the middle for 2 yards to the TB36. Tackled by William Gholston.","(4:10) Jordan Howard rush to the right for no gain to the TB38. Tackled by Gerald McCoy.","(4:52) Jordan Howard rush up the middle for 13 yards to the TB38. Tackled by Chris Conte.","(5:27) Jordan Howard rush to the left for 13 yards to the Chi49. Tackled by Noah Spence.","(5:34) Roberto Aguayo kicks off to the Chi15. Deonte Thompson return for 21 yards to Chi36. Tackled by Alan Cross.","(5:34) Roberto Aguayo extra point is good.","(5:42) Jay Cutler pass intended for Logan Paulsen INTERCEPTED by Chris Conte and returned for 20 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Tampa Bay -15 yards.","(5:48) Bryan Anger punts for 33 yards to Chi21. No return.","(5:53) Jameis Winston incomplete pass to the left defensed by Leonard Floyd.","(6:19) Doug Martin rush to the left for no gain to the TB46. Tackled by Danny Trevathan and Willie Young.","(6:45) Doug Martin rush to the right for 5 yards to the TB46. Tackled by Willie Young.","(7:06) Jameis Winston pass to the right to Adam Humphries for 12 yards to the TB41. Tackled by Tracy Porter.","(7:18) Jay Cutler pass intended for Alshon Jeffery INTERCEPTED by Brent Grimes and returned for 1 yard. Tackled by Cameron Meredith.","(8:01) Jay Cutler pass to the left to Alshon Jeffery for 13 yards to the TB37. Tackled by Vernon Hargreaves III.","(8:42) Jay Cutler sacked at Chi50 for a loss of 5 yards by Clinton McDonald.","(9:17) Jordan Howard rush to the right for 15 yards to the TB45. Tackled by Bradley McDougald.","(9:26) Bryan Anger punts for 41 yards to Chi40. No return.","(10:01) Doug Martin rush to the right for 1 yard to the TB19. Tackled by Jerrell Freeman and Will Sutton.","(10:47) Jameis Winston pass to the right to Brandon Myers for 6 yards to the TB18. Tackled by Leonard Floyd and Will Sutton.","(11:21) Doug Martin rush to the left for 2 yards to the TB12. Tackled by Will Sutton and Leonard Floyd.","(11:32) Patrick O'Donnell punts for 28 yards to TB10. No return.","(11:38) Jay Cutler incomplete pass to the left intended for Zach Miller.","(11:42) Jay Cutler incomplete pass to the left intended for Joshua Bellamy.","(12:25) Jordan Howard rush to the left for 3 yards to the TB38. Tackled by Kwon Alexander and Lavonte David.","(13:07) Jay Cutler pass to the right to Alshon Jeffery for 11 yards to the TB41. Tackled by Chris Conte.","(13:47) Jordan Howard rush to the right for 3 yards to the Chi48. Tackled by Robert Ayers Jr. and Kwon Alexander.","(14:27) Jay Cutler pass to the left to Alshon Jeffery for 16 yards to the Chi45. Tackled by Chris Conte.","(15:00) Jordan Howard rush to the right for 4 yards to the Chi29. Tackled by Robert Ayers Jr. and Chris Conte.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback."]