["(0:37) Ryan Tannehill rush up the middle for a loss of 1 yard to the Mia46.","(0:44) Philip Rivers pass intended for Tyrell Williams INTERCEPTED by Tony Lippett. No return.","(1:01) Philip Rivers pass to the right to Melvin Gordon for 12 yards to the SD37. Tackled by Bobby McCain.","(1:01) Andrew Franks kicks off to the endzone. Touchback.","(1:01) Andrew Franks extra point is good.","(1:13) Philip Rivers pass intended for Tyrell Williams INTERCEPTED by Kiko Alonso and returned for 60 yards for a TOUCHDOWN.","(1:13) San Diego Chargers timeout.","(2:00) Philip Rivers pass to the right to Melvin Gordon for 20 yards to the Mia42. Tackled by Jelani Jenkins.","(2:00) Two Minute Warning.","(2:30) Melvin Gordon rush up the middle for no gain to the SD38. Tackled by Ndamukong Suh and Andre Branch.","(2:57) Melvin Gordon rush up the middle for 13 yards to the SD38. Tackled by Isa Abdul-Quddus.","(2:57) Andrew Franks kicks off to the endzone. Touchback.","(3:01) Andrew Franks 27 yard field goal attempt is GOOD. Holder: Matt Darr.","(3:01) San Diego Chargers timeout.","(3:06) Ryan Tannehill incomplete pass to the left intended for DeVante Parker defensed by Trevor Williams.","(3:06) San Diego Chargers timeout.","(3:11) Ryan Tannehill incomplete pass to the right intended for Dion Sims.","(3:54) Jay Ajayi rush to the left for 1 yard to the SD9. Tackled by Korey Toomer.","(4:04) Ryan Tannehill pass to the left to DeVante Parker for 56 yards to the SD19. Tackled by Adrian Phillips. Penalty: Roughing Passer on San Diego (Corey Liuget) 9 yards.","(4:04) Josh Lambo kicks off to the endzone. Touchback.","(4:04) Josh Lambo extra point is good.","(4:13) Philip Rivers pass to the left to Tyrell Williams for 51 yards for a TOUCHDOWN.","(4:17) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(4:24) Penalty: Holding on Miami (Tony Lippett) 5 yards.","(5:02) Melvin Gordon rush up the middle for 2 yards to the SD44. Tackled by Jason Jones.","(5:06) Philip Rivers incomplete pass to the right intended for Tyrell Williams defensed by Byron Maxwell.","(5:21) Matt Darr punts for 47 yards to SD21. Isaiah Burse return for 21 yards to SD42. Tackled by Neville Hewitt.","(5:39) Kenyan Drake rush to the right for 9 yards to the Mia32. Tackled by Tenny Palepoi.","(6:08) Penalty: Holding on Miami (Ja'Wuan James) -10 yards.","(6:14) Ryan Tannehill pass to the right to Jay Ajayi for 1 yard to the Mia33. Tackled by Kyle Emanuel.","(6:59) Jay Ajayi rush to the left for a loss of 9 yards to the Mia32. Tackled by Corey Liuget.","(7:09) Philip Rivers pass intended for Antonio Gates INTERCEPTED by Byron Maxwell and returned for 27 yards. Tackled by Kenneth Farrow.","(7:53) Philip Rivers pass to the left to Dontrelle Inman for 14 yards to the Mia30. Tackled by Isa Abdul-Quddus.","(8:38) Philip Rivers pass to the left to Dontrelle Inman for 13 yards to the Mia44. Tackled by Tony Lippett.","(8:44) Philip Rivers incomplete pass to the left intended for Dontrelle Inman.","(9:23) Philip Rivers pass to the right to Melvin Gordon for 4 yards to the SD43. Tackled by Isa Abdul-Quddus.","(10:10) Philip Rivers pass to the right to Tyrell Williams for 25 yards to the SD39. Tackled by Byron Maxwell and Bacarri Rambo.","(10:56) Philip Rivers sacked at SD14 for a loss of 6 yards by Andre Branch and Ndamukong Suh.","(11:03) Penalty: Holding on Miami (Tony Lippett) 4 yards.","(11:33) Melvin Gordon rush up the middle for 4 yards to the SD16. Tackled by Tony Lippett and Jelani Jenkins.","(11:46) Matt Darr punts for 59 yards to SD22. No return. Penalty: Holding on San Diego (Craig Mager) -10 yards.","(11:51) Ryan Tannehill incomplete pass to the right.","(11:55) Ryan Tannehill incomplete pass to the right intended for DeVante Parker.","(12:38) Jay Ajayi rush to the right for a loss of 1 yard to the Mia19. Tackled by Korey Toomer.","(12:42) Philip Rivers pass intended for Tyrell Williams INTERCEPTED by Tony Lippett. No return. Touchback.","(12:47) Philip Rivers incomplete pass to the middle.","(12:51) Penalty: Holding on Miami (Byron Maxwell) 3 yards.","(12:56) Philip Rivers incomplete pass to the right intended for Melvin Gordon.","(13:41) Melvin Gordon rush up the middle for no gain to the Mia5. Tackled by Andre Branch.","(13:51) Drew Kaser punts for 55 yards to Mia7. Jakeem Grant - no return. FUMBLE, recovered by SD (Darrell Stuckey). Tackled by Jakeem Grant.","(14:16) Philip Rivers pass to the left to Griff Whalen for 10 yards to the SD38. Tackled by Tony Lippett.","(14:41) Penalty: False Start on San Diego (Tyrell Williams) -5 yards.","(15:00) Philip Rivers pass to the left to Dontrelle Inman for a loss of 2 yards to the SD33. Tackled by Tony Lippett.","(0:27) Melvin Gordon rush to the right for 3 yards to the SD35. Tackled by Neville Hewitt.","(0:53) Penalty: Holding on Miami (Bobby McCain) 5 yards.","(0:53) Penalty: Offside on Miami (Cameron Wake) 5 yards.","(0:59) Philip Rivers incomplete pass to the right intended for Melvin Gordon.","(1:37) Melvin Gordon rush to the right for 1 yard to the SD22. Tackled by Earl Mitchell and Neville Hewitt.","(1:43) Andrew Franks kicks off to the SD0. Isaiah Burse return for 21 yards to SD21. Tackled by Michael Thomas.","(1:43) Andrew Franks extra point is good.","(1:49) Ryan Tannehill pass to the left to Damien Williams for 18 yards for a TOUCHDOWN.","(2:27) Jay Ajayi rush to the left for 1 yard to the SD18. Tackled by Korey Toomer and Damion Square.","(2:59) Jay Ajayi rush to the right for 7 yards to the SD19. Tackled by Adrian Phillips.","(3:35) Ryan Tannehill rush to the right for 18 yards to the SD26. Tackled by Casey Hayward.","(4:18) Ryan Tannehill rush to the right for a loss of 1 yard to the SD44. Tackled by Adrian Phillips and Korey Toomer.","(4:22) Ryan Tannehill incomplete pass to the right intended for DeVante Parker defensed by Melvin Ingram defensed by Casey Hayward.","(5:00) Ryan Tannehill pass to the right to Jarvis Landry for 11 yards to the SD43. Tackled by Brandon Flowers.","(5:36) Jay Ajayi rush to the left for 21 yards to the Mia46. Tackled by Adrian Phillips.","(5:36) Josh Lambo kicks off to the endzone. Touchback.","(5:36) Josh Lambo extra point is good.","(5:42) Philip Rivers pass to the right to Hunter Henry for 7 yards for a TOUCHDOWN.","(6:26) Melvin Gordon rush to the left for a loss of 6 yards to the Mia7. Tackled by Earl Mitchell.","(7:05) Melvin Gordon rush up the middle for no gain to the Mia1. Tackled by Jelani Jenkins.","(7:11) Penalty: Pass Interference on Miami (Bobby McCain) 12 yards.","(7:55) Melvin Gordon rush up the middle for 5 yards to the Mia13. Tackled by Ndamukong Suh.","(8:33) Melvin Gordon rush to the left for 18 yards to the Mia18. Tackled by Michael Thomas.","(8:38) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(9:22) Philip Rivers pass to the left to Tyrell Williams for 21 yards to the Mia36. Tackled by Tony Lippett.","(9:28) Philip Rivers incomplete pass to the left intended for Melvin Gordon.","(10:10) Melvin Gordon rush to the left for no gain to the SD43. Tackled by Isa Abdul-Quddus and Ndamukong Suh.","(10:40) Philip Rivers pass to the left to Tyrell Williams for 12 yards to the SD43. Tackled by Tony Lippett.","(11:03) Penalty: Offside on Miami (Ndamukong Suh) 5 yards.","(11:50) Philip Rivers sacked at SD26 for a loss of 3 yards by Cameron Wake.","(12:29) Philip Rivers pass to the right to Hunter Henry for 4 yards to the SD29. Tackled by Kiko Alonso.","(12:29) Andrew Franks kicks off to the endzone. Touchback.","(12:29) Andrew Franks extra point is good.","(12:33) Damien Williams rush up the middle for 2 yards for a TOUCHDOWN.","(12:33) Miami Dolphins timeout.","(13:06) Ryan Tannehill pass to the right to Jarvis Landry for 25 yards to the SD2. Tackled by Darrell Stuckey.","(13:50) Jay Ajayi rush to the right for 3 yards to the SD27. Tackled by Darrell Stuckey.","(14:29) Jay Ajayi rush to the left for 40 yards to the SD30. Tackled by Adrian Phillips.","(15:00) Ryan Tannehill pass to the right to Jarvis Landry for 5 yards to the Mia30. Tackled by Kyle Emanuel.","(15:00) Josh Lambo kicks off to the endzone. Touchback.","(0:45) Jay Ajayi rush to the right for 1 yard to the Mia8. Tackled by Korey Toomer and Tenny Palepoi.","(0:55) Drew Kaser punts for 35 yards to Mia1. No return.","(0:55) Miami Dolphins timeout.","(1:01) Philip Rivers sacked at Mia36 for a loss of 8 yards by Cameron Wake and Mario Williams.","(1:07) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(1:07) San Diego Chargers timeout.","(1:22) Melvin Gordon rush to the right for 3 yards to the Mia28. Tackled by Byron Maxwell.","(2:00) Philip Rivers pass to the right to Antonio Gates for 14 yards to the Mia31. Tackled by Kiko Alonso.","(2:00) Two Minute Warning.","(2:06) Philip Rivers pass to the left to Antonio Gates for 19 yards to the Mia45. Tackled by Bobby McCain.","(2:11) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(2:44) Philip Rivers pass to the left to Melvin Gordon for 11 yards to the SD36. Tackled by Jordan Phillips.","(2:50) Philip Rivers incomplete pass to the right.","(2:50) Andrew Franks kicks off to the endzone. Touchback.","(2:50) Andrew Franks extra point is good.","(2:59) Ryan Tannehill pass to the left to Kenny Stills for 39 yards for a TOUCHDOWN.","(3:39) Ryan Tannehill pass to the left to Jarvis Landry for 6 yards to the SD39. Tackled by Dwight Lowery.","(4:22) Jay Ajayi rush up the middle for a loss of 2 yards to the SD45. Tackled by Korey Toomer and Tourek Williams.","(4:57) Ryan Tannehill pass to the left to DeVante Parker for 9 yards to the SD43. Tackled by Craig Mager.","(5:40) Ryan Tannehill pass to the middle to DeVante Parker for 14 yards to the Mia48. Tackled by Craig Mager.","(6:24) Jay Ajayi rush to the right for a loss of 3 yards to the Mia34. Tackled by Korey Toomer.","(6:47) Ryan Tannehill pass to the right to Kenny Stills for 8 yards to the Mia37. Tackled by Dexter McCoil.","(6:51) Ryan Tannehill incomplete pass to the right intended for Dominique Jones defensed by Korey Toomer.","(7:31) Jay Ajayi rush to the right for 3 yards to the Mia29. Tackled by Brandon Mebane.","(7:37) Josh Lambo kicks off to the Mia-5. Jakeem Grant return for 31 yards to Mia26. Tackled by Dexter McCoil.","(7:37) Josh Lambo extra point is good.","(7:42) Philip Rivers pass to the right to Antonio Gates for 11 yards for a TOUCHDOWN.","(8:27) Philip Rivers pass to the right to Antonio Gates for 19 yards to the Mia11. Tackled by Isa Abdul-Quddus.","(9:06) Melvin Gordon rush to the right for a loss of 1 yard to the Mia30. Tackled by Leon Orr and Jelani Jenkins.","(9:50) Philip Rivers pass to the right to Tyrell Williams for 16 yards to the Mia29. Tackled by Bobby McCain.","(10:26) Philip Rivers pass to the left to Dontrelle Inman for 12 yards to the Mia45. Tackled by Jason Jones.","(11:03) Philip Rivers pass to the right to Melvin Gordon for 15 yards to the SD43. Tackled by Andre Branch.","(11:07) Philip Rivers incomplete pass to the middle intended for Dontrelle Inman defensed by Ndamukong Suh.","(11:48) Melvin Gordon rush to the right for a loss of 4 yards to the SD28. Tackled by Kiko Alonso.","(12:30) Philip Rivers pass to the left to Sean McGrath for 12 yards to the SD32. Tackled by Tony Lippett.","(12:42) Matt Darr punts for 57 yards to SD17. Isaiah Burse return for 3 yards to SD20. Tackled by Michael Thomas and John Denney.","(13:21) Ryan Tannehill pass to the left to Jarvis Landry for 8 yards to the Mia26. Tackled by Craig Mager and Brandon Flowers.","(14:05) Jay Ajayi rush to the right for 3 yards to the Mia18. Tackled by Korey Toomer.","(14:46) Ryan Tannehill pass to the left to Jarvis Landry for a loss of 2 yards to the Mia15. Tackled by Casey Hayward.","(14:51) Josh Lambo kicks off to the Mia-6. Jakeem Grant return for 23 yards to Mia17. Tackled by Dexter McCoil.","(14:55) Josh Lambo 45 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(15:00) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(0:06) Melvin Gordon rush up the middle for 3 yards to the Mia27. Tackled by Ndamukong Suh.","(0:47) Melvin Gordon rush to the right for no gain to the Mia30. Tackled by Cameron Wake and Isa Abdul-Quddus.","(1:28) Melvin Gordon rush to the right for 19 yards to the Mia30. Tackled by Neville Hewitt.","(1:32) Penalty: Pass Interference on Miami (Bobby McCain) 12 yards. Penalty: Face Mask on Miami (Bobby McCain) 15 yards.","(2:18) Melvin Gordon rush to the left for a loss of 1 yard to the SD24. Tackled by Earl Mitchell and Neville Hewitt.","(2:54) Melvin Gordon rush to the right for 3 yards to the SD25. Tackled by Kiko Alonso.","(2:54) Penalty: False Start on San Diego (Joe Barksdale) -5 yards.","(3:06) Matt Darr punts for 55 yards to SD6. Isaiah Burse return for 21 yards to SD27. Tackled by Mike Hull.","(3:11) Ryan Tannehill incomplete pass to the left intended for Kenny Stills.","(3:50) Damien Williams rush up the middle for no gain to the Mia39. Tackled by Korey Toomer and Corey Liuget.","(4:30) Jay Ajayi rush to the left for 1 yard to the Mia39. Tackled by Korey Toomer and Tourek Williams.","(4:41) Drew Kaser punts for 55 yards to Mia36. Jakeem Grant - no return. FUMBLE, recovered by Mia (Jakeem Grant).","(4:47) Philip Rivers incomplete pass to the left intended for Isaiah Burse.","(4:51) Philip Rivers incomplete pass to the left intended for Dontrelle Inman.","(5:34) Melvin Gordon rush to the left for 1 yard to the SD9. Tackled by Earl Mitchell and Michael Thomas.","(5:34) Penalty: Encroachment on Miami (Jordan Phillips) 5 yards.","(5:44) Matt Darr punts for 40 yards to SD3. No return.","(6:26) Ryan Tannehill sacked at SD43 for a loss of 9 yards by Melvin Ingram. FUMBLE, recovered by Mia (Jermon Bushrod).","(7:07) Jay Ajayi rush up the middle for a loss of 4 yards to the SD34. Tackled by Brandon Flowers.","(7:51) Ryan Tannehill pass to the right to MarQueis Gray for 9 yards to the SD30. Tackled by Dwight Lowery.","(8:31) Ryan Tannehill pass to the right to DeVante Parker for 10 yards to the SD39. Tackled by Dwight Lowery and Adrian Phillips.","(9:09) Jay Ajayi rush up the middle for 1 yard to the SD49. Tackled by Tourek Williams and Kyle Emanuel.","(9:48) Ryan Tannehill pass to the left to DeVante Parker for 14 yards to the Mia50. Tackled by Adrian Phillips.","(10:23) Jay Ajayi rush up the middle for 8 yards to the Mia36. Tackled by Melvin Ingram.","(10:58) Jay Ajayi rush to the left for 5 yards to the Mia28. Tackled by Melvin Ingram.","(11:28) Ryan Tannehill pass to the left to MarQueis Gray for 9 yards to the Mia23. Tackled by Melvin Ingram.","(12:00) Jay Ajayi rush to the left for 3 yards to the Mia14. Tackled by Korey Toomer and Joey Bosa.","(12:11) Drew Kaser punts for 54 yards to Mia8. Jakeem Grant return for 3 yards to Mia11. Tackled by Derek Watt.","(12:17) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(12:22) Philip Rivers incomplete pass to the right intended for Antonio Gates defensed by Bacarri Rambo.","(13:02) Melvin Gordon rush to the right for 1 yard to the SD38. Tackled by Mario Williams.","(13:40) Philip Rivers pass to the right to Dontrelle Inman for 6 yards to the SD37. Tackled by Byron Maxwell.","(14:23) Melvin Gordon rush to the right for 4 yards to the SD31. Tackled by Byron Maxwell.","(15:00) Melvin Gordon rush to the right for 2 yards to the SD27. Tackled by Byron Maxwell and Jordan Phillips.","(15:00) Andrew Franks kicks off to the endzone. Touchback."]