["(0:04) Kirk Cousins rush up the middle for a loss of 1 yard to the Was41.","(0:11) Sam Bradford sacked at Was42 for a loss of 14 yards by Preston Smith.","(0:19) Sam Bradford incomplete pass to the left intended for Cordarrelle Patterson.","(0:40) Sam Bradford sacked at Was28 for a loss of 7 yards by Trent Murphy.","(0:40) Washington Redskins timeout.","(0:45) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(1:04) Sam Bradford pass to the right to Stefon Diggs for 5 yards to the Was21. Tackled by Will Compton.","(1:11) Sam Bradford incomplete pass to the right intended for Jerick McKinnon.","(1:29) Sam Bradford pass to the right to Adam Thielen for 7 yards to the Was26. Tackled by Will Blackmon.","(1:36) Sam Bradford pass to the right to Stefon Diggs for 9 yards to the Was33. Tackled by Kendall Fuller.","(1:52) Sam Bradford pass to the middle to Stefon Diggs for 7 yards to the Was42. Tackled by Donte Whitner.","(2:00) Sam Bradford pass to the left to Stefon Diggs for 14 yards to the Was49.","(2:00) Two Minute Warning.","(2:09) Sam Bradford pass to the right to Stefon Diggs for 6 yards to the Min37. Tackled by Su'a Cravens.","(2:31) Sam Bradford pass to the right to Stefon Diggs for 6 yards to the Min31. Tackled by Donte Whitner and Will Compton.","(2:31) Dustin Hopkins kicks off to the endzone. Touchback.","(2:35) Dustin Hopkins 28 yard field goal attempt is GOOD. Holder: Tress Way.","(2:35) Minnesota Vikings timeout.","(2:43) Kirk Cousins sacked at Min10 for a loss of 2 yards by Danielle Hunter.","(2:43) Minnesota Vikings timeout.","(2:48) Rob Kelley rush to the left for 2 yards to the Min8. Tackled by Everson Griffen and Tom Johnson.","(2:48) Minnesota Vikings timeout.","(2:55) Rob Kelley rush to the left for 2 yards to the Min10. Tackled by Chad Greenway and Everson Griffen.","(3:39) Kirk Cousins pass to the right to Pierre Garcon for 16 yards to the Min12. Tackled by Mackensie Alexander.","(4:21) Rob Kelley rush to the left for 3 yards to the Min28. Tackled by Linval Joseph and Audie Cole.","(5:02) Kirk Cousins pass to the right to Jamison Crowder for 7 yards to the Min31. Tackled by Terence Newman.","(5:44) Rob Kelley rush to the left for 4 yards to the Min38. Tackled by Harrison Smith and Chad Greenway.","(5:53) Sam Bradford pass intended for Adam Thielen INTERCEPTED by Preston Smith and returned for 22 yards. Tackled by Joe Berger.","(5:59) Sam Bradford incomplete pass to the left intended for Stefon Diggs defensed by Kendall Fuller.","(6:05) Penalty: Roughing Passer on Washington (Cullen Jenkins) 15 yards.","(6:45) Sam Bradford pass to the middle to Stefon Diggs for 9 yards to the Min46. Tackled by Kendall Fuller.","(7:28) Sam Bradford pass to the left to Stefon Diggs for 6 yards to the Min37. Tackled by Bashaud Breeland.","(8:05) Jerick McKinnon rush to the left for 1 yard to the Min31. Tackled by Will Compton and Ricky Jean Francois.","(8:25) Sam Bradford pass to the left to Cordarrelle Patterson for 4 yards to the Min30. Tackled by Will Blackmon and Will Compton.","(8:56) Sam Bradford pass to the right to Adam Thielen for 11 yards to the Min26. Tackled by Will Blackmon.","(9:29) Sam Bradford pass to the left to Jerick McKinnon for 3 yards to the Min15. Tackled by Mason Foster.","(9:33) Dustin Hopkins kicks off to the Min-6. Cordarrelle Patterson return for 18 yards to Min12. Tackled by Duke Ihenacho and Kendall Fuller.","(9:38) Dustin Hopkins 50 yard field goal attempt is GOOD. Holder: Tress Way.","(9:43) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(10:19) Kirk Cousins pass to the right to Chris Thompson for 6 yards to the Min32. Tackled by Trae Waynes.","(11:04) Rob Kelley rush to the right for 2 yards to the Min38. Tackled by Linval Joseph and Anthony Barr.","(11:39) Kirk Cousins pass to the right to Jamison Crowder for 14 yards to the Min40. Tackled by Harrison Smith and Trae Waynes.","(12:19) Kirk Cousins pass to the left to Pierre Garcon for 17 yards to the Was46. Tackled by Mackensie Alexander and Chad Greenway.","(12:54) Rob Kelley rush to the right for 21 yards to the Was29. Tackled by Xavier Rhodes and Audie Cole.","(13:03) Jeff Locke punts for 49 yards to Was8. No return.","(13:43) Matt Asiata rush up the middle for a loss of 1 yard to the Min43. Tackled by Will Compton and Donte Whitner.","(14:09) Sam Bradford pass to the right to Kyle Rudolph for 7 yards to the Min44. Tackled by Mason Foster.","(14:36) Sam Bradford pass to the right to Matt Asiata for 2 yards to the Min37. Tackled by Josh Norman.","(15:00) Matt Asiata rush to the right for 1 yard to the Min35. Tackled by Donte Whitner.","(0:38) Sam Bradford pass to the right to Kyle Rudolph for 9 yards to the Min34. Tackled by Josh Norman.","(0:38) Dustin Hopkins kicks off to the endzone. Touchback.","(0:43) Dustin Hopkins 37 yard field goal attempt is GOOD. Holder: Tress Way.","(0:48) Kirk Cousins incomplete pass to the right intended for Ryan Grant defensed by Terence Newman.","(1:29) Rob Kelley rush to the right for 2 yards to the Min19. Tackled by Linval Joseph.","(2:12) Rob Kelley rush up the middle for 4 yards to the Min21. Tackled by Linval Joseph.","(2:34) Kirk Cousins pass to the right to Maurice Harris for 15 yards to the Min25.","(2:40) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(3:24) Rob Kelley rush to the left for 2 yards to the Min40. Tackled by Tom Johnson.","(3:57) Kirk Cousins pass to the left to Chris Thompson for 4 yards to the Min42. Tackled by Anthony Barr.","(4:32) Chris Thompson rush to the left for 3 yards to the Min46. Tackled by Anthony Barr.","(5:15) Rob Kelley rush to the left for 5 yards to the Min49. Tackled by Everson Griffen.","(5:54) Rob Kelley rush to the right for 14 yards to the Was46. Tackled by Anthony Barr and Danielle Hunter.","(6:05) Jeff Locke punts for 44 yards to Was27. Jamison Crowder return for 5 yards to Was32. Tackled by Kentrell Brothers.","(6:15) Penalty: Delay of Game on Minnesota (Sam Bradford) -5 yards.","(7:31) Matt Asiata rush to the right for no gain to the Min34. Tackled by Ziggy Hood and Josh Norman.","(8:13) Zach Line rush to the right for 5 yards to the Min34. Tackled by Chris Baker and Will Blackmon.","(8:53) Matt Asiata rush up the middle for 4 yards to the Min29. Tackled by Donte Whitner.","(8:53) Dustin Hopkins kicks off to the endzone. Touchback.","(8:58) Dustin Hopkins 30 yard field goal attempt is GOOD. Holder: Tress Way.","(9:04) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(9:09) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(9:50) Kirk Cousins pass to the left to Rob Kelley for a loss of 2 yards to the Min12. Tackled by Anthony Barr.","(10:27) Kirk Cousins pass to the left to Jamison Crowder for 12 yards to the Min10. Tackled by Andrew Sendejo.","(11:07) Rob Kelley rush to the right for 1 yard to the Min22. Tackled by Harrison Smith.","(11:45) Kirk Cousins pass to the right to Maurice Harris for 5 yards to the Min23. Tackled by Chad Greenway.","(12:25) Kirk Cousins pass to the left to Pierre Garcon for 13 yards to the Min28. Tackled by Xavier Rhodes.","(13:08) Rob Kelley rush to the left for 2 yards to the Min41. Tackled by Everson Griffen and Xavier Rhodes.","(13:43) Kirk Cousins pass to the left to Pierre Garcon for 14 yards to the Min43. Tackled by Andrew Sendejo.","(14:22) Rob Kelley rush to the left for a loss of 1 yard to the Was43. Tackled by Chad Greenway.","(14:53) Kirk Cousins pass to the right to Jordan Reed for 16 yards to the Was44. Tackled by Mackensie Alexander.","(14:53) Penalty: False Start on Washington (Brandon Scherff) -5 yards.","(15:00) Blair Walsh kicks off to the Was6. Chris Thompson return for 27 yards to Was33. Tackled by Anthony Harris.","(0:00) Blair Walsh extra point is NO GOOD.","(0:05) Sam Bradford pass to the right to Adam Thielen for 3 yards for a TOUCHDOWN.","(0:05) Minnesota Vikings timeout.","(0:10) Sam Bradford incomplete pass to the right intended for Zach Line.","(0:10) Minnesota Vikings timeout.","(0:24) Matt Asiata rush to the left for 2 yards to the Was3. Tackled by Su'a Cravens and Chris Baker.","(0:50) Sam Bradford pass to the right to Stefon Diggs for 28 yards to the Was5. Tackled by Donte Whitner.","(0:58) Chris Thompson rush to the right for 7 yards to the Was32. Tackled by Linval Joseph. FUMBLE, recovered by Min (Everson Griffen). Tackled by Morgan Moses.","(0:58) Blair Walsh kicks off to the endzone. Touchback.","(0:58) Blair Walsh extra point is good.","(1:06) Sam Bradford pass to the right to Kyle Rudolph for 20 yards for a TOUCHDOWN.","(1:33) Sam Bradford pass to the left to Stefon Diggs for 10 yards to the Was20. Tackled by Su'a Cravens and Kendall Fuller.","(2:00) Jerick McKinnon rush up the middle for a loss of 1 yard to the Was30. Tackled by Quinton Dunbar.","(2:00) Two Minute Warning.","(2:08) Sam Bradford pass to the left to Jarius Wright for 9 yards to the Was29. Tackled by Mason Foster and Will Compton.","(2:42) Sam Bradford pass to the right to Stefon Diggs for 23 yards to the Was38. Tackled by Mason Foster.","(3:09) Sam Bradford pass to the left to Cordarrelle Patterson for 9 yards to the Min39. Tackled by Bashaud Breeland and Will Compton.","(3:38) Sam Bradford pass to the right to Stefon Diggs for 5 yards to the Min30. Tackled by Bashaud Breeland.","(3:46) Tress Way punts for 41 yards to Min25. No return.","(3:54) Kirk Cousins incomplete pass to the right intended for Ryan Grant.","(4:32) Chris Thompson rush to the right for 6 yards to the Was34. Tackled by Harrison Smith and Tom Johnson.","(4:38) Penalty: Holding on Washington (Morgan Moses) -10 yards.","(5:01) Rob Kelley rush to the left for 4 yards to the Was38. Tackled by Tom Johnson and Shamar Stephen.","(5:34) Rob Kelley rush to the left for 12 yards to the Was34. Tackled by Andrew Sendejo and Danielle Hunter.","(5:39) Blair Walsh kicks off to the Was0. Rashad Ross return for 22 yards to Was22. Tackled by Danielle Hunter.","(5:39) Blair Walsh extra point is good.","(5:44) Matt Asiata rush to the right for 1 yard for a TOUCHDOWN.","(6:28) Matt Asiata rush to the right for no gain to the Was1. Tackled by Ricky Jean Francois and Will Compton.","(7:05) Matt Asiata rush to the left for no gain to the Was1. Tackled by Ryan Kerrigan and Will Compton.","(7:53) Sam Bradford pass to the right to Kyle Rudolph for 13 yards to the Was1. Tackled by Bashaud Breeland.","(8:31) Adam Thielen rush to the left for 11 yards to the Was14. Tackled by Bashaud Breeland.","(9:05) Matt Asiata rush to the left for 6 yards to the Was25. Tackled by Duke Ihenacho.","(9:24) Sam Bradford pass to the left to Stefon Diggs for 36 yards to the Was31. Tackled by Kendall Fuller.","(9:31) Sam Bradford incomplete pass to the left intended for Kyle Rudolph defensed by Mason Foster.","(9:40) Tress Way punts for 51 yards to Min28. Stefon Diggs return for 5 yards to Min33. Tackled by Deshazor Everett.","(9:48) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(9:54) Kirk Cousins incomplete pass to the right intended for Ryan Grant defensed by Harrison Smith.","(10:00) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(10:09) Jeff Locke punts for 41 yards to Was21. No return.","(10:14) Sam Bradford incomplete pass to the left intended for Stefon Diggs.","(11:01) Sam Bradford pass to the right to Rhett Ellison for 2 yards to the Min38. Tackled by Ziggy Hood.","(11:24) Ronnie Hillman rush to the left for a loss of 3 yards to the Min36. Tackled by Ryan Kerrigan.","(11:51) Penalty: Illegal Contact on Washington (Will Compton) 5 yards.","(12:37) Ronnie Hillman rush up the middle for 9 yards to the Min34. Tackled by Trent Murphy.","(13:17) Ronnie Hillman rush up the middle for 2 yards to the Min25. Tackled by Su'a Cravens and Trent Murphy.","(13:36) Sam Bradford pass to the left to Jerick McKinnon for 2 yards to the Min38. Tackled by Bashaud Breeland and Preston Smith. Penalty: Face Mask on Minnesota (Jerick McKinnon) -15 yards.","(14:12) Jerick McKinnon rush to the right for 13 yards to the Min36. Tackled by Donte Whitner and Mason Foster.","(14:18) Dustin Hopkins kicks off to the Min-3. Cordarrelle Patterson return for 26 yards to Min23. Tackled by Bashaud Breeland.","(14:18) Dustin Hopkins extra point is good.","(14:28) Kirk Cousins pass to the left to Vernon Davis for 38 yards for a TOUCHDOWN.","(15:00) Kirk Cousins pass to the right to Maurice Harris for 8 yards to the Min38. Tackled by Trae Waynes.","(0:30) Kirk Cousins pass to the right to Chris Thompson for 1 yard to the Min46. Tackled by Chad Greenway.","(1:09) Rob Kelley rush to the right for 3 yards to the Min47. Tackled by Tom Johnson.","(1:47) Rob Kelley rush up the middle for 2 yards to the Was50. Tackled by Audie Cole and Linval Joseph.","(2:28) Kirk Cousins pass to the right to Pierre Garcon for 9 yards to the Was48. Tackled by Trae Waynes.","(2:54) Kirk Cousins pass to the right to Vernon Davis for 15 yards to the Was39. Tackled by Harrison Smith and Shamar Stephen.","(3:34) Kirk Cousins pass to the right to Vernon Davis for 13 yards to the Was24. Tackled by Harrison Smith.","(4:16) Rob Kelley rush to the left for 2 yards to the Was11. Tackled by Shamar Stephen.","(4:24) Jeff Locke punts for 43 yards to Was9. No return.","(5:05) Sam Bradford sacked at Min48 for a loss of 2 yards by Preston Smith.","(5:47) Sam Bradford pass to the left to Cordarrelle Patterson for 4 yards to the Min50. Tackled by Duke Ihenacho.","(6:25) Jerick McKinnon rush to the right for 1 yard to the Min46. Tackled by Mason Foster and Preston Smith.","(6:56) Penalty: Holding on Minnesota (Joe Berger) -10 yards.","(7:25) Sam Bradford pass to the middle to Kyle Rudolph for 20 yards to the Was45. Tackled by Kendall Fuller.","(8:04) Ronnie Hillman rush to the right for a loss of 6 yards to the Min35. Tackled by Su'a Cravens.","(8:36) Sam Bradford pass to the left to Jerick McKinnon for 12 yards to the Min41. Tackled by Mason Foster.","(9:04) Jerick McKinnon rush to the left for 4 yards to the Min29. Tackled by Mason Foster and Ricky Jean Francois.","(9:04) Dustin Hopkins kicks off to the endzone. Touchback.","(9:04) Dustin Hopkins extra point is good.","(9:04) Penalty: Encroachment on Minnesota (Linval Joseph) 5 yards.","(9:11) Kirk Cousins pass to the right to Jamison Crowder for 4 yards for a TOUCHDOWN.","(9:16) Kirk Cousins incomplete pass to the right intended for Jordan Reed defensed by Anthony Barr defensed by Eric Kendricks.","(9:52) Rob Kelley rush to the right for 3 yards to the Min4. Tackled by Shamar Stephen and Andrew Sendejo.","(10:33) Rob Kelley rush to the left for 4 yards to the Min7. Tackled by Xavier Rhodes and Chad Greenway.","(11:13) Chris Thompson rush to the right for 9 yards to the Min11. Tackled by Eric Kendricks and Anthony Barr.","(11:19) Kirk Cousins incomplete pass to the right intended for Jordan Reed.","(11:54) Jamison Crowder rush to the right for 7 yards to the Min20. Tackled by Andrew Sendejo.","(12:29) Rob Kelley rush to the left for 4 yards to the Min27. Tackled by Shamar Stephen and Harrison Smith.","(13:03) Kirk Cousins pass to the right to Jordan Reed for 25 yards to the Min31.","(13:23) Kirk Cousins pass to the left to Pierre Garcon for 12 yards to the Was44. Tackled by Xavier Rhodes.","(13:32) Jeff Locke punts for 40 yards to Was31. Jamison Crowder return for 1 yard to Was32. Tackled by Kentrell Brothers.","(13:37) Sam Bradford incomplete pass to the left intended for Kyle Rudolph.","(14:24) Jerick McKinnon rush to the right for a loss of 2 yards to the Min29. Tackled by Mason Foster and Ryan Kerrigan.","(15:00) Sam Bradford pass to the left to Rhett Ellison for 6 yards to the Min31. Tackled by Donte Whitner.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback."]