["(0:33) Carson Wentz rush up the middle for a loss of 1 yard to the Phi45.","(0:48) Carson Wentz rush up the middle for a loss of 1 yard to the Phi46.","(1:27) Carson Wentz rush up the middle for a loss of 1 yard to the Phi47.","(1:33) Matt Ryan pass intended for Julio Jones INTERCEPTED by Leodis McKelvin. No return. Tackled by Julio Jones.","(1:37) Matt Ryan incomplete pass to the middle intended for Austin Hooper.","(1:55) Matt Ryan pass to the right to Julio Jones for 16 yards to the Atl41. Tackled by Nigel Bradham.","(1:57) Caleb Sturgis kicks off to the endzone. Touchback.","(1:57) Two Minute Warning.","(2:00) Caleb Sturgis 48 yard field goal attempt is GOOD. Holder: Donnie Jones.","(2:01) Philadelphia Eagles timeout.","(2:01) Atlanta Falcons timeout.","(2:08) Wendell Smallwood rush up the middle for 2 yards to the Atl31. Tackled by Grady Jarrett.","(2:08) Atlanta Falcons timeout.","(2:12) Wendell Smallwood rush up the middle for 2 yards to the Atl33. Tackled by Philip Wheeler.","(2:12) Atlanta Falcons timeout.","(2:19) Wendell Smallwood rush to the right for 4 yards to the Atl35. Tackled by Ricardo Allen.","(2:24) Matt Ryan incomplete pass to the left intended for Julio Jones.","(3:09) Matt Ryan pass to the right to Devonta Freeman for 9 yards to the Atl40. Tackled by Nigel Bradham.","(3:15) Penalty: Pass Interference on Atlanta (Joshua Perkins) -10 yards.","(3:22) Matt Ryan incomplete pass to the left intended for Taylor Gabriel defensed by Leodis McKelvin.","(3:55) Devonta Freeman rush up the middle for 6 yards to the Atl41. Tackled by Jordan Hicks.","(4:04) Donnie Jones punts for 43 yards to Atl20. No return. Penalty: Unnecessary Roughness on Philadelphia (Najee Goode) 15 yards.","(4:06) Carson Wentz incomplete pass to the right intended for Nelson Agholor.","(4:47) Wendell Smallwood rush to the left for 3 yards to the Phi37. Tackled by Tyson Jackson.","(5:25) Wendell Smallwood rush to the left for 6 yards to the Phi34. Tackled by Philip Wheeler.","(5:36) Matt Bryant punts for 36 yards to Phi28. No return.","(5:42) Matt Ryan incomplete pass to the left intended for Julio Jones.","(6:20) Matt Ryan pass to the left to Austin Hooper for 8 yards to the Atl36. Tackled by Jalen Mills and Nigel Bradham.","(6:26) Matt Ryan incomplete pass to the right. Penalty: Intentional Grounding on Atlanta (Matt Ryan) -10 yards.","(6:33) Penalty: Pass Interference on Philadelphia (Jalen Mills) 17 yards.","(6:41) Matt Ryan pass to the left to Julio Jones for 9 yards to the Atl21. Tackled by Jalen Mills.","(6:49) Caleb Sturgis kicks off to the Atl-1. Eric Weems return for 23 yards to Atl22. Tackled by Malcolm Jenkins. Penalty: Holding on Atlanta (Brian Poole) -10 yards.","(6:49) Ryan Mathews 2 pt rush attempt. Successful.","(6:49) Penalty: Holding on Atlanta (Paul Worrilow) 1 yards.","(6:53) Ryan Mathews rush to the right for 5 yards for a TOUCHDOWN.","(6:57) Penalty: Pass Interference on Atlanta (Brian Poole) 21 yards.","(7:24) Carson Wentz pass to the middle to Darren Sproles for 7 yards to the Atl26. Tackled by LaRoy Reynolds.","(7:52) Carson Wentz pass to the left to Darren Sproles for 4 yards to the Atl33. Tackled by Deion Jones.","(8:19) Penalty: Offside on Atlanta (Vic Beasley Jr.) 5 yards.","(8:38) Penalty: False Start on Philadelphia (Zach Ertz) -5 yards.","(9:03) Darren Sproles rush to the left for 8 yards to the Atl37. Tackled by Jalen Collins.","(9:07) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(9:33) Carson Wentz pass to the middle to Zach Ertz for 8 yards to the Atl45. Tackled by Brian Poole.","(10:00) Carson Wentz pass to the right to Darren Sproles for 5 yards to the Phi47. Tackled by Jalen Collins.","(10:25) Carson Wentz pass to the right to Zach Ertz for 18 yards to the Phi42. Tackled by Keanu Neal.","(10:32) Matt Bryant punts for 31 yards to Phi24. No return.","(10:35) Matt Ryan incomplete pass to the right intended for Taylor Gabriel.","(10:40) Matt Ryan incomplete pass to the left intended for Julio Jones.","(10:46) Matt Ryan incomplete pass to the left intended for Taylor Gabriel.","(10:50) 55 yard field goal attempt by Caleb Sturgis is NO GOOD. Holder: Donnie Jones.","(10:56) Carson Wentz incomplete pass to the middle intended for Jordan Matthews defensed by Keanu Neal.","(10:58) Penalty: Delay of Game on Philadelphia (Carson Wentz) -5 yards.","(11:02) Carson Wentz incomplete pass to the right intended for Darren Sproles defensed by Deion Jones.","(11:39) Carson Wentz pass to the right to Nelson Agholor for 3 yards to the Atl31. Tackled by Deion Jones.","(12:29) Ryan Mathews rush to the right for 3 yards to the Atl34. Tackled by Grady Jarrett.","(13:06) Carson Wentz pass to the middle to Zach Ertz for 8 yards to the Atl37. Tackled by Deion Jones.","(13:15) Matt Bosher kicks off to the Phi3. Kenjon Barner return for 52 yards to Atl45. Tackled by LaRoy Reynolds.","(13:15) Matt Bryant extra point is NO GOOD.","(13:25) Matt Ryan pass to the right to Taylor Gabriel for 76 yards for a TOUCHDOWN.","(13:50) Devonta Freeman rush up the middle for a loss of 1 yard to the Atl24. Tackled by Rodney McLeod.","(13:50) Caleb Sturgis kicks off to the endzone. Touchback.","(13:52) Caleb Sturgis 25 yard field goal attempt is GOOD. Holder: Donnie Jones.","(14:11) Penalty: Delay of Game on Philadelphia (Donnie Jones) -5 yards.","(15:00) Ryan Mathews rush to the left for a loss of 1 yard to the Atl2. Tackled by Philip Wheeler.","(0:12) Ryan Mathews rush to the left for 1 yard to the Atl1. Tackled by Paul Worrilow.","(0:50) Ryan Mathews rush up the middle for 5 yards to the Atl2. Tackled by Keanu Neal.","(1:17) Ryan Mathews rush up the middle for 14 yards to the Atl7. Tackled by Ricardo Allen.","(2:02) Carson Wentz rush up the middle for 13 yards to the Atl21. Tackled by Deion Jones.","(2:44) Carson Wentz pass to the right to Jordan Matthews for a loss of 2 yards to the Atl34. Tackled by Jalen Collins.","(3:14) Ryan Mathews rush to the left for 20 yards to the Atl32. Tackled by Ricardo Allen.","(3:59) Carson Wentz pass to the left to Brent Celek for 9 yards to the Phi48. Tackled by Keanu Neal. FUMBLE, recovered by Phi (Brent Celek).","(4:39) Wendell Smallwood rush up the middle for 5 yards to the Phi39. Tackled by Ra'Shede Hageman.","(4:46) Matt Bosher kicks off to the Phi3. Kenjon Barner return for 31 yards to Phi34. Tackled by LaRoy Reynolds.","(4:50) Matt Bryant 46 yard field goal attempt is GOOD. Holder: Matt Bosher.","(5:30) Matt Ryan pass to the left to Julio Jones for 9 yards to the Phi28. Tackled by Malcolm Jenkins.","(5:35) Matt Ryan incomplete pass to the left intended for Terron Ward defensed by Mychal Kendricks.","(6:13) Terron Ward rush to the right for a loss of 1 yard to the Phi37. Tackled by Vinny Curry.","(6:50) Devonta Freeman rush up the middle for 5 yards to the Phi36. Tackled by Brandon Graham.","(6:56) Matt Ryan incomplete pass to the middle intended for Taylor Gabriel defensed by Leodis McKelvin.","(7:32) Devonta Freeman rush up the middle for 6 yards to the Phi41. Tackled by Jordan Hicks.","(8:16) Matt Ryan pass to the left to Julio Jones for 28 yards to the Phi47. Tackled by Jalen Mills.","(8:16) Caleb Sturgis kicks off to the endzone. Touchback.","(8:18) Caleb Sturgis 29 yard field goal attempt is GOOD. Holder: Donnie Jones.","(8:22) Carson Wentz incomplete pass to the left intended for Nelson Agholor.","(9:02) Carson Wentz pass to the right to Darren Sproles for 6 yards to the Atl11. Tackled by Keanu Neal.","(9:28) Carson Wentz pass to the right to Nelson Agholor for 4 yards to the Atl17.","(9:55) Ryan Mathews rush to the right for 1 yard to the Atl11. Tackled by Robert Alford. Penalty: Holding on Philadelphia (Jason Kelce) -10 yards.","(10:32) Carson Wentz pass to the middle to Zach Ertz for 8 yards to the Atl12. Tackled by Grady Jarrett and Deion Jones.","(10:54) Wendell Smallwood rush to the left for 12 yards to the Atl20. Tackled by Keanu Neal.","(10:59) Carson Wentz incomplete pass to the left intended for Wendell Smallwood.","(11:17) Penalty: False Start on Philadelphia (Isaac Seumalo) -5 yards.","(11:58) Wendell Smallwood rush to the left for 19 yards to the Atl27. Tackled by Jalen Collins.","(12:33) Darren Sproles rush up the middle for 11 yards to the Atl46. Tackled by De'Vondre Campbell.","(13:03) Carson Wentz pass to the right to Darren Sproles for 12 yards to the Phi43.","(13:37) Carson Wentz pass to the right to Darren Sproles for 7 yards to the Phi31. Tackled by Deion Jones.","(14:16) Ryan Mathews rush to the right for 1 yard to the Phi24. Tackled by Deion Jones and Jonathan Babineaux.","(14:56) Ryan Mathews rush to the right for 4 yards to the Phi23. Tackled by Grady Jarrett.","(15:00) Matt Bosher kicks off to the Phi2. Wendell Smallwood return for 17 yards to Phi19. Tackled by Paul Worrilow.","(0:03) Matt Ryan incomplete pass to the left.","(0:08) Carson Wentz incomplete pass to the right intended for Nelson Agholor.","(0:08) Philadelphia Eagles timeout.","(0:15) Carson Wentz pass to the middle to Darren Sproles for 9 yards to the Atl48. Tackled by Robert Alford.","(0:21) Carson Wentz incomplete pass to the middle intended for Jordan Matthews.","(0:25) Carson Wentz incomplete pass to the left intended for Darren Sproles defensed by De'Vondre Campbell.","(0:30) 53 yard field goal attempt by Matt Bryant is NO GOOD. Holder: Matt Bosher.","(0:30) Philadelphia Eagles timeout.","(0:46) Matt Ryan pass to the right to Julio Jones for 5 yards to the Phi35. Tackled by Malcolm Jenkins and Jalen Mills.","(0:46) Philadelphia Eagles timeout.","(0:56) Matt Ryan pass to the left to Julio Jones for 8 yards to the Phi40. Tackled by Malcolm Jenkins and Nolan Carroll.","(1:27) Matt Ryan sacked at Phi48 for a loss of 6 yards by Brandon Graham.","(1:36) Carson Wentz sacked at Atl48 for a loss of 5 yards by Vic Beasley Jr.. FUMBLE, recovered by Atl (Brian Poole) and returned for 10 yards. Tackled by Jordan Matthews.","(1:38) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(2:00) Carson Wentz pass to the middle to Jordan Matthews for 20 yards to the Atl43. Tackled by LaRoy Reynolds.","(2:00) Penalty: False Start on Philadelphia (Zach Ertz) -5 yards.","(2:00) Two Minute Warning.","(2:14) Wendell Smallwood rush up the middle for 3 yards to the Phi42. Tackled by LaRoy Reynolds.","(2:53) Ryan Mathews rush up the middle for 21 yards to the Phi39. Tackled by Ricardo Allen.","(2:59) Matt Bosher kicks off to the Phi3. Wendell Smallwood return for 15 yards to Phi18. Tackled by Eric Weems.","(3:03) Matt Bryant 43 yard field goal attempt is GOOD. Holder: Matt Bosher.","(3:08) Matt Ryan incomplete pass to the left intended for Austin Hooper.","(3:51) Matt Ryan sacked at Phi25 for a loss of 6 yards by Connor Barwin.","(4:33) Devonta Freeman rush up the middle for a loss of 2 yards to the Phi19. Tackled by Malcolm Jenkins.","(5:11) Devonta Freeman rush to the right for 17 yards to the Phi17. Tackled by Mychal Kendricks.","(5:48) Matt Ryan pass to the left to Julio Jones for 20 yards to the Phi34. Tackled by Rodney McLeod.","(6:30) Matt Ryan pass to the left to Julio Jones for 5 yards to the Atl46. Tackled by Mychal Kendricks.","(7:06) Devonta Freeman rush to the right for 1 yard to the Atl41. Tackled by Malcolm Jenkins.","(7:35) Matt Ryan pass to the right to Devonta Freeman for 15 yards to the Atl40. Tackled by Mychal Kendricks.","(7:47) Donnie Jones punts for 43 yards to Atl16. Eric Weems return for 9 yards to Atl25. Tackled by Wendell Smallwood.","(8:25) Carson Wentz pass to the right to Ryan Mathews for 10 yards to the Phi41. Tackled by Jalen Collins.","(8:48) Penalty: False Start on Philadelphia (Jason Peters) -5 yards.","(9:26) Ryan Mathews rush to the left for 1 yard to the Phi36. Tackled by Paul Worrilow.","(9:30) Carson Wentz incomplete pass to the right intended for Zach Ertz.","(9:36) Matt Bosher kicks off to the Phi4. Kenjon Barner return for 31 yards to Phi35. Tackled by Matt Bosher.","(9:40) Matt Bryant 38 yard field goal attempt is GOOD. Holder: Matt Bosher.","(10:19) Matt Ryan pass to the middle to Mohamed Sanu for 6 yards to the Phi20. Tackled by Malcolm Jenkins.","(11:04) Matt Ryan pass to the left to Aldrick Robinson for 2 yards to the Phi26. Tackled by Nolan Carroll.","(11:42) Devonta Freeman rush to the left for a loss of 2 yards to the Phi28. Tackled by Connor Barwin.","(12:00) Matt Ryan pass to the left to Julio Jones for 29 yards to the Phi26.","(12:40) Devonta Freeman rush up the middle for 11 yards to the Atl45. Tackled by Jalen Mills.","(12:43) 44 yard field goal attempt by Caleb Sturgis is NO GOOD. Holder: Donnie Jones.","(13:19) Carson Wentz pass to the right to Zach Ertz for a loss of 1 yard to the Atl26. Tackled by Keanu Neal.","(14:04) Wendell Smallwood rush up the middle for 1 yard to the Atl25. Tackled by Deion Jones.","(14:39) Wendell Smallwood rush up the middle for 1 yard to the Atl26. Tackled by Vic Beasley Jr..","(15:00) Carson Wentz pass to the right to Jordan Matthews for 20 yards to the Atl27.","(0:42) Wendell Smallwood rush to the left for 7 yards to the Atl47. Tackled by Philip Wheeler.","(1:23) Carson Wentz sacked at Phi46 for a loss of 5 yards by Vic Beasley Jr..","(1:56) Carson Wentz pass to the right to Ryan Mathews for 20 yards to the Atl49. Tackled by Deion Jones.","(2:37) Carson Wentz pass to the right to Jordan Matthews for 9 yards to the Phi31. Tackled by Brian Poole.","(2:44) Matt Bosher punts for 45 yards to Phi22. No return.","(3:25) Matt Ryan pass to the right to Mohamed Sanu for 8 yards to the Atl33. Tackled by Malcolm Jenkins.","(4:04) Devonta Freeman rush up the middle for 4 yards to the Atl25. Tackled by Nigel Bradham.","(4:11) Matt Ryan incomplete pass to the right intended for Julio Jones defensed by Nigel Bradham.","(4:11) Penalty: False Start on Atlanta (Chris Chester) -5 yards.","(4:17) Caleb Sturgis kicks off to the Atl-2. Eric Weems return for 28 yards to Atl26. Tackled by Marcus Smith.","(4:17) Caleb Sturgis extra point is good.","(4:19) Ryan Mathews rush to the left for 4 yards for a TOUCHDOWN.","(4:19) Atlanta Falcons timeout.","(4:42) Ryan Mathews rush up the middle for 8 yards to the Atl4. Tackled by Deion Jones.","(5:20) Ryan Mathews rush to the left for 6 yards to the Atl12. Tackled by Ra'Shede Hageman.","(5:59) Ryan Mathews rush up the middle for 5 yards to the Atl18. Tackled by Grady Jarrett.","(6:42) Ryan Mathews rush to the left for 5 yards to the Atl23. Tackled by Keanu Neal.","(7:12) Carson Wentz pass to the left to Darren Sproles for 7 yards to the Atl28.","(7:51) Carson Wentz pass to the middle to Jordan Matthews for 16 yards to the Atl35. Tackled by Ricardo Allen.","(8:30) Wendell Smallwood rush to the left for 5 yards to the Phi49. Tackled by Paul Worrilow and Ra'Shede Hageman.","(9:06) Carson Wentz pass to the right to Zach Ertz for 14 yards to the Phi44. Tackled by Jalen Collins.","(9:30) Penalty: False Start on Philadelphia (Zach Ertz) -5 yards.","(10:01) Carson Wentz pass to the right to Jordan Matthews for 10 yards to the Phi35.","(10:46) Ryan Mathews rush to the left for 4 yards to the Phi25. Tackled by Deion Jones.","(11:31) Ryan Mathews rush to the left for 2 yards to the Phi21. Tackled by Courtney Upshaw and Vic Beasley Jr..","(11:42) Matt Bosher punts for 50 yards to Phi19. No return.","(11:47) Matt Ryan incomplete pass to the left intended for Julio Jones.","(12:13) Penalty: False Start on Atlanta (Ryan Schraeder) -5 yards.","(12:56) Devonta Freeman rush to the left for no gain to the Atl36. Tackled by Brandon Graham.","(13:36) Matt Ryan pass to the left to Devonta Freeman for 8 yards to the Atl36. Tackled by Rodney McLeod.","(14:13) Matt Ryan pass to the right to Julio Jones for 6 yards to the Atl28. Tackled by Jalen Mills.","(14:54) Devonta Freeman rush to the right for 4 yards to the Atl22. Tackled by Fletcher Cox and Jordan Hicks.","(15:00) Caleb Sturgis kicks off to the Atl-5. Eric Weems return for 23 yards to Atl18. Tackled by Najee Goode."]