["(0:37) Derek Carr rush up the middle for a loss of 1 yard to the Den47.","(1:15) Derek Carr rush up the middle for a loss of 1 yard to the Den46.","(1:57) Derek Carr rush up the middle for a loss of 1 yard to the Den45.","(1:57) Two Minute Warning.","(2:06) Trevor Siemian pass intended for Jordan Norwood INTERCEPTED by Reggie Nelson and returned for 7 yards. Tackled by Donald Stephenson.","(2:09) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(2:15) Trevor Siemian incomplete pass to the left intended for Devontae Booker.","(2:20) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(2:30) Marquette King punts for 41 yards to Den16. Jordan Norwood return for 12 yards to Den28. Tackled by Nate Allen.","(2:31) Oakland Raiders timeout.","(3:16) Jalen Richard rush up the middle for 1 yard to the Oak43. Tackled by Jared Crick.","(3:17) Denver Broncos timeout.","(3:22) Jalen Richard rush to the right for 3 yards to the Oak42. Tackled by Will Parks.","(3:22) Denver Broncos timeout.","(3:27) Jalen Richard rush up the middle for 6 yards to the Oak39. Tackled by Darian Stewart.","(3:32) Penalty: Holding on Oakland (Kelechi Osemele) -10 yards.","(3:37) Derek Carr pass to the left to Amari Cooper for 9 yards to the Oak43. Tackled by Bradley Roby.","(3:37) Denver Broncos timeout.","(3:42) Jalen Richard rush to the left for 5 yards to the Oak34. Tackled by Chris Harris Jr..","(4:26) Latavius Murray rush up the middle for a loss of 3 yards to the Oak29. Tackled by Sylvester Williams.","(5:13) Latavius Murray rush to the left for 13 yards to the Oak32. Tackled by Chris Harris Jr..","(5:18) Brandon McManus kicks off to the Oak4. Taiwan Jones return for 15 yards to Oak19. Tackled by Shaquil Barrett.","(5:18) Brandon McManus extra point is good.","(5:34) Trevor Siemian pass to the left to Kapri Bibbs for 69 yards for a TOUCHDOWN.","(6:00) Penalty: False Start on Denver (Demaryius Thomas) -5 yards.","(6:09) Trevor Siemian pass to the right to Emmanuel Sanders for 11 yards to the Den36. Tackled by David Amerson.","(6:09) Sebastian Janikowski kicks off to the endzone. Touchback.","(6:09) Sebastian Janikowski extra point is good.","(6:13) Latavius Murray rush up the middle for 1 yard for a TOUCHDOWN.","(6:16) Penalty: Pass Interference on Denver (Chris Harris Jr.) 1 yards.","(6:19) Derek Carr incomplete pass to the right intended for Andre Holmes.","(6:24) Penalty: Holding on Denver (Chris Harris Jr.) 3 yards.","(6:30) Penalty: Pass Interference on Denver (Taurean Nixon) 31 yards.","(7:09) Latavius Murray rush to the left for 3 yards to the Den36. Tackled by Shaquil Barrett.","(7:13) Derek Carr incomplete pass to the right intended for Jamize Olawale.","(7:26) Trevor Siemian sacked at Den39 for a loss of 8 yards by Khalil Mack. FUMBLE, recovered by Oak (Khalil Mack). Tackled by Donald Stephenson.","(7:30) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(7:59) Trevor Siemian pass to the left to Jordan Norwood for 20 yards to the Den47. Tackled by Malcolm Smith.","(8:19) Devontae Booker rush up the middle for 2 yards to the Den27. Tackled by Malcolm Smith.","(8:19) Sebastian Janikowski kicks off to the endzone. Touchback.","(8:23) Sebastian Janikowski 35 yard field goal attempt is GOOD. Holder: Marquette King.","(9:11) Derek Carr pass to the right to Michael Crabtree for 14 yards to the Den17. Tackled by Darian Stewart.","(9:18) Penalty: Holding on Oakland (Donald Penn) -10 yards.","(10:03) Latavius Murray rush to the left for 3 yards to the Den21. Tackled by Brandon Marshall.","(10:48) Derek Carr sacked at Den24 for no gain by Bradley Roby.","(11:24) Derek Carr pass to the right to Amari Cooper for 7 yards to the Den24. Tackled by T.J. Ward and Bradley Roby.","(12:07) DeAndre Washington rush to the right for 4 yards to the Den31. Tackled by Sylvester Williams.","(12:49) Derek Carr pass to the right to Clive Walford for 15 yards to the Den35. Tackled by T.J. Ward.","(13:32) DeAndre Washington rush up the middle for 4 yards to the Oak50. Tackled by Shane Ray.","(14:15) Latavius Murray rush to the right for 8 yards to the Oak46. Tackled by Darian Stewart.","(14:56) Derek Carr pass to the left to Michael Crabtree for 13 yards to the Oak38. Tackled by Chris Harris Jr..","(14:56) Brandon McManus kicks off to the endzone. Touchback.","(15:00) Brandon McManus 44 yard field goal attempt is GOOD. Holder: Riley Dixon.","(0:25) Trevor Siemian pass to the right to Emmanuel Sanders for 8 yards to the Oak26. Tackled by Malcolm Smith.","(0:29) Trevor Siemian incomplete pass to the right intended for Devontae Booker.","(0:37) Trevor Siemian incomplete pass to the left. Penalty: Intentional Grounding on Denver (Trevor Siemian) -10 yards.","(0:42) Penalty: Holding on Oakland (Cory James) 5 yards.","(1:20) Kapri Bibbs rush up the middle for 1 yard to the Oak29. Tackled by Darius Latham.","(1:56) Trevor Siemian pass to the left to Virgil Green for 26 yards to the Oak30. Tackled by Malcolm Smith.","(2:28) Trevor Siemian pass to the left to Emmanuel Sanders for 18 yards to the Den44. Tackled by DJ Hayden.","(3:00) Devontae Booker rush up the middle for 5 yards to the Den26. Tackled by Darius Latham.","(3:43) Trevor Siemian sacked at Den21 for a loss of 9 yards by Khalil Mack.","(3:48) Penalty: Pass Interference on Oakland (DJ Hayden) 27 yards.","(4:30) Devontae Booker rush up the middle for 2 yards to the Den3. Tackled by Perry Riley Jr. and Khalil Mack.","(4:34) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(4:43) Marquette King punts for 40 yards to Den2. No return. Penalty: Holding on Denver (Taurean Nixon) -1 yards.","(5:26) Derek Carr pass to the right to DeAndre Washington for no gain to the Den42. Tackled by Bradley Roby.","(6:02) DeAndre Washington rush up the middle for 6 yards to the Den42. Tackled by Bradley Roby and Will Parks.","(6:43) DeAndre Washington rush to the left for 1 yard to the Den48. Tackled by T.J. Ward.","(7:07) Jalen Richard rush to the left for 10 yards to the Den49. Tackled by Bradley Roby.","(7:45) Latavius Murray rush up the middle for 5 yards to the Oak41. Tackled by Sylvester Williams.","(7:55) Riley Dixon punts for 59 yards to Oak30. Jalen Richard return for 6 yards to Oak36. Tackled by Zaire Anderson and Shaquil Barrett.","(8:03) Trevor Siemian pass to the right to Emmanuel Sanders for 3 yards to the Den11. Tackled by Malcolm Smith.","(8:43) Trevor Siemian pass to the left to Demaryius Thomas for 6 yards to the Den8. Tackled by DJ Hayden.","(8:49) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(8:57) Marquette King punts for 37 yards to Den2. No return.","(9:04) Derek Carr incomplete pass to the right.","(9:45) Jamize Olawale rush up the middle for 4 yards to the Den39. Tackled by Corey Nelson.","(10:26) Derek Carr pass to the left to Clive Walford for a loss of 2 yards to the Den43. Tackled by Corey Nelson.","(10:26) Oakland Raiders timeout.","(11:09) Latavius Murray rush up the middle for 5 yards to the Den41. Tackled by Todd Davis.","(11:53) Derek Carr pass to the left to Mychal Rivera for 6 yards to the Den46. Tackled by Todd Davis.","(12:17) Penalty: Offside on Denver (Shaquil Barrett) 5 yards.","(12:58) Derek Carr rush to the right for 6 yards to the Oak43. Tackled by Shaquil Barrett.","(13:43) Latavius Murray rush up the middle for 3 yards to the Oak37. Tackled by Darian Stewart.","(14:25) DeAndre Washington rush up the middle for 2 yards to the Oak34. Tackled by Sylvester Williams.","(15:00) DeAndre Washington rush up the middle for 7 yards to the Oak32. Tackled by Shaquil Barrett.","(15:00) Brandon McManus kicks off to the endzone. Touchback.","(0:02) Brandon McManus 55 yard field goal attempt is GOOD. Holder: Riley Dixon.","(0:02) Oakland Raiders timeout.","(0:02) Denver Broncos timeout.","(0:14) Trevor Siemian pass to the right to Demaryius Thomas for 7 yards to the Oak37. Tackled by David Amerson.","(0:22) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(0:27) Penalty: Holding on Oakland (TJ Carrie) 5 yards.","(0:33) Trevor Siemian incomplete pass to the left intended for Jordan Norwood defensed by Denico Autry.","(0:53) Trevor Siemian pass to the left to Demaryius Thomas for 7 yards to the Oak49. Tackled by TJ Carrie.","(1:15) Trevor Siemian pass to the left to Demaryius Thomas for 13 yards to the Den44. Tackled by TJ Carrie.","(1:19) Trevor Siemian pass to the right to Virgil Green for 11 yards to the Den31. Tackled by Malcolm Smith.","(1:25) Sebastian Janikowski kicks off to the Den4. Kapri Bibbs return for 16 yards to Den20. Tackled by Keith McGill and Brynden Trawick.","(1:25) Sebastian Janikowski extra point is good.","(1:29) Latavius Murray rush to the left for 1 yard for a TOUCHDOWN.","(1:32) Penalty: Pass Interference on Denver (Lorenzo Doss) 5 yards.","(1:37) Penalty: Illegal Plyr Downfld on Oakland (Donald Penn) -5 yards.","(1:42) Penalty: Pass Interference on Denver (Bradley Roby) 23 yards.","(1:42) Denver Broncos timeout.","(1:48) DeAndre Washington rush to the right for no gain to the Den24. Tackled by Darian Stewart.","(1:52) Derek Carr incomplete pass to the left intended for Amari Cooper.","(2:00) Latavius Murray rush to the left for 42 yards to the Den24. Tackled by T.J. Ward.","(2:00) Two Minute Warning.","(2:24) Jalen Richard rush to the left for 7 yards to the Oak34. Tackled by Chris Harris Jr..","(3:04) Derek Carr pass to the left to Amari Cooper for 2 yards to the Oak27. Tackled by Chris Harris Jr..","(3:13) Riley Dixon punts for 34 yards to Oak19. TJ Carrie return for 6 yards to Oak25. Tackled by Corey Nelson.","(3:17) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas defensed by DJ Hayden.","(3:17) Denver Broncos timeout.","(4:01) Devontae Booker rush to the left for 2 yards to the Den47. Tackled by Perry Riley Jr..","(4:33) Trevor Siemian pass to the right to Emmanuel Sanders for 7 yards to the Den45. Tackled by David Amerson.","(4:37) 48 yard field goal attempt by Sebastian Janikowski is NO GOOD. Holder: Marquette King.","(4:43) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(4:49) Derek Carr incomplete pass to the right intended for Jalen Richard.","(5:34) Derek Carr pass to the right to Jalen Richard for a loss of 1 yard to the Den30. Tackled by Brandon Marshall and Shaquil Barrett.","(5:57) Penalty: Delay of Game on Oakland (Derek Carr) -5 yards.","(6:47) Jalen Richard rush to the left for 28 yards to the Den24. Tackled by Shane Ray and Von Miller.","(7:33) Derek Carr pass to the right to Latavius Murray for 13 yards to the Oak48. Tackled by Darian Stewart.","(8:16) Latavius Murray rush up the middle for 1 yard to the Oak35. Tackled by T.J. Ward and Shane Ray.","(8:22) Brandon McManus kicks off to the Oak8. Jalen Richard return for 26 yards to Oak34. Tackled by Justin Simmons.","(8:22) Brandon McManus extra point is good.","(8:31) Trevor Siemian pass to the right to Jordan Norwood for 36 yards for a TOUCHDOWN.","(9:07) Kapri Bibbs rush to the left for 10 yards to the Oak36. Tackled by Malcolm Smith.","(9:42) Trevor Siemian pass to the right to Jordan Taylor for 6 yards to the Oak46. Tackled by David Amerson.","(10:18) Devontae Booker rush to the left for 3 yards to the Den48. Tackled by Bruce Irvin.","(10:39) Trevor Siemian pass to the left to Demaryius Thomas for 23 yards to the Den45. Tackled by TJ Carrie.","(11:21) Devontae Booker rush up the middle for a loss of 2 yards to the Den22. Tackled by Darius Latham.","(11:53) Trevor Siemian pass to the right to Devontae Booker for 8 yards to the Den24. Tackled by Malcolm Smith.","(12:01) Marquette King punts for 51 yards to Den26. No return. Penalty: Holding on Denver (Justin Simmons) -10 yards.","(12:05) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(12:05) Penalty: False Start on Oakland (Michael Crabtree) -5 yards.","(12:09) Derek Carr incomplete pass to the left intended for Michael Crabtree.","(12:48) DeAndre Washington rush to the right for 2 yards to the Oak28. Tackled by Sylvester Williams and Adam Gotsis.","(12:55) Riley Dixon punts for 43 yards to Oak27. Jalen Richard return for a loss of 1 yard to Oak26. Tackled by Bennie Fowler.","(12:59) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(13:36) Devontae Booker rush to the left for 1 yard to the Den30. Tackled by Denico Autry.","(14:07) Devontae Booker rush to the left for 4 yards to the Den29. Tackled by Denico Autry.","(14:07) Sebastian Janikowski kicks off to the endzone. Touchback.","(14:07) Sebastian Janikowski extra point is good.","(14:11) Latavius Murray rush up the middle for 1 yard for a TOUCHDOWN.","(14:54) Latavius Murray rush up the middle for no gain to the Den1. Tackled by DeMarcus Ware and Corey Nelson.","(15:00) Latavius Murray rush to the left for 8 yards to the Den1. Tackled by Darian Stewart.","(0:15) Derek Carr pass to the right to Seth Roberts for 10 yards to the Den9. Tackled by T.J. Ward and Corey Nelson.","(0:59) Latavius Murray rush up the middle for 6 yards to the Den19. Tackled by Corey Nelson.","(1:37) DeAndre Washington rush up the middle for 8 yards to the Den25. Tackled by T.J. Ward.","(2:04) Derek Carr pass to the right to Amari Cooper for 11 yards to the Den33. Tackled by Bradley Roby.","(2:57) Jalen Richard rush up the middle for 2 yards to the Den44. Tackled by Derek Wolfe and Shane Ray.","(3:35) Derek Carr pass to the left to Andre Holmes for 11 yards to the Den46.","(3:43) Riley Dixon punts for 35 yards to Oak43. No return.","(4:13) Trevor Siemian pass to the right to Bennie Fowler for 4 yards to the Den22. Tackled by David Amerson.","(4:17) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders defensed by Khalil Mack defensed by David Amerson.","(4:46) Devontae Booker rush up the middle for 3 yards to the Den18. Tackled by Perry Riley Jr..","(4:52) Sebastian Janikowski kicks off to the Den-5. Kapri Bibbs return for 20 yards to Den15. Tackled by Daren Bates and Cory James.","(4:54) Sebastian Janikowski 29 yard field goal attempt is GOOD. Holder: Marquette King.","(5:35) Derek Carr sacked at Den11 for a loss of 5 yards by Von Miller.","(6:20) Derek Carr pass to the right to Amari Cooper for 6 yards to the Den6. Tackled by Bradley Roby.","(6:27) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(6:31) Penalty: Holding on Denver (Bradley Roby) 5 yards.","(7:19) Derek Carr pass to the left to Andre Holmes for 16 yards to the Den17. Tackled by Darian Stewart.","(7:22) Derek Carr incomplete pass to the left intended for Amari Cooper.","(8:04) Latavius Murray rush up the middle for 3 yards to the Den33. Tackled by Chris Harris Jr..","(8:39) Derek Carr pass to the right to Seth Roberts for 21 yards to the Den36. Tackled by Bradley Roby.","(9:19) Latavius Murray rush to the left for 1 yard to the Oak43. Tackled by T.J. Ward.","(9:30) Riley Dixon punts for 48 yards to Oak31. Jalen Richard return for 11 yards to Oak42. Tackled by Andy Janovich.","(9:34) Trevor Siemian incomplete pass to the middle intended for Virgil Green.","(10:09) Devontae Booker rush to the left for 2 yards to the Den21. Tackled by Denico Autry.","(10:09) Penalty: False Start on Denver (Devontae Booker) -5 yards.","(10:16) Trevor Siemian incomplete pass to the right intended for A.J. Derby defensed by Karl Joseph.","(10:21) Sebastian Janikowski kicks off to the Den-2. Kapri Bibbs return for 26 yards to Den24. Tackled by Keith McGill and Antonio Hamilton.","(10:24) Sebastian Janikowski 24 yard field goal attempt is GOOD. Holder: Marquette King.","(11:07) Derek Carr pass to the right to Seth Roberts for 1 yard to the Den5. Tackled by Lorenzo Doss.","(11:49) Latavius Murray rush up the middle for 8 yards to the Den6. Tackled by Corey Nelson and Justin Simmons.","(11:53) Derek Carr incomplete pass to the right intended for Clive Walford defensed by Brandon Marshall.","(12:33) Derek Carr pass to the right to Amari Cooper for 21 yards to the Den14. Tackled by Taurean Nixon.","(13:16) DeAndre Washington rush up the middle for 1 yard to the Den35. Tackled by Derek Wolfe.","(13:56) Derek Carr pass to the right to Jalen Richard for 11 yards to the Den36. Tackled by Todd Davis.","(14:33) Latavius Murray rush to the right for 5 yards to the Den47. Tackled by Todd Davis.","(14:45) Riley Dixon punts for 48 yards to Oak38. Jalen Richard return for 10 yards to Oak48. Tackled by Dekoda Watson.","(14:50) Trevor Siemian incomplete pass to the middle intended for Demaryius Thomas defensed by Reggie Nelson.","(14:53) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders defensed by Dan Williams.","(14:56) Trevor Siemian incomplete pass to the left intended for Virgil Green.","(15:00) Sebastian Janikowski kicks off to the Den-3. Kapri Bibbs return for 17 yards to Den14. Tackled by Cory James."]