["(0:21) Andy Dalton rush up the middle for a loss of 1 yard to the Cin23.","(0:26) Carson Wentz incomplete pass to the right intended for Trey Burton.","(0:32) Carson Wentz incomplete pass to the left intended for Paul Turner.","(0:37) Carson Wentz incomplete pass to the right intended for Trey Burton.","(0:43) Carson Wentz pass to the left to Zach Ertz for 7 yards to the Cin24. Tackled by Adam Jones.","(1:04) Carson Wentz pass to the middle to Zach Ertz for 14 yards to the Cin31. Tackled by Vontaze Burfict.","(1:32) Carson Wentz pass to the right to Kenjon Barner for 2 yards to the Cin45. Tackled by Margus Hunt and Vontaze Burfict.","(1:35) Carson Wentz incomplete pass to the left intended for Paul Turner.","(1:57) Carson Wentz pass to the left to Trey Burton for 9 yards to the Cin47. Tackled by Karlos Dansby.","(1:57) Two Minute Warning.","(2:04) Carson Wentz pass to the middle to Paul Turner for 2 yards to the Phi44. Tackled by Darqueze Dennard.","(2:10) Carson Wentz pass to the left to Paul Turner for 15 yards to the Phi42. Tackled by Adam Jones.","(2:39) Carson Wentz pass to the middle to Darren Sproles for 6 yards to the Phi27. Tackled by Vontaze Burfict.","(2:45) Carson Wentz pass to the left to Zach Ertz for 8 yards to the Phi21. Tackled by Adam Jones.","(2:50) Mike Nugent kicks off to the Phi0. Wendell Smallwood return for 13 yards to Phi13. Tackled by Marquis Flowers.","(2:53) Mike Nugent 38 yard field goal attempt is GOOD. Holder: Kevin Huber.","(2:54) Cincinnati Bengals timeout.","(3:40) Jeremy Hill rush to the left for 5 yards to the Phi20. Tackled by Jalen Mills.","(3:40) Penalty: False Start on Cincinnati (Tyler Eifert) -5 yards.","(3:40) Philadelphia Eagles timeout.","(3:46) Jeremy Hill rush to the left for 5 yards to the Phi20. Tackled by Rodney McLeod and Connor Barwin.","(3:46) Philadelphia Eagles timeout.","(3:52) Jeremy Hill rush to the left for a loss of 5 yards to the Phi25. Tackled by Brandon Graham.","(4:03) Carson Wentz pass intended for Zach Ertz INTERCEPTED by Vontaze Burfict and returned for 47 yards. Tackled by Carson Wentz.","(4:29) Carson Wentz pass to the left to Paul Turner for 4 yards to the Cin31. Tackled by Adam Jones.","(5:08) Carson Wentz pass to the right to Darren Sproles for 3 yards to the Cin35. Tackled by Margus Hunt.","(5:14) Carson Wentz incomplete pass to the right intended for Nelson Agholor defensed by Carlos Dunlap.","(5:37) Carson Wentz pass to the right to Trey Burton for 10 yards to the Cin38.","(6:02) Carson Wentz pass to the left to Darren Sproles for 8 yards to the Cin48. Tackled by Adam Jones.","(6:14) Andy Dalton pass to the right to Jake Fisher for 12 yards to the Phi30. Tackled by Nigel Bradham. FUMBLE, recovered by Phi (Mychal Kendricks) and returned for 15 yards. Tackled by Ryan Hewitt.","(6:52) Rex Burkhead rush to the left for 6 yards to the Phi42. Tackled by Rodney McLeod.","(6:53) Caleb Sturgis onside kickoff to the Phi48. Onside kick recovered by receiving team by Brandon LaFell.","(6:53) Caleb Sturgis extra point is good.","(6:57) Darren Sproles rush to the right for 2 yards for a TOUCHDOWN.","(7:23) Darren Sproles rush to the right for 3 yards to the Cin2. Tackled by Will Clarke and Carlos Dunlap.","(7:46) Carson Wentz pass to the right to Nelson Agholor for 8 yards to the Cin5. Tackled by George Iloka.","(8:25) Carson Wentz sacked at Cin13 for a loss of 2 yards by Carlos Dunlap and DeShawn Williams.","(8:29) Carson Wentz incomplete pass to the right intended for Trey Burton defensed by Josh Shaw.","(8:56) Carson Wentz pass to the left to Darren Sproles for 7 yards to the Cin11. Tackled by Karlos Dansby.","(9:21) Carson Wentz pass to the left to Nelson Agholor for 8 yards to the Cin18. Tackled by Vincent Rey and Shawn Williams.","(9:25) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham defensed by Vontaze Burfict.","(9:55) Darren Sproles rush up the middle for 2 yards to the Cin26. Tackled by Geno Atkins and Vontaze Burfict.","(10:29) Carson Wentz pass to the left to Carson Wentz for 7 yards to the Cin28. Tackled by Vontaze Burfict.","(10:58) Carson Wentz pass to the middle to Paul Turner for 8 yards to the Cin35. Tackled by Adam Jones.","(11:35) Carson Wentz pass to the left to Zach Ertz for 4 yards to the Cin43. Tackled by Vincent Rey.","(12:07) Carson Wentz pass to the right to Dorial Green-Beckham for 2 yards to the Cin47. Tackled by Darqueze Dennard.","(12:36) Carson Wentz pass to the left to Darren Sproles for 5 yards to the Cin49. Tackled by Shawn Williams.","(12:57) Carson Wentz pass to the middle to Zach Ertz for 7 yards to the Phi46. Tackled by Vontaze Burfict.","(13:00) Kevin Huber punts for 49 yards to Phi32. Darren Sproles return for 7 yards to Phi39. Tackled by Darqueze Dennard.","(13:05) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(13:08) Andy Dalton incomplete pass to the right intended for Tyler Boyd defensed by Fletcher Cox.","(13:46) Rex Burkhead rush to the right for 5 yards to the Cin19. Tackled by Rodney McLeod and Vinny Curry.","(13:56) Carson Wentz pass intended for Zach Ertz INTERCEPTED by Shawn Williams defensed by George Iloka and returned for 1 yard. Tackled by Trey Burton.","(14:21) Carson Wentz pass to the left to Dorial Green-Beckham for 7 yards to the Cin46. Tackled by Adam Jones.","(14:28) Carson Wentz incomplete pass to the left intended for Trey Burton defensed by George Iloka.","(14:51) Carson Wentz pass to the right to Darren Sproles for 6 yards to the Phi47. Tackled by Vontaze Burfict.","(15:00) Andy Dalton pass to the left to Rex Burkhead for 9 yards to the Phi44. Tackled by Bennie Logan. FUMBLE, recovered by Phi (Jaylen Watkins). Tackled by Clint Boling.","(0:40) Jeremy Hill rush to the right for 2 yards to the Cin47. Tackled by Brandon Graham.","(1:20) Rex Burkhead rush to the left for 4 yards to the Cin45. Tackled by Brandon Graham and Malcolm Jenkins.","(1:52) Andy Dalton rush to the right for 10 yards to the Cin41. Tackled by Jaylen Watkins.","(2:30) Rex Burkhead rush to the left for 6 yards to the Cin31. Tackled by Brandon Graham.","(2:30) Caleb Sturgis kicks off to the endzone. Touchback.","(2:30) Caleb Sturgis extra point is good.","(2:36) Carson Wentz pass to the left to Zach Ertz for 13 yards for a TOUCHDOWN.","(2:36) Philadelphia Eagles timeout.","(2:42) Carson Wentz incomplete pass to the right intended for Zach Ertz.","(2:46) Carson Wentz incomplete pass to the left intended for Zach Ertz defensed by Vontaze Burfict.","(3:10) Darren Sproles rush up the middle for 5 yards to the Cin13. Tackled by Pat Sims.","(3:37) Carson Wentz pass to the left to Zach Ertz for 20 yards to the Cin18. Tackled by Shawn Williams and George Iloka.","(4:07) Carson Wentz pass to the left to Zach Ertz for no gain to the Cin38. Tackled by Darqueze Dennard.","(4:07) Mike Nugent kicks off to the Phi1. Kenjon Barner return for 61 yards to Cin38. Tackled by Mike Nugent.","(4:18) Mike Nugent 26 yard field goal attempt is GOOD. Holder: Kevin Huber.","(4:59) Andy Dalton pass to the right to Tyler Boyd for 7 yards to the Phi8. Tackled by Leodis McKelvin.","(5:37) Jeremy Hill rush to the right for 1 yard to the Phi15. Tackled by Marcus Smith.","(6:17) Jeremy Hill rush to the left for no gain to the Phi16. Tackled by Beau Allen and Jordan Hicks.","(6:58) Andy Dalton pass to the left to Tyler Boyd for 29 yards to the Phi16. Tackled by Jalen Mills.","(7:35) Jeremy Hill rush to the left for 4 yards to the Phi45. Tackled by Connor Barwin.","(7:54) Jeremy Hill rush to the left for 1 yard to the Cin36. Tackled by Nigel Bradham. Penalty: Unnecessary Roughness on Philadelphia (Nigel Bradham) 15 yards.","(8:19) Andy Dalton pass to the right to Rex Burkhead for 6 yards to the Cin20. Tackled by Leodis McKelvin and Malcolm Jenkins. Penalty: Unnecessary Roughness on Philadelphia (Jaylen Watkins) 15 yards.","(8:25) Andy Dalton incomplete pass to the right.","(9:00) Jeremy Hill rush to the left for no gain to the Cin14. Tackled by Nigel Bradham.","(9:12) Carson Wentz pass intended for Wendell Smallwood INTERCEPTED by Vontaze Burfict defensed by Carlos Dunlap and returned for 7 yards. Tackled by Stefen Wisniewski and Brandon Brooks. Penalty: Unnecessary Roughness on Cincinnati (Domata Peko) -13 yards.","(9:18) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham defensed by Domata Peko.","(9:57) Carson Wentz pass to the right to Paul Turner for 10 yards to the Cin23. Tackled by Vontaze Burfict.","(10:35) Nelson Agholor rush to the left for 4 yards to the Cin33. Tackled by George Iloka and Rey Maualuga.","(11:15) Carson Wentz pass to the right to Paul Turner for 41 yards to the Cin37. Tackled by George Iloka.","(11:21) Mike Nugent kicks off to the Phi-5. Kenjon Barner return for 27 yards to Phi22. Tackled by James Wright and Rex Burkhead.","(11:21) Mike Nugent extra point is good.","(11:26) Andy Dalton pass to the right to Brandon LaFell for 8 yards for a TOUCHDOWN.","(12:07) Jeremy Hill rush to the left for 2 yards to the Phi8. Tackled by Destiny Vaeao.","(12:41) Jeremy Hill rush to the right for 3 yards to the Phi10. Tackled by Jaylen Watkins.","(13:07) Jeremy Hill rush to the left for 7 yards to the Phi26. Tackled by Nigel Bradham. Penalty: Horse Collar Tackle on Philadelphia (Nigel Bradham) 13 yards.","(13:42) Jeremy Hill rush to the left for no gain to the Phi33. Tackled by Malcolm Jenkins and Beau Allen.","(14:15) Andy Dalton pass to the right to Brandon LaFell for 44 yards to the Phi33. Tackled by Leodis McKelvin.","(14:20) Andy Dalton incomplete pass to the right intended for Jeremy Hill.","(14:54) Jeremy Hill rush to the left for no gain to the Cin23. Tackled by Nigel Bradham and Connor Barwin.","(15:00) Caleb Sturgis kicks off to the Cin-1. Alex Erickson return for 19 yards to Cin18. Tackled by Marcus Smith. Penalty: Offside on Philadelphia (Najee Goode) 5 yards.","(0:02) Carson Wentz rush up the middle for a loss of 1 yard to the Phi34.","(0:07) Mike Nugent kicks off to the Phi27. Zach Ertz return for 8 yards to Phi35. Tackled by James Wright.","(0:07) Mike Nugent extra point is NO GOOD.","(0:14) Andy Dalton pass to the left to Tyler Eifert for 13 yards for a TOUCHDOWN.","(0:14) Cincinnati Bengals timeout.","(0:20) Andy Dalton pass to the left to Alex Erickson for 16 yards to the Phi13. Tackled by Nolan Carroll and Rodney McLeod.","(0:20) Penalty: False Start on Cincinnati (Tyler Eifert) -5 yards.","(0:25) Andy Dalton pass to the right to Tyler Eifert for 12 yards to the Phi24.","(0:31) Andy Dalton pass to the right to Tyler Boyd for 9 yards to the Phi36. Tackled by Leodis McKelvin.","(0:36) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(1:00) Andy Dalton pass to the right to Brandon LaFell for 8 yards to the Phi45. Tackled by Leodis McKelvin.","(1:25) Rex Burkhead rush to the left for 3 yards to the Cin47. Tackled by Jaylen Watkins and Brandon Graham.","(1:46) Andy Dalton pass to the left to Cody Core for 8 yards to the Cin44. Tackled by Nolan Carroll.","(1:55) Andy Dalton pass to the right to Rex Burkhead for 10 yards to the Cin36. Tackled by Jordan Hicks.","(2:00) Andy Dalton pass to the left to Rex Burkhead for 3 yards to the Cin26. Tackled by Nolan Carroll.","(2:00) Two Minute Warning.","(2:34) Rex Burkhead rush to the left for no gain to the Cin23. Tackled by Brandon Graham.","(3:14) Rex Burkhead rush up the middle for 16 yards to the Cin23. Tackled by Rodney McLeod.","(3:23) Donnie Jones punts for 48 yards to Cin6. Alex Erickson return for 1 yard to Cin7. Tackled by Terrence Brooks.","(3:31) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(3:56) Penalty: False Start on Philadelphia (Allen Barbre) -5 yards.","(4:43) Wendell Smallwood rush to the right for 3 yards to the Cin49. Tackled by Vontaze Burfict.","(4:47) Carson Wentz incomplete pass to the left intended for Wendell Smallwood.","(5:13) Carson Wentz pass to the middle to Trey Burton for 12 yards to the Phi48. Tackled by Vontaze Burfict and Darqueze Dennard.","(5:18) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(5:25) Carson Wentz incomplete pass to the left intended for Zach Ertz defensed by George Iloka.","(5:58) Wendell Smallwood rush to the left for 4 yards to the Phi36. Tackled by Vontaze Burfict.","(6:23) Carson Wentz pass to the middle to Trey Burton for 7 yards to the Phi32. Tackled by Vontaze Burfict.","(6:23) Mike Nugent kicks off to the endzone. Touchback.","(6:27) Mike Nugent 33 yard field goal attempt is GOOD. Holder: Kevin Huber.","(6:27) Cincinnati Bengals timeout.","(6:51) Jeremy Hill rush to the left for 1 yard to the Phi15. Tackled by Destiny Vaeao and Nigel Bradham.","(7:33) Andy Dalton pass to the right to Jeremy Hill for 8 yards to the Phi16. Tackled by Leodis McKelvin.","(7:39) Andy Dalton incomplete pass to the left intended for Brandon LaFell.","(8:02) Andy Dalton pass to the right to Tyler Boyd for 21 yards to the Phi39. Tackled by Jaylen Watkins. Penalty: Roughing Passer on Philadelphia (Brandon Graham) 15 yards.","(8:36) Jeremy Hill rush to the left for a loss of 4 yards to the Cin40. Tackled by Brandon Graham.","(9:09) Jeremy Hill rush to the left for 3 yards to the Cin44. Tackled by Brandon Graham.","(9:16) 51 yard field goal attempt by Caleb Sturgis is NO GOOD. Holder: Donnie Jones.","(9:51) Wendell Smallwood rush to the right for a loss of 1 yard to the Cin33. Tackled by Carlos Dunlap and Karlos Dansby.","(9:56) Carson Wentz incomplete pass to the right intended for Kenjon Barner.","(10:37) Darren Sproles rush to the left for 1 yard to the Cin32. Tackled by Pat Sims.","(11:17) Carson Wentz pass to the middle to Trey Burton for 15 yards to the Cin33. Tackled by Vontaze Burfict and George Iloka.","(11:57) Carson Wentz pass to the right to Zach Ertz for 6 yards to the Cin48. Tackled by Dre Kirkpatrick.","(12:18) Penalty: False Start on Philadelphia (Allen Barbre) -5 yards.","(12:44) Penalty: False Start on Philadelphia (Zach Ertz) -5 yards.","(13:30) Carson Wentz pass to the right to Nelson Agholor for 5 yards to the Cin44. Tackled by Dre Kirkpatrick.","(14:10) Carson Wentz pass to the middle to Dorial Green-Beckham for 12 yards to the Cin49. Tackled by Shawn Williams.","(14:55) Darren Sproles rush to the right for 3 yards to the Phi39. Tackled by Dre Kirkpatrick.","(15:00) Carson Wentz incomplete pass to the middle intended for Wendell Smallwood.","(0:05) Wendell Smallwood rush to the left for 2 yards to the Phi36. Tackled by Adam Jones.","(0:49) Carson Wentz rush up the middle for 7 yards to the Phi34. Tackled by Vincent Rey.","(1:32) Wendell Smallwood rush up the middle for 2 yards to the Phi27. Tackled by Michael Johnson.","(1:32) Mike Nugent kicks off to the endzone. Touchback.","(1:32) Mike Nugent extra point is good.","(1:35) Jeremy Hill rush to the right for 2 yards for a TOUCHDOWN.","(2:13) Jeremy Hill rush up the middle for 3 yards to the Phi2. Tackled by Leodis McKelvin.","(2:40) Andy Dalton pass to the left to Cody Core for 50 yards to the Phi5. Tackled by Rodney McLeod.","(3:22) Rex Burkhead rush to the left for a loss of 2 yards to the Cin45. Tackled by Nigel Bradham.","(3:57) Andy Dalton pass to the right to Jeremy Hill for 4 yards to the Cin47. Tackled by Jaylen Watkins.","(4:34) Andy Dalton pass to the left to Brandon LaFell for 23 yards to the Cin43. Tackled by Nolan Carroll and Rodney McLeod.","(5:04) Andy Dalton pass to the right to James Wright for 5 yards to the Cin20. Tackled by Jordan Hicks.","(5:44) Jeremy Hill rush to the right for a loss of 4 yards to the Cin15. Tackled by Brandon Graham and Bennie Logan.","(5:57) Donnie Jones punts for 40 yards to Cin11. Alex Erickson return for 8 yards to Cin19. Tackled by Nigel Bradham and Trey Burton.","(6:03) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(6:48) Darren Sproles rush to the right for a loss of 2 yards to the Phi49. Tackled by Domata Peko and Pat Sims.","(7:30) Carson Wentz pass to the left to Dorial Green-Beckham for 8 yards to the Cin49. Tackled by Adam Jones.","(7:52) Penalty: False Start on Philadelphia (Isaac Seumalo) -5 yards.","(8:24) Carson Wentz rush to the right for 10 yards to the Phi48. Tackled by Vontaze Burfict and Josh Shaw.","(9:00) Carson Wentz pass to the left to Nelson Agholor for 2 yards to the Phi38. Tackled by Vontaze Burfict.","(9:06) Carson Wentz incomplete pass to the right intended for Kenjon Barner defensed by Carlos Dunlap.","(9:44) Wendell Smallwood rush to the left for 9 yards to the Phi36. Tackled by Karlos Dansby.","(10:22) Wendell Smallwood rush to the left for 2 yards to the Phi27. Tackled by Carlos Dunlap and Karlos Dansby.","(10:22) Mike Nugent kicks off to the endzone. Touchback.","(10:26) Mike Nugent 32 yard field goal attempt is GOOD. Holder: Kevin Huber.","(10:31) Andy Dalton incomplete pass to the middle intended for Rex Burkhead.","(10:38) Andy Dalton incomplete pass to the right.","(11:15) Jeremy Hill rush to the left for 1 yard to the Phi14. Tackled by Jaylen Watkins.","(11:55) Andy Dalton pass to the right to James Wright for 15 yards to the Phi15. Tackled by Leodis McKelvin and Malcolm Jenkins.","(12:35) Jeremy Hill rush to the left for 4 yards to the Phi30. Tackled by Fletcher Cox and Nigel Bradham.","(12:49) Penalty: Offside on Philadelphia (Bennie Logan) 5 yards.","(13:28) Andy Dalton pass to the right to Brandon LaFell for 12 yards to the Phi39. Tackled by Leodis McKelvin.","(14:05) Jeremy Hill rush to the left for 2 yards to the Cin49. Tackled by Fletcher Cox and Malcolm Jenkins.","(14:14) Donnie Jones punts for 30 yards to Cin47. No return.","(14:19) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham defensed by Vincent Rey.","(14:23) Carson Wentz incomplete pass to the middle intended for Zach Ertz defensed by Carlos Dunlap.","(15:00) Wendell Smallwood rush to the left for a loss of 2 yards to the Phi23. Tackled by Shawn Williams.","(15:00) Mike Nugent kicks off to the endzone. Touchback."]