["(0:24) Dak Prescott rush up the middle for a loss of 1 yard to the Dal50.","(0:25) Kai Forbath onside kickoff to the Min49. Onside kick recovered by receiving team by Jason Witten.","(0:25) Sam Bradford 2 pt conversion pass is NO GOOD - intended for Kyle Rudolph.","(0:25) Penalty: False Start on Minnesota (Jeremiah Sirles) -5 yards.","(0:30) Sam Bradford pass to the right to Jerick McKinnon for 3 yards for a TOUCHDOWN.","(0:30) Dallas Cowboys timeout.","(0:33) Penalty: Offside on Dallas (Jack Crawford) 4 yards.","(0:57) Sam Bradford pass to the right to Stefon Diggs for 4 yards to the Dal7. Tackled by Barry Church.","(1:18) Sam Bradford pass to the right to Cordarrelle Patterson for 5 yards to the Dal11. Tackled by Byron Jones.","(1:23) Sam Bradford pass to the right to Jerick McKinnon for 5 yards to the Dal16. Tackled by Barry Church.","(1:46) Sam Bradford pass to the right to Stefon Diggs for 15 yards to the Dal21. Tackled by Brandon Carr.","(1:57) Sam Bradford pass to the left to Jerick McKinnon for 5 yards to the Dal36. Tackled by Barry Church.","(1:57) Two Minute Warning.","(2:01) Jerick McKinnon rush to the left for 6 yards to the Dal41. Tackled by Barry Church and Brandon Carr.","(2:09) Sam Bradford pass to the left to Adam Thielen for 18 yards to the Dal47.","(2:20) Chris Jones punts for 41 yards to Min31. Cordarrelle Patterson - no return. FUMBLE, recovered by Min (Audie Cole).","(2:20) Minnesota Vikings timeout.","(2:24) Dak Prescott rush up the middle for no gain to the Dal31. FUMBLE, recovered by Dal (Ezekiel Elliott).","(2:24) Minnesota Vikings timeout.","(2:53) Dak Prescott rush to the right for 8 yards to the Dal31. Tackled by Harrison Smith.","(2:53) Minnesota Vikings timeout.","(2:58) Ezekiel Elliott rush to the right for 1 yard to the Dal23. Tackled by Everson Griffen.","(3:08) Jeff Locke punts for 32 yards to Dal32. Lucky Whitehead - no return. Tackled by Justin Trattou. Penalty: Holding on Dallas (Kavon Frazier) -10 yards.","(3:14) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(3:20) Sam Bradford sacked at Min36 for a loss of 7 yards by Benson Mayowa.","(3:42) Sam Bradford pass to the middle to Jerick McKinnon for 5 yards to the Min43. Tackled by Orlando Scandrick.","(4:03) Sam Bradford pass to the left to Adam Thielen for 13 yards to the Min38. Tackled by Brandon Carr.","(4:10) Sam Bradford incomplete pass to the middle intended for Kyle Rudolph defensed by Anthony Hitchens.","(4:15) Dan Bailey kicks off to the Min-5. Cordarrelle Patterson return for 30 yards to Min25. Tackled by Kavon Frazier.","(4:20) Dan Bailey 39 yard field goal attempt is GOOD. Holder: Chris Jones.","(4:27) Dak Prescott incomplete pass to the left intended for Terrance Williams.","(5:09) Ezekiel Elliott rush to the right for 2 yards to the Min21. Tackled by Everson Griffen.","(5:52) Ezekiel Elliott rush to the left for 1 yard to the Min23. Tackled by Everson Griffen.","(6:37) Ezekiel Elliott rush to the right for 30 yards to the Min24. Tackled by Eric Kendricks.","(6:45) Jeff Locke punts for 33 yards to Dal46. No return.","(7:23) Sam Bradford pass to the right to Rhett Ellison for 6 yards to the Min21. Tackled by Orlando Scandrick.","(7:29) Sam Bradford incomplete pass to the right intended for Charles Johnson.","(8:16) Sam Bradford sacked at Min15 for a loss of 8 yards by Anthony Hitchens.","(8:56) Matt Asiata rush up the middle for 4 yards to the Min23. Tackled by Damien Wilson.","(9:39) Jerick McKinnon rush to the left for 3 yards to the Min19. Tackled by Anthony Hitchens and Barry Church.","(10:15) Sam Bradford pass to the left to Stefon Diggs for 6 yards to the Min16. Tackled by Orlando Scandrick.","(10:22) Dan Bailey kicks off to the Min5. Cordarrelle Patterson return for 15 yards to Min20. Tackled by Leon McFadden. Penalty: Face Mask on Minnesota (Anthony Harris) -10 yards.","(10:22) Dan Bailey extra point is good.","(10:28) Dak Prescott pass to the left to Dez Bryant for 8 yards for a TOUCHDOWN.","(10:39) Chris Jones punts for 46 yards to Min14. Adam Thielen return for a loss of 6 yards to Min8. Tackled by Kyle Wilber. FUMBLE, recovered by Dal (Kyle Wilber). Tackled by Adam Thielen.","(11:13) Dak Prescott sacked at Dal40 for a loss of 6 yards by Danielle Hunter.","(11:45) Penalty: Holding on Dallas (Ezekiel Elliott) -10 yards.","(11:50) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(12:24) Ezekiel Elliott rush to the right for 2 yards to the Min44. Tackled by Captain Munnerlyn and Danielle Hunter.","(13:03) Dak Prescott pass to the left to Terrance Williams for 18 yards to the Min46. Tackled by Harrison Smith.","(13:34) Dak Prescott rush to the left for 9 yards to the Dal36. Tackled by Eric Kendricks.","(14:11) Ezekiel Elliott rush to the left for 2 yards to the Dal27. Tackled by Danielle Hunter.","(14:11) Kai Forbath kicks off to the endzone. Touchback.","(14:15) Kai Forbath 33 yard field goal attempt is GOOD. Holder: Jeff Locke.","(14:19) Sam Bradford incomplete pass to the left intended for Laquon Treadwell.","(15:00) Sam Bradford pass to the left to Adam Thielen for 4 yards to the Dal15. Tackled by Orlando Scandrick.","(0:07) Matt Asiata rush to the right for 5 yards to the Dal19. Tackled by Anthony Hitchens.","(0:07) Penalty: False Start on Minnesota (T.J. Clemmings) -5 yards.","(0:17) Dak Prescott sacked at Dal19 for a loss of 6 yards by Brian Robison. FUMBLE, recovered by Min (Everson Griffen). Tackled by Tyron Smith.","(0:46) Penalty: Holding on Dallas (Gavin Escobar) -10 yards.","(1:31) Ezekiel Elliott rush to the right for 3 yards to the Dal35. Tackled by Chad Greenway.","(2:10) Dak Prescott rush to the left for 7 yards to the Dal32. Tackled by Chad Greenway.","(2:10) Kai Forbath kicks off to the endzone. Touchback.","(2:14) Kai Forbath 36 yard field goal attempt is GOOD. Holder: Jeff Locke.","(2:20) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(3:01) Sam Bradford pass to the right to Adam Thielen for 6 yards to the Dal18. Tackled by Anthony Brown.","(3:06) Sam Bradford incomplete pass to the right intended for Charles Johnson defensed by Anthony Brown.","(3:47) Matt Asiata rush up the middle for 14 yards to the Dal24. Tackled by Jack Crawford.","(4:30) Sam Bradford pass to the right to Kyle Rudolph for 8 yards to the Dal38. Tackled by Sean Lee.","(5:11) Sam Bradford pass to the right to Kyle Rudolph for 6 yards to the Dal46. Tackled by Anthony Hitchens and Orlando Scandrick.","(5:55) Matt Asiata rush up the middle for 3 yards to the Min48. Tackled by Anthony Hitchens.","(6:26) Sam Bradford pass to the left to Stefon Diggs for 10 yards to the Min45. Tackled by Brandon Carr.","(7:02) Jerick McKinnon rush up the middle for 2 yards to the Min35. Tackled by Maliek Collins and Sean Lee.","(7:09) Chris Jones punts for 42 yards to Min33. No return.","(7:51) Dak Prescott pass to the right to Ezekiel Elliott for 16 yards to the Dal25. Tackled by Everson Griffen.","(8:35) Dak Prescott pass to the right to Terrance Williams for a loss of 5 yards to the Dal9. Tackled by Xavier Rhodes.","(8:37) Dak Prescott incomplete pass to the left intended for Cole Beasley.","(9:11) Penalty: Clipping on Dallas (Gavin Escobar) -14 yards.","(9:39) Dak Prescott pass to the left to Dez Bryant for 13 yards to the Dal28. Tackled by Andrew Sendejo.","(10:18) Ezekiel Elliott rush to the right for 6 yards to the Dal15. Tackled by Everson Griffen.","(10:25) Jeff Locke punts for 38 yards to Dal9. No return.","(10:29) Sam Bradford incomplete pass to the left intended for Laquon Treadwell.","(11:15) Sam Bradford rush up the middle for no gain to the Dal41. FUMBLE, recovered by Min (Sam Bradford).","(11:20) Sam Bradford incomplete pass to the middle intended for Jerick McKinnon defensed by Cedric Thornton.","(12:01) Sam Bradford pass to the left to Charles Johnson for 5 yards to the Dal41. Tackled by Brandon Carr.","(12:32) Cordarrelle Patterson rush to the right for 6 yards to the Dal46. Tackled by Byron Jones.","(13:13) Sam Bradford rush up the middle for 10 yards to the Min48. Tackled by Orlando Scandrick.","(13:57) Jerick McKinnon rush up the middle for 9 yards to the Min38. Tackled by Anthony Brown.","(14:35) Sam Bradford pass to the right to Jerick McKinnon for a loss of 4 yards to the Min29. Tackled by Sean Lee.","(14:54) Sam Bradford pass to the right to Charles Johnson for 25 yards to the Min33. Tackled by Anthony Hitchens.","(15:00) Dan Bailey kicks off to the Min4. Matt Asiata return for 11 yards to Min15. Tackled by Byron Jones. Penalty: Illegal Block on Minnesota (Edmond Robinson) -7 yards.","(0:15) Dak Prescott sacked at Dal46 for a loss of 3 yards by Danielle Hunter.","(0:25) Jeff Locke punts for 25 yards to Dal49. No return.","(0:25) Dallas Cowboys timeout.","(0:31) Shaun Hill sacked at Min26 for a loss of 7 yards by Maliek Collins.","(0:52) Shaun Hill pass to the right to Adam Thielen for 6 yards to the Min33. Tackled by Barry Church.","(0:52) Minnesota Vikings timeout.","(0:58) Sam Bradford incomplete pass to the left intended for Cordarrelle Patterson.","(0:58) Minnesota Vikings timeout.","(1:04) Sam Bradford pass to the left to Stefon Diggs for 4 yards to the Min27. Tackled by Byron Jones.","(1:33) Sam Bradford pass to the right to Kyle Rudolph for 2 yards to the Min23. Tackled by Barry Church.","(1:52) Sam Bradford pass to the right to Stefon Diggs for 7 yards to the Min21. Tackled by Orlando Scandrick.","(2:00) Chris Jones punts for 45 yards to Min14. No return.","(2:00) Two Minute Warning.","(2:29) Dak Prescott pass to the right to Ezekiel Elliott for 5 yards to the Dal41. Tackled by Eric Kendricks and Captain Munnerlyn.","(2:38) Dak Prescott incomplete pass to the left intended for Ezekiel Elliott.","(3:15) Ezekiel Elliott rush to the right for 4 yards to the Dal36. Tackled by Eric Kendricks and Brian Robison.","(3:24) Jeff Locke punts for 16 yards to Dal32. No return.","(4:05) Sam Bradford pass to the right to Matt Asiata for a loss of 3 yards to the Dal48. Tackled by Sean Lee.","(4:47) Jerick McKinnon rush to the right for 4 yards to the Dal45. Tackled by Anthony Hitchens and Anthony Brown.","(4:53) Sam Bradford incomplete pass to the right intended for Adam Thielen.","(4:53) Penalty: Encroachment on Dallas (Cedric Thornton) 5 yards.","(4:53) Penalty: Offside on Dallas (Maliek Collins) 5 yards.","(4:59) Penalty: Illegal Use of Hands on Dallas (Orlando Scandrick) 5 yards.","(5:23) Jerick McKinnon rush to the right for 6 yards to the Min36. Tackled by Brandon Carr and Benson Mayowa.","(5:29) Dan Bailey kicks off to the Min-5. Cordarrelle Patterson return for 35 yards to Min30. Tackled by Byron Jones.","(5:29) Dan Bailey extra point is good.","(5:33) Ezekiel Elliott rush to the right for 1 yard for a TOUCHDOWN.","(5:33) Dallas Cowboys timeout.","(6:26) Dak Prescott pass to the left to Dez Bryant for 56 yards to the Min1. Tackled by Harrison Smith.","(7:10) Ezekiel Elliott rush to the left for 1 yard to the Dal43. Tackled by Linval Joseph and Danielle Hunter.","(7:46) Dak Prescott pass to the right to Cole Beasley for 13 yards to the Dal42. Tackled by Captain Munnerlyn.","(8:31) Ezekiel Elliott rush to the right for 2 yards to the Dal29. Tackled by Eric Kendricks.","(9:18) Dak Prescott rush to the left for 14 yards to the Dal27. Tackled by Tom Johnson.","(10:02) Ezekiel Elliott rush up the middle for a loss of 1 yard to the Dal13. Tackled by Harrison Smith.","(10:41) Dak Prescott pass to the right to Ezekiel Elliott for a loss of 2 yards to the Dal14. Tackled by Terence Newman.","(10:48) Jeff Locke punts for 37 yards to Dal16. No return.","(10:52) Sam Bradford incomplete pass to the left intended for Adam Thielen.","(11:32) Cordarrelle Patterson rush to the right for no gain to the Min47. Tackled by Barry Church.","(11:37) Jerick McKinnon incomplete pass to the right intended for Kyle Rudolph defensed by Byron Jones.","(12:27) Sam Bradford pass to the right to Stefon Diggs for 7 yards to the Min47. Tackled by Byron Jones.","(13:10) Sam Bradford pass to the right to Charles Johnson for 6 yards to the Min40. Tackled by Anthony Brown.","(14:13) Penalty: False Start on Minnesota (Zac Kerin) -5 yards.","(14:13) Jerick McKinnon rush to the left for 5 yards to the Min39. Tackled by Sean Lee.","(14:20) Lucky Whitehead rush to the left for 6 yards to the Min41. Tackled by Everson Griffen. FUMBLE, recovered by Min (Eric Kendricks). Tackled by Tyron Smith.","(15:00) Ezekiel Elliott rush to the right for 3 yards to the Min47. Tackled by Everson Griffen.","(0:16) Alfred Morris rush to the left for 11 yards to the Dal50. Tackled by Everson Griffen.","(0:42) Ezekiel Elliott rush to the left for 5 yards to the Dal49. Tackled by Anthony Barr and Harrison Smith. Penalty: Holding on Dallas (Doug Free) -10 yards.","(1:05) Dak Prescott pass to the left to Cole Beasley for 10 yards to the Dal44. Tackled by Captain Munnerlyn.","(1:45) Ezekiel Elliott rush to the right for 8 yards to the Dal34. Tackled by Shamar Stephen and Anthony Barr.","(2:24) Ezekiel Elliott rush to the right for 4 yards to the Dal26. Tackled by Shamar Stephen and Danielle Hunter.","(2:28) Kai Forbath kicks off to the Dal6. Lance Dunbar return for 16 yards to Dal22. Tackled by Emmanuel Lamur.","(2:33) Kai Forbath 48 yard field goal attempt is GOOD. Holder: Jeff Locke.","(2:37) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(3:08) Penalty: Holding on Minnesota (Alex Boone) -10 yards.","(3:50) Sam Bradford pass to the left to Stefon Diggs for 6 yards to the Dal21. Tackled by Byron Jones.","(4:30) Jerick McKinnon rush up the middle for 3 yards to the Dal27. Tackled by Anthony Hitchens.","(5:04) Sam Bradford pass to the right to Adam Thielen for 16 yards to the Dal30. Tackled by Barry Church.","(5:45) Sam Bradford pass to the left to Kyle Rudolph for 17 yards to the Dal46. Tackled by Byron Jones.","(5:54) Chris Jones punts for 48 yards to Min37. No return.","(6:30) Dak Prescott pass to the left to Ezekiel Elliott for no gain to the Dal15. Tackled by Eric Kendricks.","(6:51) Ezekiel Elliott rush to the left for no gain to the Dal15. Tackled by Anthony Barr. FUMBLE, recovered by Dal (Ezekiel Elliott).","(6:58) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(7:12) Jeff Locke punts for 43 yards to Dal14. Lucky Whitehead return for 1 yard to Dal15. Tackled by Audie Cole.","(7:53) Sam Bradford pass to the right to Kyle Rudolph for 3 yards to the Min43. Tackled by Byron Jones.","(8:35) Jerick McKinnon rush to the right for 3 yards to the Min40. Tackled by Sean Lee.","(9:16) Sam Bradford pass to the left to Cordarrelle Patterson for 5 yards to the Min37. Tackled by Brandon Carr and Byron Jones.","(9:37) Penalty: Pass Interference on Minnesota (Cordarrelle Patterson) -10 yards.","(9:56) Sam Bradford pass to the left to Adam Thielen for 23 yards to the Min42.","(10:00) Sam Bradford incomplete pass to the left intended for Kyle Rudolph.","(10:23) Penalty: False Start on Minnesota (T.J. Clemmings) -5 yards.","(10:59) Matt Asiata rush to the left for a loss of 1 yard to the Min24. Tackled by Damien Wilson.","(11:40) Sam Bradford pass to the middle to Kyle Rudolph for 9 yards to the Min25. Tackled by Sean Lee and Anthony Hitchens.","(12:19) Matt Asiata rush up the middle for 5 yards to the Min16. Tackled by Brandon Carr.","(12:30) Chris Jones punts for 55 yards to Min10. Adam Thielen return for 1 yard to Min11. Tackled by Kyle Wilber.","(12:36) Dak Prescott incomplete pass to the right intended for Cole Beasley.","(13:17) Ezekiel Elliott rush to the left for no gain to the Dal35. Tackled by Andrew Sendejo.","(13:55) Dak Prescott pass to the right to Dez Bryant for 7 yards to the Dal35. Tackled by Xavier Rhodes.","(14:15) Penalty: False Start on Dallas (Tyron Smith) -5 yards.","(14:55) Ezekiel Elliott rush to the right for 12 yards to the Dal33. Tackled by Andrew Sendejo.","(15:00) Kai Forbath kicks off to the Dal-1. Lucky Whitehead return for 22 yards to Dal21. Tackled by Kentrell Brothers."]