["(0:22) Landry Jones rush up the middle for a loss of 1 yard to the NYG46.","(0:26) Robbie Gould onside kickoff to the NYG45. Onside kick recovered by receiving team by Cobi Hamilton.","(0:26) Robbie Gould extra point is good.","(0:30) Eli Manning pass to the right to Sterling Shepard for 1 yard for a TOUCHDOWN.","(0:38) Penalty: Pass Interference on Pittsburgh (Mike Mitchell) 7 yards.","(0:55) Eli Manning pass to the middle to Odell Beckham Jr. for 7 yards to the Pit8. Tackled by Artie Burns.","(1:08) Eli Manning pass to the right to Roger Lewis for 8 yards to the Pit15. Tackled by Ross Cockrell.","(1:26) Eli Manning pass to the middle to Odell Beckham Jr. for 14 yards to the Pit23.","(1:31) Eli Manning incomplete pass to the left intended for Jerell Adams defensed by Stephon Tuitt. Penalty: Unnecessary Roughness on Pittsburgh (Stephon Tuitt) 15 yards.","(1:39) Randy Bullock kicks off to the NYG10. Bobby Rainey return for 38 yards to NYG48. Tackled by Sammie Coates and Justin Gilbert.","(1:43) Randy Bullock 38 yard field goal attempt is GOOD. Holder: Jordan Berry.","(1:49) Ben Roethlisberger incomplete pass to the right intended for Ladarius Green.","(1:49) New York Giants timeout.","(1:54) Le'Veon Bell rush up the middle for 2 yards to the NYG20. Tackled by Johnathan Hankins and Kelvin Sheppard.","(1:54) New York Giants timeout.","(2:00) Le'Veon Bell rush to the right for 1 yard to the NYG22. Tackled by Eli Apple.","(2:00) Two Minute Warning.","(2:29) Ben Roethlisberger pass to the middle to Jesse James for 5 yards to the NYG23. Tackled by Dominique Rodgers-Cromartie.","(2:29) Pittsburgh Steelers timeout.","(3:16) Le'Veon Bell rush to the left for no gain to the NYG28. Tackled by Devon Kennard and Kelvin Sheppard.","(4:00) Le'Veon Bell rush up the middle for 4 yards to the NYG28. Tackled by Kelvin Sheppard and Landon Collins.","(4:42) Le'Veon Bell rush up the middle for 3 yards to the NYG32. Tackled by Damon Harrison and Devon Kennard.","(5:26) Le'Veon Bell rush to the right for 12 yards to the NYG35. Tackled by Andrew Adams and Kelvin Sheppard.","(6:15) Le'Veon Bell rush to the right for 19 yards to the NYG47. Tackled by Olivier Vernon.","(6:56) Le'Veon Bell rush to the left for 2 yards to the Pit34. Tackled by Jonathan Casillas and Damon Harrison.","(7:04) Eli Manning sacked at Pit32 for a loss of 8 yards by Ricardo Mathews.","(7:09) Eli Manning incomplete pass to the right intended for Sterling Shepard.","(7:14) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(7:49) Eli Manning pass to the right to Odell Beckham Jr. for 1 yard to the Pit24. Tackled by Lawrence Timmons and Jarvis Jones.","(8:22) Eli Manning pass to the middle to Odell Beckham Jr. for 25 yards to the Pit25. Tackled by William Gay and Ross Cockrell.","(8:29) Jordan Berry punts for 34 yards to NYG44. Dwayne Harris return for 1 yard to NYG45. Tackled by Vince Williams and Sammie Coates. Penalty: Illegal Substitution on Pittsburgh 5 yards.","(8:36) Ben Roethlisberger incomplete pass to the middle intended for Ladarius Green defensed by Eli Apple.","(9:22) Le'Veon Bell rush to the right for 3 yards to the Pit22. Tackled by Keenan Robinson and Kerry Wynn.","(10:04) Le'Veon Bell rush up the middle for 4 yards to the Pit19. Tackled by Johnathan Hankins.","(10:46) Le'Veon Bell rush up the middle for 4 yards to the Pit15. Tackled by Damon Harrison.","(11:23) Le'Veon Bell rush up the middle for 8 yards to the Pit11. Tackled by Eli Apple.","(11:42) Eli Manning pass intended for Sterling Shepard INTERCEPTED by Sean Davis. No return. Tackled by John Jerry. Penalty: Illegal Block on Pittsburgh (Artie Burns) -3 yards.","(11:47) Eli Manning incomplete pass to the right intended for Odell Beckham Jr. defensed by Mike Mitchell.","(12:11) Penalty: False Start on New York (Ereck Flowers) -5 yards.","(12:43) Eli Manning pass to the right to Odell Beckham Jr. for no gain to the Pit30. Tackled by Mike Mitchell.","(13:25) Paul Perkins rush up the middle for 2 yards to the Pit30. Tackled by James Harrison.","(14:03) Paul Perkins rush up the middle for 2 yards to the Pit32. Tackled by Bud Dupree and Stephon Tuitt.","(14:28) Paul Perkins rush to the left for 6 yards to the Pit34. Tackled by Artie Burns and Sean Davis.","(15:00) Paul Perkins rush to the right for 3 yards to the Pit40. Tackled by Ryan Shazier and Lawrence Timmons.","(0:44) Eli Manning pass to the middle to Jerell Adams for 10 yards to the Pit43. Tackled by Ryan Shazier.","(0:54) Ben Roethlisberger pass intended for Eli Rogers INTERCEPTED by Eli Apple. No return. Tackled by Eli Rogers.","(1:38) Ben Roethlisberger sacked at Pit22 for a loss of 10 yards by Olivier Vernon.","(1:49) Brad Wing punts for 40 yards to Pit32. No return.","(1:54) Eli Manning incomplete pass to the middle intended for Odell Beckham Jr. defensed by Mike Mitchell.","(2:36) Eli Manning pass to the right to Rashad Jennings for a loss of 4 yards to the NYG28. Tackled by Ross Cockrell.","(3:09) Eli Manning pass to the right to Sterling Shepard for 7 yards to the NYG32. Tackled by Lawrence Timmons.","(3:09) Randy Bullock kicks off to the endzone. Touchback.","(3:09) Randy Bullock extra point is good.","(3:14) Ben Roethlisberger pass to the left to Ladarius Green for 20 yards for a TOUCHDOWN.","(3:55) Ben Roethlisberger pass to the right to Le'Veon Bell for 5 yards to the NYG20. Tackled by Kelvin Sheppard.","(4:31) Le'Veon Bell rush up the middle for 1 yard to the NYG25. Tackled by Kelvin Sheppard and Landon Collins.","(4:48) Ben Roethlisberger pass to the left to Antonio Brown for 13 yards to the NYG26. Tackled by Janoris Jenkins.","(5:24) Le'Veon Bell rush up the middle for 4 yards to the NYG39. Tackled by Kerry Wynn.","(5:43) Le'Veon Bell rush up the middle for 12 yards to the NYG43. Tackled by Andrew Adams.","(6:26) Ben Roethlisberger pass to the middle to Ladarius Green for 33 yards to the Pit45. Tackled by Andrew Adams.","(6:30) Robbie Gould kicks off to the Pit-2. Sammie Coates return for 24 yards to Pit22. Tackled by Deontae Skinner. Penalty: Holding on Pittsburgh (Vince Williams) -10 yards.","(6:30) Robbie Gould extra point is good.","(6:37) Eli Manning pass to the right to Rashad Jennings for 13 yards for a TOUCHDOWN.","(7:12) Rashad Jennings rush to the left for 4 yards to the Pit13. Tackled by Ricardo Mathews and Lawrence Timmons.","(7:23) Le'Veon Bell rush up the middle for 2 yards to the Pit17. Tackled by Jonathan Casillas and Damon Harrison. FUMBLE, recovered by NYG (Eli Apple). Tackled by Ramon Foster.","(8:08) Ben Roethlisberger pass to the left to Ladarius Green for 10 yards to the Pit15. Tackled by Dominique Rodgers-Cromartie.","(8:13) Ben Roethlisberger incomplete pass to the left intended for Cobi Hamilton defensed by Landon Collins.","(8:54) Le'Veon Bell rush to the right for 2 yards to the Pit5. Tackled by Damon Harrison.","(8:58) Eli Manning incomplete pass to the middle intended for Will Tye defensed by Ryan Shazier.","(9:42) Eli Manning pass to the left to Odell Beckham Jr. for 9 yards to the Pit3. Tackled by Artie Burns.","(9:48) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(9:53) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(10:36) Paul Perkins rush to the left for 18 yards to the Pit12. Tackled by Mike Mitchell and Sean Davis.","(11:13) Eli Manning pass to the left to Odell Beckham Jr. for 7 yards to the Pit30. Tackled by Artie Burns.","(11:46) Eli Manning pass to the right to Odell Beckham Jr. for 23 yards to the Pit37. Tackled by Mike Mitchell.","(11:53) Jordan Berry punts for 44 yards to NYG40. No return.","(12:00) Ben Roethlisberger incomplete pass to the left intended for Ladarius Green.","(12:39) Le'Veon Bell rush up the middle for 4 yards to the Pit16. Tackled by Landon Collins and Damon Harrison.","(13:20) Ben Roethlisberger pass to the left to Antonio Brown for a loss of 1 yard to the Pit12. Tackled by Janoris Jenkins.","(13:41) Penalty: Holding on Pittsburgh (David DeCastro) -10 yards.","(13:52) Brad Wing punts for 42 yards to Pit38. No return. Penalty: Face Mask on Pittsburgh (Sammie Coates) -15 yards.","(14:30) Eli Manning sacked at NYG20 for a loss of 9 yards by James Harrison.","(14:35) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by Ross Cockrell.","(15:00) Eli Manning pass to the left to Odell Beckham Jr. for 4 yards to the NYG29. Tackled by Ross Cockrell.","(15:00) Randy Bullock kicks off to the endzone. Touchback.","(0:24) Eli Manning rush up the middle for a loss of 1 yard to the NYG15.","(0:24) Randy Bullock kicks off to the NYG-2. Dwayne Harris return for 18 yards to NYG16. Tackled by Fitzgerald Toussaint.","(0:28) Randy Bullock 34 yard field goal attempt is GOOD. Holder: Jordan Berry.","(0:28) Pittsburgh Steelers timeout.","(1:18) Ben Roethlisberger pass to the left to Le'Veon Bell for 14 yards to the NYG16. Tackled by Jonathan Casillas and Romeo Okwara.","(1:18) New York Giants timeout.","(1:28) Ben Roethlisberger pass to the middle to Ladarius Green for 1 yard to the NYG30. Tackled by Olivier Vernon.","(1:28) Pittsburgh Steelers timeout.","(1:35) Ben Roethlisberger sacked at NYG31 for a loss of 7 yards by Olivier Vernon.","(1:35) New York Giants timeout.","(1:45) Ben Roethlisberger pass to the right to Eli Rogers for 18 yards to the NYG24. Tackled by Trevin Wade and Devon Kennard.","(1:50) Penalty: Pass Interference on Pittsburgh (Ladarius Green) -10 yards.","(1:50) New York Giants timeout.","(2:00) Le'Veon Bell rush to the left for no gain to the NYG32. Tackled by Jonathan Casillas.","(2:00) Two Minute Warning.","(2:16) Le'Veon Bell rush to the left for 3 yards to the NYG32. Tackled by Jay Bromley.","(2:48) Ben Roethlisberger pass to the right to Antonio Brown for 6 yards to the NYG35.","(3:27) Ben Roethlisberger pass to the left to Le'Veon Bell for 7 yards to the NYG41. Tackled by Keenan Robinson.","(4:01) Ben Roethlisberger pass to the left to Cobi Hamilton for 12 yards to the NYG48. Tackled by Eli Apple.","(4:06) Ben Roethlisberger incomplete pass to the middle intended for Ladarius Green defensed by Landon Collins.","(4:50) Le'Veon Bell rush up the middle for 4 yards to the Pit40. Tackled by Landon Collins.","(5:31) Ben Roethlisberger pass to the right to Ladarius Green for 9 yards to the Pit36. Tackled by Keenan Robinson.","(6:12) Le'Veon Bell rush up the middle for 7 yards to the Pit27. Tackled by Kelvin Sheppard and Keenan Robinson.","(6:16) Ben Roethlisberger incomplete pass to the right intended for David Johnson.","(6:23) Penalty: Holding on Pittsburgh (Fitzgerald Toussaint) -10 yards.","(6:27) Eli Manning incomplete pass to the left intended for Will Tye.","(7:07) Paul Perkins rush up the middle for 7 yards to the NYG32. Tackled by William Gay and Lawrence Timmons.","(7:10) Eli Manning incomplete pass to the middle intended for Sterling Shepard.","(7:10) Randy Bullock kicks off to the endzone. Touchback.","(7:10) Ben Roethlisberger 2 pt conversion pass is NO GOOD - intended for Antonio Brown.","(7:20) Ben Roethlisberger pass to the right to Antonio Brown for 22 yards for a TOUCHDOWN.","(7:50) Le'Veon Bell rush to the left for 7 yards to the NYG22. Tackled by Devon Kennard.","(8:21) Ben Roethlisberger pass to the right to Jesse James for 11 yards to the NYG29. Tackled by Jonathan Casillas and Eli Apple.","(8:33) Eli Manning pass intended for Larry Donnell INTERCEPTED by Lawrence Timmons and returned for 58 yards. Tackled by Rashad Jennings.","(9:10) Eli Manning pass to the left to Will Tye for 6 yards to the Pit9. Tackled by James Harrison and Mike Mitchell.","(9:54) Eli Manning pass to the right to Odell Beckham Jr. for 10 yards to the Pit15. Tackled by Sean Davis.","(10:40) Eli Manning pass to the middle to Will Tye for 16 yards to the Pit25. Tackled by Sean Davis.","(11:15) Rashad Jennings rush to the right for a loss of 1 yard to the Pit31. Tackled by Sean Davis. Penalty: Holding on New York (John Jerry) -10 yards.","(12:29) Rashad Jennings rush to the right for 6 yards to the Pit30. Tackled by Bud Dupree.","(13:12) Eli Manning pass to the right to Sterling Shepard for 3 yards to the Pit36. Tackled by William Gay.","(13:48) Eli Manning pass to the right to Rashad Jennings for 2 yards to the Pit39. Tackled by Ryan Shazier.","(13:52) Rashad Jennings rush up the middle for 5 yards to the NYG44. Tackled by Javon Hargrave. Penalty: Pass Interference on Pittsburgh (Ross Cockrell) 15 yards.","(15:00) Eli Manning pass to the right to Sterling Shepard for 10 yards to the NYG39. Tackled by Artie Burns.","(0:04) Randy Bullock kicks off to the NYG7. Dwayne Harris return for 22 yards to NYG29. Tackled by Shamarko Thomas.","(0:08) Randy Bullock 44 yard field goal attempt is GOOD. Holder: Jordan Berry.","(0:48) Ben Roethlisberger pass to the right to Cobi Hamilton for a loss of 1 yard to the NYG26. Tackled by Eli Apple.","(0:54) Le'Veon Bell incomplete pass to the right.","(1:34) Le'Veon Bell rush to the left for a loss of 1 yard to the NYG25. Tackled by Jonathan Casillas and Landon Collins.","(2:15) Ben Roethlisberger pass to the right to Ladarius Green for 37 yards to the NYG24. Tackled by Leon Hall.","(2:19) Ben Roethlisberger incomplete pass to the middle intended for Ladarius Green.","(2:54) Le'Veon Bell rush up the middle for 3 yards to the Pit39. Tackled by Romeo Okwara and Damon Harrison.","(3:04) Brad Wing kicks off to the Pit13. Antonio Brown return for 23 yards to Pit36. Tackled by Brad Wing.","(3:11) Penalty: Holding on New York (Ereck Flowers) -5 yards. Safety.","(3:49) Paul Perkins rush up the middle for no gain to the NYG5. Tackled by Sean Davis.","(3:54) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(4:00) Penalty: Pass Interference on New York (Odell Beckham Jr.) -4 yards.","(4:07) Jordan Berry punts for 40 yards to NYG9. No return.","(4:13) Ben Roethlisberger incomplete pass to the left intended for Eli Rogers defensed by Landon Collins.","(4:48) Ben Roethlisberger pass to the left to Antonio Brown for 9 yards to the NYG49.","(4:52) Ben Roethlisberger incomplete pass to the right intended for Le'Veon Bell.","(5:11) Penalty: Holding on Pittsburgh (David Johnson) -10 yards.","(5:57) Ben Roethlisberger pass to the right to Le'Veon Bell for 21 yards to the NYG48. Tackled by Keenan Robinson.","(6:08) Penalty: False Start on Pittsburgh (Le'Veon Bell) -5 yards.","(6:51) Le'Veon Bell rush to the right for no gain to the Pit36. Tackled by Damon Harrison and Jason Pierre-Paul.","(7:31) Ben Roethlisberger pass to the right to Jesse James for 16 yards to the Pit36. Tackled by Andrew Adams and Keenan Robinson.","(7:39) Brad Wing punts for 57 yards to Pit0. Touchback.","(7:49) Eli Manning incomplete pass to the left intended for Jerell Adams.","(8:34) Eli Manning pass to the right to Rashad Jennings for 4 yards to the NYG43. Tackled by Lawrence Timmons and Ross Cockrell.","(9:10) Rashad Jennings rush to the right for 2 yards to the NYG39. Tackled by Lawrence Timmons and Sean Davis.","(9:47) Eli Manning pass to the middle to Rashad Jennings for 20 yards to the NYG37. Tackled by Artie Burns and Mike Mitchell.","(10:26) Eli Manning pass to the right to Rashad Jennings for a loss of 1 yard to the NYG17. Tackled by Artie Burns.","(11:02) Rashad Jennings rush up the middle for 3 yards to the NYG18. Tackled by Javon Hargrave.","(11:10) Jordan Berry punts for 30 yards to NYG15. No return.","(11:14) Ben Roethlisberger incomplete pass to the right intended for Jesse James.","(11:17) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown.","(11:48) Ben Roethlisberger pass to the left to Le'Veon Bell for 9 yards to the NYG45. Tackled by Jonathan Casillas.","(12:31) Ben Roethlisberger pass to the right to Antonio Brown for 5 yards to the Pit46. Tackled by Jonathan Casillas.","(13:11) Le'Veon Bell rush to the left for 3 yards to the Pit41. Tackled by Landon Collins and Jason Pierre-Paul.","(13:51) Le'Veon Bell rush to the left for 2 yards to the Pit38. Tackled by Damon Harrison and Kelvin Sheppard.","(14:27) Le'Veon Bell rush to the left for 3 yards to the Pit36. Tackled by Landon Collins.","(15:00) Ben Roethlisberger pass to the right to Le'Veon Bell for 8 yards to the Pit33. Tackled by Jason Pierre-Paul.","(15:00) Robbie Gould kicks off to the endzone. Touchback."]