["(0:40) Ryan Mallett rush up the middle for a loss of 1 yard to the Bal38.","(1:20) Ryan Mallett rush up the middle for a loss of 1 yard to the Bal39.","(2:00) Ryan Mallett rush up the middle for a loss of 1 yard to the Bal40.","(2:00) Two Minute Warning.","(2:08) Kenneth Dixon rush to the right for 3 yards to the Bal41. Tackled by Mike Hull and Ndamukong Suh.","(2:52) Kenneth Dixon rush to the left for 5 yards to the Bal38. Tackled by Spencer Paysinger and Isa Abdul-Quddus.","(3:37) Kenneth Dixon rush to the left for 4 yards to the Bal33. Tackled by Mike Hull.","(3:48) Matt Darr punts for 43 yards to Bal25. Devin Hester return for 4 yards to Bal29. Tackled by Mike Hull.","(4:30) Ryan Tannehill pass to the left to Jay Ajayi for 3 yards to the Mia32. Tackled by Anthony Levine Sr. and Patrick Onwuasor.","(5:16) Ryan Tannehill pass to the middle to Jarvis Landry for 3 yards to the Mia29. Tackled by Matt Elam.","(5:55) Ryan Tannehill pass to the left to Jarvis Landry for 1 yard to the Mia26. Tackled by Shareece Wright.","(5:55) Justin Tucker kicks off to the endzone. Touchback.","(5:55) Justin Tucker extra point is good. Penalty: Holding on Miami (Terrence Fede) 5 yards.","(6:00) Terrance West rush to the right for 9 yards for a TOUCHDOWN.","(6:36) Terrance West rush up the middle for 15 yards to the Mia9. Tackled by Michael Thomas and Isa Abdul-Quddus.","(6:41) Ryan Mallett incomplete pass to the right intended for Darren Waller.","(7:21) Kenneth Dixon rush to the right for 17 yards to the Mia24. Tackled by Michael Thomas.","(7:27) Ryan Tannehill pass intended for Kenny Stills INTERCEPTED by Jerraud Powers. No return.","(7:31) Ryan Tannehill incomplete pass to the left intended for Jarvis Landry.","(7:36) Ryan Tannehill incomplete pass to the left intended for Kenny Stills defensed by Eric Weddle.","(8:09) Ryan Tannehill pass to the middle to Jarvis Landry for 13 yards to the Mia31. Tackled by Shareece Wright.","(8:24) Ryan Tannehill pass to the right to Kenyan Drake for 4 yards to the Mia18. Tackled by Zachary Orr.","(8:31) Sam Koch punts for 34 yards to Mia14. No return.","(8:36) Ryan Mallett incomplete pass to the right intended for Steve Smith Sr..","(9:13) Terrance West rush to the left for 2 yards to the Mia48. Tackled by Spencer Paysinger.","(9:46) Ryan Mallett pass to the left to Steve Smith Sr. for 5 yards to the Bal50. Tackled by Tony Lippett.","(9:58) Matt Darr punts for 26 yards to Bal45. No return.","(10:36) Damien Williams rush up the middle for 1 yard to the Mia29. Tackled by Zachary Orr.","(10:56) Penalty: False Start on Miami (Laremy Tunsil) -5 yards.","(11:11) Ryan Tannehill pass to the right to Jay Ajayi for no gain to the Mia48. Tackled by Zachary Orr. Penalty: Taunting on Miami (Jay Ajayi) -15 yards.","(11:34) Ryan Tannehill sacked at Mia48 for a loss of 2 yards by Brent Urban.","(11:56) Penalty: Pass Interference on Baltimore (Jimmy Smith) 12 yards.","(12:21) Ryan Tannehill pass to the left to Jay Ajayi for 13 yards to the Mia38. Tackled by Zachary Orr.","(12:49) Jay Ajayi rush to the left for no gain to the Mia25. Tackled by Brent Urban.","(12:49) Justin Tucker kicks off to the endzone. Touchback.","(12:49) Justin Tucker extra point is good.","(12:58) Joe Flacco pass to the right to Breshad Perriman for 53 yards for a TOUCHDOWN.","(13:31) Joe Flacco pass to the left to Terrance West for 10 yards to the Bal47. Tackled by Neville Hewitt.","(14:04) Terrance West rush to the left for 1 yard to the Bal37. Tackled by Ndamukong Suh and Isa Abdul-Quddus.","(14:42) Joe Flacco pass to the right to Kenneth Dixon for 11 yards to the Bal36. Tackled by Neville Hewitt.","(14:42) Andrew Franks kicks off to the endzone. Touchback.","(14:42) Ryan Tannehill 2 pt conversion pass to Jarvis Landry is NO GOOD.","(14:47) Ryan Tannehill pass to the right to DeVante Parker for 8 yards for a TOUCHDOWN.","(15:00) Joe Flacco pass to the right to Dennis Pitta for 7 yards to the Bal33. Tackled by Byron Maxwell. FUMBLE, recovered by Mia (Neville Hewitt). Tackled by Steve Smith Sr.. FUMBLE, recovered by Mia (Michael Thomas) and advanced for 27 yards.","(0:06) Joe Flacco pass to the left to Mike Wallace for 6 yards to the Bal26. Tackled by Isa Abdul-Quddus.","(0:15) Matt Darr punts for 48 yards to Bal31. Devin Hester - no return. Tackled by Spencer Paysinger. Penalty: Illegal Block on Baltimore (Matt Judon) -10 yards.","(0:23) Ryan Tannehill incomplete pass to the middle.","(1:09) Ryan Tannehill pass to the right to DeVante Parker for 9 yards to the Mia21. Tackled by C.J. Mosley and Zachary Orr.","(1:35) Penalty: Face Mask on Miami (Laremy Tunsil) -12 yards.","(1:40) Ryan Tannehill incomplete pass to the left intended for Kenny Stills defensed by Jimmy Smith.","(2:10) Jay Ajayi rush to the left for 10 yards to the Mia24. Tackled by Zachary Orr and Jerraud Powers.","(2:42) Ryan Tannehill pass to the right to Jarvis Landry for 7 yards to the Mia14. Tackled by Jerraud Powers.","(2:48) Sam Koch punts for 43 yards to Mia7. No return.","(2:52) Joe Flacco incomplete pass to the right intended for Chris Moore.","(2:57) Joe Flacco incomplete pass to the left intended for Chris Moore defensed by Bobby McCain.","(3:23) Joe Flacco pass to the right to Mike Wallace for 5 yards to the Bal50. Tackled by Byron Maxwell.","(3:50) Terrance West rush to the left for 6 yards to the Bal45. Tackled by Tony Lippett.","(4:14) Terrance West rush to the right for 6 yards to the Bal39. Tackled by Spencer Paysinger.","(4:30) Joe Flacco pass to the middle to Dennis Pitta for 25 yards to the Bal33. Tackled by Isa Abdul-Quddus.","(4:54) Joe Flacco pass to the left to Dennis Pitta for 2 yards to the Bal8. Tackled by Isa Abdul-Quddus.","(5:03) Matt Darr punts for 39 yards to Bal13. Devin Hester return for a loss of 1 yard to Bal12. Tackled by Lafayette Pitts. Penalty: Illegal Block on Baltimore (Shareece Wright) -6 yards.","(5:09) Ryan Tannehill incomplete pass to the left intended for Leonte Carroo.","(5:56) Ryan Tannehill sacked at Mia48 for a loss of 9 yards by Matt Judon.","(6:34) Kenyan Drake rush to the left for 1 yard to the Bal43. Tackled by Zachary Orr.","(6:51) Ryan Tannehill pass to the left to Kenny Stills for 9 yards to the Bal44. Tackled by Jimmy Smith.","(7:35) Ryan Tannehill pass to the right to Dion Sims for 2 yards to the Mia47. Tackled by Tavon Young.","(8:21) Ryan Tannehill pass to the left to Jay Ajayi for 4 yards to the Mia45. Tackled by Jimmy Smith.","(8:54) Ryan Tannehill pass to the left to Jarvis Landry for 7 yards to the Mia41. Tackled by Jimmy Smith.","(9:28) Ryan Tannehill pass to the right to Jarvis Landry for 9 yards to the Mia34. Tackled by Zachary Orr.","(9:33) Sam Koch punts for 16 yards to Mia25. No return.","(9:38) Joe Flacco incomplete pass to the right intended for Breshad Perriman defensed by Cameron Wake.","(9:43) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(10:08) Joe Flacco pass to the right to Steve Smith Sr. for 4 yards to the Mia41. Tackled by Kiko Alonso.","(10:24) Ryan Tannehill pass intended for Jarvis Landry INTERCEPTED by Eric Weddle defensed by Jerraud Powers and returned for 53 yards. Tackled by Jarvis Landry.","(10:24) Miami Dolphins timeout.","(10:53) Penalty: Holding on Miami (Laremy Tunsil) -10 yards.","(11:22) Ryan Tannehill pass to the left to Dion Sims for 22 yards to the Bal19. Tackled by C.J. Mosley.","(12:05) Ryan Tannehill pass to the left to Jarvis Landry for 5 yards to the Bal41. Tackled by Jerraud Powers.","(12:30) Ryan Tannehill pass to the right to Jay Ajayi for no gain to the Bal46. Tackled by Jerraud Powers.","(13:11) Ryan Tannehill pass to the left to Jarvis Landry for 26 yards to the Bal46. Tackled by Lardarius Webb.","(13:58) Jay Ajayi rush to the right for 9 yards to the Mia28. Tackled by Jimmy Smith and Eric Weddle.","(14:25) Penalty: False Start on Miami (Jermon Bushrod) -5 yards.","(15:00) Jay Ajayi rush to the right for a loss of 1 yard to the Mia24. Tackled by Timmy Jernigan.","(15:00) Justin Tucker kicks off to the endzone. Touchback.","(0:04) Justin Tucker 55 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:04) Miami Dolphins timeout.","(0:04) Joe Flacco incomplete pass to the middle.","(0:23) Joe Flacco pass to the left to Mike Wallace for 16 yards to the Mia37. Tackled by Isa Abdul-Quddus.","(0:29) Joe Flacco pass to the left to Kenneth Dixon for 3 yards to the Bal47. Tackled by Tony Lippett.","(0:29) Baltimore Ravens timeout.","(0:34) Joe Flacco pass to the left to Dennis Pitta for 9 yards to the Bal44. Tackled by Bobby McCain and Tony Lippett.","(0:51) Joe Flacco pass to the middle to Kenneth Dixon for 3 yards to the Bal35. Tackled by Kiko Alonso.","(0:53) Baltimore Ravens timeout.","(0:59) Kenneth Dixon rush to the left for 17 yards to the Bal32. Tackled by Isa Abdul-Quddus.","(1:06) Matt Darr punts for 40 yards to Bal15. No return.","(1:12) Ryan Tannehill pass to the left to Jarvis Landry for 11 yards to the Mia45. Tackled by Jimmy Smith.","(1:56) Ryan Tannehill rush up the middle for no gain to the Mia42. FUMBLE, recovered by Mia (Ryan Tannehill).","(2:00) Ryan Tannehill incomplete pass to the left intended for Jay Ajayi.","(2:00) Two Minute Warning.","(2:06) Ryan Tannehill pass to the middle to DeVante Parker for 17 yards to the Mia42. Tackled by Shareece Wright.","(2:10) Ryan Tannehill incomplete pass to the right intended for Dion Sims.","(2:10) Justin Tucker kicks off to the endzone. Touchback.","(2:10) Justin Tucker extra point is good.","(2:17) Joe Flacco pass to the left to Dennis Pitta for 9 yards for a TOUCHDOWN.","(2:53) Joe Flacco pass to the right to Terrance West for 5 yards to the Mia9. Tackled by Jordan Phillips and Spencer Paysinger.","(3:14) Penalty: False Start on Baltimore (Vladimir Ducasse) -5 yards.","(3:47) Joe Flacco pass to the right to Dennis Pitta for 3 yards to the Mia9. Tackled by Michael Thomas.","(4:18) Joe Flacco pass to the left to Kyle Juszczyk for 6 yards to the Mia12. Tackled by Michael Thomas and Bobby McCain.","(4:22) Joe Flacco incomplete pass to the middle intended for Steve Smith Sr..","(4:58) Chris Moore rush to the left for 7 yards to the Mia18. Tackled by Mike Hull.","(5:41) Joe Flacco pass to the right to Breshad Perriman for 6 yards to the Mia25. Tackled by Spencer Paysinger.","(6:09) Terrance West rush to the left for 4 yards to the Mia31. Tackled by Earl Mitchell.","(6:25) Joe Flacco pass to the left to Steve Smith Sr. for 8 yards to the Mia35.","(6:25) Baltimore Ravens timeout.","(6:59) Joe Flacco pass to the middle to Mike Wallace for 4 yards to the Mia43. Tackled by Byron Maxwell.","(7:33) Joe Flacco pass to the right to Kenneth Dixon for 4 yards to the Mia47. Tackled by Mike Hull.","(7:37) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(8:08) Joe Flacco pass to the left to Steve Smith Sr. for 8 yards to the Bal49. Tackled by Tony Lippett.","(8:45) Joe Flacco pass to the left to Mike Wallace for 16 yards to the Bal41. Tackled by Michael Thomas.","(9:17) Penalty: Illegal Use of Hands on Baltimore (Steve Smith Sr.) -10 yards.","(9:42) Terrance West rush to the right for no gain to the Bal35. Tackled by Andre Branch and Bobby McCain.","(10:12) Joe Flacco pass to the middle to Kamar Aiken for 18 yards to the Bal35. Tackled by Isa Abdul-Quddus.","(10:43) Joe Flacco pass to the right to Nick Boyle for 4 yards to the Bal17. Tackled by Spencer Paysinger.","(11:07) Terrance West rush to the right for 1 yard to the Bal13. Tackled by Cameron Wake and Andre Branch.","(11:13) Matt Darr punts for 26 yards to Bal12. No return.","(11:33) Ryan Tannehill pass to the right to Damien Williams for 2 yards to the Bal38. Tackled by Tavon Young.","(12:10) Jay Ajayi rush to the right for a loss of 4 yards to the Bal40. Tackled by Lardarius Webb.","(12:36) Penalty: False Start on Miami (DeVante Parker) -5 yards.","(13:16) Ryan Tannehill pass to the middle to Dominique Jones for 7 yards to the Bal31. Tackled by Albert McClellan and C.J. Mosley.","(13:25) Joe Flacco pass intended for Mike Wallace INTERCEPTED by Byron Maxwell and returned for 2 yards. Tackled by Mike Wallace.","(13:32) Ryan Tannehill pass intended for DeVante Parker INTERCEPTED by Lardarius Webb. No return. Touchback.","(14:20) Jay Ajayi rush to the left for 6 yards to the Bal28. Tackled by Jimmy Smith.","(15:00) Jarvis Landry rush to the left for a loss of 1 yard to the Bal34. Tackled by Zachary Orr.","(0:17) Jay Ajayi rush to the right for 14 yards to the Bal33. Tackled by Zachary Orr and Tavon Young.","(0:47) Ryan Tannehill pass to the right to Jarvis Landry for no gain to the Mia38. Tackled by Zachary Orr. Penalty: Taunting on Baltimore (Timmy Jernigan) 15 yards.","(1:17) Ryan Tannehill pass to the left to Kenny Stills for 12 yards to the Mia38.","(1:58) Ryan Tannehill pass to the right to Damien Williams for 6 yards to the Mia26. Tackled by Zachary Orr.","(2:42) Jay Ajayi rush to the right for no gain to the Mia20. Tackled by Zachary Orr.","(3:14) Ryan Tannehill pass to the left to Jay Ajayi for 6 yards to the Mia20. Tackled by Eric Weddle.","(3:17) Justin Tucker kicks off to the Mia-4. Jakeem Grant return for 18 yards to Mia14. Tackled by Patrick Onwuasor.","(3:17) Justin Tucker extra point is good.","(3:22) Joe Flacco pass to the middle to Dennis Pitta for 13 yards for a TOUCHDOWN.","(3:30) Joe Flacco incomplete pass to the right.","(4:09) Joe Flacco pass to the right to Kamar Aiken for 11 yards to the Mia13. Tackled by Kiko Alonso.","(4:44) Joe Flacco pass to the right to Nick Boyle for 20 yards to the Mia24. Tackled by Isa Abdul-Quddus.","(5:16) Kenneth Dixon rush to the left for 10 yards to the Mia44. Tackled by Michael Thomas.","(5:59) Joe Flacco pass to the middle to Dennis Pitta for 14 yards to the Bal46. Tackled by Spencer Paysinger and Kiko Alonso.","(6:03) Joe Flacco incomplete pass to the middle intended for Dennis Pitta.","(6:30) Penalty: Holding on Baltimore (Vladimir Ducasse) -10 yards.","(6:54) Joe Flacco pass to the middle to Steve Smith Sr. for 5 yards to the Bal42. Tackled by Bobby McCain.","(6:59) 46 yard field goal attempt by Andrew Franks is NO GOOD. Holder: Matt Darr.","(7:48) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry defensed by Tavon Young.","(7:48) Jay Ajayi rush to the left for 3 yards to the Bal28. Tackled by Brandon Williams.","(8:24) Ryan Tannehill pass to the left to Jarvis Landry for 5 yards to the Bal31. Tackled by Jerraud Powers.","(9:06) Jay Ajayi rush to the left for 19 yards to the Bal36. Tackled by Eric Weddle.","(9:41) Jay Ajayi rush to the left for 5 yards to the Mia45. Tackled by Elvis Dumervil.","(10:21) Ryan Tannehill pass to the left to Dion Sims for 15 yards to the Mia40. Tackled by Lardarius Webb.","(10:57) Jay Ajayi rush to the right for no gain to the Mia25. Tackled by Timmy Jernigan.","(10:57) Justin Tucker kicks off to the endzone. Touchback.","(10:57) Justin Tucker extra point is good.","(11:02) Joe Flacco pass to the right to Terrance West for 3 yards for a TOUCHDOWN.","(11:39) Joe Flacco pass to the middle to Darren Waller for 15 yards to the Mia3. Tackled by Bacarri Rambo.","(11:47) Joe Flacco incomplete pass to the right intended for Steve Smith Sr. defensed by Isa Abdul-Quddus.","(12:21) Joe Flacco pass to the left to Mike Wallace for 12 yards to the Mia18. Tackled by Tony Lippett and Neville Hewitt.","(13:09) Joe Flacco pass to the left to Steve Smith Sr. for 23 yards to the Mia30. Tackled by Bacarri Rambo.","(13:43) Terrance West rush up the middle for 6 yards to the Bal47. Tackled by Kiko Alonso.","(14:22) Joe Flacco pass to the right to Dennis Pitta for 8 yards to the Bal41. Tackled by Kiko Alonso.","(14:56) Joe Flacco pass to the left to Kamar Aiken for 12 yards to the Bal33. Tackled by Kiko Alonso.","(15:00) Andrew Franks kicks off to the Bal4. Devin Hester return for 17 yards to Bal21. Tackled by Michael Thomas."]