["(0:39) Tom Brady rush up the middle for a loss of 1 yard to the NE23.","(1:15) Tom Brady rush up the middle for a loss of 1 yard to the NE24.","(1:15) Greg Zuerlein kicks off to the endzone. Touchback.","(1:15) Greg Zuerlein extra point is good.","(1:20) Jared Goff pass to the right to Kenny Britt for 1 yard for a TOUCHDOWN.","(1:20) Penalty: Encroachment on New England (Alan Branch) 0 yards.","(1:20) Penalty: Too Many Men on Field on New England 1 yards.","(1:20) Los Angeles Rams timeout.","(1:29) Benny Cunningham rush up the middle for a loss of 1 yard to the NE2. Tackled by Trey Flowers and Shea McClellin.","(2:00) Jared Goff pass to the right to Kenny Britt for 66 yards to the NE1. Tackled by Duron Harmon.","(2:00) Two Minute Warning.","(2:40) Jared Goff pass to the right to Tyler Higbee for 6 yards to the LA33. Tackled by Logan Ryan.","(2:50) Jared Goff incomplete pass to the right intended for Pharoh Cooper defensed by Malcolm Butler.","(3:29) Jared Goff sacked at LA27 for a loss of 7 yards by Shea McClellin.","(3:43) Ryan Allen punts for 40 yards to LA35. Pharoh Cooper return for a loss of 1 yard to LA34. Tackled by Nate Ebner and Jonathan Jones.","(3:43) Penalty: False Start on New England (Jonathan Jones) -5 yards.","(3:43) Tom Brady incomplete pass to the right intended for James Develin.","(3:48) Tom Brady pass to the right to Chris Hogan for 6 yards to the NE30.","(4:31) Tom Brady pass to the right to Chris Hogan for 2 yards to the NE24. Tackled by Lamarcus Joyner.","(5:15) Tom Brady pass to the left to Julian Edelman for 6 yards to the NE22. Tackled by Mike Jordan.","(5:52) LeGarrette Blount rush up the middle for 8 yards to the NE16. Tackled by Trumaine Johnson and Mark Barron.","(6:01) Johnny Hekker punts for 49 yards to NE8. No return.","(6:01) New England Patriots timeout.","(6:05) Jared Goff incomplete pass to the middle intended for Pharoh Cooper.","(6:09) Jared Goff incomplete pass to the right intended for Mike Thomas.","(6:14) Jared Goff incomplete pass to the right intended for Tyler Higbee defensed by Jabaal Sheard.","(6:36) Todd Gurley rush to the right for 3 yards to the LA43. Tackled by Malcom Brown and Dont'a Hightower.","(6:39) Jared Goff incomplete pass to the middle intended for Bradley Marquez.","(7:04) Todd Gurley rush to the left for 9 yards to the LA40. Tackled by Jabaal Sheard.","(7:17) Ryan Allen punts for 46 yards to LA32. Pharoh Cooper return for a loss of 1 yard to LA31. Tackled by Nate Ebner and Brandon King.","(7:23) Tom Brady incomplete pass to the left intended for Malcolm Mitchell defensed by Mike Jordan.","(8:01) LeGarrette Blount rush up the middle for 4 yards to the NE22. Tackled by Mark Barron and Alec Ogletree.","(8:44) LeGarrette Blount rush to the left for no gain to the NE18. Tackled by Mike Jordan and Alec Ogletree.","(9:10) Tom Brady pass to the left to Malcolm Mitchell for 13 yards to the NE18.","(9:24) Johnny Hekker punts for 76 yards to NE9. Cyrus Jones return for 1 yard to NE10. Tackled by Mike Thomas. Penalty: Holding on New England (Jonathan Jones) -5 yards.","(10:01) Jared Goff sacked at LA15 for a loss of 9 yards by Chris Long.","(10:38) Jared Goff pass to the right to Lance Kendricks for 2 yards to the LA24. Tackled by Malcolm Butler.","(10:41) Jared Goff incomplete pass to the right intended for Lance Kendricks.","(10:48) Stephen Gostkowski kicks off to the LA-2. Benny Cunningham return for 24 yards to LA22. Tackled by Brandon King.","(10:53) Stephen Gostkowski 45 yard field goal attempt is GOOD. Holder: Ryan Allen.","(10:57) Tom Brady incomplete pass to the left intended for Julian Edelman.","(11:36) Tom Brady pass to the right to Julian Edelman for 10 yards to the LA26. Tackled by T.J. McDonald.","(11:59) Penalty: Holding on New England (Martellus Bennett) -10 yards.","(12:36) LeGarrette Blount rush to the left for 4 yards to the LA26. Tackled by Aaron Donald.","(12:59) Tom Brady pass to the left to Malcolm Mitchell for 20 yards to the LA30.","(13:26) Tom Brady pass to the left to Malcolm Mitchell for 12 yards to the NE50.","(13:49) Tom Brady pass to the left to James White for 4 yards to the NE38. Tackled by Maurice Alexander.","(14:27) LeGarrette Blount rush to the right for 2 yards to the NE34. Tackled by Mark Barron and Cam Thomas.","(15:00) Tom Brady pass to the left to Julian Edelman for 9 yards to the NE32. Tackled by T.J. McDonald and Alec Ogletree.","(0:14) Tom Brady pass to the left to Dion Lewis for 7 yards to the NE23. Tackled by Alec Ogletree.","(0:23) Johnny Hekker punts for 51 yards to NE17. Danny Amendola return for a loss of 1 yard to NE16. Tackled by Mike Thomas.","(0:30) Jared Goff incomplete pass to the left intended for Brian Quick.","(1:11) Jared Goff pass to the right to Todd Gurley for 7 yards to the LA32. Tackled by Kyle Van Noy and Jabaal Sheard.","(1:34) Penalty: Holding on Los Angeles (Jamon Brown) -10 yards.","(1:43) Jared Goff incomplete pass to the left intended for Brian Quick.","(2:29) Jared Goff pass to the right to Brian Quick for 10 yards to the LA35. Tackled by Kyle Van Noy and Jabaal Sheard.","(3:06) Todd Gurley rush to the right for no gain to the LA25. Tackled by Vincent Valentine.","(3:06) Stephen Gostkowski kicks off to the endzone. Touchback.","(3:12) Stephen Gostkowski 45 yard field goal attempt is GOOD. Holder: Ryan Allen.","(3:49) Tom Brady pass to the left to James White for 3 yards to the LA27. Tackled by Mark Barron.","(4:28) LeGarrette Blount rush to the left for a loss of 1 yard to the LA30. Tackled by Mike Jordan and Matt Longacre.","(4:33) Tom Brady incomplete pass to the left intended for Malcolm Mitchell.","(4:56) Tom Brady pass to the left to Malcolm Mitchell for 11 yards to the LA29. Tackled by Alec Ogletree.","(5:02) Tom Brady incomplete pass to the left intended for Julian Edelman.","(5:08) Jared Goff pass intended for Tyler Higbee INTERCEPTED by Kyle Van Noy defensed by Jabaal Sheard. No return. Tackled by Tyler Higbee.","(5:08) Stephen Gostkowski kicks off to the endzone. Touchback.","(5:13) Stephen Gostkowski 48 yard field goal attempt is GOOD. Holder: Ryan Allen.","(5:18) Tom Brady incomplete pass to the left intended for Danny Amendola.","(5:55) LeGarrette Blount rush to the right for 1 yard to the LA30. Tackled by Michael Brockers.","(6:31) Tom Brady pass to the left to Chris Hogan for 1 yard to the LA31. Tackled by Lamarcus Joyner.","(7:07) Tom Brady pass to the right to Julian Edelman for 15 yards to the LA32. Tackled by Alec Ogletree.","(7:46) Tom Brady pass to the right to Julian Edelman for 32 yards to the LA47. Tackled by Maurice Alexander.","(7:50) Greg Zuerlein kicks off to the NE11. James White return for 10 yards to NE21. Tackled by Chase Reynolds.","(7:56) Greg Zuerlein 44 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(8:43) Jared Goff pass to the right to Brian Quick for 6 yards to the NE26. Tackled by Eric Rowe.","(9:19) Jared Goff pass to the right to Pharoh Cooper for 8 yards to the NE32. Tackled by Jabaal Sheard.","(9:48) Penalty: Holding on Los Angeles (Greg Robinson) -10 yards.","(10:25) Todd Gurley rush up the middle for 3 yards to the NE30. Tackled by Kyle Van Noy and Patrick Chung.","(10:49) Jared Goff pass to the right to Brian Quick for 17 yards to the NE33. Tackled by Logan Ryan.","(11:40) Jared Goff sacked at LA50 for a loss of 7 yards by Rob Ninkovich.","(12:11) Todd Gurley rush to the left for 3 yards to the NE43. Tackled by Malcom Brown and Shea McClellin.","(12:45) Todd Gurley rush to the left for 9 yards to the NE46. Tackled by Patrick Chung and Shea McClellin.","(12:56) Ryan Allen punts for 45 yards to LA39. Pharoh Cooper return for 6 yards to LA45. Tackled by Joe Cardona.","(13:00) Tom Brady incomplete pass to the left intended for Julian Edelman.","(13:03) Tom Brady incomplete pass to the left intended for Dion Lewis.","(13:40) Tom Brady pass to the left to Danny Amendola for 5 yards to the NE16. Tackled by T.J. McDonald.","(14:03) Penalty: Illegal Shift on New England -5 yards.","(14:14) Johnny Hekker punts for 55 yards to NE16. Danny Amendola - no return. Tackled by Mike Thomas.","(14:44) Jared Goff pass to the middle to Lance Kendricks for 11 yards to the LA29. Tackled by Kyle Van Noy and Shea McClellin.","(14:48) Jared Goff incomplete pass to the middle intended for Pharoh Cooper defensed by Jabaal Sheard.","(14:56) Jared Goff incomplete pass to the left intended for Kenny Britt defensed by Devin McCourty.","(14:57) Penalty: False Start on Los Angeles (Kenny Britt) -5 yards.","(15:00) Stephen Gostkowski kicks off to the LA-1. Benny Cunningham return for 24 yards to LA23. Tackled by Kyle Van Noy.","(0:06) Jared Goff rush up the middle for a loss of 1 yard to the LA24.","(0:11) Stephen Gostkowski kicks off to the LA0. Benny Cunningham return for 25 yards to LA25. Tackled by Nate Ebner.","(0:15) Stephen Gostkowski 28 yard field goal attempt is GOOD. Holder: Ryan Allen.","(0:21) Tom Brady incomplete pass to the left intended for Martellus Bennett defensed by T.J. McDonald.","(0:50) Tom Brady pass to the left to Malcolm Mitchell for 9 yards to the LA10. Tackled by Mike Jordan.","(1:21) Tom Brady pass to the left to Malcolm Mitchell for a loss of 3 yards to the LA19. Tackled by Mike Jordan.","(1:21) New England Patriots timeout.","(1:23) Tom Brady rush up the middle for 3 yards to the LA16. Tackled by Aaron Donald.","(2:00) James White rush to the right for 4 yards to the LA19. Tackled by Lamarcus Joyner.","(2:00) Two Minute Warning.","(2:48) Penalty: Offside on Los Angeles (Michael Brockers) 5 yards.","(2:48) LeGarrette Blount rush to the right for 6 yards to the LA28. Tackled by Trumaine Johnson.","(3:20) LeGarrette Blount rush to the right for no gain to the LA34. Tackled by Cory Littleton.","(3:51) Dion Lewis rush to the right for 9 yards to the LA34. Tackled by Alec Ogletree and T.J. McDonald.","(3:59) Tom Brady incomplete pass to the right intended for Julian Edelman.","(4:29) Tom Brady pass to the middle to Danny Amendola for 8 yards to the LA43. Tackled by Alec Ogletree and Lamarcus Joyner.","(5:02) Tom Brady pass to the left to Julian Edelman for 9 yards to the NE49. Tackled by Mike Jordan.","(5:30) LeGarrette Blount rush to the left for a loss of 2 yards to the NE40. Tackled by William Hayes.","(5:39) Johnny Hekker punts for 43 yards to NE43. Danny Amendola return for a loss of 1 yard to NE42. Tackled by Chase Reynolds.","(5:45) Jared Goff incomplete pass to the left intended for Kenny Britt defensed by Devin McCourty.","(6:16) Todd Gurley rush to the left for 5 yards to the LA14. Tackled by Eric Rowe.","(6:20) Jared Goff incomplete pass to the left intended for Todd Gurley.","(6:28) Ryan Allen punts for 34 yards to LA9. No return.","(6:39) Tom Brady incomplete pass to the middle intended for James White.","(7:14) Dion Lewis rush to the left for 3 yards to the LA43. Tackled by Maurice Alexander.","(7:21) Tom Brady incomplete pass to the right intended for Martellus Bennett.","(7:45) Tom Brady pass to the left to Malcolm Mitchell for 14 yards to the LA46. Tackled by Mike Jordan.","(9:02) LeGarrette Blount rush to the left for a loss of 1 yard to the NE40. Tackled by Cory Littleton and Alec Ogletree.","(9:02) LeGarrette Blount rush to the right for 3 yards to the NE41. Tackled by William Hayes.","(9:34) Tom Brady pass to the left to Danny Amendola for 17 yards to the NE38. Tackled by Mike Jordan and Alec Ogletree.","(10:25) Penalty: Holding on New England (Martellus Bennett) -10 yards.","(10:25) Tom Brady pass to the right to Julian Edelman for 7 yards to the NE31. Tackled by Lamarcus Joyner and Maurice Alexander.","(10:58) Tom Brady pass to the left to Martellus Bennett for 2 yards to the NE24. Tackled by Cory Littleton and E.J. Gaines.","(11:10) Johnny Hekker punts for 61 yards to NE14. Danny Amendola return for 8 yards to NE22. Tackled by Cory Littleton.","(11:45) Jared Goff pass to the left to Tyler Higbee for 10 yards to the LA25. Tackled by Logan Ryan.","(12:25) Jared Goff sacked at LA15 for a loss of 12 yards by Logan Ryan.","(13:04) Todd Gurley rush to the right for 2 yards to the LA27. Tackled by Malcom Brown.","(13:04) Stephen Gostkowski kicks off to the endzone. Touchback.","(13:04) Stephen Gostkowski extra point is good.","(13:13) Tom Brady pass to the left to Chris Hogan for 14 yards for a TOUCHDOWN.","(13:50) Dion Lewis rush to the left for 6 yards to the LA14. Tackled by Lamarcus Joyner.","(14:26) Dion Lewis rush up the middle for 5 yards to the LA20. Tackled by Alec Ogletree.","(15:00) Tom Brady pass to the left to Dion Lewis for 5 yards to the LA25. Tackled by Cory Littleton and Mark Barron.","(0:09) Jared Goff pass intended for Lance Kendricks INTERCEPTED by Malcolm Butler and returned for 7 yards. Tackled by Pharoh Cooper.","(0:52) Todd Gurley rush to the left for 3 yards to the LA32. Tackled by Trey Flowers and Rob Ninkovich.","(0:59) Jared Goff incomplete pass to the left intended for Brian Quick.","(1:40) Jared Goff pass to the left to Todd Gurley for 2 yards to the LA29. Tackled by Dont'a Hightower.","(2:21) Jared Goff pass to the right to Brian Quick for 9 yards to the LA27. Tackled by Logan Ryan.","(2:33) Ryan Allen punts for 39 yards to LA18. No return.","(2:40) Tom Brady incomplete pass to the left intended for Chris Hogan.","(3:21) Tom Brady pass to the middle to James White for 2 yards to the NE43. Tackled by Michael Brockers.","(3:57) LeGarrette Blount rush to the right for a loss of 2 yards to the NE41. Tackled by Ethan Westbrooks.","(4:22) Tom Brady pass to the right to Julian Edelman for 13 yards to the NE43.","(5:05) LeGarrette Blount rush to the right for 7 yards to the NE30. Tackled by Cory Littleton.","(5:39) LeGarrette Blount rush to the left for 4 yards to the NE23. Tackled by Cory Littleton and Matt Longacre.","(5:50) Johnny Hekker punts for 45 yards to NE19. Cyrus Jones - no return. FUMBLE, recovered by NE (Patrick Chung).","(6:37) Jared Goff pass to the left to Brian Quick for 6 yards to the LA36. Tackled by Duron Harmon and Patrick Chung.","(7:15) Todd Gurley rush to the left for 2 yards to the LA30. Tackled by Patrick Chung and Shea McClellin.","(7:20) Jared Goff incomplete pass to the right intended for Kenny Britt defensed by Malcolm Butler.","(7:28) Ryan Allen punts for 43 yards to LA24. Pharoh Cooper return for 4 yards to LA28. Tackled by Brandon Bolden.","(7:59) Tom Brady pass to the right to Dion Lewis for 2 yards to the NE33. Tackled by Maurice Alexander.","(8:36) James White rush to the right for 4 yards to the NE31. Tackled by Eugene Sims and Lamarcus Joyner.","(9:14) Tom Brady pass to the right to Martellus Bennett for 2 yards to the NE27. Tackled by Trumaine Johnson.","(9:38) Penalty: Holding on New England (Joe Thuney) -10 yards.","(9:46) Johnny Hekker punts for 50 yards to NE35. No return.","(9:53) Jared Goff incomplete pass to the right intended for Lance Kendricks.","(9:58) Jared Goff incomplete pass to the left intended for Kenny Britt.","(10:33) Todd Gurley rush to the right for a loss of 1 yard to the LA15. Tackled by Alan Branch.","(10:38) Stephen Gostkowski kicks off to the LA-3. Benny Cunningham return for 19 yards to LA16. Tackled by Shea McClellin and Elandon Roberts.","(10:38) Stephen Gostkowski extra point is good.","(10:46) LeGarrette Blount rush to the right for 43 yards for a TOUCHDOWN.","(11:23) Tom Brady pass to the right to James White for 9 yards to the LA43. Tackled by Michael Brockers.","(12:01) Tom Brady pass to the right to Dion Lewis for a loss of 3 yards to the NE48. Tackled by Trumaine Johnson.","(12:36) LeGarrette Blount rush to the left for 3 yards to the LA49. Tackled by E.J. Gaines and Alec Ogletree.","(13:09) Tom Brady pass to the left to Malcolm Mitchell for 6 yards to the NE48. Tackled by T.J. McDonald and Alec Ogletree.","(13:46) James White rush to the left for 9 yards to the NE42. Tackled by Maurice Alexander.","(14:20) LeGarrette Blount rush up the middle for 9 yards to the NE33. Tackled by E.J. Gaines and Eugene Sims.","(14:57) Dion Lewis rush to the left for 4 yards to the NE24. Tackled by Michael Brockers and Aaron Donald.","(15:00) Greg Zuerlein kicks off to the NE-4. Cyrus Jones return for 24 yards to NE20. Tackled by Cory Littleton."]