["(0:31) Scott Tolzien rush for a loss of 1 yard to the NYJ25.","(1:01) Scott Tolzien rush for a loss of 2 yards to the NYJ24.","(1:41) Scott Tolzien rush for no gain to the NYJ22.","(1:47) Bryce Petty pass intended for Robby Anderson INTERCEPTED by Darryl Morris. No return. Tackled by Robby Anderson.","(1:57) Josh Ferguson rush to the right for 11 yards to the NYJ9. Tackled by Jordan Jenkins.","(2:03) Josh Ferguson rush to the right for a loss of 2 yards to the NYJ20. Tackled by David Harris.","(2:48) Josh Ferguson rush to the left for a loss of 1 yard to the NYJ18. Tackled by Mike Catapano and Marcus Gilchrist.","(3:33) Josh Ferguson rush to the right for 1 yard to the NYJ17. Tackled by Muhammad Wilkerson and Jordan Jenkins.","(4:18) Scott Tolzien pass to the left to Erik Swoope for 11 yards to the NYJ18. Tackled by Darron Lee.","(5:00) Josh Ferguson rush to the right for 2 yards to the NYJ29. Tackled by Jordan Jenkins and Darron Lee.","(5:06) Penalty: Pass Interference on New York (Darrelle Revis) 7 yards.","(5:49) Jordan Todman rush to the right for 1 yard to the NYJ38. Tackled by Muhammad Wilkerson.","(6:32) Jordan Todman rush to the right for 2 yards to the NYJ39. Tackled by Deon Simon.","(6:37) Bryce Petty incomplete pass to the right intended for Brandon Marshall.","(6:40) Bryce Petty incomplete pass to the left intended for Bilal Powell.","(6:44) Bryce Petty incomplete pass to the right intended for Robby Anderson.","(7:05) Penalty: False Start on New York (Breno Giacomini) -5 yards.","(7:42) Bryce Petty pass to the left to Robby Anderson for 7 yards to the NYJ46. Tackled by Antonio Morrison.","(8:22) Bryce Petty pass to the right to Austin Seferian-Jenkins for 19 yards to the NYJ39. Tackled by T.J. Green.","(9:01) Bryce Petty pass to the right to Robby Anderson for 6 yards to the NYJ20. Tackled by Rashaan Melvin.","(9:09) Pat McAfee punts for 51 yards to NYJ14. No return.","(9:44) Robert Turbin rush up the middle for a loss of 1 yard to the Ind35. Tackled by David Harris.","(10:27) Robert Turbin rush to the right for 7 yards to the Ind36. Tackled by Rontez Miles.","(11:12) Robert Turbin rush to the left for 1 yard to the Ind29. Tackled by Buster Skrine.","(11:19) Nick Folk kicks off to the Ind2. Jordan Todman return for 26 yards to Ind28. Tackled by Marcus Gilchrist.","(11:19) Nick Folk extra point is good.","(11:26) Bryce Petty pass to the middle to Robby Anderson for 40 yards for a TOUCHDOWN.","(11:31) Bryce Petty incomplete pass to the left intended for Austin Seferian-Jenkins.","(11:36) Bryce Petty incomplete pass to the right intended for Robby Anderson.","(12:16) C.J. Spiller rush to the left for 2 yards to the Ind40. Tackled by Curt Maggitt and Antonio Morrison.","(12:19) Bryce Petty incomplete pass to the right intended for Charone Peake.","(12:58) Bryce Petty pass to the right to Brandon Marshall for 9 yards to the Ind42. Tackled by Edwin Jackson.","(13:36) Bryce Petty pass to the right to Brandon Marshall for 4 yards to the NYJ49. Tackled by Rashaan Melvin.","(14:14) Bryce Petty pass to the middle to Robby Anderson for 8 yards to the NYJ45. Tackled by Edwin Jackson.","(14:19) Bryce Petty incomplete pass to the right intended for Robby Anderson.","(14:22) Bryce Petty incomplete pass to the left intended for C.J. Spiller.","(14:54) Bryce Petty pass to the left to Brandon Bostick for 12 yards to the NYJ37. Tackled by D'Qwell Jackson.","(14:54) Pat McAfee kicks off to the endzone. Touchback.","(14:54) Adam Vinatieri extra point is good.","(15:00) Robert Turbin rush to the right for 5 yards for a TOUCHDOWN.","(0:14) Robert Turbin rush up the middle for 1 yard to the NYJ5. Tackled by Darron Lee and Deon Simon.","(0:30) Bryce Petty pass intended for Robby Anderson INTERCEPTED by Mike Adams and returned for 56 yards. Tackled by Ben Ijalana.","(1:02) Bryce Petty pass to the right to Matt Forte for 7 yards to the NYJ27. Tackled by Rashaan Melvin.","(1:08) Pat McAfee kicks off to the NYJ1. Jeremy Ross return for 19 yards to NYJ20. Tackled by Robert Turbin and Curt Maggitt.","(1:11) Adam Vinatieri 36 yard field goal attempt is GOOD.","(1:16) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(2:00) Frank Gore rush to the left for 1 yard to the NYJ18. Tackled by Leonard Williams.","(2:40) Frank Gore rush to the left for 6 yards to the NYJ19. Tackled by David Harris.","(3:25) Andrew Luck pass to the middle to Dwayne Allen for 21 yards to the NYJ25. Tackled by Rontez Miles.","(4:06) Robert Turbin rush up the middle for 3 yards to the NYJ46. Tackled by Muhammad Wilkerson.","(4:47) Frank Gore rush to the left for 1 yard to the NYJ49. Tackled by Marcus Gilchrist and Leonard Williams.","(5:35) Andrew Luck rush to the left for 8 yards to the 50. Tackled by David Harris.","(5:41) Andrew Luck incomplete pass to the left intended for Donte Moncrief defensed by Darrelle Revis.","(6:19) Frank Gore rush to the right for 3 yards to the Ind42. Tackled by David Harris.","(6:34) Lachlan Edwards punts for 54 yards to Ind9. Chester Rogers return for 30 yards to Ind39. Tackled by Lachlan Edwards.","(6:39) Bryce Petty incomplete pass to the left intended for Robby Anderson.","(6:44) Bryce Petty incomplete pass to the left intended for Brandon Marshall.","(6:49) Bryce Petty incomplete pass to the left intended for Matt Forte defensed by Trent Cole.","(7:25) Bryce Petty pass to the left to Brandon Marshall for 13 yards to the NYJ37. Tackled by Mike Adams.","(7:34) Bryce Petty incomplete pass to the left intended for Robby Anderson defensed by Darius Butler.","(8:15) Bryce Petty sacked at NYJ24 for a loss of 2 yards by David Parry.","(8:48) Bryce Petty pass to the right to Austin Seferian-Jenkins for 10 yards to the NYJ26. Tackled by Rashaan Melvin.","(8:54) Pat McAfee kicks off to the NYJ1. Jeremy Ross return for 15 yards to NYJ16. Tackled by Chris Carter and Antonio Morrison.","(8:54) Adam Vinatieri extra point is good.","(8:59) Andrew Luck pass to the middle to Donte Moncrief for 3 yards for a TOUCHDOWN.","(9:34) Andrew Luck pass to the right to T.Y. Hilton for 7 yards to the NYJ3. Tackled by Marcus Gilchrist.","(10:14) Frank Gore rush to the left for 1 yard to the NYJ10. Tackled by Leonard Williams.","(10:56) Andrew Luck pass to the right to T.Y. Hilton for 24 yards to the NYJ11. Tackled by Marcus Gilchrist.","(11:38) Andrew Luck pass to the right to Donte Moncrief for 5 yards to the NYJ35. Tackled by Rontez Miles and Darrelle Revis.","(12:15) Frank Gore rush to the left for 6 yards to the NYJ40. Tackled by Deon Simon and Leonard Williams.","(12:57) Andrew Luck pass to the left to T.Y. Hilton for 17 yards to the NYJ46. Tackled by Buster Skrine.","(13:38) Frank Gore rush up the middle for 1 yard to the Ind37. Tackled by Leonard Williams and Deon Simon.","(14:19) Andrew Luck pass to the left to Donte Moncrief for 8 yards to the Ind36. Tackled by Darryl Roberts.","(14:56) Frank Gore rush to the left for 3 yards to the Ind28. Tackled by Darryl Roberts.","(15:00) Andrew Luck incomplete pass to the right intended for Donte Moncrief.","(15:00) Nick Folk kicks off to the endzone. Touchback.","(0:29) Ryan Fitzpatrick rush for a loss of 1 yard to the NYJ19.","(0:38) Andrew Luck pass to the middle to Jack Doyle for 14 yards to the NYJ1. Tackled by Rontez Miles. FUMBLE, recovered by NYJ and returned for a loss of 1 yard. Touchback.","(0:44) Penalty: Pass Interference on New York (Julian Stanford) 39 yards.","(0:51) Ryan Fitzpatrick pass intended for Brandon Marshall INTERCEPTED by Darius Butler. No return. Tackled by Brandon Marshall.","(1:11) Ryan Fitzpatrick rush to the right for 4 yards to the NYJ29. Tackled by Erik Walden and D'Qwell Jackson.","(1:18) Pat McAfee kicks off to the NYJ-2. Jeremy Ross return for 27 yards to NYJ25. Tackled by Matthias Farley and Chris Carter.","(1:18) Adam Vinatieri extra point is good.","(1:24) Andrew Luck pass to the left to Dwayne Allen for 23 yards for a TOUCHDOWN.","(2:00) Andrew Luck pass to the left to Jack Doyle for 2 yards to the NYJ23. Tackled by Darron Lee and Darrelle Revis.","(2:45) Andrew Luck pass to the middle to T.Y. Hilton for 15 yards to the NYJ25. Tackled by Darrelle Revis.","(3:27) Andrew Luck pass to the right to Erik Swoope for 4 yards to the NYJ40. Tackled by Darron Lee.","(4:07) Frank Gore rush to the right for 6 yards to the NYJ44. Tackled by Muhammad Wilkerson and David Harris.","(4:44) Frank Gore rush up the middle for 6 yards to the 50. Tackled by David Harris and Marcus Gilchrist.","(5:23) Andrew Luck pass to the left to T.Y. Hilton for 7 yards to the Ind44. Tackled by Rontez Miles.","(6:02) Frank Gore rush to the right for 5 yards to the Ind37. Tackled by Mike Catapano.","(6:38) Andrew Luck pass to the left to Jack Doyle for 2 yards to the Ind32. Tackled by Darron Lee.","(6:45) Lachlan Edwards punts for 36 yards to Ind30. No return.","(6:49) Ryan Fitzpatrick incomplete pass to the left intended for Charone Peake.","(7:30) Matt Forte rush up the middle for 3 yards to the NYJ34. Tackled by Edwin Jackson.","(8:10) Matt Forte rush to the left for 1 yard to the NYJ31. Tackled by Hassan Ridgeway and D'Qwell Jackson.","(8:16) Pat McAfee kicks off to the NYJ2. Jeremy Ross return for 28 yards to NYJ30. Tackled by Matthias Farley.","(8:20) Adam Vinatieri 53 yard field goal attempt is GOOD.","(8:25) Andrew Luck incomplete pass to the left intended for Phillip Dorsett.","(8:30) Andrew Luck incomplete pass to the middle intended for Erik Swoope.","(9:13) Frank Gore rush to the right for a loss of 2 yards to the NYJ35. Tackled by Deon Simon and Leonard Williams.","(9:58) Frank Gore rush to the right for 19 yards to the NYJ33. Tackled by Marcus Gilchrist and Rontez Miles.","(10:31) Andrew Luck pass to the left to T.Y. Hilton for 23 yards to the Ind48. Tackled by Marcus Gilchrist.","(10:31) Nick Folk kicks off to the endzone. Touchback.","(10:36) Nick Folk 38 yard field goal attempt is GOOD.","(10:56) Bilal Powell rush up the middle for 3 yards to the Ind5. Tackled by Trent Cole. Penalty: Unnecessary Roughness on New York (Breno Giacomini) -15 yards.","(10:56) Indianapolis TIMEOUT.","(11:00) Ryan Fitzpatrick incomplete pass to the right intended for Austin Seferian-Jenkins defensed by Rashaan Melvin.","(11:45) Matt Forte rush up the middle for 5 yards to the Ind8. Tackled by Trent Cole.","(12:09) Ryan Fitzpatrick pass to the right to Matt Forte for 40 yards to the Ind26. Tackled by Darius Butler. Penalty: Roughing Passer on Indianapolis (Zach Kerr) 13 yards.","(12:48) C.J. Spiller rush up the middle for 3 yards to the NYJ34. Tackled by Mike Adams.","(13:15) Ryan Fitzpatrick pass to the left to C.J. Spiller for 7 yards to the NYJ31. Tackled by Edwin Jackson.","(13:46) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 10 yards to the NYJ24.","(14:18) Ryan Fitzpatrick pass to the right to Matt Forte for 7 yards to the NYJ14. Tackled by Edwin Jackson.","(15:00) Matt Forte rush up the middle for 4 yards to the NYJ7. Tackled by Zach Kerr and Mike Adams.","(0:12) Pat McAfee punts for 44 yards to NYJ3. No return.","(0:51) Frank Gore rush to the right for 6 yards to the NYJ47. Tackled by Rontez Miles.","(1:29) Frank Gore rush up the middle for 7 yards to the Ind47. Tackled by Darron Lee and Muhammad Wilkerson.","(1:51) Penalty: Delay of Game on Indianapolis (Andrew Luck) -5 yards.","(2:38) Andrew Luck sacked at Ind45 for a loss of 7 yards by Leonard Williams.","(2:45) Penalty: Holding on Indianapolis (Jack Mewhort) -10 yards.","(2:45) New York TIMEOUT.","(3:02) Andrew Luck pass to the left to Donte Moncrief for 10 yards to the NYJ38. Tackled by Darryl Roberts.","(3:06) Andrew Luck incomplete pass to the middle intended for Frank Gore defensed by Jordan Jenkins.","(3:51) Frank Gore rush to the left for 1 yard to the NYJ48. Tackled by Muhammad Wilkerson.","(4:11) Andrew Luck rush to the right for 12 yards to the Ind36. Penalty: Unnecessary Roughness on New York (Sheldon Richardson) 15 yards.","(4:53) Frank Gore rush up the middle for 4 yards to the Ind24. Tackled by Leonard Williams and Muhammad Wilkerson.","(5:02) Lachlan Edwards punts for 56 yards to Ind0. Touchback.","(5:37) Matt Forte rush up the middle for a loss of 3 yards to the NYJ44. Tackled by Edwin Jackson.","(6:14) Matt Forte rush to the right for 2 yards to the NYJ47. Tackled by D'Qwell Jackson.","(6:55) Matt Forte rush to the right for 7 yards to the NYJ45. Tackled by Darius Butler.","(7:41) Ryan Fitzpatrick pass to the left to Brandon Marshall for 17 yards to the NYJ38. Tackled by Mike Adams.","(7:45) Pat McAfee kicks off to the NYJ3. Jeremy Ross return for 18 yards to NYJ21. Tackled by Antonio Morrison.","(7:45) Adam Vinatieri extra point is good.","(7:53) Andrew Luck pass to the right to Dwayne Allen for 21 yards for a TOUCHDOWN.","(8:28) Andrew Luck pass to the right to T.Y. Hilton for 34 yards to the NYJ21.","(9:04) Frank Gore rush to the right for 2 yards to the Ind45. Tackled by Buster Skrine and David Harris.","(9:32) Andrew Luck pass to the right to Jack Doyle for 12 yards to the Ind43. Tackled by Darron Lee.","(9:39) Lachlan Edwards punts for 38 yards to Ind31. No return.","(9:44) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa.","(10:19) Matt Forte rush up the middle for 6 yards to the NYJ31. Tackled by Edwin Jackson.","(10:23) Ryan Fitzpatrick incomplete pass to the left intended for Austin Seferian-Jenkins.","(10:23) Pat McAfee kicks off to the endzone. Touchback.","(10:23) Adam Vinatieri extra point is good.","(10:29) Andrew Luck pass to the left to Dwayne Allen for 7 yards for a TOUCHDOWN.","(11:07) Frank Gore rush to the left for 2 yards to the NYJ7. Tackled by Jordan Jenkins.","(11:29) Phillip Dorsett rush to the right for 7 yards to the NYJ18. Penalty: Unnecessary Roughness on New York (Buster Skrine) 9 yards.","(11:57) Andrew Luck pass to the right to T.Y. Hilton for 13 yards to the NYJ25. Tackled by Darrelle Revis.","(12:30) Andrew Luck pass to the left to T.Y. Hilton for 6 yards to the NYJ38.","(13:15) Andrew Luck rush up the middle for 6 yards to the NYJ44. Tackled by Leonard Williams.","(13:56) Frank Gore rush to the right for 1 yard to the 50. Tackled by Rontez Miles.","(14:06) Lachlan Edwards punts for 46 yards to Ind43. Chester Rogers return for 6 yards to Ind49. Tackled by Josh Martin and Antonio Allen.","(14:11) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(14:15) Ryan Fitzpatrick incomplete pass to the right intended for Robby Anderson.","(14:57) Matt Forte rush to the right for no gain to the NYJ11. Tackled by Arthur Jones.","(15:00) Pat McAfee kicks off to the NYJ-2. Jeremy Ross return for 13 yards to NYJ11. Tackled by Chris Milton."]