["(0:41) Carson Palmer rush up the middle for a loss of 1 yard to the Ari19.","(0:48) Kirk Cousins pass intended for Jamison Crowder INTERCEPTED by Patrick Peterson and returned for 2 yards. Tackled by Jamison Crowder.","(0:52) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(0:57) Kirk Cousins pass to the right to Vernon Davis for 6 yards to the Ari28. Tackled by Tony Jefferson.","(1:16) Kirk Cousins pass to the right to Vernon Davis for 18 yards to the Ari34. Tackled by Patrick Peterson.","(1:22) Penalty: Illegal Use of Hands on Arizona (Patrick Peterson) 5 yards.","(1:27) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(1:33) Penalty: Roughing Passer on Arizona (Calais Campbell) 15 yards.","(1:56) Kirk Cousins pass to the right to Pierre Garcon for 3 yards to the Was28. Tackled by Markus Golden.","(1:56) Chandler Catanzaro kicks off to the endzone. Touchback.","(1:56) Two Minute Warning.","(1:56) Chandler Catanzaro extra point is good.","(2:03) Carson Palmer pass to the right to J.J. Nelson for 42 yards for a TOUCHDOWN.","(2:03) Washington Redskins timeout.","(2:07) David Johnson rush up the middle for no gain to the Was42. Tackled by Mason Foster.","(2:11) Penalty: Holding on Washington (Josh Norman) 5 yards.","(2:16) Carson Palmer incomplete pass to the right.","(2:59) Carson Palmer pass to the right to Michael Floyd for 5 yards to the Was47. Tackled by Bashaud Breeland.","(3:47) David Johnson rush up the middle for 14 yards to the Ari48. Tackled by Josh Norman.","(4:32) Carson Palmer pass to the left to David Johnson for 2 yards to the Ari34. Tackled by Josh Norman.","(4:32) Arizona Cardinals timeout.","(5:14) Carson Palmer pass to the middle to Larry Fitzgerald for 4 yards to the Ari32. Tackled by Ricky Jean Francois.","(6:01) David Johnson rush to the left for 3 yards to the Ari28. Tackled by Duke Ihenacho.","(6:01) Dustin Hopkins kicks off to the endzone. Touchback.","(6:06) Dustin Hopkins 53 yard field goal attempt is GOOD. Holder: Tress Way.","(6:11) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(6:55) Kirk Cousins pass to the right to Maurice Harris for a loss of 2 yards to the Ari35. Tackled by Deone Bucannon.","(7:36) Rob Kelley rush to the left for 3 yards to the Ari33. Tackled by Frostee Rucker.","(8:17) Kirk Cousins pass to the left to Vernon Davis for 7 yards to the Ari36. Tackled by Tony Jefferson.","(8:56) Kirk Cousins pass to the middle to Vernon Davis for 11 yards to the Ari43. Tackled by Deone Bucannon.","(9:41) Rob Kelley rush to the right for a loss of 3 yards to the Was46. Tackled by Deone Bucannon.","(10:18) Kirk Cousins pass to the left to Jamison Crowder for 14 yards to the Was49. Tackled by Kevin Minter.","(10:27) Kirk Cousins incomplete pass to the right.","(11:09) Rob Kelley rush up the middle for 10 yards to the Was35. Tackled by Kevin Minter and Tyvon Branch.","(11:09) Chandler Catanzaro kicks off to the endzone. Touchback.","(11:09) Chandler Catanzaro extra point is good.","(11:16) Carson Palmer pass to the right to David Johnson for 25 yards for a TOUCHDOWN.","(11:38) Carson Palmer pass to the right to Larry Fitzgerald for 5 yards to the Was25. Tackled by Bashaud Breeland and Mason Foster.","(12:20) David Johnson rush up the middle for 13 yards to the Was30. Tackled by Will Blackmon.","(13:00) Carson Palmer pass to the middle to Jermaine Gresham for 11 yards to the Was43. Tackled by Kendall Fuller and Mason Foster.","(13:36) Carson Palmer pass to the left to Jermaine Gresham for 9 yards to the Ari46. Tackled by Will Blackmon.","(14:13) Carson Palmer pass to the right to Darren Fells for 9 yards to the Ari37. Tackled by Kendall Fuller.","(14:17) Penalty: Holding on Arizona (Jermaine Gresham) -10 yards.","(15:00) Carson Palmer pass to the middle to Larry Fitzgerald for 3 yards to the Ari38. Tackled by Duke Ihenacho.","(0:17) Carson Palmer pass to the middle to Larry Fitzgerald for 3 yards to the Ari35. Tackled by Will Compton and Donte Whitner.","(1:00) Carson Palmer pass to the right to Jermaine Gresham for 7 yards to the Ari32. Tackled by Will Compton.","(1:06) Carson Palmer incomplete pass to the right intended for Michael Floyd.","(1:06) Dustin Hopkins kicks off to the endzone. Touchback.","(1:06) Dustin Hopkins extra point is good.","(1:12) Kirk Cousins pass to the right to Jamison Crowder for 26 yards for a TOUCHDOWN.","(1:19) Kirk Cousins incomplete pass to the right intended for Jamison Crowder defensed by Tyvon Branch.","(1:26) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(2:05) Chris Thompson rush up the middle for 16 yards to the Ari26. Tackled by Chandler Jones.","(2:09) Kirk Cousins incomplete pass to the middle intended for Vernon Davis defensed by Tony Jefferson.","(2:50) Kirk Cousins pass to the left to Pierre Garcon for 28 yards to the Ari42. Tackled by Tony Jefferson.","(3:32) Kirk Cousins pass to the left to Jamison Crowder for 2 yards to the Was30. Tackled by Tyvon Branch.","(4:10) Rob Kelley rush up the middle for 3 yards to the Was28. Tackled by Deone Bucannon.","(4:10) Chandler Catanzaro kicks off to the endzone. Touchback.","(4:10) Chandler Catanzaro extra point is good.","(4:16) Carson Palmer pass to the left to Michael Floyd for 6 yards for a TOUCHDOWN.","(4:20) Carson Palmer incomplete pass to the right intended for David Johnson defensed by Ziggy Hood.","(5:01) David Johnson rush up the middle for 4 yards to the Was6. Tackled by Preston Smith.","(5:13) Kirk Cousins sacked at Was30 for a loss of 15 yards by Calais Campbell. FUMBLE, recovered by Ari (Markus Golden) and returned for 20 yards. Tackled by Chris Thompson.","(5:34) Rob Kelley rush up the middle for 2 yards to the Was45. Tackled by Josh Mauro.","(5:40) 53 yard field goal attempt by Chandler Catanzaro is NO GOOD. Holder: Drew Butler.","(6:28) Carson Palmer sacked at Was35 for a loss of 10 yards by Trent Murphy.","(7:11) Andre Ellington rush up the middle for a loss of 2 yards to the Was25. Tackled by Ziggy Hood.","(7:19) Carson Palmer incomplete pass to the right intended for David Johnson defensed by Quinton Dunbar.","(8:03) Carson Palmer pass to the left to Michael Floyd for 7 yards to the Was23. Tackled by Will Blackmon.","(8:08) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(8:48) Andre Ellington rush to the left for a loss of 1 yard to the Was30. Tackled by Cullen Jenkins.","(9:18) Penalty: Offside on Washington (Ryan Kerrigan) 5 yards.","(9:53) Carson Palmer pass to the right to David Johnson for 12 yards to the Was34. Tackled by Su'a Cravens.","(9:58) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Quinton Dunbar.","(10:38) Carson Palmer pass to the left to Larry Fitzgerald for 4 yards to the Was46. Tackled by Trent Murphy.","(11:14) David Johnson rush up the middle for 5 yards to the Ari50. Tackled by Ziggy Hood.","(11:57) David Johnson rush up the middle for 9 yards to the Ari45. Tackled by Duke Ihenacho.","(12:36) Carson Palmer pass to the left to Jermaine Gresham for 11 yards to the Ari36. Tackled by Preston Smith.","(12:36) Dustin Hopkins kicks off to the endzone. Touchback.","(12:36) Dustin Hopkins extra point is good.","(12:45) Kirk Cousins rush up the middle for 1 yard for a TOUCHDOWN.","(13:32) Rob Kelley rush up the middle for 4 yards to the Ari1. Tackled by Josh Mauro.","(13:39) Kirk Cousins incomplete pass to the right.","(14:15) Kirk Cousins pass to the right to DeSean Jackson for 59 yards to the Ari5. Tackled by Tyvon Branch.","(14:55) Kirk Cousins pass to the left to Pierre Garcon for 10 yards to the Was36. Tackled by Marcus Cooper.","(15:00) Chandler Catanzaro kicks off to the Was0. Maurice Harris return for 26 yards to Was26. Tackled by Brittan Golden.","(0:02) Kirk Cousins rush up the middle for a loss of 1 yard to the Was18.","(0:07) Chandler Catanzaro kicks off to the Was15. Maurice Harris return for 4 yards to Was19. Tackled by Justin Bethel. FUMBLE, recovered by Was (Chris Thompson).","(0:11) Chandler Catanzaro 28 yard field goal attempt is GOOD. Holder: Drew Butler.","(0:16) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Josh Norman.","(0:17) Carson Palmer incomplete pass to the middle.","(0:29) Carson Palmer pass to the left to David Johnson for 8 yards to the Was10. Tackled by Su'a Cravens.","(0:29) Arizona Cardinals timeout.","(0:36) Carson Palmer pass to the left to David Johnson for 23 yards to the Was18. Tackled by Will Blackmon.","(0:36) Arizona Cardinals timeout.","(0:48) Carson Palmer sacked at Was41 for a loss of 9 yards by Ryan Kerrigan.","(1:09) Carson Palmer pass to the left to Larry Fitzgerald for 7 yards to the Was32. Tackled by Bashaud Breeland.","(1:29) David Johnson rush up the middle for 4 yards to the Was39. Tackled by Will Compton.","(1:29) Arizona Cardinals timeout.","(1:37) Carson Palmer pass to the middle to David Johnson for 9 yards to the Was43. Tackled by Will Compton.","(1:40) Carson Palmer incomplete pass to the right intended for Jermaine Gresham.","(1:49) Carson Palmer pass to the left to Larry Fitzgerald for 23 yards to the Ari48. Tackled by Will Compton.","(1:52) Carson Palmer incomplete pass to the right intended for John Brown.","(1:52) Dustin Hopkins kicks off to the endzone. Touchback.","(1:55) Dustin Hopkins 20 yard field goal attempt is GOOD. Holder: Tress Way.","(2:00) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(2:00) Two Minute Warning.","(2:14) Rob Kelley rush up the middle for no gain to the Ari1. Tackled by Kevin Minter.","(3:00) Kirk Cousins pass to the right to Vernon Davis for 5 yards to the Ari1. Tackled by Patrick Peterson and Chandler Jones.","(3:05) Penalty: Illegal Shift on Washington (Derek Carrier) -5 yards.","(3:44) Kirk Cousins pass to the left to Ryan Grant for 13 yards to the Ari1. Tackled by Marcus Cooper.","(4:19) Rob Kelley rush up the middle for 4 yards to the Ari14. Tackled by Markus Golden and Tony Jefferson.","(5:01) Kirk Cousins pass to the right to Ryan Grant for 7 yards to the Ari18. Tackled by D.J. Swearinger.","(5:31) Kirk Cousins pass to the left to Pierre Garcon for 8 yards to the Ari25. Tackled by Marcus Cooper.","(6:17) Kirk Cousins pass to the middle to Pierre Garcon for 9 yards to the Ari33. Tackled by Calais Campbell.","(6:58) Rob Kelley rush up the middle for 3 yards to the Ari42. Tackled by Patrick Peterson.","(7:18) Chris Thompson rush to the right for 8 yards to the Ari45. Tackled by D.J. Swearinger.","(7:18) Penalty: False Start on Washington (Brandon Scherff) -5 yards.","(7:26) Drew Butler punts for 28 yards to Ari48. No return.","(7:56) Andre Ellington rush to the left for 8 yards to the Ari20. Tackled by Duke Ihenacho.","(8:40) Carson Palmer pass to the left to David Johnson for 2 yards to the Ari12. Tackled by Kendall Fuller.","(9:10) Penalty: Pass Interference on Arizona (Michael Floyd) -10 yards.","(9:48) David Johnson rush up the middle for a loss of 5 yards to the Ari20. Tackled by Josh Norman.","(9:48) Dustin Hopkins kicks off to the endzone. Touchback.","(9:53) Dustin Hopkins 47 yard field goal attempt is GOOD. Holder: Tress Way.","(9:57) Kirk Cousins incomplete pass to the middle intended for Chris Thompson.","(10:16) Penalty: False Start on Washington (Shawn Lauvao) -5 yards.","(10:57) Rob Kelley rush to the right for 4 yards to the Ari24. Tackled by Calais Campbell.","(11:33) Rob Kelley rush up the middle for no gain to the Ari28. Tackled by Deone Bucannon.","(12:15) Rob Kelley rush up the middle for 19 yards to the Ari28. Tackled by Tyvon Branch.","(12:44) Kirk Cousins pass to the right to Chris Thompson for 21 yards to the Ari47. Tackled by D.J. Swearinger.","(13:21) Rob Kelley rush up the middle for 1 yard to the Was32. Tackled by Kevin Minter and Deone Bucannon.","(13:32) Drew Butler punts for 50 yards to Was24. Jamison Crowder return for 7 yards to Was31. Tackled by Tony Jefferson and Zaviar Gooden.","(13:37) Carson Palmer incomplete pass to the right intended for David Johnson.","(14:15) David Johnson rush to the right for 3 yards to the Ari26. Tackled by Su'a Cravens.","(14:19) Carson Palmer incomplete pass to the middle intended for Larry Fitzgerald.","(15:00) Carson Palmer pass to the left to Larry Fitzgerald for 14 yards to the Ari23. Tackled by Josh Norman.","(0:19) David Johnson rush up the middle for 1 yard to the Ari9. Tackled by Ziggy Hood.","(1:01) David Johnson rush up the middle for 4 yards to the Ari8. Tackled by Josh Norman.","(1:01) Penalty: False Start on Arizona (John Wetzel) -4 yards.","(1:07) Tress Way punts for 30 yards to Ari15. No return. Penalty: Holding on Arizona (Tharold Simon) -7 yards.","(1:12) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(1:18) Kirk Cousins incomplete pass to the left intended for Rob Kelley defensed by Calais Campbell.","(1:24) Kirk Cousins incomplete pass to the left.","(2:06) Kirk Cousins pass to the left to Pierre Garcon for 11 yards to the Ari45. Tackled by Marcus Cooper.","(2:09) Kirk Cousins incomplete pass to the left intended for Pierre Garcon defensed by Chandler Jones.","(2:45) Rob Kelley rush up the middle for 13 yards to the Was44. Tackled by Marcus Cooper and Tony Jefferson.","(3:25) Kirk Cousins pass to the left to Derek Carrier for 6 yards to the Was31. Tackled by Deone Bucannon.","(3:35) Drew Butler punts for 41 yards to Was15. Jamison Crowder return for 10 yards to Was25. Tackled by Tony Jefferson.","(3:40) Carson Palmer incomplete pass to the right.","(3:44) Carson Palmer incomplete pass to the left intended for Michael Floyd defensed by Bashaud Breeland.","(4:23) Carson Palmer pass to the left to Larry Fitzgerald for 3 yards to the Ari44. Tackled by Su'a Cravens.","(4:34) Tress Way punts for 59 yards to Ari28. Patrick Peterson return for 13 yards to Ari41. Tackled by Terence Garvin.","(5:10) Kirk Cousins sacked at Was13 for a loss of 10 yards by Kevin Minter.","(5:15) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(5:32) Penalty: False Start on Washington (Shawn Lauvao) -5 yards.","(6:02) Penalty: False Start on Washington (Vernon Davis) -5 yards.","(6:37) Kirk Cousins pass to the left to Pierre Garcon for 9 yards to the Was33. Tackled by Marcus Cooper.","(6:43) Chandler Catanzaro kicks off to the Was-2. Chris Thompson return for 26 yards to Was24. Tackled by Justin Bethel.","(6:43) Chandler Catanzaro extra point is good.","(6:48) David Johnson rush up the middle for 1 yard for a TOUCHDOWN.","(7:31) David Johnson rush up the middle for no gain to the Was1. Tackled by Ryan Kerrigan.","(8:12) Carson Palmer pass to the left to Jermaine Gresham for 14 yards to the Was1. Tackled by Bashaud Breeland.","(8:16) Carson Palmer incomplete pass to the left intended for Andre Ellington defensed by Ricky Jean Francois.","(8:57) Andre Ellington rush up the middle for a loss of 2 yards to the Was15. Tackled by Ricky Jean Francois.","(9:41) Carson Palmer pass to the right to Andre Ellington for 10 yards to the Was13. Tackled by Donte Whitner and Trent Murphy.","(10:20) David Johnson rush up the middle for 6 yards to the Was23. Tackled by Will Compton.","(11:12) David Johnson rush up the middle for 10 yards to the Was29. Tackled by Bashaud Breeland. FUMBLE, recovered by Ari (Mike Iupati).","(11:18) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Ryan Kerrigan.","(11:48) Carson Palmer pass to the left to David Johnson for 13 yards to the Was39.","(12:29) Carson Palmer pass to the left to David Johnson for a loss of 3 yards to the Ari48. Tackled by Duke Ihenacho.","(13:03) Andre Ellington rush to the left for 2 yards to the Was49. Tackled by Mason Foster.","(13:44) Carson Palmer pass to the left to Larry Fitzgerald for 12 yards to the Ari49. Tackled by Ziggy Hood.","(14:22) David Johnson rush to the right for 2 yards to the Ari37. Tackled by Ziggy Hood.","(15:00) David Johnson rush to the left for 10 yards to the Ari35. Tackled by Duke Ihenacho.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback."]