["(0:08) Mike Tolbert rush to the right for 8 yards to the Sea39. Tackled by Bobby Wagner.","(0:51) Mike Tolbert rush up the middle for 11 yards to the Sea47. Tackled by Kelcie McCray and Bobby Wagner.","(1:35) Mike Tolbert rush to the right for no gain to the Car42. Tackled by Bobby Wagner.","(2:00) Cam Newton pass to the middle to Brenton Bersin for 7 yards to the Car42. Tackled by Bobby Wagner and Kelcie McCray.","(2:00) Two Minute Warning.","(2:36) Mike Tolbert rush up the middle for 2 yards to the Car35. Tackled by Bobby Wagner and Damontre Moore.","(3:20) Jonathan Stewart rush up the middle for 3 yards to the Car33. Tackled by Kevin Pierre-Louis and Kelcie McCray.","(3:28) Steven Hauschka kicks off to the Car-1. Fozzy Whittaker return for 31 yards to Car30. Tackled by Tyvis Powell.","(3:32) Steven Hauschka 28 yard field goal attempt is GOOD. Holder: Jon Ryan.","(3:38) Trevone Boykin incomplete pass to the right intended for Jermaine Kearse.","(4:22) Troymaine Pope rush up the middle for a loss of 3 yards to the Car10. Tackled by Kawann Short.","(5:01) George Farmer rush to the left for 1 yard to the Car7. Tackled by Star Lotulelei and Kawann Short.","(5:27) Trevone Boykin pass to the right to Jermaine Kearse for 31 yards to the Car16. Tackled by James Bradberry. Penalty: Roughing Passer on Carolina (Wes Horton) 8 yards.","(6:07) Trevone Boykin rush to the right for 1 yard to the Car47. Tackled by Shaq Thompson.","(6:43) Troymaine Pope rush to the right for 2 yards to the Car48. Tackled by Michael Griffin.","(7:29) Troymaine Pope rush to the left for 18 yards to the Sea50. Tackled by Tre Boston and Thomas Davis.","(8:09) Troymaine Pope rush up the middle for 3 yards to the Sea32. Tackled by Michael Griffin and Thomas Davis.","(8:47) Trevone Boykin pass to the right to Tyler Lockett for 7 yards to the Sea29. Tackled by James Bradberry.","(9:28) Troymaine Pope rush to the left for 2 yards to the Sea22. Tackled by Thomas Davis.","(9:36) Michael Palardy punts for 46 yards to Sea0. Touchback.","(9:40) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by Richard Sherman.","(9:44) Cam Newton incomplete pass to the left intended for Ted Ginn Jr..","(9:49) Cam Newton incomplete pass to the right.","(10:36) Jonathan Stewart rush up the middle for 29 yards to the Sea46. Tackled by Deshawn Shead and Steven Terrell.","(11:09) Jonathan Stewart rush to the left for no gain to the Car25. Tackled by Damontre Moore.","(11:09) Steven Hauschka kicks off to the endzone. Touchback.","(11:09) Steven Hauschka extra point is good.","(11:12) Russell Wilson pass to the left to Jimmy Graham for 1 yard for a TOUCHDOWN.","(11:12) Seattle Seahawks timeout.","(12:00) Russell Wilson pass to the right to Jimmy Graham for 12 yards to the Car1. Tackled by Michael Griffin and James Bradberry.","(12:06) Russell Wilson incomplete pass to the right intended for Jimmy Graham defensed by James Bradberry.","(12:28) Thomas Rawls rush to the left for 2 yards to the Car13. Tackled by Michael Griffin.","(12:28) Seattle Seahawks timeout.","(13:09) Russell Wilson pass to the left to Doug Baldwin for 29 yards to the Car15. Tackled by Robert McClain and Michael Griffin.","(13:43) Russell Wilson pass to the left to Doug Baldwin for 9 yards to the Car44. Tackled by Leonard Johnson.","(14:21) Thomas Rawls rush up the middle for no gain to the Sea47. Tackled by A.J. Klein and Michael Griffin.","(15:00) Thomas Rawls rush to the left for 4 yards to the Sea47. Tackled by Thomas Davis.","(0:24) Russell Wilson pass to the left to Jermaine Kearse for 13 yards to the Sea28. Tackled by Robert McClain and A.J. Klein. Penalty: Face Mask on Carolina (Robert McClain) 15 yards.","(0:47) Penalty: False Start on Seattle (Bradley Sowell) -5 yards.","(1:24) Russell Wilson pass to the right to Nick Vannett for 4 yards to the Sea20. Tackled by A.J. Klein.","(1:29) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(1:33) Cam Newton incomplete pass to the left intended for Devin Funchess.","(2:15) Cam Newton rush up the middle for a loss of 2 yards to the Sea16. Tackled by K.J. Wright.","(2:20) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(3:04) Cam Newton pass to the left to Devin Funchess for 24 yards to the Sea14. Tackled by Kam Chancellor.","(3:45) Cam Newton pass to the left to Ted Ginn Jr. for 4 yards to the Sea38. Tackled by Kam Chancellor.","(4:13) Cam Newton incomplete pass to the right intended for Ed Dickson. Penalty: Holding on Carolina (Mike Remmers) -10 yards.","(4:55) Cam Newton pass to the left to Devin Funchess for 20 yards to the Sea32. Tackled by Steven Terrell.","(6:01) Jonathan Stewart rush up the middle for 4 yards to the Car48. Tackled by K.J. Wright and Tony McDaniel.","(6:08) Cam Newton incomplete pass to the left intended for Greg Olsen.","(6:15) Cam Newton pass to the left to Ted Ginn Jr. for 9 yards to the Car44. Tackled by Kam Chancellor.","(6:22) Jon Ryan punts for 41 yards to Car35. No return.","(6:58) Russell Wilson sacked at Sea24 for a loss of 5 yards by Thomas Davis and Wes Horton.","(7:37) Russell Wilson pass to the left to Doug Baldwin for 5 yards to the Sea29. Tackled by Leonard Johnson.","(8:10) Russell Wilson pass to the right to Tyler Lockett for a loss of 1 yard to the Sea24. Tackled by James Bradberry.","(8:44) Russell Wilson pass to the left to Tanner McEvoy for 14 yards to the Sea25. Tackled by Robert McClain.","(9:26) Russell Wilson pass to the left to Doug Baldwin for 4 yards to the Sea11. Tackled by Robert McClain.","(10:08) Thomas Rawls rush to the left for a loss of 3 yards to the Sea7. Tackled by Robert McClain.","(10:15) Michael Palardy punts for 28 yards to Sea10. No return.","(10:15) Seattle Seahawks timeout.","(10:20) Cam Newton incomplete pass to the left intended for Corey Brown.","(10:27) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(11:06) Jonathan Stewart rush up the middle for 3 yards to the Sea38. Tackled by Frank Clark and Bobby Wagner.","(11:31) Cam Newton pass to the right to Ted Ginn Jr. for 11 yards to the Sea41. Tackled by Kam Chancellor.","(12:17) Cam Newton pass to the left to Greg Olsen for 2 yards to the Car48. Tackled by Ahtyba Rubin.","(12:55) Corey Brown rush to the right for a loss of 3 yards to the Car46. Tackled by Richard Sherman.","(13:29) Cam Newton pass to the left to Greg Olsen for 12 yards to the Car49. Tackled by Deshawn Shead.","(14:10) Cam Newton rush to the left for 9 yards to the Car37. Tackled by Mike Morgan.","(14:48) Fozzy Whittaker rush to the left for 3 yards to the Car28. Tackled by Bobby Wagner.","(14:48) Steven Hauschka kicks off to the endzone. Touchback.","(14:48) Steven Hauschka extra point is good.","(15:00) Tyler Lockett rush to the right for 75 yards for a TOUCHDOWN.","(15:00) Graham Gano kicks off to the endzone. Touchback.","(0:07) Steven Hauschka kicks off to the Car-8. Ted Ginn Jr. return for 25 yards to Car17. Tackled by Neiko Thorpe.","(0:10) Steven Hauschka 31 yard field goal attempt is GOOD. Holder: Jon Ryan.","(0:16) Russell Wilson incomplete pass to the left intended for Jimmy Graham.","(0:21) Russell Wilson incomplete pass to the left.","(0:26) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(0:26) Seattle Seahawks timeout.","(0:35) Russell Wilson pass to the left to Jermaine Kearse for 11 yards to the Car13. Tackled by Daryl Worley and Tre Boston.","(0:35) Seattle Seahawks timeout.","(0:43) Russell Wilson rush to the left for 18 yards to the Car24. Tackled by Michael Griffin.","(0:43) Seattle Seahawks timeout.","(0:51) Russell Wilson pass to the right to Jimmy Graham for 18 yards to the Car42. Tackled by Michael Griffin.","(0:51) Carolina Panthers timeout.","(0:59) Russell Wilson pass to the left to Doug Baldwin for 20 yards to the Sea40. Tackled by Shaq Thompson.","(1:19) Russell Wilson pass to the right to Troymaine Pope for 5 yards to the Sea20. Tackled by Leonard Johnson.","(1:30) Michael Palardy punts for 52 yards to Sea23. Tyler Lockett return for 2 yards to Sea25. Tackled by Joe Webb. Penalty: Holding on Seattle (Kevin Pierre-Louis) -10 yards.","(1:35) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(1:40) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(1:45) Cam Newton incomplete pass to the right intended for Greg Olsen.","(1:45) Steven Hauschka kicks off to the endzone. Touchback.","(1:49) Steven Hauschka 37 yard field goal attempt is GOOD. Holder: Jon Ryan.","(1:52) Russell Wilson incomplete pass to the left intended for George Farmer.","(2:00) Russell Wilson incomplete pass to the left intended for Jimmy Graham.","(2:00) Two Minute Warning.","(2:36) Troymaine Pope rush to the left for a loss of 2 yards to the Car19. Tackled by Ryan Delaire and A.J. Klein.","(3:17) Russell Wilson rush to the left for 9 yards to the Car17. Tackled by Leonard Johnson.","(3:52) Troymaine Pope rush up the middle for 2 yards to the Car26. Tackled by Vernon Butler.","(4:23) Troymaine Pope rush to the right for 6 yards to the Car28. Tackled by Michael Griffin.","(4:45) Penalty: False Start on Seattle (Bradley Sowell) -5 yards.","(5:29) Russell Wilson pass to the left to Nick Vannett for 21 yards to the Car29. Tackled by Daryl Worley and Michael Griffin.","(6:11) Thomas Rawls rush up the middle for a loss of 1 yard to the Sea50. Tackled by Thomas Davis and Kony Ealy.","(6:53) Russell Wilson pass to the left to Jimmy Graham for 13 yards to the Car49. Tackled by Michael Griffin and Tre Boston.","(7:28) Thomas Rawls rush to the right for 13 yards to the Sea38. Tackled by Michael Griffin.","(7:38) Michael Palardy punts for 49 yards to Sea15. Tyler Lockett return for 10 yards to Sea25. Tackled by Ed Dickson.","(7:42) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(8:18) Jonathan Stewart rush up the middle for no gain to the Car36. Tackled by Kam Chancellor.","(8:18) Carolina Panthers timeout.","(9:05) Jonathan Stewart rush to the left for no gain to the Car36. Tackled by Bobby Wagner and Mike Morgan.","(9:44) Cam Newton pass to the left to Kelvin Benjamin for 11 yards to the Car36. Tackled by Bobby Wagner and Deshawn Shead.","(9:44) Steven Hauschka kicks off to the endzone. Touchback.","(9:44) Steven Hauschka extra point is good.","(9:53) Thomas Rawls rush to the right for 45 yards for a TOUCHDOWN.","(10:25) Thomas Rawls rush to the right for 12 yards to the Car45. Tackled by Daryl Worley.","(10:32) Graham Gano kicks off to the Sea-3. Tyler Lockett return for 46 yards to Sea43. Tackled by Graham Gano.","(10:32) Graham Gano extra point is good.","(10:40) Cam Newton pass to the left to Ted Ginn Jr. for 55 yards for a TOUCHDOWN.","(10:45) Cam Newton incomplete pass to the right intended for Greg Olsen defensed by Earl Thomas.","(11:30) Cam Newton pass to the left to Jonathan Stewart for 3 yards to the Car45. Tackled by Mike Morgan.","(11:58) Penalty: Illegal Block on Carolina (Mike Remmers) -10 yards.","(12:05) Russell Wilson pass intended for Jermaine Kearse INTERCEPTED by Tre Boston and returned for 7 yards. Tackled by George Farmer.","(12:33) Russell Wilson pass to the right to Doug Baldwin for a loss of 3 yards to the Sea41. Tackled by Kony Ealy. FUMBLE, recovered by Sea.","(13:16) Russell Wilson sacked at Sea44 for a loss of 6 yards by Kony Ealy.","(13:25) Jonathan Stewart rush to the right for 4 yards to the Car50. Tackled by K.J. Wright. FUMBLE, recovered by Sea (Cassius Marsh). Tackled by Tyler Larsen.","(13:30) Russell Wilson sacked at Car46 for a loss of 10 yards by Charles Johnson.","(13:36) Russell Wilson incomplete pass to the right intended for Tanner McEvoy.","(14:15) Russell Wilson pass to the left to Jimmy Graham for 5 yards to the Car36. Tackled by A.J. Klein.","(15:00) Thomas Rawls rush to the right for no gain to the Car41. Tackled by Shaq Thompson.","(0:17) Thomas Rawls rush to the left for 12 yards to the Car41. Tackled by Daryl Worley.","(0:56) Russell Wilson pass to the right to Tyler Lockett for 8 yards to the Sea47. Tackled by James Bradberry.","(1:38) Russell Wilson pass to the right to Tyler Lockett for 9 yards to the Sea39. Tackled by James Bradberry.","(2:14) Thomas Rawls rush to the left for 2 yards to the Sea30. Tackled by Kawann Short and Star Lotulelei.","(2:47) Russell Wilson pass to the left to Jermaine Kearse for 7 yards to the Sea28. Tackled by Daryl Worley.","(2:57) Michael Palardy punts for 36 yards to Sea6. No return. Penalty: Unnecessary Roughness on Carolina (Joe Webb) 15 yards.","(3:01) Cam Newton incomplete pass to the right intended for Kelvin Benjamin defensed by Deshawn Shead.","(3:25) Penalty: False Start on Carolina (Kelvin Benjamin) -5 yards.","(4:07) Jonathan Stewart rush to the left for no gain to the Sea37. Tackled by Michael Bennett and Mike Morgan.","(4:49) Cam Newton rush up the middle for 5 yards to the Sea37. Tackled by Earl Thomas.","(5:34) Cam Newton pass to the left to Greg Olsen for 16 yards to the Sea42. Tackled by Bobby Wagner.","(6:05) Cam Newton pass to the left to Kelvin Benjamin for 7 yards to the Car42. Tackled by Earl Thomas.","(6:38) Ted Ginn Jr. rush to the left for 6 yards to the Car35. Tackled by Kam Chancellor.","(6:42) Steven Hauschka kicks off to the Car5. Fozzy Whittaker return for 19 yards to Car24. Tackled by Dewey McDonald. Penalty: Offside on Seattle (Cassius Marsh) 5 yards.","(6:42) Steven Hauschka extra point is good.","(6:47) Thomas Rawls rush to the left for 8 yards for a TOUCHDOWN.","(7:23) Russell Wilson pass to the middle to Jimmy Graham for 14 yards to the Car8. Tackled by Tre Boston and Michael Griffin.","(7:48) Russell Wilson rush to the left for 2 yards to the Car22. Tackled by Daryl Worley.","(8:13) Russell Wilson pass to the left to Thomas Rawls for 12 yards to the Car24. Tackled by Thomas Davis.","(8:19) Russell Wilson incomplete pass to the left intended for Tyler Lockett defensed by Robert McClain.","(8:59) Thomas Rawls rush to the left for 8 yards to the Car36. Tackled by Michael Griffin.","(9:32) Thomas Rawls rush to the left for 2 yards to the Car44. Tackled by Kawann Short.","(10:11) Russell Wilson pass to the left to Tyler Lockett for 40 yards to the Car46. Tackled by Thomas Davis.","(10:37) Russell Wilson pass to the right to Jermaine Kearse for 6 yards to the Sea14. Tackled by James Bradberry.","(10:53) Michael Palardy punts for 43 yards to Sea19. Tyler Lockett - no return. Tackled by Michael Palardy. Penalty: Illegal Block on Seattle (Kelcie McCray) -7 yards.","(10:58) Cam Newton incomplete pass to the right intended for Corey Brown defensed by Kam Chancellor.","(11:36) Cam Newton pass to the left to Ted Ginn Jr. for 1 yard to the Car38.","(11:40) Cam Newton incomplete pass to the right intended for Greg Olsen defensed by K.J. Wright.","(12:15) Jonathan Stewart rush up the middle for 6 yards to the Car37. Tackled by Jeremy Lane and Kam Chancellor.","(12:46) Penalty: Offside on Seattle (Michael Bennett) 5 yards.","(13:23) Jonathan Stewart rush to the right for 1 yard to the Car26. Tackled by Mike Morgan and Cliff Avril.","(13:23) Steven Hauschka kicks off to the endzone. Touchback.","(13:26) Steven Hauschka 23 yard field goal attempt is GOOD. Holder: Jon Ryan.","(13:32) Russell Wilson incomplete pass to the middle intended for Jermaine Kearse defensed by Tre Boston.","(14:11) Russell Wilson pass to the right to Doug Baldwin for 1 yard to the Car5. Tackled by James Bradberry.","(14:46) Thomas Rawls rush to the left for 2 yards to the Car6. Tackled by Wes Horton and Kawann Short.","(14:55) Derek Anderson pass intended for Mike Tolbert INTERCEPTED by Mike Morgan and returned for 14 yards. Tackled by Devin Funchess.","(15:00) Steven Hauschka kicks off to the Car4. Fozzy Whittaker return for 14 yards to Car18. Tackled by Neiko Thorpe."]