["(0:07) Blake Bortles pass to the middle to T.J. Yeldon for 9 yards to the Jax42. Tackled by Shane Ray.","(0:29) Blake Bortles pass to the middle to T.J. Yeldon for 8 yards to the Jax33. Tackled by T.J. Ward.","(0:29) Brandon McManus kicks off to the endzone. Touchback.","(0:33) Brandon McManus 41 yard field goal attempt is GOOD. Holder: Riley Dixon.","(0:33) Denver Broncos timeout.","(1:19) Devontae Booker rush to the left for 4 yards to the Jax23. Tackled by Johnathan Cyprien.","(1:19) Jacksonville Jaguars timeout.","(1:23) Devontae Booker rush to the left for 2 yards to the Jax27. Tackled by Abry Jones.","(1:23) Jacksonville Jaguars timeout.","(1:27) Devontae Booker rush to the right for no gain to the Jax29. Tackled by Paul Posluszny.","(1:37) Blake Bortles sacked at Jax32 for a loss of 2 yards. FUMBLE, recovered by Den (Shane Ray) and returned for 3 yards. Tackled by A.J. Cann.","(1:41) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(1:52) Riley Dixon punts for 47 yards to Jax26. Bryan Walters return for 8 yards to Jax34. Tackled by Dekoda Watson.","(1:56) Paxton Lynch incomplete pass to the left intended for Demaryius Thomas.","(1:56) Jacksonville Jaguars timeout.","(2:00) Juwan Thompson rush up the middle for 3 yards to the Den27. Tackled by Telvin Smith.","(2:00) Two Minute Warning.","(2:08) Juwan Thompson rush up the middle for 2 yards to the Den24. Tackled by Paul Posluszny.","(2:16) Brad Nortman punts for 45 yards to Den22. No return.","(2:49) Blake Bortles pass to the left to Bryan Walters for 4 yards to the Jax33. Tackled by T.J. Ward.","(2:53) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(2:57) Blake Bortles incomplete pass to the left intended for T.J. Yeldon defensed by Jared Crick.","(3:05) Riley Dixon punts for 45 yards to Jax29. No return.","(3:50) Paxton Lynch rush up the middle for 1 yard to the Den26. Tackled by Malik Jackson.","(4:36) Paxton Lynch rush to the left for 10 yards to the Den25. Tackled by Paul Posluszny.","(5:14) Devontae Booker rush to the right for a loss of 2 yards to the Den15. Tackled by Tyson Alualu.","(5:21) Brad Nortman punts for 38 yards to Den17. No return.","(6:02) T.J. Yeldon rush to the left for 5 yards to the Jax45. Tackled by Justin Simmons.","(6:06) Blake Bortles incomplete pass to the left intended for Marqise Lee defensed by Bradley Roby.","(6:10) Blake Bortles incomplete pass to the left intended for T.J. Yeldon defensed by Corey Nelson.","(6:15) T.J. Yeldon rush to the left for 3 yards to the Jax23. Tackled by Von Miller. Penalty: Pass Interference on Denver (Bradley Roby) 17 yards.","(6:53) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(6:59) Riley Dixon punts for 40 yards to Jax0. Touchback.","(7:05) Paxton Lynch incomplete pass to the left intended for Emmanuel Sanders.","(7:05) Denver Broncos timeout.","(7:39) Devontae Booker rush to the right for 3 yards to the Jax40. Tackled by Johnathan Cyprien.","(8:14) Emmanuel Sanders rush to the right for 4 yards to the Jax43. Tackled by Tyson Alualu.","(8:18) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Aqib Talib. Penalty: Unsports. Conduct on Jacksonville (Allen Robinson) -15 yards.","(8:24) Blake Bortles incomplete pass to the right intended for Neal Sterling.","(8:55) Blake Bortles pass to the right to Neal Sterling for 2 yards to the Den38. Tackled by Todd Davis.","(9:29) Blake Bortles pass to the right to Ben Koyack for 4 yards to the Den40. Tackled by Corey Nelson.","(10:06) T.J. Yeldon rush to the left for 8 yards to the Den44. Tackled by DeMarcus Ware and Corey Nelson.","(10:43) T.J. Yeldon rush up the middle for 3 yards to the Jax48. Tackled by Von Miller.","(11:22) Blake Bortles pass to the left to Neal Sterling for 15 yards to the Jax45. Tackled by Darian Stewart.","(11:57) T.J. Yeldon rush up the middle for 3 yards to the Jax30. Tackled by Bradley Roby.","(12:05) Riley Dixon punts for 41 yards to Jax27. Bryan Walters - no return. Tackled by Cody Latimer.","(12:41) Paxton Lynch sacked at Den32 for no gain by Telvin Smith.","(12:41) Penalty: False Start on Denver (Russell Okung) -5 yards.","(12:45) Paxton Lynch incomplete pass to the right intended for Demaryius Thomas.","(13:22) Devontae Booker rush to the right for 2 yards to the Den37. Tackled by Telvin Smith.","(13:57) Paxton Lynch pass to the left to Cody Latimer for 10 yards to the Den35. Tackled by Prince Amukamara.","(14:03) Paxton Lynch incomplete pass to the right intended for Emmanuel Sanders.","(14:03) Jason Myers kicks off to the endzone. Touchback.","(14:03) Jason Myers extra point is good.","(14:10) Blake Bortles rush up the middle for 22 yards for a TOUCHDOWN.","(14:16) Blake Bortles incomplete pass to the middle intended for T.J. Yeldon defensed by Corey Nelson.","(15:00) T.J. Yeldon rush up the middle for 5 yards to the Den22. Tackled by T.J. Ward.","(0:39) T.J. Yeldon rush to the left for no gain to the Den27. Tackled by Derek Wolfe.","(0:43) T.J. Yeldon rush up the middle for 3 yards to the Den32. Tackled by Corey Nelson. Penalty: Holding on Denver (Aqib Talib) 5 yards.","(1:55) Blake Bortles rush to the right for 7 yards to the Den35. Tackled by DeMarcus Ware.","(1:55) Penalty: Offside on Denver (Von Miller) 5 yards.","(2:01) Blake Bortles incomplete pass to the left intended for Bryan Walters.","(2:31) Shane Wynn rush to the right for a loss of 2 yards to the Den47. Tackled by Shaquil Barrett.","(3:00) Blake Bortles pass to the left to T.J. Yeldon for 10 yards to the Den45. Tackled by Bradley Roby.","(3:22) Penalty: False Start on Jacksonville (Jermey Parnell) -5 yards.","(3:38) Shane Wynn rush to the right for 7 yards to the Jax50. Tackled by Von Miller.","(4:01) Blake Bortles pass to the left to Marqise Lee for 12 yards to the Jax43. Tackled by Bradley Roby.","(4:48) Denard Robinson rush to the left for 1 yard to the Jax31. Tackled by Chris Harris Jr..","(4:55) Riley Dixon punts for 45 yards to Jax30. No return.","(5:26) Devontae Booker rush to the right for a loss of 1 yard to the Den25. Tackled by Sen'Derrick Marks.","(6:10) Paxton Lynch pass to the left to Demaryius Thomas for 7 yards to the Den26. Tackled by Prince Amukamara.","(6:47) Devontae Booker rush to the right for 1 yard to the Den19. Tackled by Dante Fowler Jr..","(6:55) Brad Nortman punts for 41 yards to Den18. No return.","(7:00) Blake Bortles incomplete pass to the middle intended for Bryan Walters.","(7:04) Blake Bortles incomplete pass to the right intended for Ben Koyack.","(7:34) Marqise Lee rush to the right for 1 yard to the Jax41. Tackled by Shaquil Barrett.","(7:34) Brandon McManus kicks off to the Jax7, out of bounds. No return.","(7:34) Brandon McManus extra point is good.","(7:45) Blake Bortles pass intended for Allen Robinson INTERCEPTED by Bradley Roby and returned for 51 yards for a TOUCHDOWN.","(8:23) Denard Robinson rush up the middle for 3 yards to the Jax49. Tackled by Todd Davis.","(8:55) Denard Robinson rush up the middle for 3 yards to the Jax46. Tackled by Jared Crick.","(9:32) T.J. Yeldon rush to the left for 8 yards to the Jax43. Tackled by T.J. Ward.","(10:13) Denard Robinson rush to the left for 5 yards to the Jax35. Tackled by Adam Gotsis.","(10:50) Blake Bortles pass to the left to Denard Robinson for 11 yards to the Jax30. Tackled by Brandon Marshall.","(11:21) T.J. Yeldon rush up the middle for 5 yards to the Jax19. Tackled by DeMarcus Ware.","(11:56) Denard Robinson rush up the middle for 5 yards to the Jax14. Tackled by Shane Ray.","(12:27) Denard Robinson rush up the middle for 4 yards to the Jax9. Tackled by Sylvester Williams.","(12:36) Riley Dixon punts for 35 yards to Jax5. No return.","(13:13) Paxton Lynch pass to the right to Emmanuel Sanders for 8 yards to the Jax40. Tackled by Jalen Ramsey.","(13:57) Devontae Booker rush to the right for a loss of 1 yard to the Jax48. Tackled by Dante Fowler Jr..","(14:06) Paxton Lynch incomplete pass to the left intended for Emmanuel Sanders defensed by Jalen Ramsey.","(14:18) Brad Nortman punts for 41 yards to Den31. Kalif Raymond return for 22 yards to Jax47. Tackled by Corey Grant.","(14:23) Blake Bortles incomplete pass to the left intended for Marqise Lee defensed by Darian Stewart.","(14:27) Blake Bortles incomplete pass to the left intended for Ben Koyack.","(15:00) Denard Robinson rush to the right for 3 yards to the Jax28. Tackled by Derek Wolfe.","(15:00) Brandon McManus kicks off to the endzone. Touchback.","(0:01) Brandon McManus kicks off to the Jax31. Chris Smith - no return.","(0:05) Brandon McManus 32 yard field goal attempt is GOOD. Holder: Riley Dixon.","(0:05) Denver Broncos timeout.","(0:18) Paxton Lynch pass to the left to Demaryius Thomas for 18 yards to the Jax14. Tackled by Prince Amukamara.","(0:42) Devontae Booker rush up the middle for 3 yards to the Jax32. Tackled by Paul Posluszny.","(0:47) Paxton Lynch pass to the left to Emmanuel Sanders for 8 yards to the Jax35. Tackled by Prince Amukamara.","(1:00) Brad Nortman punts for 53 yards to Den23. Kalif Raymond return for 19 yards to Den42. Tackled by Alex Ellis. Penalty: Unnecessary Roughness on Jacksonville (Alex Ellis) 15 yards.","(1:00) Denver Broncos timeout.","(1:07) Blake Bortles pass to the left to Allen Robinson for 5 yards to the Jax24. Tackled by Chris Harris Jr..","(1:15) Penalty: Illegal Use of Hands on Jacksonville (A.J. Cann) -10 yards.","(1:21) Blake Bortles pass to the right to Neal Sterling for 3 yards to the Jax29. Tackled by Chris Harris Jr..","(1:24) Blake Bortles incomplete pass to the right intended for Bryan Walters defensed by Chris Harris Jr..","(1:24) Jacksonville Jaguars timeout.","(1:33) Blake Bortles pass to the left to Bryan Walters for 12 yards to the Jax26. Tackled by Shane Ray.","(1:36) Blake Bortles incomplete pass to the right intended for T.J. Yeldon.","(2:00) T.J. Yeldon rush to the right for 1 yard to the Jax14. Tackled by Derek Wolfe.","(2:00) Two Minute Warning.","(2:15) T.J. Yeldon rush up the middle for 8 yards to the Jax13. Tackled by Todd Davis.","(3:00) T.J. Yeldon rush up the middle for 2 yards to the Jax5. Tackled by Jared Crick.","(3:08) Riley Dixon punts for 41 yards to Jax3. No return.","(3:12) Paxton Lynch incomplete pass to the left intended for Jordan Norwood.","(3:52) Kapri Bibbs rush to the right for no gain to the Jax44. Tackled by Dante Fowler Jr..","(4:29) Kapri Bibbs rush up the middle for 7 yards to the Jax44. Tackled by Tyson Alualu.","(4:44) Blake Bortles pass intended for Allen Robinson INTERCEPTED by Chris Harris Jr. and returned for 36 yards. Tackled by Denard Robinson.","(5:19) Denard Robinson rush up the middle for 5 yards to the Den37. Tackled by Shane Ray.","(5:54) Marqise Lee rush to the right for 9 yards to the Den42.","(6:30) Denard Robinson rush to the left for 3 yards to the Jax49. Tackled by Derek Wolfe.","(6:54) Blake Bortles pass to the right to Allen Robinson for 21 yards to the Jax46. Tackled by Aqib Talib.","(6:54) Brandon McManus kicks off to the endzone. Touchback.","(6:54) Brandon McManus extra point is good.","(7:01) Devontae Booker rush up the middle for 6 yards for a TOUCHDOWN.","(7:37) Devontae Booker rush to the left for 4 yards to the Jax6. Tackled by Abry Jones.","(8:21) Kapri Bibbs rush to the left for 13 yards to the Jax10. Tackled by Tashaun Gipson.","(8:52) Paxton Lynch pass to the left to Demaryius Thomas for 7 yards to the Jax23. Tackled by Aaron Colvin.","(9:34) Kapri Bibbs rush to the right for 24 yards to the Jax30. Tackled by Jalen Ramsey.","(10:09) Devontae Booker rush to the right for 1 yard to the Den46. Tackled by Malik Jackson.","(10:14) Penalty: Roughing Passer on Jacksonville (Telvin Smith) 15 yards.","(10:14) Denver Broncos timeout.","(10:54) Devontae Booker rush to the right for 5 yards to the Den30. Tackled by Paul Posluszny.","(11:01) Paxton Lynch incomplete pass to the right intended for Demaryius Thomas defensed by Jalen Ramsey.","(11:01) Jason Myers kicks off to the endzone. Touchback.","(11:06) Jason Myers 47 yard field goal attempt is GOOD. Holder: Brad Nortman.","(11:11) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(11:46) Corey Grant rush to the left for 2 yards to the Den29. Tackled by Billy Winn.","(12:17) Blake Bortles pass to the middle to Allen Robinson for 5 yards to the Den31. Tackled by Adam Gotsis and Brandon Marshall.","(12:58) Blake Bortles pass to the right to Marqise Lee for 17 yards to the Den36. Tackled by Aqib Talib.","(13:37) T.J. Yeldon rush up the middle for 1 yard to the Jax47. Tackled by Todd Davis.","(14:09) Blake Bortles pass to the right to Marqise Lee for 5 yards to the Jax46. Tackled by Aqib Talib.","(14:19) Riley Dixon punts for 50 yards to Jax36. Bryan Walters return for 5 yards to Jax41. Tackled by Justin Simmons.","(14:23) Paxton Lynch incomplete pass to the right intended for Emmanuel Sanders.","(14:27) Paxton Lynch incomplete pass to the right intended for Emmanuel Sanders.","(15:00) Kapri Bibbs rush to the right for 5 yards to the Den14. Tackled by Dan Skuta.","(0:05) Brad Nortman punts for 36 yards to Den9. No return.","(0:09) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(0:16) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(0:50) Denard Robinson rush to the right for 1 yard to the Den45. Tackled by Shaquil Barrett.","(1:31) Blake Bortles pass to the left to Neal Sterling for 17 yards to the Den46. Tackled by Justin Simmons.","(2:10) Denard Robinson rush to the left for no gain to the Jax37. Tackled by Todd Davis.","(2:40) Denard Robinson rush to the left for 4 yards to the Jax37. Tackled by Jared Crick.","(3:18) Blake Bortles pass to the left to Bryan Walters for 15 yards to the Jax33. Tackled by Corey Nelson.","(4:00) Denard Robinson rush to the right for 1 yard to the Jax18. Tackled by Jared Crick.","(4:32) Denard Robinson rush to the left for 3 yards to the Jax17. Tackled by Sylvester Williams.","(4:40) Riley Dixon punts for 46 yards to Jax14. No return.","(4:49) Paxton Lynch incomplete pass to the left intended for Virgil Green.","(5:28) Paxton Lynch pass to the left to Demaryius Thomas for 6 yards to the Den40. Tackled by Prince Amukamara.","(6:01) Devontae Booker rush up the middle for 2 yards to the Den34. Tackled by Paul Posluszny.","(6:33) Paxton Lynch pass to the right to Emmanuel Sanders for 12 yards to the Den32. Tackled by Telvin Smith.","(6:43) Brad Nortman punts for 50 yards to Den21. Kalif Raymond return for a loss of 1 yard to Den20. Tackled by Arrelious Benn.","(6:48) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(7:31) Denard Robinson rush to the right for 4 yards to the Jax29. Tackled by Derek Wolfe.","(8:03) Denard Robinson rush up the middle for 5 yards to the Jax25. Tackled by T.J. Ward.","(8:12) Riley Dixon punts for 58 yards to Jax0. Touchback.","(8:48) Paxton Lynch pass to the right to Devontae Booker for 2 yards to the Den42. Tackled by Sen'Derrick Marks.","(9:27) Paxton Lynch sacked at Den40 for a loss of 2 yards by Sen'Derrick Marks.","(10:07) Devontae Booker rush to the right for 1 yard to the Den42. Tackled by Dante Fowler Jr..","(10:48) Paxton Lynch pass to the left to Demaryius Thomas for 10 yards to the Den41. Tackled by Jalen Ramsey.","(11:27) Devontae Booker rush to the left for 4 yards to the Den31. Tackled by Telvin Smith.","(12:04) Paxton Lynch pass to the right to A.J. Derby for 3 yards to the Den27. Tackled by Myles Jack.","(12:39) Paxton Lynch pass to the left to Demaryius Thomas for 13 yards to the Den24. Tackled by Jalen Ramsey and Tashaun Gipson.","(12:53) Brad Nortman punts for 65 yards to Den11. Kalif Raymond - no return. Tackled by Carson Tinker and Hayes Pullard III.","(13:33) Blake Bortles pass to the right to Neal Sterling for 6 yards to the Jax24. Tackled by T.J. Ward.","(13:33) Penalty: False Start on Jacksonville (Kelvin Beachum) -5 yards.","(13:36) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(14:11) Denard Robinson rush to the left for 3 yards to the Jax23. Tackled by Derek Wolfe.","(14:23) Riley Dixon punts for 58 yards to Jax16. Bryan Walters return for 4 yards to Jax20. Tackled by Justin Simmons.","(14:27) Paxton Lynch incomplete pass to the right intended for Emmanuel Sanders.","(14:30) Paxton Lynch incomplete pass to the right intended for Demaryius Thomas.","(15:00) Devontae Booker rush to the left for 1 yard to the Den26. Tackled by Telvin Smith.","(15:00) Jason Myers kicks off to the endzone. Touchback."]