["(0:25) Paxton Lynch rush up the middle for a loss of 1 yard to the TB34.","(0:55) Paxton Lynch rush up the middle for a loss of 2 yards to the TB33.","(1:36) Paxton Lynch rush up the middle for a loss of 1 yard to the TB31.","(1:43) Jameis Winston incomplete pass to the right intended for Mike Evans.","(1:44) Tampa Bay Buccaneers timeout.","(1:53) Jameis Winston sacked at TB30 for a loss of 9 yards by Shaquil Barrett and Jared Crick.","(1:53) Tampa Bay Buccaneers timeout.","(2:00) Jameis Winston rush up the middle for no gain to the Den45. FUMBLE, recovered by TB (Jameis Winston).","(2:00) Two Minute Warning.","(2:25) Jameis Winston sacked at Den45 for a loss of 8 yards by Von Miller and Derek Wolfe.","(2:32) Penalty: Illegal Contact on Denver (T.J. Ward) 5 yards.","(2:58) Jameis Winston rush to the left for 5 yards to the Den42. Tackled by T.J. Ward.","(3:03) Jameis Winston incomplete pass to the left intended for Mike Evans.","(3:30) Jameis Winston pass to the left to Mike Evans for 11 yards to the Den47. Tackled by Bradley Roby.","(3:52) Jameis Winston pass to the left to Jacquizz Rodgers for 4 yards to the TB42. Tackled by Corey Nelson.","(3:56) Jameis Winston incomplete pass to the right intended for Cameron Brate defensed by Todd Davis.","(4:19) Jameis Winston pass to the middle to Cameron Brate for 19 yards to the TB38. Tackled by Corey Nelson.","(4:28) Riley Dixon punts for 48 yards to TB19. No return.","(4:28) Tampa Bay Buccaneers timeout.","(4:34) C.J. Anderson rush to the left for 1 yard to the Den33. Tackled by Channing Ward and Akeem Spence.","(5:20) C.J. Anderson rush to the left for 4 yards to the Den32. Tackled by Kwon Alexander.","(6:04) C.J. Anderson rush to the right for 1 yard to the Den28. Tackled by DaVonte Lambert.","(6:33) Penalty: Horse Collar Tackle on Tampa Bay (Chris Conte) 15 yards.","(7:22) Devontae Booker rush to the left for 1 yard to the Den12. Tackled by Clinton McDonald.","(7:30) Bryan Anger punts for 35 yards to Den11. No return.","(7:35) Jameis Winston incomplete pass to the left intended for Cameron Brate defensed by T.J. Ward.","(7:55) Jameis Winston pass to the left to Adam Humphries for 4 yards to the Den46. Tackled by Chris Harris Jr..","(8:16) Jacquizz Rodgers rush up the middle for 5 yards to the TB50. Tackled by Derek Wolfe.","(8:31) Penalty: Illegal Shift on Tampa Bay (Adam Humphries) -5 yards.","(8:55) Jameis Winston pass to the left to Mike Evans for 25 yards to the TB50. Tackled by Darian Stewart.","(8:55) Brandon McManus kicks off to the endzone. Touchback.","(8:55) Brandon McManus extra point is good.","(9:01) Paxton Lynch pass to the right to Emmanuel Sanders for 5 yards for a TOUCHDOWN.","(9:40) Devontae Booker rush to the left for 7 yards to the TB5. Tackled by Vernon Hargreaves III.","(9:54) Kapri Bibbs rush up the middle for 2 yards to the TB12. Tackled by Lavonte David.","(10:34) Kapri Bibbs rush to the left for 9 yards to the TB14. Tackled by Bradley McDougald.","(11:08) Kapri Bibbs rush to the left for 3 yards to the TB23. Tackled by Daryl Smith and Channing Ward.","(11:47) Paxton Lynch pass to the right to Jordan Taylor for 9 yards to the TB26. Tackled by Chris Conte.","(12:26) Paxton Lynch pass to the middle to Jordan Norwood for 21 yards to the TB35. Tackled by Chris Conte.","(12:59) Devontae Booker rush up the middle for 3 yards to the Den44. Tackled by Lavonte David and Akeem Spence.","(13:06) Penalty: Pass Interference on Denver (Demaryius Thomas) -10 yards.","(13:34) Paxton Lynch pass to the right to Demaryius Thomas for 31 yards to the TB49. Tackled by Brent Grimes.","(13:43) Bryan Anger punts for 59 yards to Den0. Touchback.","(13:54) Jameis Winston incomplete pass to the left intended for Mike Evans.","(14:02) Jameis Winston incomplete pass to the right intended for Cameron Brate.","(14:25) Jameis Winston pass to the left to Mike Evans for 1 yard to the TB41. Tackled by Chris Harris Jr..","(14:44) Jameis Winston pass to the right to Charles Sims for 9 yards to the TB25. Tackled by Todd Davis. Penalty: Horse Collar Tackle on Denver (Todd Davis) 15 yards.","(14:57) Riley Dixon punts for 54 yards to TB5. Adam Humphries return for 11 yards to TB16. Tackled by Andy Janovich.","(15:00) Paxton Lynch incomplete pass to the right intended for Demaryius Thomas defensed by Brent Grimes.","(0:01) C.J. Anderson rush to the right for a loss of 1 yard to the Den41. Tackled by Clinton McDonald.","(0:08) Paxton Lynch incomplete pass to the right intended for Emmanuel Sanders.","(0:16) Bryan Anger punts for 48 yards to Den42. No return.","(0:54) Jameis Winston sacked at TB10 for a loss of 4 yards by Derek Wolfe.","(1:31) Charles Sims rush up the middle for 2 yards to the TB14. Tackled by Brandon Marshall.","(2:05) Charles Sims rush to the left for 5 yards to the TB12. Tackled by Von Miller.","(2:14) Riley Dixon punts for 40 yards to TB7. No return.","(2:20) Paxton Lynch incomplete pass to the right intended for Emmanuel Sanders.","(2:56) Devontae Booker rush to the right for no gain to the TB47. Tackled by Daryl Smith and Clinton McDonald.","(3:32) C.J. Anderson rush to the right for 6 yards to the TB47. Tackled by Bradley McDougald.","(4:04) Paxton Lynch pass to the middle to Emmanuel Sanders for 17 yards to the Den47. Tackled by Brent Grimes.","(4:49) C.J. Anderson rush to the right for 3 yards to the Den30. Tackled by Kwon Alexander.","(5:25) Paxton Lynch pass to the left to Emmanuel Sanders for 2 yards to the Den27. Tackled by Vernon Hargreaves III.","(5:40) Bryan Anger punts for 44 yards to Den38. Jordan Norwood - no return. Tackled by Josh Keyes. Penalty: Holding on Denver (Kayvon Webster) -10 yards.","(6:23) Jameis Winston sacked at TB18 for a loss of 8 yards by Derek Wolfe.","(6:29) Jameis Winston incomplete pass to the right intended for Vincent Jackson.","(7:03) Charles Sims rush up the middle for 1 yard to the TB26. Tackled by Derek Wolfe and Von Miller.","(7:03) Brandon McManus kicks off to the endzone. Touchback.","(7:07) Brandon McManus 24 yard field goal attempt is GOOD. Holder: Riley Dixon.","(7:13) Paxton Lynch incomplete pass to the left intended for Cody Latimer.","(7:46) C.J. Anderson rush to the right for a loss of 3 yards to the TB6. Tackled by William Gholston.","(8:28) C.J. Anderson rush to the right for 2 yards to the TB3. Tackled by Bradley McDougald and Akeem Spence.","(9:06) Paxton Lynch pass to the left to Demaryius Thomas for 11 yards to the TB5. Tackled by Chris Conte and Vernon Hargreaves III.","(9:41) C.J. Anderson rush to the left for no gain to the TB16. Tackled by Akeem Spence and Channing Ward.","(10:25) C.J. Anderson rush to the left for 10 yards to the TB16. Tackled by Chris Conte.","(10:32) Penalty: Holding on Tampa Bay (Chris Conte) 5 yards.","(10:40) Paxton Lynch incomplete pass to the right intended for Devontae Booker.","(11:20) Devontae Booker rush to the left for 7 yards to the TB31. Tackled by Bradley McDougald and Lavonte David.","(11:56) Paxton Lynch pass to the left to Emmanuel Sanders for 9 yards to the TB38. Tackled by Vernon Hargreaves III.","(12:31) Devontae Booker rush to the left for 1 yard to the TB47. Tackled by Lavonte David.","(13:06) Paxton Lynch pass to the right to C.J. Anderson for 3 yards to the TB48. Tackled by Jude Adjei-Barimah.","(13:44) C.J. Anderson rush to the left for 9 yards to the Den49. Tackled by Bradley McDougald.","(13:52) Paxton Lynch incomplete pass to the right intended for Cody Latimer defensed by Brent Grimes.","(14:29) Paxton Lynch pass to the right to Demaryius Thomas for 15 yards to the Den40. Tackled by Brent Grimes.","(15:00) C.J. Anderson rush to the right for no gain to the Den25. Tackled by Clinton McDonald.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback.","(0:05) Jameis Winston rush up the middle for a loss of 1 yard to the TB24.","(0:05) Brandon McManus kicks off to the endzone. Touchback.","(0:09) Brandon McManus 38 yard field goal attempt is GOOD. Holder: Riley Dixon.","(0:15) Paxton Lynch incomplete pass to the right intended for Emmanuel Sanders defensed by Brent Grimes.","(0:15) Denver Broncos timeout.","(0:29) Paxton Lynch pass to the left to Emmanuel Sanders for 9 yards to the TB20. Tackled by Vernon Hargreaves III.","(0:33) Paxton Lynch incomplete pass to the left intended for Bennie Fowler defensed by Jude Adjei-Barimah.","(0:33) Denver Broncos timeout.","(0:40) Paxton Lynch pass to the right to Emmanuel Sanders for 18 yards to the TB29. Tackled by Lavonte David.","(0:45) Paxton Lynch incomplete pass to the right intended for Emmanuel Sanders.","(0:51) Paxton Lynch sacked at TB47 for no gain by Kwon Alexander.","(0:52) Denver Broncos timeout.","(0:59) Paxton Lynch pass to the right to Emmanuel Sanders for 16 yards to the TB47. Tackled by Bradley McDougald.","(1:19) Paxton Lynch pass to the middle to Jordan Norwood for 4 yards to the Den37. Tackled by Kwon Alexander.","(1:31) Bryan Anger punts for 52 yards to Den21. Jordan Norwood return for 12 yards to Den33. Tackled by Josh Robinson.","(1:38) Jameis Winston incomplete pass to the right intended for Jacquizz Rodgers.","(1:43) Jameis Winston pass to the right to Vincent Jackson for 6 yards to the TB27. Tackled by Aqib Talib.","(1:46) Jameis Winston incomplete pass to the left intended for Adam Humphries.","(1:54) Riley Dixon punts for 47 yards to TB16. No return. Penalty: Illegal Formation on Denver 5 yards.","(2:00) Paxton Lynch incomplete pass to the left intended for Bennie Fowler.","(2:00) Two Minute Warning.","(2:40) Devontae Booker rush to the left for 11 yards to the Den37. Tackled by Vernon Hargreaves III.","(3:25) Trevor Siemian sacked at Den26 for a loss of 8 yards by Clinton McDonald.","(3:34) Charles Sims rush up the middle for a loss of 4 yards to the Den30. Tackled by T.J. Ward. FUMBLE, recovered by Den (Billy Winn) and returned for 4 yards. Tackled by Charles Sims.","(3:40) Penalty: Offside on Denver (Von Miller) 5 yards.","(4:24) Charles Sims rush to the right for 4 yards to the Den31. Tackled by T.J. Ward and Brandon Marshall.","(4:31) Jameis Winston incomplete pass to the right intended for Adam Humphries defensed by Shaquil Barrett.","(5:09) Jameis Winston pass to the left to Vincent Jackson for 14 yards to the Den35. Tackled by Bradley Roby.","(5:09) Tampa Bay Buccaneers timeout.","(5:19) Jameis Winston incomplete pass to the left intended for Mike Evans.","(5:54) Charles Sims rush to the right for 1 yard to the Den49. Tackled by Brandon Marshall and Todd Davis.","(6:07) Riley Dixon punts for 43 yards to TB35. Adam Humphries return for 15 yards to TB50. Tackled by Corey Nelson.","(6:40) C.J. Anderson rush up the middle for 12 yards to the Den22. Tackled by Bradley McDougald.","(7:21) C.J. Anderson rush to the left for 2 yards to the Den10. Tackled by Kwon Alexander.","(7:58) Trevor Siemian sacked at Den8 for a loss of 1 yard by Akeem Spence and Clinton McDonald.","(8:17) C.J. Anderson rush to the right for 1 yard to the Den18. Tackled by Clinton McDonald. Penalty: Holding on Denver (Matt Paradis) -9 yards.","(8:25) Bryan Anger punts for 35 yards to Den17. No return.","(9:03) Jameis Winston pass to the left to Cameron Brate for 8 yards to the TB48. Tackled by Chris Harris Jr..","(9:29) Jacquizz Rodgers rush up the middle for 3 yards to the TB50. Tackled by Brandon Marshall. Penalty: Holding on Tampa Bay (Joe Hawley) -10 yards.","(9:44) Penalty: False Start on Tampa Bay (Demar Dotson) -5 yards.","(10:24) Jacquizz Rodgers rush to the left for 7 yards to the Den48. Tackled by Dekoda Watson and Shaquil Barrett.","(10:30) Jameis Winston incomplete pass to the left intended for Vincent Jackson.","(10:37) Penalty: Pass Interference on Denver (Will Parks) 24 yards.","(11:17) Jameis Winston sacked at TB21 for a loss of 7 yards by Sylvester Williams.","(11:44) Jacquizz Rodgers rush to the right for no gain to the TB28. Tackled by Shaquil Barrett.","(12:09) Jameis Winston pass to the left to Mike Evans for 11 yards to the TB28.","(12:14) Brandon McManus kicks off to the TB6. Ryan Smith return for 11 yards to TB17. Tackled by Dekoda Watson.","(12:14) Brandon McManus extra point is good.","(12:18) C.J. Anderson rush to the left for 1 yard for a TOUCHDOWN.","(12:24) Penalty: Pass Interference on Tampa Bay (Bradley McDougald) 0 yards.","(12:30) Penalty: Pass Interference on Tampa Bay (Chris Conte) 14 yards.","(13:10) Trevor Siemian pass to the left to Demaryius Thomas for 17 yards to the TB15. Tackled by Vernon Hargreaves III.","(13:10) Penalty: False Start on Denver (Russell Okung) -5 yards.","(13:22) Jameis Winston pass intended for Mike Evans INTERCEPTED by Aqib Talib and returned for 15 yards. Tackled by Joe Hawley.","(13:55) Charles Sims rush to the right for no gain to the TB28. Tackled by Shaquil Barrett.","(14:00) Jameis Winston incomplete pass to the left intended for Charles Sims.","(14:10) Riley Dixon punts for 57 yards to TB17. Adam Humphries return for 11 yards to TB28. Tackled by Jordan Taylor.","(14:19) Trevor Siemian incomplete pass to the right intended for Bennie Fowler.","(15:00) Trevor Siemian sacked at Den26 for a loss of 11 yards by Gerald McCoy.","(0:07) C.J. Anderson rush to the left for 2 yards to the Den37. Tackled by Clinton McDonald and Gerald McCoy.","(0:42) Trevor Siemian pass to the left to Jeff Heuerman for 19 yards to the Den35. Tackled by Bradley McDougald.","(1:18) C.J. Anderson rush up the middle for a loss of 1 yard to the Den16. Tackled by Kwon Alexander.","(1:28) Bryan Anger punts for 53 yards to Den17. No return.","(2:09) Jameis Winston pass to the left to Charles Sims for a loss of 2 yards to the TB30. Tackled by Jared Crick.","(2:29) Penalty: False Start on Tampa Bay (Donovan Smith) -5 yards.","(3:02) Jacquizz Rodgers rush up the middle for a loss of 2 yards to the TB37. Tackled by Shaquil Barrett and Billy Winn.","(3:09) Jameis Winston incomplete pass to the middle intended for Alan Cross.","(3:45) Jacquizz Rodgers rush to the left for 12 yards to the TB39. Tackled by Darian Stewart and T.J. Ward.","(4:14) Jameis Winston rush to the right for 8 yards to the TB27. Tackled by Shane Ray.","(4:50) Charles Sims rush to the right for 6 yards to the TB19. Tackled by Aqib Talib.","(4:59) Riley Dixon punts for 41 yards to TB13. No return.","(5:36) C.J. Anderson rush up the middle for no gain to the Den46. Tackled by William Gholston.","(5:42) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(6:12) Trevor Siemian pass to the right to Demaryius Thomas for 9 yards to the Den46. Tackled by Kwon Alexander and Brent Grimes.","(6:38) Trevor Siemian pass to the right to Emmanuel Sanders for 12 yards to the Den37. Tackled by Brent Grimes.","(6:40) Roberto Aguayo kicks off to the endzone. Touchback.","(6:40) Roberto Aguayo extra point is good.","(6:47) Jameis Winston rush up the middle for 7 yards for a TOUCHDOWN.","(7:27) Jameis Winston pass to the middle to Cameron Brate for 13 yards to the Den7. Tackled by Von Miller.","(7:53) Penalty: Holding on Tampa Bay (Demar Dotson) -10 yards.","(7:53) Tampa Bay Buccaneers timeout.","(8:45) Charles Sims rush to the left for 1 yard to the Den10. Tackled by Brandon Marshall and Adam Gotsis.","(9:23) Jameis Winston pass to the left to Cameron Brate for 14 yards to the Den11. Tackled by Darian Stewart.","(9:59) Charles Sims rush to the left for 3 yards to the Den25. Tackled by Jared Crick.","(10:04) Jameis Winston incomplete pass to the right intended for Freddie Martino.","(10:39) Jameis Winston pass to the right to Vincent Jackson for 18 yards to the Den28. Tackled by Darian Stewart.","(11:15) Charles Sims rush up the middle for 3 yards to the Den46. Tackled by Sylvester Williams.","(11:21) Jameis Winston incomplete pass to the left intended for Mike Evans.","(11:52) Jameis Winston pass to the left to Mike Evans for 11 yards to the Den49.","(12:28) Charles Sims rush up the middle for 1 yard to the TB40. Tackled by Shane Ray.","(12:58) Jameis Winston pass to the left to Cameron Brate for 13 yards to the TB39. Tackled by Chris Harris Jr..","(13:26) Charles Sims rush to the right for 1 yard to the TB26. Tackled by Aqib Talib.","(13:26) Brandon McManus kicks off to the endzone. Touchback.","(13:26) Brandon McManus extra point is good.","(13:31) Trevor Siemian pass to the right to Demaryius Thomas for 11 yards for a TOUCHDOWN.","(13:31) Tampa Bay Buccaneers timeout.","(13:41) Jameis Winston pass intended for Adam Humphries INTERCEPTED by Aqib Talib and returned for 25 yards. Tackled by Joe Hawley.","(14:23) Charles Sims rush up the middle for 1 yard to the TB29. Tackled by Derek Wolfe.","(14:55) Charles Sims rush up the middle for 3 yards to the TB28. Tackled by Brandon Marshall.","(15:00) Brandon McManus kicks off to the TB9. Ryan Smith return for 16 yards to TB25. Tackled by Dekoda Watson."]