["(0:20) Robert Griffin III pass to the left to Seth DeValve for 11 yards to the Cle45. Tackled by Adam Jones.","(0:31) Robert Griffin III pass to the left to Corey Coleman for 7 yards to the Cle34. Tackled by Karlos Dansby.","(0:35) Robert Griffin III incomplete pass to the left intended for Duke Johnson Jr..","(0:57) Robert Griffin III pass to the right to Gary Barnidge for 7 yards to the Cle27. Tackled by Karlos Dansby.","(1:04) Kevin Huber punts for 52 yards to Cle0. Touchback.","(1:14) Penalty: Illegal Formation on Cincinnati (Josh Shaw) -5 yards.","(2:00) Penalty: Delay of Game on Cincinnati (Kevin Huber) -5 yards.","(2:00) Jeremy Hill rush to the right for no gain to the Cle42. Tackled by Danny Shelton.","(2:00) Two Minute Warning.","(2:22) Rex Burkhead rush to the left for 4 yards to the Cle42. Tackled by Danny Shelton.","(2:22) Cleveland Browns timeout.","(2:30) Jeremy Hill rush to the left for 5 yards to the Cle46. Tackled by Ed Reynolds.","(3:16) Jeremy Hill rush to the right for 10 yards to the Cin49. Tackled by Jamie Collins.","(3:57) Jeremy Hill rush to the left for 4 yards to the Cin39. Tackled by Stephen Paea and Ibraheim Campbell.","(3:57) Cleveland Browns timeout.","(4:02) Andy Dalton pass to the right to Rex Burkhead for 6 yards to the Cin35. Tackled by Tramon Williams.","(4:38) Jeremy Hill rush to the right for 2 yards to the Cin29. Tackled by Joe Haden and Demario Davis.","(5:21) Jeremy Hill rush to the right for 2 yards to the Cin27. Tackled by Cam Johnson and Danny Shelton.","(6:01) Britton Colquitt punts for 42 yards to Cin25. No return.","(6:30) Robert Griffin III sacked at Cle33 for a loss of 11 yards by Geno Atkins.","(6:58) Robert Griffin III sacked at Cle44 for a loss of 8 yards by Geno Atkins.","(7:32) Robert Griffin III incomplete pass to the right intended for Corey Coleman.","(7:50) Duke Johnson Jr. rush to the left for 21 yards to the Cin48. Tackled by Karlos Dansby.","(8:31) Robert Griffin III pass to the left to Isaiah Crowell for 5 yards to the Cle31. Tackled by Karlos Dansby.","(8:38) Mike Nugent kicks off to the Cle2. Ricardo Louis return for 24 yards to Cle26. Tackled by Tyler Kroft.","(8:41) Mike Nugent 44 yard field goal attempt is GOOD. Holder: Kevin Huber.","(8:41) Penalty: False Start on Cincinnati (Eric Winston) -5 yards.","(8:47) Andy Dalton incomplete pass to the right intended for Tyler Eifert.","(9:12) Andy Dalton pass to the left to Brandon LaFell for 9 yards to the Cle20. Tackled by Carl Nassib.","(9:36) Andy Dalton rush to the right for 9 yards to the Cle19. Tackled by Jamie Meder. Penalty: Holding on Cincinnati (Brandon LaFell) -10 yards.","(10:18) Jeremy Hill rush to the right for 1 yard to the Cle28. Tackled by Jamie Collins.","(10:18) Cincinnati Bengals timeout.","(11:04) Andy Dalton pass to the right to Brandon LaFell for 11 yards to the Cle29. Tackled by Joe Haden and Ibraheim Campbell.","(11:43) Rex Burkhead rush to the right for 5 yards to the Cle40. Tackled by Jamie Collins.","(12:20) Rex Burkhead rush to the left for 5 yards to the Cle45. Tackled by Jamie Meder.","(12:56) Jeremy Hill rush to the right for 7 yards to the Cin50. Tackled by Jamie Collins.","(13:28) Andy Dalton pass to the right to Jeremy Hill for 18 yards to the Cin43. Tackled by Ibraheim Campbell.","(14:08) Jeremy Hill rush to the right for 7 yards to the Cin25. Tackled by Jamie Collins.","(14:14) Cody Parkey kicks off to the Cin2. Alex Erickson return for 16 yards to Cin18. Tackled by Marcus Burley.","(14:22) Cody Parkey 30 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(14:22) Robert Griffin III incomplete pass to the right intended for Seth DeValve.","(15:00) Isaiah Crowell rush to the right for a loss of 1 yard to the Cin12. Tackled by Geno Atkins and Karlos Dansby.","(0:29) Robert Griffin III pass to the right to Terrelle Pryor Sr. for 3 yards to the Cin11. Tackled by Dre Kirkpatrick.","(1:03) Isaiah Crowell rush to the right for 30 yards to the Cin14. Tackled by Dre Kirkpatrick.","(1:12) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(1:48) Isaiah Crowell rush to the right for 9 yards to the Cin44. Tackled by Shawn Williams.","(2:32) Robert Griffin III pass to the right to Duke Johnson Jr. for 21 yards to the Cle47. Tackled by Josh Shaw and George Iloka.","(3:15) Robert Griffin III rush to the left for 7 yards to the Cle26. Tackled by Adam Jones.","(3:20) Robert Griffin III incomplete pass to the right intended for Gary Barnidge.","(3:25) Kevin Huber punts for 42 yards to Cle19. No return.","(3:35) Andy Dalton incomplete pass to the left intended for Rex Burkhead.","(4:02) Andy Dalton pass to the right to Jeremy Hill for 6 yards to the Cin39. Tackled by Jamie Collins and Emmanuel Ogbah.","(4:24) Penalty: Unnecessary Roughness on Cincinnati (Tyler Eifert) -15 yards.","(4:58) Jeremy Hill rush to the right for 5 yards to the Cin48. Tackled by Danny Shelton and Christian Kirksey.","(5:38) Jeremy Hill rush to the right for 4 yards to the Cin43. Tackled by Demario Davis.","(6:14) Andy Dalton rush to the left for 8 yards to the Cin39. Tackled by Joe Haden.","(6:52) Andy Dalton pass to the right to Tyler Boyd for 4 yards to the Cin31. Tackled by Jamar Taylor.","(7:34) Jeremy Hill rush to the left for 5 yards to the Cin27. Tackled by Emmanuel Ogbah and Christian Kirksey.","(8:06) Jeremy Hill rush to the right for 4 yards to the Cin22. Tackled by Danny Shelton.","(8:11) Cody Parkey kicks off to the Cin-3. Alex Erickson return for 21 yards to Cin18. Tackled by Tracy Howard.","(8:11) Cody Parkey extra point is good.","(8:17) Robert Griffin III rush up the middle for 1 yard for a TOUCHDOWN.","(8:32) Isaiah Crowell rush to the left for 1 yard to the Cin1. Tackled by Geno Atkins.","(9:05) Robert Griffin III incomplete pass to the right intended for Danny Vitale.","(9:36) Robert Griffin III pass to the right to Corey Coleman for 15 yards to the Cin5. Tackled by Carlos Dunlap. Penalty: Horse Collar Tackle on Cincinnati (Carlos Dunlap) 3 yards.","(10:11) Isaiah Crowell rush to the right for 5 yards to the Cin20. Tackled by Karlos Dansby.","(10:11) Cleveland Browns timeout.","(10:52) Robert Griffin III pass to the right to Andrew Hawkins for 4 yards to the Cin25.","(11:28) Robert Griffin III pass to the middle to Gary Barnidge for 7 yards to the Cin29. Tackled by George Iloka.","(11:58) Robert Griffin III rush to the left for 2 yards to the Cin36. Tackled by Karlos Dansby.","(12:43) Isaiah Crowell rush to the right for 42 yards to the Cin38. Tackled by George Iloka.","(12:51) Robert Griffin III incomplete pass to the left intended for Isaiah Crowell.","(12:58) Kevin Huber punts for 72 yards to Cle0. Touchback.","(13:05) Andy Dalton incomplete pass to the left intended for Brandon LaFell.","(13:09) Andy Dalton incomplete pass to the right intended for Jeremy Hill.","(13:42) Jeremy Hill rush to the left for 3 yards to the Cin28. Tackled by Demario Davis.","(13:50) Britton Colquitt punts for 46 yards to Cin25. No return.","(13:55) Robert Griffin III incomplete pass to the left intended for Corey Coleman.","(14:34) Robert Griffin III sacked at Cle29 for no gain by Karlos Dansby.","(15:00) Robert Griffin III pass to the left to Corey Coleman for 4 yards to the Cle29. Tackled by Shawn Williams.","(15:00) Mike Nugent kicks off to the endzone. Touchback.","(0:04) 36 yard field goal attempt by Mike Nugent is NO GOOD. Holder: Kevin Huber.","(0:08) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(0:27) Andy Dalton pass to the left to Cody Core for 8 yards to the Cle18. Tackled by Jamar Taylor.","(0:27) Cincinnati Bengals timeout.","(0:33) Andy Dalton sacked at Cle26 for a loss of 10 yards by Emmanuel Ogbah.","(0:40) Rex Burkhead rush to the left for 11 yards to the Cle16. Tackled by Briean Boddy-Calhoun.","(0:46) Andy Dalton incomplete pass to the right intended for Alex Erickson.","(1:12) Andy Dalton pass to the right to Tyler Boyd for 9 yards to the Cle27. Tackled by Jamar Taylor.","(1:17) Andy Dalton pass to the left to Tyler Eifert for 13 yards to the Cle36. Tackled by Jamie Collins.","(1:17) Cincinnati Bengals timeout.","(1:22) Rex Burkhead rush to the right for 5 yards to the Cle49. Tackled by Jamie Collins.","(2:00) Rex Burkhead rush to the right for 7 yards to the Cin46. Tackled by Danny Shelton.","(2:00) Two Minute Warning.","(2:29) Jeremy Hill rush to the left for 2 yards to the Cin39. Tackled by Demario Davis.","(2:34) Britton Colquitt punts for 53 yards to Cin13. Alex Erickson return for 24 yards to Cin37. Tackled by Dominique Alexander.","(3:35) Robert Griffin III rush to the left for 7 yards to the Cle34. Tackled by Karlos Dansby.","(3:39) Robert Griffin III incomplete pass to the middle intended for Corey Coleman.","(4:15) Isaiah Crowell rush to the left for 2 yards to the Cle27. Tackled by Karlos Dansby.","(5:01) Isaiah Crowell rush to the right for 19 yards to the Cle25. Tackled by Shawn Williams.","(5:06) Mike Nugent kicks off to the Cle2. Ricardo Louis return for 10 yards to Cle12. Tackled by Cedric Peerman. Penalty: Holding on Cleveland (Cam Johnson) -6 yards.","(5:06) Mike Nugent extra point is good.","(5:08) Andy Dalton pass to the middle to Tyler Eifert for 5 yards for a TOUCHDOWN.","(5:52) Andy Dalton pass to the right to Brandon LaFell for 2 yards to the Cle5. Tackled by Jamie Collins.","(5:53) Cincinnati Bengals timeout.","(6:40) Jeremy Hill rush to the right for 2 yards to the Cle7. Tackled by Briean Boddy-Calhoun.","(7:05) Jeremy Hill rush to the left for 10 yards to the Cle9. Tackled by Joe Haden.","(7:43) Andy Dalton pass to the left to Jeremy Hill for 7 yards to the Cle19. Tackled by Joe Haden.","(7:57) Robert Griffin III pass intended for Terrelle Pryor Sr. INTERCEPTED by George Iloka and returned for 21 yards. Tackled by Duke Johnson Jr..","(8:06) Kevin Huber punts for 40 yards to Cle2. No return.","(8:46) Andy Dalton sacked at Cle42 for a loss of 8 yards by Jamie Collins.","(9:31) Andy Dalton pass to the left to Tyler Boyd for 6 yards to the Cle34. Tackled by Jamar Taylor.","(10:16) Rex Burkhead rush to the right for no gain to the Cle40. Tackled by Jamie Collins and Demario Davis.","(10:54) Andy Dalton pass to the right to Alex Erickson for 16 yards to the Cle40. Tackled by Tramon Williams.","(11:34) Andy Dalton sacked at Cin44 for a loss of 5 yards by Stephen Paea and Emmanuel Ogbah.","(12:02) Andy Dalton pass to the left to Tyler Eifert for 6 yards to the Cin49. Tackled by Jamie Collins.","(12:34) Rex Burkhead rush to the right for 6 yards to the Cin43. Tackled by Emmanuel Ogbah.","(13:09) Tyler Boyd rush to the right for 1 yard to the Cin37. Tackled by Joe Haden.","(13:25) Britton Colquitt punts for 36 yards to Cin22. Alex Erickson return for 14 yards to Cin36. Tackled by Ed Reynolds.","(13:28) Robert Griffin III incomplete pass to the left intended for Corey Coleman.","(14:01) Isaiah Crowell rush to the left for 2 yards to the Cle42. Tackled by Michael Johnson and Vincent Rey.","(14:05) Robert Griffin III incomplete pass to the right intended for Gary Barnidge.","(14:11) Penalty: Illegal Formation on Cleveland -5 yards.","(15:00) Robert Griffin III pass to the right to Gary Barnidge for 13 yards to the Cle45. Tackled by Nick Vigil.","(0:39) Corey Coleman rush to the left for 1 yard to the Cle32. Tackled by Shawn Williams.","(0:48) Robert Griffin III incomplete pass to the left intended for Corey Coleman.","(0:55) Kevin Huber punts for 42 yards to Cle31. No return.","(0:58) Andy Dalton incomplete pass to the left intended for Cody Core.","(1:34) Jeremy Hill rush to the right for 3 yards to the Cin27. Tackled by Demario Davis.","(2:13) Jeremy Hill rush to the left for 2 yards to the Cin24. Tackled by Demario Davis.","(3:00) Britton Colquitt punts for 54 yards to Cin22. No return.","(3:00) Robert Griffin III pass to the right to Randall Telfer for 7 yards to the Cle24. Tackled by Dre Kirkpatrick.","(3:41) Isaiah Crowell rush to the left for 4 yards to the Cle17. Tackled by DeShawn Williams.","(3:51) Robert Griffin III incomplete pass to the left intended for Corey Coleman defensed by Shawn Williams.","(4:18) Duke Johnson Jr. rush to the left for 1 yard to the Cle23. Tackled by Adam Jones. Penalty: Holding on Cleveland (Randall Telfer) -10 yards.","(4:42) Robert Griffin III rush up the middle for 1 yard to the Cle22. Tackled by Vincent Rey.","(5:17) Duke Johnson Jr. rush to the right for no gain to the Cle21. Tackled by Geno Atkins.","(5:56) Duke Johnson Jr. rush to the right for 2 yards to the Cle21. Tackled by Vontaze Burfict.","(6:27) Robert Griffin III rush to the right for 7 yards to the Cle19. Tackled by Karlos Dansby.","(6:27) Mike Nugent kicks off to the Cle3. Ricardo Louis return for 9 yards to Cle12. Tackled by Clayton Fejedelem.","(6:27) Mike Nugent extra point is NO GOOD.","(6:33) Jeremy Hill rush to the right for 1 yard for a TOUCHDOWN.","(7:07) Jeremy Hill rush to the right for 5 yards to the Cle1. Tackled by Jamie Meder.","(7:33) Jeremy Hill rush to the left for 11 yards to the Cle6. Tackled by Tramon Williams.","(8:07) Rex Burkhead rush to the left for 2 yards to the Cle17. Tackled by Cam Johnson and Stephen Paea.","(8:45) Andy Dalton pass to the left to Tyler Boyd for 11 yards to the Cle19. Tackled by Jamar Taylor.","(9:11) Andy Dalton pass to the right to Tyler Boyd for 11 yards to the Cle30. Tackled by Christian Kirksey.","(9:57) Andy Dalton sacked at Cle41 for a loss of 10 yards by Cam Johnson. FUMBLE, recovered by Cin (Eric Winston).","(10:43) Andy Dalton pass to the middle to Tyler Eifert for 10 yards to the Cle31. Tackled by Jamie Collins.","(11:16) Jeremy Hill rush to the left for 4 yards to the Cle41. Tackled by Emmanuel Ogbah.","(11:25) Britton Colquitt punts for 45 yards to Cin46. Alex Erickson return for 9 yards to Cle45. Tackled by Briean Boddy-Calhoun.","(11:30) Robert Griffin III incomplete pass to the right intended for Corey Coleman defensed by Michael Johnson.","(11:38) Penalty: False Start on Cleveland (Terrelle Pryor Sr.) -5 yards.","(11:38) Robert Griffin III incomplete pass to the right intended for Corey Coleman.","(12:15) Robert Griffin III rush to the left for 6 yards to the Cle14. Tackled by Karlos Dansby.","(12:21) Mike Nugent kicks off to the Cle-2. Ricardo Louis return for 18 yards to Cle16. Tackled by Margus Hunt. Penalty: Illegal Block on Cleveland (Joe Schobert) -8 yards.","(12:21) Mike Nugent extra point is good.","(12:26) Andy Dalton pass to the right to Tyler Eifert for 14 yards for a TOUCHDOWN.","(13:13) Jeremy Hill rush to the right for 6 yards to the Cle14. Tackled by Danny Shelton.","(13:33) Tyler Boyd rush to the left for 39 yards to the Cle20. Tackled by Briean Boddy-Calhoun.","(14:06) Andy Dalton pass to the right to Tyler Boyd for 8 yards to the Cin41. Tackled by Jamie Collins.","(14:13) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(14:54) Jeremy Hill rush to the right for 6 yards to the Cin33. Tackled by Ibraheim Campbell.","(15:00) Cody Parkey kicks off to the Cin11. Alex Erickson return for 16 yards to Cin27. Tackled by Marcus Burley and Cam Johnson."]