["(0:05) Sam Bradford rush up the middle for a loss of 1 yard to the Min48.","(0:21) Jason Myers 61 yard field goal attempt is BLOCKED by Linval Joseph. Return blocked field goal by Xavier Rhodes to the Min49. Tackled by Carson Tinker.","(0:22) Minnesota Vikings timeout.","(0:31) Blake Bortles pass to the middle to Bryan Walters for 8 yards to the Min33. Tackled by Captain Munnerlyn. Penalty: Illegal Block on Jacksonville (Allen Robinson) -10 yards.","(0:58) Blake Bortles sacked at Min41 for a loss of 8 yards by Danielle Hunter.","(1:02) Blake Bortles incomplete pass to the middle intended for Shane Wynn.","(1:23) Blake Bortles pass to the middle to Shane Wynn for 19 yards to the Min33. Tackled by Anthony Harris.","(1:28) Blake Bortles incomplete pass to the left intended for Arrelious Benn.","(1:35) Blake Bortles pass to the left to Neal Sterling for 8 yards to the Jax48. Tackled by Xavier Rhodes.","(2:00) Blake Bortles pass to the middle to Marqise Lee for 9 yards to the Jax40. Tackled by Eric Kendricks and Anthony Barr.","(2:00) Two Minute Warning.","(2:13) Blake Bortles pass to the left to Neal Sterling for 6 yards to the Jax31. Tackled by Anthony Barr.","(2:13) Kai Forbath kicks off to the endzone. Touchback.","(2:13) Kai Forbath extra point is good.","(2:17) Sam Bradford pass to the right to Kyle Rudolph for 3 yards for a TOUCHDOWN.","(3:02) Matt Asiata rush to the right for 3 yards to the Jax3. Tackled by Paul Posluszny.","(3:08) Sam Bradford pass to the right to Kyle Rudolph for 11 yards to the Jax6. Tackled by Dan Skuta.","(3:08) Jacksonville Jaguars timeout.","(3:14) Matt Asiata rush up the middle for no gain to the Jax17. Tackled by Paul Posluszny.","(3:21) Sam Bradford pass to the right to Cordarrelle Patterson for 11 yards to the Jax17. Tackled by Aaron Colvin and Paul Posluszny.","(3:21) Jacksonville Jaguars timeout.","(3:27) Jerick McKinnon rush to the left for a loss of 1 yard to the Jax28. Tackled by Dan Skuta.","(3:27) Jacksonville Jaguars timeout.","(3:33) Jerick McKinnon rush to the left for 1 yard to the Jax27. Tackled by Johnathan Cyprien and Dan Skuta.","(3:38) Sam Bradford pass to the right to Charles Johnson for 6 yards to the Jax43. Tackled by Prince Amukamara. Penalty: Face Mask on Jacksonville (Tyson Alualu) 15 yards.","(5:04) Jerick McKinnon rush to the right for 5 yards to the Jax49. Tackled by Johnathan Cyprien.","(5:14) Brad Nortman punts for 39 yards to Min46. No return.","(5:29) Penalty: Illegal Touch on Jacksonville (Arrelious Benn) -5 yards.","(5:36) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(6:15) T.J. Yeldon rush to the right for no gain to the Jax20. Tackled by Linval Joseph and Danielle Hunter.","(6:19) Blake Bortles incomplete pass to the middle intended for T.J. Yeldon.","(6:24) Matt Asiata rush up the middle for no gain to the Jax1. Tackled by Johnathan Cyprien. FUMBLE, recovered by Jax (Malik Jackson). Touchback.","(7:00) Sam Bradford pass to the right to Rhett Ellison for no gain to the Jax1. Tackled by Hayes Pullard III.","(7:41) Matt Asiata rush up the middle for no gain to the Jax1. Tackled by Abry Jones.","(8:31) Matt Asiata rush to the right for 23 yards to the Jax1. Tackled by Tashaun Gipson.","(9:14) Jerick McKinnon rush to the left for 7 yards to the Jax24. Tackled by Paul Posluszny and Sheldon Day.","(9:26) Penalty: Running into Kicker on Jacksonville (Alex Ellis) 15 yards.","(9:59) Sam Bradford incomplete pass to the middle intended for Adam Thielen.","(10:43) Sam Bradford pass to the right to Jerick McKinnon for a loss of 1 yard to the Min48. Tackled by Paul Posluszny.","(11:13) Sam Bradford rush to the left for 15 yards to the Jax41. Penalty: Holding on Minnesota (T.J. Clemmings) -10 yards.","(12:40) Jerick McKinnon rush up the middle for 3 yards to the Min44. Tackled by Tyson Alualu.","(12:48) Brad Nortman punts for 29 yards to Min41. No return.","(12:51) Blake Bortles incomplete pass to the right intended for Shane Wynn.","(13:37) Blake Bortles pass to the right to T.J. Yeldon for 5 yards to the Jax30. Tackled by Terence Newman.","(14:12) T.J. Yeldon rush to the right for no gain to the Jax25. Tackled by Terence Newman.","(14:13) Kai Forbath kicks off to the endzone. Touchback.","(14:13) Kai Forbath extra point is NO GOOD.","(14:13) Penalty: False Start on Minnesota (Rhett Ellison) -5 yards.","(14:18) Matt Asiata rush up the middle for 1 yard for a TOUCHDOWN.","(14:23) Jerick McKinnon rush up the middle for no gain to the Jax3. Tackled by Johnathan Cyprien and Hayes Pullard III. Penalty: Holding on Jacksonville (Johnathan Cyprien) 2 yards.","(0:32) Sam Bradford pass to the right to Jerick McKinnon for 5 yards to the Jax3. Tackled by Jalen Ramsey and Johnathan Cyprien.","(0:38) Sam Bradford incomplete pass to the right intended for Zach Line.","(1:22) Sam Bradford pass to the right to Jerick McKinnon for 7 yards to the Jax8. Tackled by Paul Posluszny.","(1:55) Sam Bradford pass to the right to Adam Thielen for 23 yards to the Jax15. Tackled by Telvin Smith.","(2:36) Sam Bradford pass to the middle to Jerick McKinnon for 12 yards to the Jax38. Tackled by Johnathan Cyprien and Myles Jack.","(3:13) Jerick McKinnon rush to the left for 7 yards to the Min50. Tackled by Prince Amukamara.","(3:46) Sam Bradford pass to the left to Stefon Diggs for 5 yards to the Min43. Tackled by Johnathan Cyprien.","(3:50) Jason Myers kicks off to the Min20. David Morgan return for 18 yards to Min38. Tackled by Davon House.","(3:50) Jason Myers extra point is good. Penalty: Delay of Game on Jacksonville (Jason Myers) -5 yards.","(3:54) Blake Bortles pass to the middle to Bryan Walters for 14 yards for a TOUCHDOWN.","(4:00) Blake Bortles incomplete pass to the right intended for T.J. Yeldon.","(4:39) T.J. Yeldon rush to the left for 3 yards to the Min14. Tackled by Danielle Hunter.","(4:44) Penalty: Pass Interference on Minnesota (Mackensie Alexander) 22 yards.","(4:47) Blake Bortles incomplete pass to the left intended for Corey Grant defensed by Everson Griffen.","(5:06) Blake Bortles rush up the middle for 6 yards to the Jax41. Penalty: Holding on Minnesota (Xavier Rhodes) 5 yards. Penalty: Unsports. Conduct on Minnesota (Xavier Rhodes) 15 yards.","(5:45) T.J. Yeldon rush to the left for 11 yards to the Jax35. Tackled by Anthony Barr.","(6:24) Blake Bortles sacked at Jax24 for a loss of 6 yards by Everson Griffen.","(6:45) Blake Bortles pass to the right to Allen Robinson for 17 yards to the Jax30. Tackled by Anthony Harris.","(7:29) Blake Bortles pass to the right to T.J. Yeldon for 5 yards to the Jax13. Tackled by Eric Kendricks.","(7:51) Blake Bortles rush to the right for 2 yards to the Jax16. Tackled by Andrew Sendejo. Penalty: Illegal Block on Jacksonville (Alex Ellis) -8 yards.","(8:24) Blake Bortles pass to the right to Ben Koyack for 4 yards to the Jax14. Tackled by Eric Kendricks.","(8:29) Kai Forbath kicks off to the Jax-1. Marqise Lee return for 21 yards to Jax20. Tackled by Audie Cole. Penalty: Illegal Block on Jacksonville (Hayes Pullard III) -10 yards.","(8:34) Kai Forbath 46 yard field goal attempt is GOOD. Holder: Jeff Locke.","(8:41) Sam Bradford incomplete pass to the left intended for Cordarrelle Patterson defensed by Jalen Ramsey.","(8:46) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(9:27) Matt Asiata rush up the middle for 4 yards to the Jax28. Tackled by Johnathan Cyprien.","(10:08) Sam Bradford pass to the middle to Adam Thielen for 11 yards to the Jax32. Tackled by Tashaun Gipson.","(10:14) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(10:54) Jerick McKinnon rush up the middle for no gain to the Jax43. Tackled by Tyson Alualu.","(11:17) Sam Bradford pass to the left to Adam Thielen for 26 yards to the Jax43. Tackled by Johnathan Cyprien.","(11:22) Sam Bradford incomplete pass to the right intended for Stefon Diggs.","(11:27) 41 yard field goal attempt by Jason Myers is NO GOOD. Holder: Brad Nortman.","(11:32) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(11:36) Blake Bortles incomplete pass to the middle intended for Alex Ellis.","(12:19) Corey Grant rush up the middle for 4 yards to the Min23. Tackled by Shamar Stephen.","(12:32) Blake Bortles pass to the right to Marqise Lee for 34 yards to the Min27. Tackled by Xavier Rhodes.","(13:09) Corey Grant rush up the middle for 3 yards to the Jax39. Tackled by Terence Newman.","(13:47) Blake Bortles pass to the right to Bryan Walters for 5 yards to the Jax36. Tackled by Captain Munnerlyn.","(14:24) T.J. Yeldon rush to the left for 4 yards to the Jax31. Tackled by Danielle Hunter.","(15:00) T.J. Yeldon rush to the right for 2 yards to the Jax27. Tackled by Anthony Barr.","(15:00) Kai Forbath kicks off to the endzone. Touchback.","(0:09) Sam Bradford rush up the middle for a loss of 1 yard to the Min24.","(0:09) Jason Myers kicks off to the endzone. Touchback.","(0:13) Jason Myers 24 yard field goal attempt is GOOD. Holder: Brad Nortman.","(0:19) Blake Bortles pass to the right to T.J. Yeldon for no gain to the Min7. Tackled by Anthony Harris.","(0:19) Jacksonville Jaguars timeout.","(0:26) Blake Bortles pass to the right to Neal Sterling for 13 yards to the Min7. Tackled by Andrew Sendejo.","(0:52) Blake Bortles pass to the right to T.J. Yeldon for a loss of 4 yards to the Min20. Tackled by Tom Johnson.","(1:03) Blake Bortles pass to the right to Marqise Lee for 39 yards to the Min16. Tackled by Anthony Harris.","(1:31) Blake Bortles pass to the right to T.J. Yeldon for 10 yards to the Jax45. Tackled by Eric Kendricks.","(1:36) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(1:40) Blake Bortles incomplete pass to the right intended for Neal Sterling.","(1:46) Penalty: Pass Interference on Minnesota (Xavier Rhodes) 31 yards.","(1:46) Penalty: False Start on Jacksonville (Tyler Shatley) -4 yards.","(1:46) Minnesota Vikings timeout.","(1:50) T.J. Yeldon rush up the middle for 5 yards to the Jax8. Tackled by Trae Waynes and Eric Kendricks.","(1:50) Minnesota Vikings timeout.","(1:56) T.J. Yeldon rush up the middle for 2 yards to the Jax3. Tackled by Eric Kendricks.","(2:00) Matt Asiata rush to the left for no gain to the Jax1. Tackled by Sen'Derrick Marks.","(2:00) Two Minute Warning.","(2:25) Minnesota Vikings timeout.","(2:25) Matt Asiata rush to the right for no gain to the Jax1. Tackled by Paul Posluszny.","(2:57) Sam Bradford pass to the right to Kyle Rudolph for 2 yards to the Jax1. Tackled by Hayes Pullard III.","(3:01) Sam Bradford incomplete pass to the left intended for Kyle Rudolph defensed by Johnathan Cyprien.","(3:43) Matt Asiata rush up the middle for 5 yards to the Jax3. Tackled by Johnathan Cyprien.","(4:23) Jerick McKinnon rush up the middle for 6 yards to the Jax8. Tackled by Tashaun Gipson.","(4:49) Sam Bradford pass to the middle to Stefon Diggs for 45 yards to the Jax14. Tackled by Tashaun Gipson.","(5:27) Jerick McKinnon rush to the right for 1 yard to the Min41. Tackled by Paul Posluszny.","(6:18)  FUMBLE, recovered by Min (Sam Bradford). Sam Bradford pass to the right to Jerick McKinnon for 15 yards to the Min40. Tackled by Johnathan Cyprien.","(6:18) Jason Myers kicks off to the endzone. Touchback.","(6:22) Jason Myers 55 yard field goal attempt is GOOD. Holder: Brad Nortman.","(7:11) Blake Bortles pass to the left to T.J. Yeldon for 6 yards to the Min37. Tackled by Terence Newman.","(7:28) Penalty: False Start on Jacksonville (Jermey Parnell) -5 yards.","(8:15) Blake Bortles rush up the middle for 5 yards to the Min38. Tackled by Everson Griffen.","(8:30) Penalty: False Start on Jacksonville (Blake Bortles) -5 yards.","(9:07) Corey Grant rush to the right for a loss of 3 yards to the Min38. Tackled by Eric Kendricks.","(9:37) Blake Bortles pass to the right to T.J. Yeldon for 9 yards to the Min35. Tackled by Terence Newman.","(10:16) T.J. Yeldon rush to the right for 2 yards to the Min44. Tackled by Danielle Hunter.","(10:43) Blake Bortles pass to the left to Marqise Lee for 22 yards to the Min46. Tackled by Terence Newman.","(10:49) Kai Forbath kicks off to the Jax7. Marqise Lee return for 25 yards to Jax32. Tackled by Kentrell Brothers.","(10:53) Kai Forbath 40 yard field goal attempt is GOOD. Holder: Jeff Locke.","(11:00) Sam Bradford incomplete pass to the left intended for Kyle Rudolph.","(11:04) Sam Bradford incomplete pass to the left intended for Stefon Diggs.","(11:43) Jerick McKinnon rush up the middle for 2 yards to the Jax22. Tackled by Tyson Alualu.","(12:12) Sam Bradford pass to the left to Stefon Diggs for 5 yards to the Jax39. Tackled by Jalen Ramsey. Penalty: Unnecessary Roughness on Jacksonville (Jalen Ramsey) 15 yards.","(13:00) Sam Bradford rush to the right for 4 yards to the Jax44. Tackled by Johnathan Cyprien.","(13:07) Jason Myers kicks off to the Min-1. Cordarrelle Patterson return for 53 yards to Jax48. Tackled by Jarrod Wilson.","(13:12) Jason Myers 45 yard field goal attempt is GOOD. Holder: Brad Nortman.","(13:16) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Xavier Rhodes.","(13:53) T.J. Yeldon rush up the middle for 5 yards to the Min27. Tackled by Anthony Barr.","(14:29) T.J. Yeldon rush to the right for 1 yard to the Min32. Tackled by Danielle Hunter.","(15:00) T.J. Yeldon rush to the right for 12 yards to the Min33. Tackled by Anthony Harris.","(0:21) Blake Bortles pass to the right to Ben Koyack for 15 yards to the Min45. Tackled by Andrew Sendejo and Captain Munnerlyn.","(1:00) T.J. Yeldon rush to the left for 1 yard to the Jax40. Tackled by Anthony Harris.","(1:07) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Trae Waynes.","(1:17) Jeff Locke punts for 42 yards to Jax35. Bryan Walters return for 4 yards to Jax39. Tackled by Cordarrelle Patterson.","(1:42) Sam Bradford pass to the left to Cordarrelle Patterson for 2 yards to the Min23. Tackled by Paul Posluszny.","(2:28) Sam Bradford pass to the right to Jerick McKinnon for no gain to the Min21. Tackled by Prince Amukamara.","(3:12) Jerick McKinnon rush to the right for a loss of 1 yard to the Min21. Tackled by Telvin Smith.","(3:22) Brad Nortman punts for 41 yards to Min12. No return. Penalty: Holding on Jacksonville (Carson Tinker) 10 yards.","(4:01) Blake Bortles pass to the right to Marqise Lee for 9 yards to the Jax47. Tackled by Eric Kendricks and Anthony Barr.","(4:41) T.J. Yeldon rush to the right for 1 yard to the Jax38. Tackled by Linval Joseph.","(5:18) Blake Bortles sacked at Jax37 for a loss of 6 yards by Everson Griffen.","(6:02) Corey Grant rush to the right for 9 yards to the Jax43. Tackled by Zach Line.","(6:42) T.J. Yeldon rush to the right for no gain to the Jax34. Tackled by Chad Greenway.","(7:18) T.J. Yeldon rush to the left for 5 yards to the Jax34. Tackled by Anthony Harris.","(7:53) Blake Bortles pass to the right to Bryan Walters for 4 yards to the Jax29. Tackled by Captain Munnerlyn.","(7:53) Kai Forbath kicks off to the endzone. Touchback.","(7:57) Kai Forbath 32 yard field goal attempt is GOOD. Holder: Jeff Locke.","(8:36) Penalty: Delay of Game on Minnesota (Sam Bradford) -5 yards.","(9:30) Sam Bradford pass to the middle to Matt Asiata for 8 yards to the Jax9. Tackled by Paul Posluszny.","(9:35) Sam Bradford incomplete pass to the right intended for Rhett Ellison.","(10:09) Matt Asiata rush up the middle for 1 yard to the Jax17. Tackled by Malik Jackson.","(10:28) Sam Bradford pass to the left to Adam Thielen for 41 yards to the Jax18. Tackled by Prince Amukamara.","(10:40) Brad Nortman punts for 54 yards to Min32. Adam Thielen return for 9 yards to Min41. Tackled by Corey Grant.","(11:16) Blake Bortles sacked at Jax14 for a loss of 7 yards by Brian Robison.","(11:21) Blake Bortles incomplete pass to the middle intended for Neal Sterling.","(11:39) Penalty: False Start on Jacksonville (Kelvin Beachum) -5 yards.","(12:18) T.J. Yeldon rush to the right for 5 yards to the Jax26. Tackled by Shamar Stephen.","(12:20) Kai Forbath kicks off to the Jax1. Marqise Lee return for 20 yards to Jax21. Tackled by Laquon Treadwell.","(12:30) Kai Forbath 43 yard field goal attempt is GOOD. Holder: Jeff Locke.","(13:13) Sam Bradford pass to the right to Cordarrelle Patterson for 5 yards to the Jax25. Tackled by Dante Fowler Jr..","(13:51) Jerick McKinnon rush up the middle for no gain to the Jax30. Tackled by Sen'Derrick Marks.","(14:29) Jerick McKinnon rush to the right for 1 yard to the Jax30. Tackled by Johnathan Cyprien.","(15:00) Sam Bradford pass to the right to Kyle Rudolph for 44 yards to the Jax31. Tackled by Johnathan Cyprien.","(15:00) Jason Myers kicks off to the endzone. Touchback."]