["(0:13) LeGarrette Blount rush to the right for 4 yards to the Bal21. Tackled by Matt Judon and Albert McClellan.","(0:13) New England Patriots timeout.","(0:59) LeGarrette Blount rush to the right for no gain to the Bal25. Tackled by C.J. Mosley and Matt Judon.","(0:59) New England Patriots timeout.","(1:44) LeGarrette Blount rush to the left for 4 yards to the Bal25. Tackled by Eric Weddle and C.J. Mosley.","(1:44) Baltimore Ravens timeout.","(1:50) LeGarrette Blount rush to the left for 5 yards to the Bal29. Tackled by Lardarius Webb and Albert McClellan.","(1:50) Baltimore Ravens timeout.","(1:55) LeGarrette Blount rush to the right for 5 yards to the Bal34. Tackled by Lardarius Webb and Lawrence Guy.","(1:55) Two Minute Warning.","(2:01) Tom Brady pass to the right to Julian Edelman for 8 yards to the Bal39. Tackled by Lardarius Webb.","(2:03) Justin Tucker onside kickoff to the Bal47. Onside kick recovered by receiving team by Patrick Chung.","(2:07) Justin Tucker 37 yard field goal attempt is GOOD. Holder: Sam Koch.","(2:48) Joe Flacco pass to the right to Dennis Pitta for 2 yards to the NE20. Tackled by Malcolm Butler.","(3:28) Joe Flacco pass to the middle to Chris Moore for 5 yards to the NE22. Tackled by Dont'a Hightower and Logan Ryan.","(4:04) Joe Flacco pass to the right to Kenneth Dixon for 2 yards to the NE27. Tackled by Kyle Van Noy.","(4:11) Joe Flacco pass to the right to Steve Smith Sr. for 25 yards to the NE29. Tackled by Malcolm Butler.","(4:48) Joe Flacco pass to the left to Kyle Juszczyk for no gain to the Bal46. Tackled by Chris Long.","(4:56) Joe Flacco pass to the left to Kenneth Dixon for 5 yards to the Bal46. Tackled by Chris Long.","(5:30) Joe Flacco pass to the right to Mike Wallace for 20 yards to the Bal41. Tackled by Logan Ryan.","(6:10) Joe Flacco pass to the left to Dennis Pitta for 2 yards to the Bal21. Tackled by Shea McClellin.","(6:15) Joe Flacco incomplete pass to the left intended for Kamar Aiken.","(6:18) Stephen Gostkowski kicks off to the Bal-4. Devin Hester return for 23 yards to Bal19. Tackled by Brandon King.","(6:18) Stephen Gostkowski extra point is good.","(6:28) Tom Brady pass to the right to Chris Hogan for 79 yards for a TOUCHDOWN.","(6:35) Justin Tucker kicks off to the NE3. James White return for 18 yards to NE21. Tackled by Shareece Wright.","(6:39) Justin Tucker 38 yard field goal attempt is GOOD. Holder: Sam Koch.","(7:24) Joe Flacco sacked at NE20 for a loss of 8 yards by Rob Ninkovich.","(7:24) Baltimore Ravens timeout.","(7:58) Joe Flacco rush to the left for 1 yard to the NE12.","(8:37) Kenneth Dixon rush to the right for 5 yards to the NE13. Tackled by Alan Branch and Patrick Chung.","(9:15) Kenneth Dixon rush to the left for 4 yards to the NE18. Tackled by Dont'a Hightower and Chris Long.","(9:55) Joe Flacco pass to the right to Nick Boyle for 7 yards to the NE22. Tackled by Devin McCourty and Dont'a Hightower.","(10:38) Joe Flacco pass to the left to Breshad Perriman for 47 yards to the NE29. Tackled by Patrick Chung.","(11:03) Penalty: Holding on Baltimore (Rick Wagner) -10 yards.","(11:49) Joe Flacco pass to the middle to Dennis Pitta for 10 yards to the Bal34. Tackled by Chris Long and Patrick Chung.","(12:14) Penalty: Illegal Motion on Baltimore (Joe Flacco) -6 yards.","(12:55) Joe Flacco pass to the right to Nick Boyle for 6 yards to the Bal30. Tackled by Patrick Chung.","(13:03) Ryan Allen punts for 46 yards to Bal24. No return.","(13:37) Tom Brady pass to the right to Dion Lewis for 5 yards to the NE30. Tackled by Zachary Orr.","(13:43) Tom Brady incomplete pass to the left intended for Julian Edelman.","(14:24) LeGarrette Blount rush to the right for 2 yards to the NE25. Tackled by Elvis Dumervil.","(14:32) Sam Koch punts for 47 yards to NE23. No return.","(14:56) Joe Flacco pass to the middle to Mike Wallace for 7 yards to the Bal30. Tackled by Jonathan Jones.","(15:00) Joe Flacco incomplete pass to the left intended for Kenneth Dixon.","(0:09) Kenneth Dixon rush to the left for a loss of 4 yards to the Bal23. Tackled by Jonathan Jones.","(0:44) Joe Flacco pass to the right to Mike Wallace for 6 yards to the Bal27. Tackled by Logan Ryan.","(1:18) Terrance West rush to the right for 1 yard to the Bal21. Tackled by Malcolm Butler and Kyle Van Noy.","(1:53) Joe Flacco pass to the left to Terrance West for 5 yards to the Bal20. Tackled by Logan Ryan.","(2:33) Kenneth Dixon rush to the right for 4 yards to the Bal15. Tackled by Logan Ryan and Kyle Van Noy.","(3:11) Kenneth Dixon rush up the middle for 9 yards to the Bal11. Tackled by Patrick Chung.","(3:22) Ryan Allen punts for 53 yards to Bal2. No return.","(3:57) Tom Brady pass to the right to Chris Hogan for 10 yards to the NE45. Tackled by Jerraud Powers.","(4:03) Tom Brady incomplete pass to the left intended for Chris Hogan.","(4:23) LeGarrette Blount rush up the middle for 4 yards to the NE45. Tackled by Zachary Orr and Eric Weddle. Penalty: Holding on New England (Joe Thuney) -10 yards.","(5:24) Tom Brady pass to the left to Julian Edelman for 16 yards to the NE41. Tackled by Shareece Wright.","(5:24) Justin Tucker kicks off to the endzone. Touchback.","(5:24) Justin Tucker extra point is good.","(5:29) Joe Flacco pass to the right to Kenneth Dixon for 8 yards for a TOUCHDOWN.","(5:32) Joe Flacco incomplete pass to the middle intended for Steve Smith Sr..","(6:12) Kenneth Dixon rush to the left for 5 yards to the NE8. Tackled by Devin McCourty.","(6:43) Joe Flacco pass to the middle to Steve Smith Sr. for 9 yards to the NE13.","(6:43) Justin Tucker kicks off to the NE1. Matthew Slater return for 19 yards to NE20. Tackled by Patrick Onwuasor. FUMBLE, recovered by Bal (Shareece Wright).","(6:50) Justin Tucker extra point is good.","(6:54) Joe Flacco pass to the middle to Darren Waller for 3 yards for a TOUCHDOWN.","(6:57) Joe Flacco incomplete pass to the left intended for Darren Waller.","(7:08) Sam Koch punts for 65 yards to NE3. Cyrus Jones - no return. FUMBLE, recovered by Bal (Chris Moore).","(7:14) Joe Flacco incomplete pass to the middle intended for Mike Wallace.","(7:57) Joe Flacco pass to the right to Nick Boyle for 2 yards to the Bal32. Tackled by Patrick Chung.","(8:10) Penalty: False Start on Baltimore (Rick Wagner) -4 yards.","(8:45) Kenneth Dixon rush to the left for 9 yards to the Bal34. Tackled by Patrick Chung and Shea McClellin.","(8:45) Stephen Gostkowski kicks off to the endzone. Touchback.","(8:45) Stephen Gostkowski extra point is good.","(8:50) Tom Brady pass to the right to Martellus Bennett for 19 yards for a TOUCHDOWN.","(9:32) Tom Brady pass to the left to Malcolm Mitchell for a loss of 1 yard to the Bal19. Tackled by Shareece Wright.","(10:14) LeGarrette Blount rush to the left for 6 yards to the Bal18. Tackled by Brandon Williams and Matt Judon.","(10:59) Tom Brady pass to the right to Chris Hogan for 28 yards to the Bal24. Tackled by Shareece Wright.","(11:35) Tom Brady pass to the middle to Julian Edelman for 6 yards to the NE48. Tackled by Jerraud Powers.","(12:19) LeGarrette Blount rush to the right for 1 yard to the NE42. Tackled by Eric Weddle.","(12:41) Tom Brady pass to the right to Julian Edelman for 6 yards to the NE41. Tackled by Lardarius Webb.","(12:51) Sam Koch punts for 56 yards to NE28. Patrick Chung return for 7 yards to NE35. Tackled by Anthony Levine Sr. and Patrick Onwuasor.","(13:31) Joe Flacco pass to the left to Kyle Juszczyk for 6 yards to the Bal16. Tackled by Cyrus Jones and Dont'a Hightower.","(14:16) Joe Flacco pass to the left to Kenneth Dixon for 2 yards to the Bal10. Tackled by Shea McClellin.","(14:53) Kenneth Dixon rush to the right for 1 yard to the Bal8. Tackled by Malcom Brown and Shea McClellin.","(15:00) Stephen Gostkowski kicks off to the Bal-3. Devin Hester return for 17 yards to Bal14. Tackled by Duron Harmon. Penalty: Holding on Baltimore (Matt Judon) -7 yards.","(0:11) Tom Brady rush up the middle for a loss of 1 yard to the NE24.","(0:11) Justin Tucker kicks off to the endzone. Touchback.","(0:16) Justin Tucker 50 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:20) Joe Flacco incomplete pass to the right intended for Kamar Aiken.","(0:20) Baltimore Ravens timeout.","(0:25) Joe Flacco pass to the right to Breshad Perriman for 2 yards to the NE32. Tackled by Devin McCourty.","(0:52) Joe Flacco pass to the right to Mike Wallace for 3 yards to the NE34. Tackled by Rob Ninkovich.","(1:00) Joe Flacco pass to the right to Kenneth Dixon for 15 yards to the NE37. Tackled by Devin McCourty.","(1:11) Ryan Allen punts for 52 yards to Bal36. Devin Hester return for 12 yards to Bal48. Tackled by Brandon King.","(1:11) Baltimore Ravens timeout.","(1:15) Tom Brady sacked at NE12 for a loss of 5 yards by Eric Weddle.","(1:20) Tom Brady incomplete pass to the left intended for Julian Edelman.","(2:00) Dion Lewis rush to the left for 8 yards to the NE17. Tackled by Matt Judon.","(2:00) Two Minute Warning.","(2:18) Penalty: Holding on New England (Shaq Mason) -8 yards.","(2:28) Sam Koch punts for 49 yards to NE17. No return.","(2:28) Penalty: False Start on Baltimore (Kenneth Dixon) -5 yards.","(2:28) Baltimore Ravens timeout.","(2:52) Joe Flacco pass to the right to Dennis Pitta for 4 yards to the Bal39.","(3:14) Joe Flacco pass to the right to Breshad Perriman for 3 yards to the Bal35. Tackled by Duron Harmon.","(3:43) Joe Flacco pass to the right to Kenneth Dixon for 1 yard to the Bal32. Tackled by Duron Harmon.","(4:07) Joe Flacco pass to the right to Mike Wallace for 16 yards to the Bal31. Tackled by Logan Ryan.","(4:11) Joe Flacco incomplete pass to the middle intended for Dennis Pitta defensed by Kyle Van Noy.","(4:36) Joe Flacco pass to the middle to Steve Smith Sr. for 5 yards to the Bal15. Tackled by Dont'a Hightower.","(4:45) Tom Brady pass intended for Chris Hogan INTERCEPTED by Eric Weddle and returned for 14 yards. Tackled by Chris Hogan.","(5:29) Tom Brady pass to the right to Chris Hogan for 2 yards to the Bal2. Tackled by Zachary Orr.","(6:03) James White rush to the right for a loss of 2 yards to the Bal4. Tackled by Terrell Suggs and Zachary Orr.","(6:34) Tom Brady pass to the middle to Chris Hogan for 10 yards to the Bal2. Tackled by C.J. Mosley.","(6:42) Tom Brady incomplete pass to the left intended for Malcolm Mitchell.","(7:23) LeGarrette Blount rush to the right for 4 yards to the Bal12. Tackled by Zachary Orr.","(8:03) Tom Brady pass to the left to Malcolm Mitchell for 34 yards to the Bal16. Tackled by Lardarius Webb.","(8:45) Tom Brady pass to the middle to Martellus Bennett for 27 yards to the NE50. Tackled by Eric Weddle.","(8:45) Joe Flacco pass intended for Mike Wallace INTERCEPTED by Devin McCourty. No return. Tackled by Mike Wallace.","(9:28) Terrance West rush to the left for 1 yard to the Bal26. Tackled by Dont'a Hightower and Kyle Van Noy.","(9:28) Stephen Gostkowski kicks off to the endzone. Touchback.","(9:28) Stephen Gostkowski extra point is good.","(9:31) Tom Brady pass to the right to Malcolm Mitchell for 6 yards for a TOUCHDOWN.","(9:36) Tom Brady incomplete pass to the right intended for Julian Edelman defensed by Terrell Suggs.","(10:12) LeGarrette Blount rush to the right for a loss of 1 yard to the Bal6. Tackled by Brandon Williams.","(10:45) LeGarrette Blount rush to the right for 9 yards to the Bal5. Tackled by Zachary Orr and Shareece Wright.","(11:24) LeGarrette Blount rush to the left for 13 yards to the Bal14. Tackled by Eric Weddle.","(11:48) Penalty: Illegal Shift on New England (Malcolm Mitchell) -5 yards.","(12:25) Tom Brady pass to the right to James White for 61 yards to the Bal22. Tackled by Lardarius Webb.","(12:31) Tom Brady incomplete pass to the right intended for Julian Edelman defensed by C.J. Mosley.","(12:55) Tom Brady pass to the left to James White for 6 yards to the NE17. Tackled by Eric Weddle.","(13:02) Sam Koch punts for 35 yards to NE11. No return.","(13:02) Penalty: False Start on Baltimore (Patrick Onwuasor) -5 yards.","(13:06) Joe Flacco incomplete pass to the right intended for Kenneth Dixon.","(13:10) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(13:43) Kenneth Dixon rush to the left for 3 yards to the NE41. Tackled by Shea McClellin and Malcom Brown.","(14:16) Joe Flacco pass to the left to Kamar Aiken for 10 yards to the NE44. Tackled by Logan Ryan.","(15:00) Joe Flacco pass to the right to Terrance West for 2 yards to the Bal46. Tackled by Patrick Chung and Rob Ninkovich.","(15:00) Penalty: False Start on Baltimore (Dennis Pitta) -5 yards.","(0:35) Joe Flacco pass to the middle to Terrance West for 6 yards to the Bal49. Tackled by Shea McClellin.","(1:04) Joe Flacco pass to the middle to Steve Smith Sr. for 18 yards to the Bal43. Tackled by Duron Harmon and Shea McClellin.","(1:04) Stephen Gostkowski kicks off to the endzone. Touchback.","(1:04) Stephen Gostkowski extra point is good.","(1:09) LeGarrette Blount rush to the right for 1 yard for a TOUCHDOWN.","(1:21) Tom Brady pass to the left to Malcolm Mitchell for 2 yards to the Bal1. Tackled by Jimmy Smith and Jerraud Powers.","(2:00) James White rush to the right for 5 yards to the Bal3. Tackled by Eric Weddle and C.J. Mosley.","(2:30) Tom Brady pass to the right to James White for 14 yards to the Bal8. Tackled by Eric Weddle and Tavon Young.","(3:05) Tom Brady pass to the right to Julian Edelman for 4 yards to the Bal22. Tackled by Tavon Young.","(3:28) LeGarrette Blount rush to the right for 6 yards to the Bal26. Tackled by Tavon Young.","(3:53) Tom Brady pass to the right to LeGarrette Blount for 7 yards to the Bal32. Tackled by Tavon Young.","(4:35) Tom Brady pass to the right to Julian Edelman for 28 yards to the Bal39. Tackled by Eric Weddle.","(5:18) LeGarrette Blount rush to the right for 4 yards to the NE33. Tackled by Lawrence Guy and Albert McClellan.","(5:51) LeGarrette Blount rush to the right for 3 yards to the NE29. Tackled by C.J. Mosley and Matt Judon.","(5:58) Justin Tucker 34 yard field goal attempt is BLOCKED by Shea McClellin.","(6:02) Joe Flacco incomplete pass to the right intended for Mike Wallace defensed by Malcolm Butler.","(6:06) Joe Flacco incomplete pass to the right intended for Darren Waller.","(6:42) Joe Flacco pass to the left to Kenneth Dixon for 5 yards to the NE16. Tackled by Cyrus Jones.","(7:11) Joe Flacco pass to the right to Kyle Juszczyk for 40 yards to the NE36. Tackled by Cyrus Jones. Penalty: Unnecessary Roughness on New England (Malcolm Butler) 15 yards.","(7:16) Joe Flacco incomplete pass to the right intended for Kenneth Dixon.","(7:49) Kenneth Dixon rush to the right for 4 yards to the Bal24. Tackled by Malcom Brown and Shea McClellin.","(8:00) Ryan Allen punts for 41 yards to Bal0. Touchback.","(8:06) Tom Brady incomplete pass to the left intended for Julian Edelman.","(8:10) Tom Brady incomplete pass to the right. Penalty: Intentional Grounding on New England (Tom Brady) -10 yards.","(8:16) Tom Brady incomplete pass to the left intended for James Develin defensed by Jimmy Smith.","(8:55) Tom Brady pass to the right to Martellus Bennett for 18 yards to the Bal31. Tackled by Lardarius Webb.","(9:00) Penalty: Holding on Baltimore (Jerraud Powers) 5 yards.","(9:27) Chris Hogan rush to the right for 1 yard to the NE46. Tackled by Zachary Orr.","(9:55) Dion Lewis rush to the left for 2 yards to the NE45. Tackled by Brandon Williams.","(10:19) Tom Brady pass to the left to Julian Edelman for 5 yards to the NE43. Tackled by Zachary Orr.","(10:42) Dion Lewis rush up the middle for 4 yards to the NE38. Tackled by Brandon Williams and C.J. Mosley.","(10:47) Sam Koch kicks off to the NE15. Julian Edelman return for 19 yards to NE34. Tackled by Shareece Wright.","(10:53) Kenneth Dixon rush to the right for a loss of 1 yard to the Bal0. Tackled by Malcom Brown and Patrick Chung. Safety.","(11:04) Ryan Allen punts for 56 yards to Bal1. No return.","(11:08) Tom Brady incomplete pass to the middle intended for Julian Edelman.","(11:15) Tom Brady incomplete pass to the left intended for Julian Edelman.","(11:15) New England Patriots timeout.","(11:52) Chris Hogan rush to the left for 6 yards to the NE43. Tackled by Albert McClellan and Jimmy Smith.","(12:02) Sam Koch punts for 37 yards to NE37. No return.","(12:24) Joe Flacco sacked at Bal26 for a loss of 10 yards by Trey Flowers.","(13:03) Joe Flacco pass to the right to Kenneth Dixon for 4 yards to the Bal36. Tackled by Malcolm Butler.","(13:08) Joe Flacco incomplete pass to the left intended for Steve Smith Sr..","(13:37) Joe Flacco pass to the middle to Terrance West for 11 yards to the Bal32. Tackled by Shea McClellin and Dont'a Hightower.","(13:40) Joe Flacco incomplete pass to the right intended for Kamar Aiken defensed by Rob Ninkovich.","(13:45) Ryan Allen punts for 46 yards to Bal21. No return.","(14:16) Tom Brady pass to the right to Martellus Bennett for 6 yards to the NE33. Tackled by Zachary Orr.","(14:22) Tom Brady incomplete pass to the right intended for Julian Edelman.","(15:00) LeGarrette Blount rush to the left for 2 yards to the NE27. Tackled by Eric Weddle and Zachary Orr.","(15:00) Justin Tucker kicks off to the endzone. Touchback."]