["(0:01) Andrew Franks 21 yard field goal attempt is GOOD. Holder: Matt Darr.","(0:01) Arizona Cardinals timeout.","(0:01) Miami Dolphins timeout.","(0:10) Damien Williams rush to the right for no gain to the Ari3. Tackled by Markus Golden.","(0:37) Damien Williams rush to the left for a loss of 2 yards to the Ari3. Tackled by Chandler Jones.","(0:43) Matt Moore pass to the left to Kenny Stills for 29 yards to the Ari1. Tackled by Justin Bethel.","(0:43) Miami Dolphins timeout.","(0:52) Matt Moore pass to the right to Kenny Stills for 12 yards to the Ari30. Tackled by Justin Bethel.","(1:29) Damien Williams rush to the right for 5 yards to the Ari42. Tackled by D.J. Swearinger.","(1:39) Drew Butler punts for 43 yards to Mia33. Jarvis Landry return for 20 yards to Ari47. Tackled by Hakeem Valles.","(1:39) Arizona Cardinals timeout.","(1:43) Carson Palmer incomplete pass to the middle intended for Larry Fitzgerald.","(1:49) Carson Palmer pass to the left to David Johnson for 5 yards to the Ari24. Tackled by Spencer Paysinger.","(1:49) Miami Dolphins timeout.","(1:55) Carson Palmer sacked at Ari19 for a loss of 6 yards. FUMBLE, recovered by Ari (Carson Palmer).","(1:55) Two Minute Warning.","(2:04) Matt Darr punts for 44 yards to Ari24. Patrick Peterson return for 1 yard to Ari25. Tackled by Neville Hewitt.","(2:04) Arizona Cardinals timeout.","(2:22) Matt Moore pass to the right to Jarvis Landry for 6 yards to the Mia32. Tackled by Patrick Peterson.","(2:58) Jay Ajayi rush to the right for 1 yard to the Mia26. Tackled by Sio Moore.","(3:01) Matt Moore incomplete pass to the right intended for DeVante Parker defensed by Brandon Williams.","(3:01) Chandler Catanzaro kicks off to the endzone. Touchback.","(3:01) Carson Palmer 2 pt conversion pass to David Johnson is GOOD.","(3:05) Carson Palmer pass to the left to J.J. Nelson for 8 yards for a TOUCHDOWN.","(3:10) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald defensed by Byron Maxwell.","(3:17) David Johnson rush to the left for 6 yards to the Mia8. Tackled by Tony Lippett.","(3:49) Kerwynn Williams rush to the left for 11 yards to the Mia14. Tackled by Bacarri Rambo.","(4:25) Carson Palmer pass to the left to David Johnson for 12 yards to the Mia25. Tackled by Tony Lippett and Spencer Paysinger.","(4:34) Carson Palmer pass to the left to Jermaine Gresham for 9 yards to the Mia37. Tackled by Tony Lippett.","(5:14) David Johnson rush to the right for 4 yards to the Mia46. Tackled by Andre Branch and Ndamukong Suh.","(5:24) Matt Darr punts for 39 yards to Mia50. No return.","(5:32) Matt Moore incomplete pass to the right intended for Damien Williams.","(6:16) Jay Ajayi rush to the left for a loss of 2 yards to the Mia11. Tackled by Chandler Jones.","(6:57) Jay Ajayi rush to the right for 3 yards to the Mia13. Tackled by Sio Moore.","(7:05) Chandler Catanzaro kicks off to the Mia-2. Kenyan Drake return for 22 yards to Mia20. Tackled by Justin Bethel. Penalty: Holding on Miami (Michael Thomas) -10 yards.","(7:05) Chandler Catanzaro extra point is BLOCKED. Return of blocked extra point by Walt Aikens for 2 pts.","(7:11) Carson Palmer pass to the left to Brittan Golden for 9 yards for a TOUCHDOWN.","(7:15) Carson Palmer incomplete pass to the middle intended for Darren Fells.","(7:23) Carson Palmer incomplete pass to the right intended for Darren Fells defensed by Jordan Phillips.","(8:00) Carson Palmer pass to the right to Jermaine Gresham for 14 yards to the Mia9. Tackled by Spencer Paysinger.","(8:07) Penalty: Pass Interference on Miami (Byron Maxwell) 16 yards.","(8:49) David Johnson rush to the left for 2 yards to the Mia39. Tackled by Andre Branch and Mike Hull.","(9:03) Penalty: Illegal Contact on Miami (Mike Hull) 5 yards.","(9:27) Penalty: Offside on Miami (Andre Branch) 5 yards.","(10:01) Carson Palmer pass to the left to Larry Fitzgerald for 3 yards to the Ari49. Tackled by Neville Hewitt.","(10:42) Carson Palmer pass to the right to Jermaine Gresham for 5 yards to the Ari46. Tackled by Byron Maxwell and Terrence Fede.","(11:11) Kerwynn Williams rush to the left for 3 yards to the Ari41. Tackled by Jason Jones.","(11:47) Carson Palmer pass to the middle to Jermaine Gresham for 8 yards to the Ari38. Tackled by Mike Hull.","(12:26) Carson Palmer pass to the left to Larry Fitzgerald for 8 yards to the Ari30. Tackled by Spencer Paysinger.","(13:10) Carson Palmer rush up the middle for 6 yards to the Ari22. Tackled by Mike Hull.","(13:48) Carson Palmer pass to the right to Michael Floyd for 15 yards to the Ari16. Tackled by Byron Maxwell.","(13:56) Matt Darr punts for 40 yards to Ari1. No return.","(14:34) Penalty: False Start on Miami (Anthony Steen) -5 yards.","(15:00) Jay Ajayi rush up the middle for 3 yards to the Ari36. Tackled by Tony Jefferson.","(0:32) Jay Ajayi rush up the middle for 1 yard to the Ari39. Tackled by Xavier Williams.","(1:09) Jay Ajayi rush to the left for 5 yards to the Ari40. Tackled by Tony Jefferson and Xavier Williams.","(1:46) Ryan Tannehill pass to the right to DeVante Parker for 11 yards to the Ari45. Tackled by Brandon Williams.","(1:55) Drew Butler punts for 31 yards to Mia39. Jarvis Landry return for 5 yards to Mia44. Tackled by Kareem Martin.","(2:00) Carson Palmer incomplete pass to the right intended for Jermaine Gresham.","(2:05) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald.","(2:34) Penalty: Holding on Arizona (Ulrick John) -10 yards.","(3:04) David Johnson rush to the right for 2 yards to the Mia45. Tackled by Terrence Fede and Mike Hull. Penalty: Taunting on Arizona (Jermaine Gresham) -15 yards.","(3:42) Drew Butler punts for 53 yards to Mia37. Jarvis Landry return for 10 yards to Mia47. FUMBLE, recovered by Ari (Alex Okafor). Tackled by Jarvis Landry.","(3:55) David Johnson rush up the middle for 6 yards to the Ari10. Tackled by Ndamukong Suh.","(3:59) Carson Palmer incomplete pass to the left intended for David Johnson defensed by Andre Branch.","(3:59) Penalty: Delay of Game on Arizona (Carson Palmer) -4 yards.","(4:47) Carson Palmer sacked at Ari8 for a loss of 5 yards by Andre Branch. FUMBLE, recovered by Ari (John Wetzel).","(4:54) Penalty: Holding on Miami (Spencer Paysinger) 5 yards.","(5:05) Matt Darr punts for 51 yards to Ari8. No return.","(5:49) Ryan Tannehill pass to the left to Dion Sims for 2 yards to the Mia41. Tackled by Tony Jefferson.","(6:29) Jay Ajayi rush to the right for 4 yards to the Mia39. Tackled by Sio Moore.","(7:08) Jay Ajayi rush to the right for 2 yards to the Mia35. Tackled by Calais Campbell.","(7:50) Ryan Tannehill pass to the right to Kenny Stills for 14 yards to the Mia33. Tackled by Tony Jefferson.","(8:30) Ryan Tannehill pass to the left to DeVante Parker for 3 yards to the Mia19. Tackled by Justin Bethel.","(9:13) Ryan Tannehill rush up the middle for no gain to the Mia16. FUMBLE, recovered by Mia (Ryan Tannehill).","(9:22) Drew Butler punts for 47 yards to Mia16. No return.","(9:54) Carson Palmer pass to the middle to David Johnson for 4 yards to the Ari37. Tackled by Jason Jones.","(10:33) David Johnson rush to the left for a loss of 3 yards to the Ari33. Tackled by Ndamukong Suh and Bobby McCain.","(11:11) David Johnson rush to the left for 7 yards to the Ari36. Tackled by Andre Branch.","(11:17) Andrew Franks kicks off to the Ari6. Brittan Golden return for 23 yards to Ari29. Tackled by Kenyan Drake.","(11:17) Andrew Franks extra point is good.","(11:59) Ryan Tannehill pass to the right to Damien Williams for 3 yards for a TOUCHDOWN. Penalty: Taunting on Miami (Jarvis Landry) -15 yards.","(11:59) Ryan Tannehill pass to the left to Kenny Stills for 7 yards to the Ari3. Tackled by Marcus Cooper.","(12:36) Ryan Tannehill pass to the left to Kenyan Drake for 3 yards to the Ari10. Tackled by Josh Mauro.","(12:40) Penalty: Holding on Miami (Anthony Steen) -10 yards.","(13:41) Ryan Tannehill pass to the right to Jarvis Landry for 71 yards to the Ari3. Tackled by D.J. Swearinger.","(14:20) Ryan Tannehill rush to the right for 1 yard to the Mia26. Tackled by D.J. Swearinger.","(14:51) Jay Ajayi rush up the middle for 2 yards to the Mia25. Tackled by Deone Bucannon.","(15:00) Chandler Catanzaro kicks off to the Mia1. Kenyan Drake return for 22 yards to Mia23. Tackled by Brandon Williams and Kerwynn Williams.","(0:09) Carson Palmer rush up the middle for a loss of 1 yard to the Ari9.","(0:19) Matt Darr punts for 51 yards to Ari20. Patrick Peterson - no return. Tackled by Walt Aikens. Penalty: Holding on Arizona (Marcus Cooper) -10 yards.","(0:19) Arizona Cardinals timeout.","(0:26) Ryan Tannehill pass to the right to Damien Williams for a loss of 2 yards to the Mia29. Tackled by Deone Bucannon.","(0:36) Ryan Tannehill rush to the right for 12 yards to the Mia31. Tackled by Deone Bucannon.","(1:10) Damien Williams rush to the left for a loss of 1 yard to the Mia19. Tackled by Markus Golden.","(1:18) Damien Williams rush to the left for 5 yards to the Mia30. Tackled by D.J. Swearinger. Penalty: Holding on Miami (Ja'Wuan James) -10 yards.","(1:18) Chandler Catanzaro kicks off to the endzone. Touchback.","(1:23) Chandler Catanzaro 56 yard field goal attempt is GOOD. Holder: Drew Butler.","(1:23) Miami Dolphins timeout.","(1:28) Carson Palmer incomplete pass to the left intended for David Johnson.","(1:34) Carson Palmer incomplete pass to the right intended for Michael Floyd.","(1:39) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(1:49) Matt Darr punts for 42 yards to Mia49. Patrick Peterson return for 11 yards to Mia38. Tackled by Michael Thomas.","(1:49) Arizona Cardinals timeout.","(1:55) Jay Ajayi rush to the right for no gain to the Mia7. Tackled by Calais Campbell.","(2:00) Penalty: Holding on Miami (Laremy Tunsil) -7 yards.","(2:00) Two Minute Warning.","(2:36) Ryan Tannehill sacked at Mia24 for a loss of 11 yards. FUMBLE, recovered by Mia.","(3:02) Jay Ajayi rush to the left for 4 yards to the Mia35. Tackled by Deone Bucannon.","(3:08) 41 yard field goal attempt by Chandler Catanzaro is NO GOOD. Holder: Drew Butler.","(3:52) Carson Palmer sacked at Mia23 for a loss of 9 yards by Cameron Wake.","(4:34) David Johnson rush to the left for 8 yards to the Mia14. Tackled by Jason Jones and Bobby McCain.","(4:41) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(5:24) David Johnson rush to the left for 19 yards to the Mia22. Tackled by Spencer Paysinger.","(6:16) David Johnson rush up the middle for no gain to the Mia41. Tackled by Ndamukong Suh.","(6:53) David Johnson rush to the left for 9 yards to the Mia41. Tackled by Bacarri Rambo.","(7:42) Carson Palmer pass to the right to Jermaine Gresham for 9 yards to the Ari50. Tackled by Bobby McCain and Mike Hull.","(8:26) David Johnson rush up the middle for 1 yard to the Ari41. Tackled by Earl Mitchell.","(8:58) Kerwynn Williams rush to the left for 20 yards to the Ari40. Tackled by Spencer Paysinger.","(9:07) Matt Darr punts for 43 yards to Ari0. Touchback.","(9:11) Ryan Tannehill incomplete pass to the middle intended for Jarvis Landry defensed by Tyvon Branch.","(9:20) Ryan Tannehill incomplete pass to the right intended for Jay Ajayi.","(10:00) Jay Ajayi rush up the middle for a loss of 4 yards to the Ari43. Tackled by Calais Campbell. FUMBLE, recovered by Mia (Jay Ajayi).","(10:03) Carson Palmer rush up the middle for no gain to the Ari41. FUMBLE, recovered by Mia (Terrence Fede). Tackled by Jermaine Gresham.","(10:22) Penalty: Illegal Contact on Miami (Tony Lippett) 5 yards.","(10:51) David Johnson rush to the right for 3 yards to the Ari36. Tackled by Mike Hull and Donald Butler.","(11:16) Penalty: Offside on Miami (Ndamukong Suh) 5 yards.","(11:41) Carson Palmer pass to the left to Michael Floyd for 3 yards to the Ari28.","(11:41) Andrew Franks kicks off to the endzone. Touchback.","(11:41) Andrew Franks extra point is good.","(11:47) Ryan Tannehill pass to the right to Dion Sims for 7 yards for a TOUCHDOWN.","(12:28) Jay Ajayi rush to the left for a loss of 1 yard to the Ari7. Tackled by Josh Mauro.","(13:06) Ryan Tannehill rush to the right for 7 yards to the Ari6. Tackled by Markus Golden.","(13:39) Ryan Tannehill pass to the left to Jarvis Landry for 12 yards to the Ari13. Tackled by D.J. Swearinger.","(14:18) Jay Ajayi rush to the left for 13 yards to the Ari25. Tackled by Tony Jefferson.","(14:36) Penalty: Holding on Arizona (Marcus Cooper) 5 yards.","(14:50) Drew Butler punts for 62 yards to Mia35. Jarvis Landry return for 17 yards to Ari48. Tackled by Kerwynn Williams. Penalty: Illegal Motion on Arizona (Brittan Golden) 5 yards.","(14:55) Carson Palmer incomplete pass to the left intended for David Johnson defensed by Jason Jones.","(14:55) Arizona Cardinals timeout.","(15:00) Carson Palmer incomplete pass to the left intended for Jermaine Gresham.","(0:22) David Johnson rush to the right for 2 yards to the Ari3. Tackled by Andre Branch and Neville Hewitt.","(0:43) Ryan Tannehill rush up the middle for no gain to the Ari2. FUMBLE, recovered by Ari (Rodney Gunter). Tackled by Jay Ajayi.","(1:17) Kenyan Drake rush to the right for 8 yards to the Ari2. Tackled by Deone Bucannon and Tony Jefferson.","(1:27) Carson Palmer pass intended for Larry Fitzgerald INTERCEPTED by Bacarri Rambo and returned for 17 yards. Tackled by John Brown.","(2:12) David Johnson rush to the left for no gain to the Ari16. Tackled by Michael Thomas.","(2:49) David Johnson rush to the left for 6 yards to the Ari16. Tackled by Mike Hull and Earl Mitchell.","(2:58) Matt Darr punts for 36 yards to Ari10. No return.","(3:09) Ryan Tannehill incomplete pass to the right intended for Jay Ajayi.","(3:55) Ryan Tannehill pass to the right to Kenny Stills for 7 yards to the Ari46. Tackled by Tony Jefferson.","(4:41) Jay Ajayi rush to the left for a loss of 1 yard to the Mia47. Tackled by Markus Golden.","(4:59) Penalty: False Start on Miami (Dion Sims) -5 yards.","(5:37) Jay Ajayi rush up the middle for 7 yards to the Ari47. Tackled by Josh Mauro.","(6:15) Jay Ajayi rush to the right for 9 yards to the Mia46. Tackled by Markus Golden and Tony Jefferson.","(6:21) David Johnson rush to the right for a loss of 2 yards to the Mia35. Tackled by Cameron Wake. FUMBLE, recovered by Mia (Spencer Paysinger). Tackled by Jermaine Gresham.","(6:32) Ryan Tannehill pass intended for Kenny Stills INTERCEPTED by Marcus Cooper. No return. Tackled by Kenny Stills. Penalty: Unnecessary Roughness on Miami (Kenny Stills) 15 yards.","(6:37) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry defensed by Patrick Peterson.","(7:22) Jay Ajayi rush to the right for a loss of 3 yards to the Mia37. Tackled by Tony Jefferson.","(8:00) Ryan Tannehill pass to the middle to Jay Ajayi for 15 yards to the Mia40. Tackled by D.J. Swearinger.","(8:00) Chandler Catanzaro kicks off to the endzone. Touchback.","(8:00) Chandler Catanzaro extra point is NO GOOD.","(8:12) J.J. Nelson rush to the right for 56 yards for a TOUCHDOWN.","(9:02) Carson Palmer pass to the right to David Johnson for 14 yards to the Ari44. Tackled by Byron Maxwell.","(9:27) David Johnson rush to the right for 5 yards to the Ari30. Tackled by Neville Hewitt and Terrence Fede.","(9:27) Andrew Franks kicks off to the endzone. Touchback.","(9:27) Andrew Franks extra point is good.","(9:33) Ryan Tannehill pass to the left to Kenny Stills for 28 yards for a TOUCHDOWN.","(10:16) Jay Ajayi rush to the right for a loss of 1 yard to the Ari28. Tackled by Tony Jefferson.","(10:46) Jay Ajayi rush to the right for 6 yards to the Ari27. Tackled by Josh Mauro.","(11:03) Penalty: Encroachment on Arizona (Calais Campbell) 5 yards.","(11:36) Ryan Tannehill pass to the right to Jarvis Landry for 14 yards to the Ari38. Tackled by Tyvon Branch.","(11:47) Carson Palmer pass intended for Larry Fitzgerald INTERCEPTED by Mike Hull defensed by Bobby McCain and returned for 8 yards. Tackled by David Johnson.","(12:30) Carson Palmer pass to the left to Larry Fitzgerald for 1 yard to the Ari49. Tackled by Spencer Paysinger and Jason Jones.","(13:10) David Johnson rush to the left for 3 yards to the Ari48. Tackled by Michael Thomas and Mike Hull.","(13:51) Carson Palmer pass to the middle to Darren Fells for 12 yards to the Ari45. Tackled by Spencer Paysinger and Bacarri Rambo.","(14:27) Carson Palmer pass to the right to David Johnson for 6 yards to the Ari33. Tackled by Isa Abdul-Quddus.","(15:00) David Johnson rush to the left for 2 yards to the Ari27. Tackled by Andre Branch.","(15:00) Andrew Franks kicks off to the endzone. Touchback."]