["(0:44) Ben Roethlisberger rush up the middle for a loss of 1 yard to the Buf41.","(0:44) Buffalo Bills timeout.","(0:45) Ben Roethlisberger rush up the middle for no gain to the Buf40.","(1:25) Ben Roethlisberger rush up the middle for a loss of 1 yard to the Buf40.","(1:25) Dan Carpenter onside kickoff to the Buf39. No return.","(1:25) Dan Carpenter extra point is good.","(1:28) LeSean McCoy rush up the middle for 3 yards for a TOUCHDOWN.","(1:50) Tyrod Taylor pass to the middle to LeSean McCoy for 13 yards to the Pit3. Tackled by Sean Davis.","(2:00) Tyrod Taylor pass to the right to LeSean McCoy for a loss of 1 yard to the Pit16. Tackled by Bud Dupree.","(2:00) Two Minute Warning.","(2:21) Tyrod Taylor pass to the middle to Nick O'Leary for 12 yards to the Pit15. Tackled by Robert Golden.","(2:57) Tyrod Taylor rush to the left for 1 yard to the Pit27. Tackled by Ryan Shazier.","(3:24) Tyrod Taylor pass to the right to Robert Woods for 29 yards to the Pit28. Tackled by Robert Golden.","(3:31) Tyrod Taylor pass to the right to Sammy Watkins for 18 yards to the Buf43.","(3:38) Tyrod Taylor incomplete pass to the right intended for Sammy Watkins.","(3:38) Chris Boswell kicks off to the endzone. Touchback.","(3:43) Chris Boswell 39 yard field goal attempt is GOOD. Holder: Jordan Berry.","(3:43) Buffalo Bills timeout.","(3:47) Le'Veon Bell rush to the right for no gain to the Buf21. Tackled by Marcell Dareus.","(3:47) Buffalo Bills timeout.","(3:53) Le'Veon Bell rush to the right for no gain to the Buf21. Tackled by Lorenzo Alexander.","(4:34) Le'Veon Bell rush up the middle for 2 yards to the Buf21. Tackled by Corey Graham and Preston Brown.","(4:44) Ben Roethlisberger pass to the right to Le'Veon Bell for 14 yards to the Buf23. Tackled by James Ihedigbo.","(4:44) Pittsburgh Steelers timeout.","(5:23) Le'Veon Bell rush up the middle for 5 yards to the Buf37. Tackled by Leger Douzable and Lorenzo Alexander.","(6:04) Le'Veon Bell rush to the left for 4 yards to the Buf42. Tackled by Zach Brown.","(6:49) Ben Roethlisberger pass to the right to Antonio Brown for 29 yards to the Buf46.","(7:27) Le'Veon Bell rush to the left for no gain to the Pit25. Tackled by Corey Graham.","(7:27) Dan Carpenter kicks off to the endzone. Touchback.","(7:27) Dan Carpenter extra point is NO GOOD.","(7:39) Tyrod Taylor pass to the left to Charles Clay for 40 yards for a TOUCHDOWN.","(7:47) Tyrod Taylor incomplete pass to the right intended for Robert Woods.","(8:29) Tyrod Taylor pass to the right to LeSean McCoy for 41 yards to the Pit40. Tackled by Sean Davis.","(9:16) Tyrod Taylor sacked at Buf19 for a loss of 4 yards by Bud Dupree.","(9:51) Tyrod Taylor pass to the right to Charles Clay for 5 yards to the Buf23. Tackled by William Gay.","(9:57) Chris Boswell kicks off to the Buf-1. Brandon Tate return for 19 yards to Buf18. Tackled by Anthony Chickillo and Jordan Dangerfield.","(10:02) Chris Boswell 37 yard field goal attempt is GOOD. Holder: Jordan Berry.","(10:43) Le'Veon Bell rush to the right for 1 yard to the Buf19. Tackled by Jerel Worthy.","(11:28) Le'Veon Bell rush up the middle for 3 yards to the Buf20. Tackled by Marcell Dareus and Jerry Hughes.","(12:09) Le'Veon Bell rush to the left for 5 yards to the Buf23. Tackled by Marcell Dareus.","(12:53) Le'Veon Bell rush to the right for 14 yards to the Buf28. Tackled by Ronald Darby.","(13:31) Le'Veon Bell rush to the left for 6 yards to the Buf42. Tackled by Preston Brown and Jerry Hughes.","(13:43) Tyrod Taylor pass intended for Marquise Goodwin INTERCEPTED by Artie Burns and returned for 4 yards. Tackled by Justin Hunter. Penalty: Holding on Pittsburgh (Sean Davis) -10 yards.","(13:48) Ben Roethlisberger pass intended for Jesse James INTERCEPTED by Zach Brown. No return. Touchback.","(14:09) Le'Veon Bell rush up the middle for 1 yard to the Buf7. Tackled by Shaq Lawson and Adolphus Washington.","(14:55) Le'Veon Bell rush to the right for 4 yards to the Buf8. Tackled by Lorenzo Alexander.","(14:55) Penalty: Offside on Buffalo (Adolphus Washington) 5 yards.","(15:00) Ben Roethlisberger incomplete pass to the middle intended for Ladarius Green defensed by Corey White.","(0:38) Le'Veon Bell rush to the left for a loss of 1 yard to the Buf17. Tackled by James Ihedigbo.","(1:23) Fitzgerald Toussaint rush to the left for 6 yards to the Buf16. Tackled by Preston Brown.","(2:10) Le'Veon Bell rush up the middle for 33 yards to the Buf22. Tackled by James Ihedigbo.","(2:42) Penalty: Holding on Pittsburgh (B.J. Finney) -10 yards.","(3:23) Le'Veon Bell rush to the right for 10 yards to the Buf45. Tackled by Zach Brown.","(3:58) Penalty: Offside on Buffalo (Jerel Worthy) 5 yards.","(4:11) Colton Schmidt punts for 46 yards to Pit23. Antonio Brown return for 17 yards to Pit40. Tackled by Colton Schmidt.","(4:17) Tyrod Taylor incomplete pass to the right intended for Charles Clay defensed by Ross Cockrell.","(5:00) Tyrod Taylor pass to the left to LeSean McCoy for 11 yards to the Buf31. Tackled by James Harrison and Lawrence Timmons.","(5:04) Tyrod Taylor incomplete pass to the left intended for LeSean McCoy.","(5:28) Penalty: Illegal Shift on Buffalo (Sammy Watkins) -5 yards.","(5:28) Chris Boswell kicks off to the endzone. Touchback.","(5:28) Chris Boswell extra point is good.","(5:35) Le'Veon Bell rush to the left for 5 yards for a TOUCHDOWN.","(6:19) Le'Veon Bell rush up the middle for 8 yards to the Buf5. Tackled by Corey Graham and Ronald Darby.","(7:05) Ben Roethlisberger pass to the right to Cobi Hamilton for 15 yards to the Buf13. Tackled by Corey White.","(7:48) Le'Veon Bell rush to the right for 2 yards to the Buf28. Tackled by Jerry Hughes and Deandre Coleman.","(8:33) Le'Veon Bell rush to the right for 5 yards to the Buf30. Tackled by Ronald Darby and James Ihedigbo.","(9:12) Le'Veon Bell rush to the left for 24 yards to the Buf35. Tackled by Ronald Darby.","(9:12) Penalty: False Start on Pittsburgh (B.J. Finney) -5 yards.","(9:12) Pittsburgh Steelers timeout.","(9:52) Le'Veon Bell rush to the left for 3 yards to the Pit46. Tackled by Shaq Lawson and Deandre Coleman.","(10:34) Le'Veon Bell rush to the left for 7 yards to the Pit43. Tackled by Preston Brown.","(11:16) Le'Veon Bell rush up the middle for 5 yards to the Pit36. Tackled by Preston Brown and Brandon Spikes.","(12:01) Le'Veon Bell rush to the left for 13 yards to the Pit31. Tackled by Corey Graham and Ronald Darby.","(12:14) Colton Schmidt punts for 52 yards to Pit18. Antonio Brown - no return. Tackled by James Ihedigbo.","(12:20) Tyrod Taylor incomplete pass to the left intended for Charles Clay defensed by Stephon Tuitt.","(13:02) Tyrod Taylor rush to the left for 1 yard to the Buf30. Tackled by Artie Burns.","(13:39) LeSean McCoy rush up the middle for a loss of 1 yard to the Buf29. Tackled by Stephon Tuitt.","(14:15) Tyrod Taylor pass to the right to Sammy Watkins for 14 yards to the Buf30. Tackled by Sean Davis and Ross Cockrell.","(14:20) Tyrod Taylor incomplete pass to the right intended for Charles Clay defensed by Ryan Shazier.","(14:55) Tyrod Taylor rush to the right for no gain to the Buf16. Tackled by Bud Dupree.","(15:00) Chris Boswell kicks off to the Buf0. Brandon Tate return for 16 yards to Buf16. Tackled by Roosevelt Nix.","(0:04) Mike Gillislee rush to the right for 12 yards to the Buf38. Tackled by Mike Mitchell.","(0:11) Mike Gillislee rush to the left for 22 yards to the Buf26. Tackled by Artie Burns.","(0:11) Penalty: False Start on Buffalo (Charles Clay) -4 yards.","(0:11) Pittsburgh Steelers timeout.","(0:23) LeSean McCoy rush to the right for no gain to the Buf8. Tackled by Ross Cockrell and Ricardo Mathews.","(0:32) Penalty: Holding on Buffalo (John Miller) -7 yards.","(0:45) Jordan Berry punts for 45 yards to Buf15. Brandon Tate - no return. Tackled by Tyler Matakevich and Jordan Dangerfield.","(0:54) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown defensed by Corey Graham.","(1:30) Le'Veon Bell rush to the right for 2 yards to the Pit40. Tackled by Ronald Darby and Jerry Hughes.","(2:00) Ben Roethlisberger pass to the right to Eli Rogers for 6 yards to the Pit38. Tackled by Nickell Robey-Coleman.","(2:00) Two Minute Warning.","(2:24) Le'Veon Bell rush to the left for 12 yards to the Pit32. Tackled by Marcell Dareus.","(2:33) Colton Schmidt punts for 55 yards to Pit0. Touchback.","(2:38) Tyrod Taylor incomplete pass to the middle intended for Robert Woods.","(3:21) LeSean McCoy rush up the middle for no gain to the Buf45. Tackled by Ryan Shazier.","(3:47) Tyrod Taylor pass to the middle to Charles Clay for 7 yards to the Buf45. Tackled by Ryan Shazier and William Gay.","(4:12) Tyrod Taylor pass to the right to Sammy Watkins for 14 yards to the Buf38. Tackled by Ross Cockrell.","(4:36) LeSean McCoy rush to the right for 4 yards to the Buf24. Tackled by Sean Davis.","(4:42) Jordan Berry punts for 56 yards to Buf0. Touchback.","(4:50) Ben Roethlisberger incomplete pass to the middle intended for Antonio Brown.","(4:50) Penalty: False Start on Pittsburgh (Marcus Gilbert) -5 yards.","(4:55) Ben Roethlisberger incomplete pass to the middle intended for Le'Veon Bell defensed by Lorenzo Alexander.","(5:03) Ben Roethlisberger incomplete pass to the right intended for Ladarius Green.","(5:43) Le'Veon Bell rush to the right for 11 yards to the Pit49. Tackled by Preston Brown and Ronald Darby.","(6:22) Le'Veon Bell rush to the left for 7 yards to the Pit38. Tackled by Corey White.","(7:00) Ben Roethlisberger pass to the left to Le'Veon Bell for 6 yards to the Pit31. Tackled by Stephon Gilmore.","(7:07) Dan Carpenter kicks off to the Pit-1. Fitzgerald Toussaint return for 26 yards to Pit25. Tackled by Nickell Robey-Coleman and Lorenzo Alexander.","(7:07) Dan Carpenter extra point is good.","(7:11) Tyrod Taylor pass to the middle to Sammy Watkins for 8 yards for a TOUCHDOWN.","(7:53) Tyrod Taylor pass to the left to LeSean McCoy for 8 yards to the Pit8. Tackled by Ryan Shazier and L.T. Walton.","(8:00) Penalty: Holding on Buffalo (John Miller) -10 yards.","(8:34) LeSean McCoy rush to the right for 1 yard to the Pit6. Tackled by Ryan Shazier.","(8:45) Ben Roethlisberger pass intended for Antonio Brown INTERCEPTED by Stephon Gilmore and returned for 31 yards. Tackled by Antonio Brown.","(9:30) Le'Veon Bell rush up the middle for no gain to the Pit25. Tackled by Adolphus Washington and Marcell Dareus.","(9:38) Colton Schmidt punts for 32 yards to Pit25. No return.","(9:42) Tyrod Taylor incomplete pass to the left intended for Sammy Watkins.","(10:23) Tyrod Taylor sacked at Buf43 for a loss of 2 yards by Ryan Shazier.","(10:55) Tyrod Taylor pass to the right to LeSean McCoy for 9 yards to the Buf45. Tackled by Sean Davis.","(11:24) LeSean McCoy rush to the right for 2 yards to the Buf36. Tackled by Ryan Shazier and William Gay.","(12:00) LeSean McCoy rush to the right for 9 yards to the Buf34. Tackled by William Gay and Ross Cockrell.","(12:00) Chris Boswell kicks off to the endzone. Touchback.","(12:00) Chris Boswell extra point is good.","(12:05) Le'Veon Bell rush to the left for 7 yards for a TOUCHDOWN.","(12:45) Ben Roethlisberger pass to the right to Antonio Brown for 9 yards to the Buf7. Tackled by Corey Graham.","(13:32) Ben Roethlisberger pass to the right to Eli Rogers for 9 yards to the Buf16. Tackled by Ronald Darby.","(13:36) Ben Roethlisberger incomplete pass to the right intended for Jesse James.","(14:19) Ben Roethlisberger pass to the right to David Johnson for 15 yards to the Buf25. Tackled by Preston Brown.","(15:00) Le'Veon Bell rush up the middle for no gain to the Buf40. Tackled by Marcell Dareus and James Ihedigbo.","(0:28) Ben Roethlisberger pass to the left to Eli Rogers for 5 yards to the Buf40. Tackled by Nickell Robey-Coleman and Corey Graham.","(1:07) Le'Veon Bell rush to the right for 4 yards to the Buf45. Tackled by Preston Brown and Marcell Dareus.","(1:44) Le'Veon Bell rush up the middle for 5 yards to the Buf49. Tackled by Preston Brown.","(2:14) Ben Roethlisberger pass to the left to Ladarius Green for 7 yards to the Pit46. Tackled by Zach Brown.","(2:25) Colton Schmidt punts for 41 yards to Pit49. Antonio Brown - no return. Tackled by Jonathan Meeks. Penalty: Holding on Pittsburgh (Sammie Coates) -10 yards.","(3:00) LeSean McCoy rush up the middle for 7 yards to the Buf10. Tackled by Bud Dupree.","(3:43) Tyrod Taylor sacked at Buf3 for a loss of 6 yards by Sean Davis.","(4:17) LeSean McCoy rush up the middle for a loss of 1 yard to the Buf9. Tackled by L.T. Walton.","(4:29) Reggie Bush rush to the left for 4 yards to the Buf20. Tackled by Mike Mitchell. Penalty: Holding on Buffalo (Marquise Goodwin) -10 yards.","(4:39) Penalty: Holding on Pittsburgh (Artie Burns) 5 yards.","(5:22) Tyrod Taylor sacked at Buf11 for a loss of 4 yards by Bud Dupree.","(5:54) LeSean McCoy rush to the right for 1 yard to the Buf15. Tackled by William Gay and Ryan Shazier.","(6:00) Chris Boswell kicks off to the Buf1. Brandon Tate return for 13 yards to Buf14. Tackled by Roosevelt Nix.","(6:00) Chris Boswell extra point is good.","(6:05) Le'Veon Bell rush to the left for 3 yards for a TOUCHDOWN.","(6:10) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(6:54) Le'Veon Bell rush to the left for 8 yards to the Buf3. Tackled by Lorenzo Alexander and Corey Graham.","(7:39) Ben Roethlisberger pass to the right to Ladarius Green for 18 yards to the Buf11. Tackled by Zach Brown and Corey White.","(7:46) Ben Roethlisberger incomplete pass to the middle intended for Antonio Brown defensed by Ronald Darby.","(7:49) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown.","(8:26) Ben Roethlisberger pass to the right to Antonio Brown for 40 yards to the Buf29. Tackled by Ronald Darby.","(9:06) Le'Veon Bell rush to the left for 2 yards to the Pit31. Tackled by Zach Brown and Corey Graham.","(9:17) Colton Schmidt punts for 44 yards to Pit18. Antonio Brown return for 11 yards to Pit29.","(9:23) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(9:58) LeSean McCoy rush to the left for 2 yards to the Buf38. Tackled by Artie Burns.","(10:34) Tyrod Taylor sacked at Buf36 for a loss of 4 yards by Stephon Tuitt and Sean Davis.","(10:44) Ben Roethlisberger pass intended for Ladarius Green INTERCEPTED by Lorenzo Alexander and returned for 28 yards. Tackled by Maurkice Pouncey.","(11:30) Ben Roethlisberger pass to the left to Jesse James for 5 yards to the Buf15. Tackled by Lorenzo Alexander and Preston Brown.","(12:16) Le'Veon Bell rush to the right for 16 yards to the Buf20. Tackled by Jerry Hughes and Preston Brown.","(12:16) Pittsburgh Steelers timeout.","(12:59) Ben Roethlisberger pass to the left to Antonio Brown for a loss of 2 yards to the Buf36. Tackled by Nickell Robey-Coleman.","(13:41) Ben Roethlisberger pass to the right to Le'Veon Bell for 32 yards to the Buf34. Tackled by Zach Brown.","(13:47) Ben Roethlisberger incomplete pass to the left intended for Ladarius Green.","(13:53) Ben Roethlisberger incomplete pass to the left intended for Cobi Hamilton.","(14:23) Ben Roethlisberger pass to the right to Le'Veon Bell for 10 yards to the Pit34. Tackled by Leger Douzable.","(14:53) Ben Roethlisberger pass to the right to Antonio Brown for 2 yards to the Pit24. Tackled by Ronald Darby.","(15:00) Dan Carpenter kicks off to the Pit1. Fitzgerald Toussaint return for 21 yards to Pit22. Tackled by Kevon Seymour and Lorenzo Alexander."]