["(0:12) Kirk Cousins rush up the middle for a loss of 1 yard to the Was33.","(0:21) Carson Wentz sacked at Was27 for a loss of 13 yards by Ryan Kerrigan. FUMBLE, recovered by Was (Trent Murphy) and returned for 7 yards. Tackled by Ryan Mathews.","(0:26) Carson Wentz incomplete pass to the right intended for Nelson Agholor.","(0:26) Philadelphia Eagles timeout.","(0:35) Carson Wentz pass to the left to Zach Ertz for 13 yards to the Was14. Tackled by Duke Ihenacho.","(0:35) Washington Redskins timeout.","(0:39) Carson Wentz incomplete pass to the left intended for Ryan Mathews.","(0:42) Carson Wentz incomplete pass to the left intended for Nelson Agholor.","(0:47) Carson Wentz pass to the left to Jordan Matthews for 12 yards to the Was27. Tackled by Greg Toler.","(0:53) Carson Wentz incomplete pass to the left intended for Zach Ertz.","(1:13) Carson Wentz pass to the right to Trey Burton for 16 yards to the Was39. Tackled by Bashaud Breeland.","(1:30) Carson Wentz pass to the left to Jordan Matthews for 16 yards to the Phi45. Tackled by Quinton Dunbar.","(1:53) Carson Wentz pass to the left to Jordan Matthews for 4 yards to the Phi29. Tackled by Quinton Dunbar.","(1:53) Dustin Hopkins kicks off to the endzone. Touchback.","(1:53) Kirk Cousins 2 pt conversion pass is NO GOOD - intended for Jordan Reed.","(2:00) Chris Thompson rush to the left for 25 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:16) Rob Kelley rush up the middle for 4 yards to the Phi25. Tackled by Rodney McLeod and Destiny Vaeao.","(2:59) Kirk Cousins pass to the right to Pierre Garcon for 6 yards to the Phi29. Tackled by Leodis McKelvin.","(2:59) Washington Redskins timeout.","(3:02) Kirk Cousins incomplete pass to the right intended for Chris Thompson.","(3:02) Washington Redskins timeout.","(3:44) Rob Kelley rush up the middle for 3 yards to the Phi35. Tackled by Bennie Logan.","(4:23) Kirk Cousins rush to the right for 6 yards to the Phi38. Tackled by Fletcher Cox.","(4:49) Kirk Cousins pass to the left to Jamison Crowder for 33 yards to the Phi44. Tackled by Jalen Mills.","(4:52) Kirk Cousins incomplete pass to the right intended for Pierre Garcon defensed by Leodis McKelvin.","(4:59) Caleb Sturgis kicks off to the Was1. Chris Thompson return for 22 yards to Was23. Tackled by Najee Goode.","(5:03) Caleb Sturgis 41 yard field goal attempt is GOOD. Holder: Donnie Jones.","(5:03) Philadelphia Eagles timeout.","(5:50) Ryan Mathews rush up the middle for 1 yard to the Was23. Tackled by Ryan Kerrigan.","(6:27) Carson Wentz pass to the left to Nelson Agholor for 13 yards to the Was24. Tackled by Martrell Spaight.","(6:30) Carson Wentz incomplete pass to the left intended for Trey Burton.","(6:52) Penalty: False Start on Philadelphia (Stefen Wisniewski) -5 yards.","(7:27) Carson Wentz rush up the middle for 2 yards to the Was32. Tackled by Chris Baker.","(8:06) Carson Wentz pass to the middle to Trey Burton for 13 yards to the Was34. Tackled by Mason Foster.","(8:55) Carson Wentz sacked at Was47 for a loss of 3 yards by Bashaud Breeland. FUMBLE, recovered by Phi (Jason Kelce).","(9:33) Ryan Mathews rush up the middle for a loss of 1 yard to the Was44. Tackled by Mason Foster.","(10:14) Carson Wentz pass to the left to Zach Ertz for 14 yards to the Was43. Tackled by Mason Foster.","(10:43) Carson Wentz sacked at Phi43 for a loss of 1 yard by Mason Foster.","(11:27) Ryan Mathews rush to the right for 4 yards to the Phi44. Tackled by Josh Norman.","(11:38) Tress Way punts for 45 yards to Phi25. No return. Penalty: FC Interference on Washington (Deshazor Everett) 15 yards.","(11:44) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(12:25) Rob Kelley rush to the left for a loss of 1 yard to the Was30. Tackled by Beau Allen.","(13:04) Rob Kelley rush up the middle for 5 yards to the Was31. Tackled by Nigel Bradham.","(13:11) Caleb Sturgis kicks off to the Was1. Chris Thompson return for 25 yards to Was26. Tackled by Malcolm Jenkins.","(13:11) Carson Wentz 2 pt conversion pass is NO GOOD - intended for Jordan Matthews.","(13:16) Kirk Cousins pass intended for DeSean Jackson INTERCEPTED by Leodis McKelvin and returned for 29 yards for a TOUCHDOWN.","(13:35) Kirk Cousins pass to the left to Jamison Crowder for 4 yards to the Was20. Tackled by Nolan Carroll.","(13:45) Donnie Jones punts for 54 yards to Was26. Jamison Crowder return for 5 yards to Was31. Tackled by C.J. Smith. Penalty: Illegal Block on Washington (Deshazor Everett) -15 yards.","(14:21) Ryan Mathews rush up the middle for a loss of 2 yards to the Phi20. Tackled by Ricky Jean Francois.","(15:00) Ryan Mathews rush up the middle for 2 yards to the Phi22. Tackled by Matt Ioannidis.","(0:01) Darren Sproles rush to the left for 5 yards to the Phi20. Tackled by Matt Ioannidis.","(0:07) Dustin Hopkins kicks off to the Phi-1. Nelson Agholor return for 16 yards to Phi15. Tackled by Houston Bates.","(0:07) Dustin Hopkins extra point is good.","(0:12) Kirk Cousins pass to the left to Pierre Garcon for 15 yards for a TOUCHDOWN.","(0:31) Penalty: False Start on Washington (Morgan Moses) -5 yards.","(1:10) Rob Kelley rush up the middle for a loss of 1 yard to the Phi10. Tackled by Vinny Curry and Beau Allen.","(1:50) Rob Kelley rush to the left for 10 yards to the Phi9. Tackled by Jordan Hicks.","(2:38) Kirk Cousins pass to the right to Rob Kelley for 14 yards to the Phi19. Tackled by Bennie Logan.","(2:52) Washington Redskins timeout.","(2:52) Kirk Cousins pass to the left to DeSean Jackson for 21 yards to the Phi33.","(3:21) Rob Kelley rush up the middle for no gain to the Was46. Tackled by Jalen Mills and Connor Barwin.","(3:29) Donnie Jones rush up the middle for no gain to the Was32. FUMBLE, recovered by Phi (Donnie Jones) and advanced for a loss of 6 yards.","(4:09) Darren Sproles rush to the left for 7 yards to the Was32. Tackled by Duke Ihenacho.","(4:14) Carson Wentz incomplete pass to the middle intended for Zach Ertz.","(4:18) Penalty: Pass Interference on Philadelphia (Jordan Matthews) -10 yards.","(4:23) Carson Wentz incomplete pass to the left intended for Darren Sproles.","(5:04) Carson Wentz pass to the middle to Zach Ertz for 8 yards to the Was29. Tackled by Mason Foster.","(5:09) Carson Wentz incomplete pass to the left intended for Paul Turner.","(5:55) Carson Wentz pass to the left to Jordan Matthews for 6 yards to the Was37. Tackled by Bashaud Breeland.","(6:38) Carson Wentz pass to the right to Trey Burton for 2 yards to the Was43. Tackled by Bashaud Breeland.","(7:14) Ryan Mathews rush to the left for 21 yards to the Was45. Tackled by Donte Whitner.","(7:54) Carson Wentz pass to the right to Trey Burton for 8 yards to the Phi34. Tackled by Donte Whitner.","(8:30) Darren Sproles rush up the middle for 4 yards to the Phi26. Tackled by Ziggy Hood.","(9:08) Carson Wentz pass to the right to Zach Ertz for 4 yards to the Phi22. Tackled by Mason Foster.","(9:14) Dustin Hopkins kicks off to the Phi7. Paul Turner return for 11 yards to Phi18. Tackled by Martrell Spaight.","(9:14) Dustin Hopkins extra point is good.","(9:26) Kirk Cousins pass to the right to DeSean Jackson for 80 yards for a TOUCHDOWN.","(9:57) Rob Kelley rush to the left for 1 yard to the Was20. Tackled by Bennie Logan.","(10:06) Donnie Jones punts for 52 yards to Was11. Jamison Crowder return for 8 yards to Was19. Tackled by Trey Burton.","(10:49) Carson Wentz sacked at Phi37 for a loss of 9 yards by Preston Smith and Chris Baker.","(11:28) Carson Wentz pass to the right to Zach Ertz for 8 yards to the Phi46. Tackled by Donte Whitner.","(12:09) Ryan Mathews rush to the left for a loss of 3 yards to the Phi38. Tackled by Ziggy Hood.","(12:50) Ryan Mathews rush to the right for 18 yards to the Phi41. Tackled by Duke Ihenacho.","(13:10) Tress Way punts for 49 yards to Phi28. Darren Sproles return for 5 yards to Phi33. Penalty: Illegal Block on Philadelphia (Zach Ertz) -10 yards.","(13:45) Kirk Cousins sacked at Was23 for a loss of 6 yards by Fletcher Cox and Bennie Logan.","(14:27) Chris Thompson rush to the left for 3 yards to the Was29. Tackled by Bennie Logan.","(15:00) Kirk Cousins pass to the left to DeSean Jackson for 1 yard to the Was26. Tackled by Rodney McLeod.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback.","(0:22) Kirk Cousins rush up the middle for a loss of 1 yard to the Was6.","(0:28) Caleb Sturgis kicks off to the Was1. Chris Thompson return for 13 yards to Was14. Tackled by Chris Maragos. Penalty: Holding on Washington (Matt Ioannidis) -7 yards.","(0:28) Caleb Sturgis extra point is good.","(0:32) Carson Wentz pass to the left to Darren Sproles for 4 yards for a TOUCHDOWN.","(0:38) Carson Wentz pass to the right to Trey Burton for 7 yards to the Was4. Tackled by Donte Whitner.","(0:38) Philadelphia Eagles timeout.","(0:43) Carson Wentz pass to the right to Zach Ertz for 1 yard to the Was11. Tackled by Mason Foster.","(1:07) Darren Sproles rush up the middle for 8 yards to the Was12. Tackled by Donte Whitner.","(1:30) Carson Wentz pass to the middle to Paul Turner for 16 yards to the Was20. Tackled by Bashaud Breeland.","(1:51) Carson Wentz pass to the left to Jordan Matthews for 7 yards to the Was36. Tackled by Quinton Dunbar.","(2:00) Carson Wentz incomplete pass to the middle intended for Trey Burton.","(2:00) Two Minute Warning.","(2:14) Carson Wentz pass to the right to Trey Burton for 16 yards to the Was43. Tackled by Bashaud Breeland.","(2:22) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(3:02) Ryan Mathews rush up the middle for 1 yard to the Phi41. Tackled by Deshazor Everett.","(3:30) Carson Wentz pass to the right to Jordan Matthews for 14 yards to the Phi40. Tackled by Donte Whitner.","(4:06) Ryan Mathews rush up the middle for 3 yards to the Phi26. Tackled by Mason Foster.","(4:11) Dustin Hopkins kicks off to the Phi12. Nelson Agholor return for 11 yards to Phi23. Tackled by Martrell Spaight.","(4:11) Dustin Hopkins extra point is good.","(4:19) Rob Kelley rush to the left for 22 yards for a TOUCHDOWN.","(5:01) Rob Kelley rush to the left for 5 yards to the Phi22. Tackled by Stephen Tulloch.","(5:31) Kirk Cousins pass to the right to Pierre Garcon for 7 yards to the Phi27. Tackled by Leodis McKelvin.","(6:11) Rob Kelley rush to the left for 2 yards to the Phi34. Tackled by Steven Means and Bennie Logan.","(6:53) Kirk Cousins pass to the right to Jordan Reed for 10 yards to the Phi36. Tackled by Leodis McKelvin.","(7:36) Rob Kelley rush up the middle for 1 yard to the Phi46. Tackled by Nolan Carroll and Jordan Hicks.","(8:19) Kirk Cousins pass to the left to Rob Kelley for 11 yards to the Phi47. Tackled by Nolan Carroll.","(9:00) Kirk Cousins rush to the right for 2 yards to the Was42. Tackled by Brandon Graham.","(9:42) Chris Thompson rush to the right for 10 yards to the Was40. Tackled by Leodis McKelvin.","(10:23) Kirk Cousins sacked at Was30 for a loss of 1 yard by Fletcher Cox.","(10:29) Caleb Sturgis kicks off to the Was6. Chris Thompson return for 25 yards to Was31. Tackled by Chris Maragos.","(10:31) Caleb Sturgis 36 yard field goal attempt is GOOD. Holder: Donnie Jones.","(10:47) Penalty: False Start on Philadelphia (Jason Peters) -5 yards.","(11:30) Carson Wentz pass to the right to Darren Sproles for 9 yards to the Was13. Tackled by Mason Foster.","(12:13) Carson Wentz pass to the left to Brent Celek for a loss of 2 yards to the Was22. Tackled by Preston Smith and Will Compton.","(12:17) Carson Wentz incomplete pass to the left intended for Trey Burton.","(12:55) Carson Wentz pass to the left to Brent Celek for 9 yards to the Was20. Tackled by Will Compton.","(13:33) Darren Sproles rush to the left for 3 yards to the Was29. Tackled by Ricky Jean Francois.","(14:19) Carson Wentz pass to the left to Zach Ertz for 29 yards to the Was32. Tackled by Duke Ihenacho.","(15:00) Ryan Mathews rush up the middle for 2 yards to the Phi39. Tackled by Chris Baker.","(0:31) Wendell Smallwood rush to the left for a loss of 1 yard to the Phi37. Tackled by Trent Murphy.","(1:05) Carson Wentz pass to the left to Nelson Agholor for 9 yards to the Phi38. Tackled by Quinton Dunbar.","(1:09) 38 yard field goal attempt by Dustin Hopkins is NO GOOD. Holder: Tress Way.","(1:12) Kirk Cousins incomplete pass to the right intended for Jamison Crowder defensed by Leodis McKelvin.","(1:17) Kirk Cousins incomplete pass to the left intended for Vernon Davis.","(1:56) Rob Kelley rush up the middle for 2 yards to the Phi20. Tackled by Jordan Hicks.","(2:35) Kirk Cousins pass to the left to Pierre Garcon for 15 yards to the Phi22. Tackled by Rodney McLeod.","(3:05) Kirk Cousins pass to the left to Vernon Davis for 1 yard to the Phi37. Tackled by Nolan Carroll.","(3:09) Penalty: Pass Interference on Philadelphia (Malcolm Jenkins) 24 yards.","(3:49) Rob Kelley rush to the left for 2 yards to the Was38. Tackled by Fletcher Cox.","(4:30) Kirk Cousins pass to the right to Pierre Garcon for 16 yards to the Was36. Tackled by Leodis McKelvin.","(4:33) Carson Wentz pass intended for Zach Ertz INTERCEPTED by Deshazor Everett. No return. Touchback.","(5:15) Wendell Smallwood rush up the middle for 5 yards to the Was3. Tackled by Duke Ihenacho.","(5:20) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(5:58) Carson Wentz pass to the right to Jordan Matthews for 10 yards to the Was8. Tackled by Will Compton.","(6:38) Ryan Mathews rush to the left for 2 yards to the Was18. Tackled by Trent Murphy.","(7:21) Carson Wentz pass to the left to Trey Burton for 3 yards to the Was20. Tackled by Bashaud Breeland.","(8:02) Carson Wentz pass to the right to Zach Ertz for 13 yards to the Was23. Tackled by Mason Foster.","(8:08) Penalty: Pass Interference on Washington (Quinton Dunbar) 44 yards.","(8:17) Tress Way punts for 47 yards to Phi20. No return.","(8:24) Kirk Cousins incomplete pass to the left intended for Jamison Crowder defensed by Leodis McKelvin.","(9:08) Rob Kelley rush to the right for 2 yards to the Was33. Tackled by Brandon Graham.","(9:46) Rob Kelley rush to the right for 6 yards to the Was31. Tackled by Nigel Bradham.","(9:46) Caleb Sturgis kicks off to the endzone. Touchback.","(9:49) Caleb Sturgis 45 yard field goal attempt is GOOD. Holder: Donnie Jones.","(9:49) Philadelphia Eagles timeout.","(9:54) Carson Wentz incomplete pass to the right intended for Brent Celek.","(10:32) Ryan Mathews rush to the left for 3 yards to the Was27. Tackled by Su'a Cravens.","(11:08) Ryan Mathews rush to the left for 4 yards to the Was30. Tackled by Donte Whitner and Ziggy Hood.","(11:44) Carson Wentz rush to the right for 3 yards to the Was34. Tackled by Donte Whitner.","(12:21) Carson Wentz pass to the left to Zach Ertz for 9 yards to the Was37. Tackled by Duke Ihenacho.","(13:07) Carson Wentz pass to the right to Jordan Matthews for 10 yards to the Was46. Tackled by Quinton Dunbar.","(13:44) Wendell Smallwood rush to the left for a loss of 1 yard to the Phi44. Tackled by Will Compton.","(14:17) Ryan Mathews rush up the middle for 5 yards to the Phi45. Tackled by Mason Foster.","(14:53) Carson Wentz pass to the left to Zach Ertz for 13 yards to the Phi40. Tackled by Duke Ihenacho.","(15:00) Dustin Hopkins kicks off to the Phi0. Wendell Smallwood return for 27 yards to Phi27. Tackled by Duke Ihenacho."]