["(0:22) Jameis Winston rush up the middle for a loss of 1 yard to the NO49.","(0:51) Jameis Winston rush up the middle for a loss of 1 yard to the NO48.","(0:57) Drew Brees pass intended for Willie Snead INTERCEPTED by Keith Tandy. No return. Tackled by Willie Snead.","(0:57) New Orleans Saints timeout.","(1:08) Drew Brees pass to the right to Travaris Cadet for 4 yards to the NO45. Tackled by Bradley McDougald.","(1:15) Drew Brees incomplete pass to the middle intended for Brandin Cooks defensed by Keith Tandy.","(1:23) Drew Brees pass to the middle to Travaris Cadet for 5 yards to the NO41. Tackled by Lavonte David.","(1:41) Drew Brees pass to the left to Brandon Coleman for 16 yards to the NO36. Tackled by Vernon Hargreaves III.","(2:00) Drew Brees pass to the middle to Willie Snead for 17 yards to the NO20. Tackled by Keith Tandy.","(2:00) Two Minute Warning.","(2:08) Bryan Anger punts for 32 yards to NO3. No return.","(2:14) Jameis Winston incomplete pass to the left intended for Mike Evans defensed by B.W. Webb.","(2:14) Tampa Bay Buccaneers timeout.","(3:02) Doug Martin rush to the left for 2 yards to the NO35. Tackled by Stephone Anthony and Tyeler Davison.","(3:48) Doug Martin rush to the left for 1 yard to the NO37. Tackled by Sheldon Rankins and Tyeler Davison.","(4:30) Jameis Winston pass to the right to Mike Evans for 6 yards to the NO38. Tackled by Ken Crawley.","(5:08) Doug Martin rush to the left for 3 yards to the NO44. Tackled by Roman Harper.","(5:41) Doug Martin rush to the right for 3 yards to the NO47. Tackled by Dannell Ellerbe.","(5:54) Thomas Morstead punts for 53 yards to TB38. Vernon Hargreaves III return for 12 yards to TB50. Tackled by Nate Stupar.","(6:00) Drew Brees incomplete pass to the right intended for John Kuhn defensed by Noah Spence.","(6:37) Drew Brees pass to the left to John Phillips for 8 yards to the NO9. Tackled by Kwon Alexander.","(6:44) Drew Brees incomplete pass to the right intended for Brandon Coleman.","(6:54) Bryan Anger punts for 44 yards to NO1. No return.","(7:33) Jameis Winston pass to the middle to Doug Martin for 11 yards to the NO45. Tackled by Stephone Anthony.","(8:16) Jameis Winston sacked at TB44 for a loss of 11 yards by Vonn Bell and Cameron Jordan.","(8:53) Doug Martin rush to the left for a loss of 1 yard to the NO45. Tackled by Dannell Ellerbe and Jairus Byrd.","(9:33) Doug Martin rush to the right for 4 yards to the NO44. Tackled by Roman Harper and Jairus Byrd.","(10:07) Doug Martin rush to the left for 6 yards to the NO48. Tackled by Dannell Ellerbe and Stephone Anthony.","(10:15) Drew Brees pass intended for Brandon Coleman INTERCEPTED by Brent Grimes defensed by Keith Tandy and returned for 5 yards. Tackled by Brandon Coleman.","(10:57) Drew Brees pass to the right to Coby Fleener for 6 yards to the TB47. Tackled by Lavonte David.","(11:29) Mark Ingram rush up the middle for 3 yards to the NO47. Tackled by Daryl Smith.","(11:55) Drew Brees pass to the right to Travaris Cadet for 10 yards to the NO44. Tackled by Lavonte David.","(11:55) New Orleans Saints timeout.","(12:39) Drew Brees pass to the middle to Mark Ingram for 9 yards to the NO34. Tackled by Lavonte David.","(12:46) Drew Brees incomplete pass to the right intended for Coby Fleener.","(12:46) Roberto Aguayo kicks off to the endzone. Touchback.","(12:50) Roberto Aguayo 26 yard field goal attempt is GOOD. Holder: Bryan Anger.","(12:56) Jameis Winston incomplete pass to the right intended for Russell Shepard defensed by Sterling Moore.","(13:39) Jameis Winston rush up the middle for 1 yard to the NO7. Tackled by Dannell Ellerbe.","(14:16) Doug Martin rush to the left for 5 yards to the NO8. Tackled by Paul Kruger.","(15:00) Jameis Winston pass to the right to Charles Sims for 11 yards to the NO13. Tackled by Stephone Anthony.","(0:09) Jameis Winston pass to the right to Charles Sims for 13 yards to the NO24. Tackled by Jairus Byrd.","(0:48) Jameis Winston pass to the right to Charles Sims for 9 yards to the NO37. Tackled by Nick Fairley.","(1:28) Jacquizz Rodgers rush up the middle for a loss of 1 yard to the NO46. Tackled by Cameron Jordan.","(2:04) Jameis Winston pass to the left to Josh Huff for 17 yards to the NO45. Tackled by Vonn Bell.","(2:43) Jacquizz Rodgers rush to the right for 1 yard to the TB38. Tackled by Stephone Anthony.","(3:22) Jameis Winston pass to the right to Cameron Brate for 12 yards to the TB37. Tackled by Ken Crawley.","(3:26) Jameis Winston incomplete pass to the left intended for Josh Huff.","(3:35) Jameis Winston incomplete pass to the right intended for Russell Shepard.","(3:35) Wil Lutz kicks off to the endzone. Touchback.","(3:39) Wil Lutz 22 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(3:45) Drew Brees incomplete pass to the right intended for Brandin Cooks.","(3:52) Drew Brees incomplete pass to the right intended for Tim Hightower.","(4:32) Tim Hightower rush up the middle for 8 yards to the TB4. Tackled by Keith Tandy and Bradley McDougald.","(5:01) Drew Brees pass to the right to Willie Snead for 6 yards to the TB12. Tackled by Javien Elliott.","(5:42) Tim Hightower rush to the left for 8 yards to the TB18. Tackled by Kwon Alexander and Sealver Siliga.","(6:29) Drew Brees pass to the right to Brandin Cooks for 38 yards to the TB26. Tackled by Keith Tandy.","(6:34) Penalty: Offside on Tampa Bay (William Gholston) 5 yards.","(7:13) Travaris Cadet rush to the left for a loss of 1 yard to the NO31. Tackled by Kwon Alexander.","(7:13) New Orleans Saints timeout.","(7:52) Drew Brees pass to the middle to Brandin Cooks for 5 yards to the NO32. Tackled by Keith Tandy.","(8:31) Drew Brees pass to the left to Brandin Cooks for 3 yards to the NO27. Tackled by Javien Elliott.","(9:04) Tim Hightower rush to the right for 4 yards to the NO24. Tackled by Sealver Siliga and Akeem Spence.","(9:17) Bryan Anger punts for 57 yards to NO24. Tommylee Lewis return for 6 yards to NO30. Tackled by Cameron Brate. Penalty: Illegal Block on New Orleans (Sam Barrington) -10 yards.","(9:57) Jameis Winston sacked at TB19 for a loss of 7 yards by Nick Fairley.","(10:35) Jameis Winston pass to the right to Brandon Myers for 9 yards to the TB26. Tackled by Sterling Moore and David Onyemata.","(10:55) Doug Martin rush up the middle for a loss of 3 yards to the TB32. Tackled by Nick Fairley. Penalty: Unnecessary Roughness on Tampa Bay (Donovan Smith) -15 yards.","(11:00) Penalty: Holding on New Orleans (B.W. Webb) 5 yards.","(11:38) Doug Martin rush to the left for 7 yards to the TB30. Tackled by B.W. Webb and Tyeler Davison.","(12:01) Jameis Winston pass to the left to Doug Martin for 8 yards to the TB23. Tackled by Nate Stupar.","(12:10) Thomas Morstead punts for 51 yards to TB15. No return.","(12:28) Drew Brees pass to the right to Willie Snead for 7 yards to the NO49. Tackled by Brent Grimes and Kwon Alexander. Penalty: Taunting on New Orleans (Willie Snead) -15 yards.","(12:33) Drew Brees incomplete pass to the left intended for Willie Snead.","(12:53) Penalty: False Start on New Orleans (John Kuhn) -5 yards.","(13:21) Penalty: Offside on Tampa Bay (Gerald McCoy) 5 yards.","(14:02) Drew Brees pass to the left to Brandon Coleman for 7 yards to the NO42. Tackled by Javien Elliott.","(14:24) Penalty: Holding on New Orleans (Zach Strief) -10 yards.","(14:56) Drew Brees pass to the right to Willie Snead for 20 yards to the NO45. Tackled by Javien Elliott.","(15:00) Drew Brees incomplete pass to the right intended for Brandin Cooks.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback.","(0:04) Wil Lutz 34 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(0:04) Tampa Bay Buccaneers timeout.","(0:04) New Orleans Saints timeout.","(0:09) Drew Brees sacked at TB15 for a loss of 9 yards by Robert Ayers Jr..","(0:13) Drew Brees incomplete pass to the right intended for Travaris Cadet.","(0:13) Penalty: False Start on New Orleans (Tony Hills) -5 yards.","(0:13) Tampa Bay Buccaneers timeout.","(0:48) Mark Ingram rush up the middle for 2 yards to the TB1. Tackled by Gerald McCoy.","(1:24) Drew Brees pass to the right to Brandon Coleman for 9 yards to the TB3. Tackled by Brent Grimes.","(2:00) Drew Brees rush up the middle for 2 yards to the TB12. Tackled by Robert Ayers Jr..","(2:00) Two Minute Warning.","(2:24) John Kuhn rush up the middle for no gain to the TB14. Tackled by Bradley McDougald.","(3:01) Mark Ingram rush to the right for 9 yards to the TB14. Tackled by Kwon Alexander and Keith Tandy.","(3:05) Drew Brees incomplete pass to the right intended for Mark Ingram defensed by Bradley McDougald.","(3:41) Drew Brees pass to the right to Brandon Coleman for 9 yards to the TB23. Tackled by Keith Tandy.","(4:16) Tim Hightower rush to the right for 7 yards to the TB32. Tackled by Clinton McDonald and William Gholston.","(4:23) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(4:47) Drew Brees pass to the left to Travaris Cadet for 11 yards to the TB39. Tackled by Bradley McDougald.","(5:18) Mark Ingram rush to the right for no gain to the NO50. Tackled by Gerald McCoy and Clinton McDonald.","(5:20) Bryan Anger kicks off to the NO25, out of bounds. No return.","(5:27) Doug Martin rush up the middle for a loss of 1 yard to the TB0. Tackled by Paul Kruger. Safety.","(5:29) Wil Lutz kicks off to the TB1. Josh Huff - no return.","(5:33) Wil Lutz 42 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(6:15) Drew Brees pass to the middle to Willie Snead for 6 yards to the TB23. Tackled by Kwon Alexander.","(6:54) Drew Brees pass to the right to Tim Hightower for 8 yards to the TB29. Tackled by Clinton McDonald.","(7:00) Penalty: Holding on New Orleans (Andrus Peat) -10 yards.","(7:31) Tim Hightower rush to the left for 2 yards to the TB27. Tackled by Robert Ayers Jr..","(7:50) Drew Brees pass to the left to Willie Snead for 29 yards to the TB44. Tackled by Keith Tandy. Penalty: Face Mask on Tampa Bay (Vernon Hargreaves III) 15 yards.","(7:58) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(8:26) Tim Hightower rush up the middle for 2 yards to the NO27. Tackled by Bradley McDougald.","(8:26) Roberto Aguayo kicks off to the endzone. Touchback.","(8:30) Roberto Aguayo 39 yard field goal attempt is GOOD. Holder: Bryan Anger.","(8:37) Jameis Winston incomplete pass to the right intended for Mike Evans defensed by Delvin Breaux.","(9:15) Doug Martin rush up the middle for 3 yards to the NO21. Tackled by Roman Harper.","(9:51) Doug Martin rush to the right for 6 yards to the NO24. Tackled by Nick Fairley and Roman Harper.","(10:18) Jameis Winston pass to the left to Mike Evans for 12 yards to the NO30. Tackled by Delvin Breaux and Jairus Byrd.","(11:00) Charles Sims rush to the left for a loss of 1 yard to the NO42. Tackled by Delvin Breaux.","(11:30) Charles Sims rush to the right for 12 yards to the NO41. Tackled by Roman Harper.","(11:30) New Orleans Saints timeout.","(11:52) Jameis Winston pass to the left to Mike Evans for 11 yards to the TB47. Tackled by Delvin Breaux.","(12:38) Jameis Winston rush up the middle for 3 yards to the TB36. Tackled by Vonn Bell and Stephone Anthony.","(13:11) Charles Sims rush to the right for 4 yards to the TB33. Tackled by Kasim Edebali.","(13:19) Drew Brees pass intended for Coby Fleener INTERCEPTED by Vernon Hargreaves III defensed by Kwon Alexander. No return. Tackled by Coby Fleener.","(13:35) Penalty: Delay of Game on New Orleans (Drew Brees) -5 yards.","(14:22) Drew Brees pass to the left to Brandon Coleman for 6 yards to the TB47. Tackled by Keith Tandy.","(14:50) Drew Brees pass to the right to Brandin Cooks for 7 yards to the NO32. Tackled by Kwon Alexander. Penalty: Face Mask on Tampa Bay (Lavonte David) 15 yards.","(14:50) Roberto Aguayo kicks off to the endzone. Touchback.","(14:50) Roberto Aguayo extra point is good.","(14:55) Doug Martin rush to the left for 1 yard for a TOUCHDOWN.","(15:00) Penalty: Pass Interference on New Orleans (Stephone Anthony) 1 yards.","(0:34) Doug Martin rush up the middle for a loss of 1 yard to the NO2. Tackled by Stephone Anthony and Cameron Jordan.","(0:40) Penalty: Pass Interference on New Orleans (Delvin Breaux) 13 yards.","(1:17) Josh Huff rush to the right for 5 yards to the NO14. Tackled by Dannell Ellerbe.","(1:56) Jameis Winston pass to the middle to Mike Evans for 13 yards to the NO19. Tackled by Roman Harper and Jairus Byrd.","(2:35) Charles Sims rush to the right for 2 yards to the NO32. Tackled by Darryl Tapp and Cameron Jordan.","(3:10) Doug Martin rush to the left for 5 yards to the NO34. Tackled by Stephone Anthony and Vonn Bell.","(3:54) Jameis Winston pass to the left to Cameron Brate for 18 yards to the NO39. Tackled by Sterling Moore.","(4:36) Jameis Winston pass to the left to Cameron Brate for 8 yards to the TB43. Tackled by Dannell Ellerbe.","(5:13) Doug Martin rush to the right for a loss of 1 yard to the TB35. Tackled by Cameron Jordan.","(5:48) Doug Martin rush to the left for 3 yards to the TB36. Tackled by David Onyemata and Vonn Bell.","(6:27) Doug Martin rush to the left for 8 yards to the TB33. Tackled by Nate Stupar and Jairus Byrd.","(6:38) Thomas Morstead punts for 49 yards to TB29. Vernon Hargreaves III return for a loss of 4 yards to TB25. Tackled by Daniel Lasco.","(6:46) Drew Brees incomplete pass to the right intended for Brandon Coleman.","(7:27) Drew Brees pass to the left to Brandin Cooks for 8 yards to the NO22. Tackled by Vernon Hargreaves III.","(8:00) Mark Ingram rush to the right for a loss of 3 yards to the NO14. Tackled by Lavonte David.","(8:05) Roberto Aguayo kicks off to the NO-2. Tommylee Lewis return for 19 yards to NO17. Tackled by Josh Robinson.","(8:10) Roberto Aguayo 41 yard field goal attempt is GOOD. Holder: Bryan Anger.","(8:16) Jameis Winston incomplete pass to the left intended for Mike Evans.","(8:21) Jameis Winston incomplete pass to the right intended for Freddie Martino defensed by Vonn Bell.","(8:28) Penalty: Offside on New Orleans (Cameron Jordan) 5 yards.","(8:28) Jameis Winston incomplete pass to the right intended for Charles Sims.","(8:49) Penalty: False Start on Tampa Bay (Donovan Smith) -5 yards.","(9:22) Doug Martin rush to the left for 8 yards to the NO28. Tackled by Vonn Bell. Penalty: Holding on New Orleans (Tyeler Davison) 5 yards.","(9:59) Jameis Winston pass to the middle to Cameron Brate for 9 yards to the NO36. Tackled by Stephone Anthony and Vonn Bell.","(10:34) Doug Martin rush to the left for 2 yards to the NO45. Tackled by Tyeler Davison and Jairus Byrd.","(10:59) Jameis Winston rush to the left for 14 yards to the TB38. Tackled by Roman Harper. Penalty: Unnecessary Roughness on New Orleans (Roman Harper) 15 yards.","(10:59) Penalty: False Start on Tampa Bay (Donovan Smith) -5 yards.","(11:05) Jameis Winston incomplete pass to the right intended for Mike Evans.","(11:16) Thomas Morstead punts for 52 yards to TB22. Vernon Hargreaves III return for 7 yards to TB29. Tackled by John Kuhn.","(11:51) Drew Brees pass to the left to John Kuhn for 3 yards to the NO26. Tackled by Vernon Hargreaves III.","(12:28) Mark Ingram rush to the right for a loss of 1 yard to the NO23. Tackled by Keith Tandy.","(12:57) Mark Ingram rush to the left for 4 yards to the NO24. Tackled by Daryl Smith.","(13:07) Bryan Anger punts for 52 yards to NO0. Touchback.","(13:12) Jameis Winston incomplete pass to the left intended for Cameron Brate.","(13:50) Doug Martin rush to the right for no gain to the TB48. Tackled by Nick Fairley.","(14:24) Doug Martin rush to the left for 6 yards to the TB48. Tackled by Nick Fairley.","(15:00) Jameis Winston pass to the left to Russell Shepard for 17 yards to the TB42. Tackled by Roman Harper.","(15:00) Wil Lutz kicks off to the endzone. Touchback."]