["(0:03) Chandler Catanzaro 34 yard field goal attempt is GOOD. Holder: Ryan Quigley.","(0:03) Arizona Cardinals timeout.","(0:16) David Johnson rush to the right for a loss of 3 yards to the SF16. Tackled by Quinton Dial.","(0:17) Carson Palmer incomplete pass to the middle.","(0:47) David Johnson rush up the middle for 9 yards to the SF13. Tackled by Gerald Hodges Jr..","(0:47) San Francisco 49ers timeout.","(0:52) David Johnson rush up the middle for 1 yard to the SF22. Tackled by Antoine Bethea and Nick Bellore.","(0:57) Carson Palmer pass to the right to David Johnson for 12 yards to the SF23. Tackled by Nick Bellore.","(0:57) San Francisco 49ers timeout.","(1:03) David Johnson rush up the middle for 2 yards to the SF35. Tackled by Quinton Dial.","(1:07) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Tramaine Brock.","(1:07) Arizona Cardinals timeout.","(1:10) Carson Palmer pass to the left to Larry Fitzgerald for 14 yards to the SF37. Tackled by Jimmie Ward.","(1:35) Carson Palmer pass to the middle to David Johnson for 8 yards to the Ari49. Tackled by Nick Bellore.","(1:35) Arizona Cardinals timeout.","(1:47) Carson Palmer pass to the left to Michael Floyd for 26 yards to the Ari41. Tackled by Tramaine Brock.","(1:51) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(1:55) Phil Dawson kicks off to the Ari2. Andre Ellington return for 13 yards to Ari15. Tackled by Michael Wilhoite.","(1:55) Phil Dawson extra point is good.","(2:00) Colin Kaepernick rush to the right for 4 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:14) Colin Kaepernick pass to the right to Vance McDonald for 8 yards to the Ari4. Tackled by Patrick Peterson.","(2:19) Colin Kaepernick incomplete pass to the left intended for Carlos Hyde.","(2:19) San Francisco 49ers timeout.","(2:28) Colin Kaepernick rush to the left for 19 yards to the Ari12. Tackled by Marcus Cooper.","(2:33) Colin Kaepernick incomplete pass to the right intended for Torrey Smith.","(3:05) Carlos Hyde rush up the middle for 2 yards to the Ari31. Tackled by Calais Campbell.","(3:13) Colin Kaepernick pass to the left to Jeremy Kerley for 24 yards to the Ari33. Tackled by Marcus Cooper.","(3:24) Carson Palmer pass intended for John Brown INTERCEPTED by Gerald Hodges Jr. and returned for 6 yards. Tackled by Jermaine Gresham.","(4:04) Carson Palmer pass to the left to Larry Fitzgerald for 19 yards to the Ari50. Tackled by Jimmie Ward.","(4:48) David Johnson rush to the right for no gain to the Ari31. Tackled by Ahmad Brooks.","(5:30) David Johnson rush up the middle for 7 yards to the Ari31. Tackled by Antoine Bethea and Tramaine Brock.","(6:17) John Brown rush to the right for 10 yards to the Ari24. Tackled by Eric Reid.","(6:21) Penalty: Holding on San Francisco (Jimmie Ward) 5 yards.","(7:06) David Johnson rush up the middle for 1 yard to the Ari9. Tackled by DeForest Buckner.","(7:33) Penalty: Holding on Arizona (Jermaine Gresham) -5 yards.","(8:09) Carson Palmer pass to the middle to Jermaine Gresham for 9 yards to the Ari13. Tackled by Nick Bellore.","(8:19) Bradley Pinion punts for 43 yards to Ari4. No return.","(8:24) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(8:55) Carlos Hyde rush up the middle for 1 yard to the Ari47. Tackled by Chandler Jones.","(9:25) Colin Kaepernick rush to the left for 4 yards to the Ari48. Tackled by Tony Jefferson.","(9:59) Colin Kaepernick pass to the middle to Jeremy Kerley for 7 yards to the SF48. Tackled by Marcus Cooper.","(10:40) DuJuan Harris rush to the left for 4 yards to the SF41. Tackled by Justin Bethel and Deone Bucannon.","(10:44) Colin Kaepernick incomplete pass to the left intended for Rod Streater.","(11:44) Carlos Hyde rush up the middle for 2 yards to the SF37. Tackled by Tony Jefferson.","(11:44) Colin Kaepernick pass to the left to Jeremy Kerley for 7 yards to the SF35. Tackled by Marcus Cooper.","(12:15) Carlos Hyde rush up the middle for 2 yards to the SF28. Tackled by Tony Jefferson.","(12:23) Ryan Quigley punts for 41 yards to SF26. No return.","(13:07) David Johnson rush up the middle for no gain to the Ari33. Tackled by Antoine Bethea.","(13:50) David Johnson rush up the middle for 2 yards to the Ari33. Tackled by Gerald Hodges Jr..","(14:32) Carson Palmer pass to the left to David Johnson for 7 yards to the Ari31. Tackled by Gerald Hodges Jr..","(15:00) Carson Palmer pass to the left to Larry Fitzgerald for 4 yards to the Ari24. Tackled by Jimmie Ward.","(0:40) Carson Palmer pass to the left to Larry Fitzgerald for 7 yards to the Ari20. Tackled by Tank Carradine.","(0:45) Carson Palmer incomplete pass to the middle intended for Jermaine Gresham.","(0:52) Bradley Pinion punts for 33 yards to Ari13. No return.","(0:58) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(1:30) Colin Kaepernick rush to the right for 2 yards to the Ari46. Tackled by Patrick Peterson.","(1:55) Penalty: Holding on San Francisco (Daniel Kilgore) -10 yards.","(2:21) Penalty: Holding on San Francisco (Garrett Celek) -10 yards.","(2:26) Colin Kaepernick incomplete pass to the right intended for Chris Harper.","(2:51) Colin Kaepernick pass to the right to Jeremy Kerley for 3 yards to the Ari28.","(2:59) Colin Kaepernick incomplete pass to the right intended for Quinton Patton.","(3:22) Colin Kaepernick rush to the left for 9 yards to the Ari31. Tackled by Justin Bethel.","(3:37) Carson Palmer pass intended for J.J. Nelson INTERCEPTED by Eric Reid and returned for 13 yards. Tackled by David Johnson.","(3:42) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald defensed by Eric Reid.","(3:52) Carson Palmer incomplete pass to the left intended for David Johnson.","(4:02) Bradley Pinion punts for 51 yards to Ari29. Brittan Golden return for 6 yards to Ari35. Tackled by Aaron Burbridge.","(4:08) Colin Kaepernick incomplete pass to the left intended for Quinton Patton.","(4:51) Carlos Hyde rush up the middle for a loss of 3 yards to the SF20. Tackled by Xavier Williams.","(5:26) Carlos Hyde rush up the middle for 2 yards to the SF23. Tackled by Kevin Minter.","(5:34) Ryan Quigley punts for 43 yards to SF18. Jeremy Kerley return for 3 yards to SF21. Tackled by Brittan Golden.","(5:42) Carson Palmer incomplete pass to the left intended for John Brown defensed by Keith Reaser.","(6:21) David Johnson rush up the middle for 1 yard to the Ari39. Tackled by Quinton Dial and Eric Reid.","(7:04) Carson Palmer pass to the left to Jermaine Gresham for 1 yard to the Ari38. Tackled by Tank Carradine.","(7:10) Penalty: Pass Interference on San Francisco (Tramaine Brock) 9 yards.","(7:51) Carson Palmer pass to the middle to Jermaine Gresham for 6 yards to the Ari28. Tackled by Antoine Bethea.","(8:32) David Johnson rush to the right for a loss of 1 yard to the Ari22. Tackled by Shayne Skov and Ahmad Brooks.","(8:40) Phil Dawson kicks off to the Ari5. Brittan Golden return for 18 yards to Ari23. Tackled by Jaquiski Tartt.","(8:46) Phil Dawson 53 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(9:34) Colin Kaepernick sacked at Ari35 for a loss of 5 yards by Calais Campbell.","(9:42) Colin Kaepernick incomplete pass to the right intended for Torrey Smith.","(10:16) Carlos Hyde rush up the middle for 5 yards to the Ari30. Tackled by Marcus Cooper and Josh Mauro.","(10:56) Colin Kaepernick pass to the right to Quinton Patton for 45 yards to the Ari35. Tackled by Justin Bethel.","(11:07) Carson Palmer sacked at SF20 for a loss of 4 yards by Eli Harold. FUMBLE, recovered by SF (DeForest Buckner). Tackled by John Wetzel.","(11:53) Carson Palmer sacked at SF16 for a loss of 9 yards by DeForest Buckner.","(12:43) Carson Palmer pass to the left to Larry Fitzgerald for 32 yards to the SF7. Tackled by Eric Reid.","(13:09) Carson Palmer pass to the left to Jermaine Gresham for 22 yards to the SF39. Tackled by Antoine Bethea.","(13:46) David Johnson rush up the middle for 3 yards to the Ari39. Tackled by Glenn Dorsey.","(13:55) Bradley Pinion punts for 42 yards to Ari34. John Brown return for 2 yards to Ari36. Tackled by Dontae Johnson.","(14:25) Colin Kaepernick sacked at SF24 for a loss of 3 yards by Chandler Jones.","(14:30) Colin Kaepernick incomplete pass to the middle intended for Vance McDonald defensed by Deone Bucannon.","(15:00) Colin Kaepernick rush to the right for 2 yards to the SF27. Tackled by Kevin Minter.","(15:00) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:02) Chandler Catanzaro 19 yard field goal attempt is GOOD. Holder: Ryan Quigley.","(0:06) Carson Palmer incomplete pass to the middle intended for Hakeem Valles defensed by Jimmie Ward.","(0:12) Penalty: Pass Interference on San Francisco (Eric Reid) 13 yards.","(0:12) Arizona Cardinals timeout.","(0:18) Carson Palmer pass to the left to J.J. Nelson for 12 yards to the SF14. Tackled by Antoine Bethea.","(0:24) Carson Palmer incomplete pass to the right intended for J.J. Nelson defensed by Keith Reaser.","(0:24) Arizona Cardinals timeout.","(0:30) Carson Palmer pass to the right to Michael Floyd for 19 yards to the SF26. Tackled by Keith Reaser.","(0:49) Carson Palmer pass to the left to John Brown for 9 yards to the SF45. Tackled by Tramaine Brock.","(0:56) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(1:15) Carson Palmer pass to the middle to Larry Fitzgerald for 7 yards to the Ari46. Tackled by Jimmie Ward.","(1:21) Carson Palmer pass to the left to Michael Floyd for 12 yards to the Ari39. Tackled by Tramaine Brock.","(1:27) Carson Palmer pass to the right to Michael Floyd for 9 yards to the Ari27. Tackled by Tramaine Brock.","(1:32) Phil Dawson kicks off to the Ari1. Brittan Golden return for 17 yards to Ari18. Tackled by Jaquiski Tartt.","(1:37) Phil Dawson 49 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(1:37) Arizona Cardinals timeout.","(1:56) Colin Kaepernick rush up the middle for 2 yards to the Ari30. Tackled by Deone Bucannon.","(2:00) Colin Kaepernick incomplete pass to the middle intended for Vance McDonald.","(2:00) Two Minute Warning.","(2:08) DuJuan Harris rush up the middle for 2 yards to the Ari32. Tackled by Tony Jefferson and Rodney Gunter.","(2:33) Colin Kaepernick pass to the right to Vance McDonald for 6 yards to the Ari34. Tackled by Tony Jefferson.","(3:02) Colin Kaepernick rush up the middle for 1 yard to the Ari40. Tackled by Markus Golden.","(3:36) DuJuan Harris rush up the middle for 8 yards to the Ari41. Tackled by Markus Golden.","(4:15) DuJuan Harris rush up the middle for a loss of 1 yard to the Ari49. Tackled by Deone Bucannon.","(4:51) Colin Kaepernick pass to the middle to Jeremy Kerley for 7 yards to the Ari48. Tackled by Marcus Cooper.","(5:32) DuJuan Harris rush up the middle for 1 yard to the SF45. Tackled by Chandler Jones.","(6:22) Carlos Hyde rush to the left for 5 yards to the SF44. Tackled by Deone Bucannon and Calais Campbell.","(6:48) Colin Kaepernick pass to the right to Quinton Patton for 13 yards to the SF39. Tackled by Patrick Peterson.","(7:16) Colin Kaepernick pass to the left to Torrey Smith for 21 yards to the SF26. Tackled by Justin Bethel.","(7:32) Penalty: False Start on San Francisco (Joshua Garnett) -5 yards.","(8:18) Carlos Hyde rush up the middle for a loss of 4 yards to the SF10. Tackled by Josh Mauro and Corey Peters.","(8:23) Colin Kaepernick incomplete pass to the right intended for Quinton Patton.","(8:28) Chandler Catanzaro kicks off to the SF-5. JaCorey Shepherd return for 19 yards to SF14. Tackled by Christian Bryant and Gabe Martin.","(8:34) Chandler Catanzaro 39 yard field goal attempt is GOOD. Holder: Ryan Quigley.","(9:13) Carson Palmer pass to the left to Larry Fitzgerald for 9 yards to the SF21. Tackled by Dontae Johnson.","(9:19) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald defensed by Jimmie Ward.","(9:27) Carson Palmer incomplete pass to the middle intended for Larry Fitzgerald defensed by Tramaine Brock.","(10:02) Carson Palmer rush up the middle for 16 yards to the SF35. Tackled by Eric Reid. Penalty: Holding on San Francisco (Jimmie Ward) 5 yards.","(10:19) Penalty: Offside on San Francisco (Eli Harold) 5 yards.","(10:55) Carson Palmer pass to the left to Larry Fitzgerald for 1 yard to the Ari44. Tackled by Jimmie Ward.","(11:33) Andre Ellington rush to the right for a loss of 3 yards to the Ari43. Tackled by Ahmad Brooks.","(12:12) Carson Palmer pass to the left to John Brown for 21 yards to the Ari46. Tackled by Tramaine Brock.","(12:12) Bradley Pinion kicks off to the endzone. Touchback.","(12:12) Phil Dawson extra point is good.","(12:20) Colin Kaepernick pass to the right to Jeremy Kerley for 17 yards for a TOUCHDOWN.","(12:56) Colin Kaepernick pass to the left to Rod Streater for 11 yards to the Ari17. Tackled by Deone Bucannon.","(13:38) Colin Kaepernick pass to the middle to Vance McDonald for 32 yards to the Ari28. Tackled by D.J. Swearinger.","(13:45) Colin Kaepernick incomplete pass to the left intended for Quinton Patton defensed by Justin Bethel.","(14:08) Colin Kaepernick rush to the right for 10 yards to the SF40. Tackled by Tony Jefferson.","(14:42) Carlos Hyde rush up the middle for 5 yards to the SF30. Tackled by Xavier Williams.","(14:42) Chandler Catanzaro kicks off to the endzone. Touchback.","(14:42) Chandler Catanzaro extra point is good.","(14:53) David Johnson rush up the middle for 18 yards for a TOUCHDOWN.","(15:00) Penalty: Pass Interference on San Francisco (Jimmie Ward) 38 yards.","(0:10) Ryan Quigley punts for 50 yards to SF22. Jeremy Kerley return for 25 yards to SF47. Tackled by Ryan Quigley. FUMBLE, recovered by Ari (Gabe Martin) and returned for a loss of 1 yard. Tackled by Dontae Johnson.","(0:14) Carson Palmer incomplete pass to the left intended for David Johnson.","(0:52) Carson Palmer pass to the left to Larry Fitzgerald for 8 yards to the Ari28. Tackled by Antoine Bethea.","(1:14) Penalty: False Start on Arizona (John Wetzel) -5 yards.","(1:54) David Johnson rush to the right for 2 yards to the Ari25. Tackled by Ahmad Brooks.","(2:02) Bradley Pinion punts for 47 yards to Ari23. No return.","(2:30) Colin Kaepernick pass to the right to Torrey Smith for 5 yards to the SF30. Tackled by Patrick Peterson.","(3:03) Colin Kaepernick pass to the middle to Quinton Patton for a loss of 6 yards to the SF25. Tackled by Josh Mauro.","(3:55) Colin Kaepernick pass to the right to Jeremy Kerley for 6 yards to the SF31. Tackled by D.J. Swearinger.","(3:55) Chandler Catanzaro kicks off to the endzone. Touchback.","(3:55) Chandler Catanzaro extra point is good.","(4:00) Carson Palmer pass to the left to David Johnson for 3 yards for a TOUCHDOWN.","(4:04) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(4:45) David Johnson rush up the middle for 2 yards to the SF3. Tackled by Antoine Bethea.","(5:26) Carson Palmer pass to the right to Larry Fitzgerald for 8 yards to the SF5. Tackled by Jimmie Ward.","(6:07) Carson Palmer pass to the left to Larry Fitzgerald for 5 yards to the SF13. Tackled by Keith Reaser.","(6:44) Andre Ellington rush up the middle for 2 yards to the SF18. Tackled by Gerald Hodges Jr..","(7:29) Carson Palmer pass to the right to Larry Fitzgerald for 18 yards to the SF20. Tackled by Antoine Bethea.","(8:07) Carson Palmer pass to the middle to David Johnson for 16 yards to the SF38. Tackled by Jimmie Ward.","(8:47) David Johnson rush up the middle for 2 yards to the Ari46. Tackled by Gerald Hodges Jr. and Ronald Blair.","(9:16) Carson Palmer pass to the right to Michael Floyd for 35 yards to the Ari44. Tackled by Eric Reid.","(9:59) David Johnson rush to the right for no gain to the Ari9. Tackled by Gerald Hodges Jr..","(10:07) Bradley Pinion punts for 37 yards to Ari9. No return.","(10:44) Carlos Hyde rush to the right for a loss of 5 yards to the Ari46. Tackled by D.J. Swearinger.","(11:04) Colin Kaepernick pass to the right to Vance McDonald for 4 yards to the Ari41. Tackled by Deone Bucannon.","(11:29) Carlos Hyde rush to the right for 4 yards to the Ari45. Tackled by Kevin Minter.","(11:39) Carson Palmer pass to the left to J.J. Nelson for 17 yards to the SF49. Tackled by Keith Reaser. FUMBLE, recovered by SF (Antoine Bethea) and returned for 5 yards. Tackled by J.J. Nelson.","(12:18) David Johnson rush to the left for 3 yards to the Ari34. Tackled by Ahmad Brooks.","(12:25) Carson Palmer incomplete pass to the middle intended for J.J. Nelson defensed by Jimmie Ward.","(12:35) Bradley Pinion punts for 52 yards to Ari26. John Brown return for 5 yards to Ari31. Tackled by Garrett Celek.","(13:09) Colin Kaepernick sacked at SF22 for a loss of 4 yards by Chandler Jones.","(13:35) Carlos Hyde rush up the middle for a loss of 2 yards to the SF26. Tackled by Tony Jefferson.","(14:05) Colin Kaepernick rush to the left for 2 yards to the SF28. Tackled by Deone Bucannon.","(14:13) Ryan Quigley punts for 43 yards to SF26. No return.","(14:17) Carson Palmer incomplete pass to the middle intended for Larry Fitzgerald defensed by Jimmie Ward.","(14:21) Carson Palmer incomplete pass to the left intended for Jermaine Gresham.","(15:00) David Johnson rush to the right for 6 yards to the Ari31. Tackled by DeForest Buckner.","(15:00) Bradley Pinion kicks off to the endzone. Touchback."]