["(0:34) Eli Manning rush up the middle for a loss of 1 yard to the Cin23.","(1:24) Eli Manning rush up the middle for a loss of 1 yard to the Cin22.","(2:00) Rashad Jennings rush up the middle for 25 yards to the Cin21. Tackled by Darqueze Dennard.","(2:00) Two Minute Warning.","(2:07) Rashad Jennings rush to the left for no gain to the Cin46. Tackled by Vontaze Burfict and Vincent Rey.","(2:07) New York Giants timeout.","(2:50) Rashad Jennings rush up the middle for 9 yards to the Cin46. Tackled by Geno Atkins and George Iloka.","(2:50) Cincinnati Bengals timeout.","(2:56) Rashad Jennings rush to the left for 3 yards to the NYG45. Tackled by Michael Johnson and Vincent Rey.","(2:56) Cincinnati Bengals timeout.","(3:01) Rashad Jennings rush to the left for 1 yard to the NYG42. Tackled by Vincent Rey and Domata Peko.","(3:08) Kevin Huber punts for 43 yards to NYG41. No return.","(3:41) Andy Dalton sacked at Cin16 for a loss of 7 yards by Olivier Vernon.","(4:05) Andy Dalton sacked at Cin23 for a loss of 7 yards by Jonathan Casillas and Damon Harrison.","(4:11) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(4:55) Andy Dalton rush up the middle for 15 yards to the Cin30. Tackled by Janoris Jenkins.","(5:39) Giovani Bernard rush to the right for a loss of 1 yard to the Cin15. Tackled by Damon Harrison and Coty Sensabaugh.","(6:17) Giovani Bernard rush to the left for 7 yards to the Cin16. Tackled by Landon Collins.","(6:23) Brad Wing punts for 37 yards to Cin9. No return.","(6:27) Eli Manning incomplete pass to the right intended for Rashad Jennings.","(7:10) Eli Manning pass to the right to Will Tye for 5 yards to the Cin46. Tackled by Karlos Dansby and Dre Kirkpatrick.","(7:53) Rashad Jennings rush to the right for 2 yards to the NYG49. Tackled by Vontaze Burfict and Pat Sims.","(8:21) Eli Manning pass to the right to Odell Beckham Jr. for 7 yards to the NYG47. Tackled by Pat Sims.","(8:53) Rashad Jennings rush to the right for 5 yards to the NYG40. Tackled by Carlos Dunlap and Dre Kirkpatrick.","(9:09) Kevin Huber punts for 52 yards to NYG27. Bobby Rainey return for 8 yards to NYG35. Tackled by Tyler Kroft.","(10:05) Jeremy Hill rush to the left for no gain to the Cin21. Tackled by Damon Harrison and Olivier Vernon.","(10:44) Andy Dalton pass to the right to A.J. Green for 8 yards to the Cin21. Tackled by Janoris Jenkins.","(11:22) Andy Dalton pass to the right to Tyler Boyd for 1 yard to the Cin13. Tackled by Jason Pierre-Paul and Dominique Rodgers-Cromartie.","(11:31) Eli Manning pass intended for Tavarres King INTERCEPTED by George Iloka. No return. Tackled by Tavarres King.","(11:35) Andy Dalton pass intended for Tyler Kroft INTERCEPTED by Landon Collins. No return. Tackled by Tyler Kroft.","(12:11) Jeremy Hill rush to the left for 1 yard to the Cin39. Tackled by Jason Pierre-Paul and Andrew Adams.","(12:19) Penalty: Holding on New York (Janoris Jenkins) 5 yards.","(12:19) Penalty: Delay of Game on Cincinnati (Andy Dalton) -5 yards.","(12:27) Andy Dalton incomplete pass to the right.","(13:11) Jeremy Hill rush to the left for no gain to the Cin38. Tackled by Kelvin Sheppard and Olivier Vernon.","(13:50) Andy Dalton pass to the right to Tyler Eifert for 20 yards to the Cin38. Tackled by Janoris Jenkins.","(13:55) Andy Dalton incomplete pass to the right intended for Tyler Eifert defensed by Jason Pierre-Paul.","(14:00) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Janoris Jenkins.","(14:05) Robbie Gould kicks off to the Cin3. Alex Erickson return for 15 yards to Cin18. Tackled by Paul Perkins and Owamagbe Odighizuwa.","(14:05) Robbie Gould extra point is good.","(14:12) Eli Manning pass to the left to Sterling Shepard for 3 yards for a TOUCHDOWN.","(14:57) Eli Manning pass to the left to Tavarres King for 6 yards to the Cin3. Tackled by Vontaze Burfict and Darqueze Dennard.","(15:00) Eli Manning incomplete pass to the right intended for Will Tye.","(0:10) Rashad Jennings rush to the right for no gain to the Cin9. Tackled by Shawn Williams.","(0:51) Rashad Jennings rush to the left for 24 yards to the Cin9. Tackled by George Iloka and Dre Kirkpatrick.","(1:30) Eli Manning pass to the middle to Rashad Jennings for 3 yards to the Cin33. Tackled by Vontaze Burfict and George Iloka.","(1:56) Eli Manning pass to the middle to Odell Beckham Jr. for 11 yards to the Cin36. Tackled by Darqueze Dennard.","(2:08) Kevin Huber punts for 50 yards to NYG44. Bobby Rainey return for 9 yards to Cin47. Tackled by Vincent Rey.","(2:13) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(2:13) Cincinnati Bengals timeout.","(2:57) Jeremy Hill rush to the left for a loss of 1 yard to the Cin6. Tackled by Johnathan Hankins.","(3:33) Jeremy Hill rush to the right for 2 yards to the Cin7. Tackled by Olivier Vernon and Damon Harrison.","(3:40) Brad Wing punts for 35 yards to Cin10. No return. Penalty: Illegal Block on Cincinnati (Darqueze Dennard) -5 yards.","(3:45) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(4:23) Eli Manning pass to the right to Will Tye for 6 yards to the Cin45. Tackled by Vincent Rey.","(4:26) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(4:32) Penalty: Pass Interference on Cincinnati (Dre Kirkpatrick) 10 yards.","(5:10) Paul Perkins rush to the left for no gain to the NYG39. Tackled by Vincent Rey and Vontaze Burfict.","(5:39) Paul Perkins rush to the left for 9 yards to the NYG39. Tackled by Michael Johnson and Vincent Rey.","(5:53) Kevin Huber punts for 53 yards to NYG15. Bobby Rainey return for 15 yards to NYG30. Tackled by Rex Burkhead and Vincent Rey.","(6:03) Andy Dalton incomplete pass to the left intended for A.J. Green.","(6:32) Giovani Bernard rush to the left for 1 yard to the Cin42. Tackled by Trevin Wade. Penalty: Holding on Cincinnati (Andrew Whitworth) -10 yards.","(7:18) Giovani Bernard rush to the right for 3 yards to the Cin41. Tackled by Damon Harrison and Olivier Vernon.","(7:47) Giovani Bernard rush to the left for 5 yards to the Cin38. Tackled by Landon Collins.","(8:02) Brad Wing punts for 51 yards to Cin25. Alex Erickson return for 8 yards to Cin33. Tackled by Nat Berhe and Mark Herzlich.","(8:35) Eli Manning pass to the left to Sterling Shepard for 6 yards to the NYG24. Tackled by Darqueze Dennard.","(8:40) Eli Manning incomplete pass to the right intended for Rashad Jennings defensed by Carlos Dunlap.","(8:46) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(8:52) Mike Nugent kicks off to the NYG2. Bobby Rainey return for 16 yards to NYG18. Tackled by Rex Burkhead and Clayton Fejedelem.","(8:56) Mike Nugent 38 yard field goal attempt is GOOD. Holder: Kevin Huber.","(9:04) Andy Dalton incomplete pass to the middle intended for Tyler Boyd defensed by Trevin Wade.","(9:48) Jeremy Hill rush to the left for 2 yards to the NYG20. Tackled by Devon Kennard and Olivier Vernon.","(10:31) Jeremy Hill rush to the right for 3 yards to the NYG22. Tackled by Olivier Vernon and Jason Pierre-Paul.","(11:13) Andy Dalton pass to the left to A.J. Green for 21 yards to the NYG25. Tackled by Landon Collins.","(11:50) Jeremy Hill rush to the left for 6 yards to the NYG46. Tackled by Jonathan Casillas and Jason Pierre-Paul.","(12:25) Jeremy Hill rush to the left for 9 yards to the Cin48. Tackled by Landon Collins.","(12:37) Brad Wing punts for 48 yards to Cin21. Alex Erickson return for 18 yards to Cin39. Tackled by Bobby Rainey and B.J. Goodson.","(12:47) Eli Manning incomplete pass to the right intended for Roger Lewis.","(13:28) Rashad Jennings rush to the left for 3 yards to the NYG31. Tackled by Michael Johnson and Vontaze Burfict.","(13:58) Eli Manning pass to the right to Rashad Jennings for 3 yards to the NYG28. Tackled by Vincent Rey.","(13:58) Mike Nugent kicks off to the endzone. Touchback.","(13:58) Mike Nugent extra point is good.","(14:05) Jeremy Hill rush to the left for 9 yards for a TOUCHDOWN.","(14:46) Jeremy Hill rush to the right for 4 yards to the NYG9. Tackled by Coty Sensabaugh and Jonathan Casillas.","(15:00) Robbie Gould kicks off to the Cin3. Alex Erickson return for 84 yards to NYG13. Tackled by Coty Sensabaugh.","(0:03) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Odell Beckham Jr. defensed by Dominique Rodgers-Cromartie.","(0:03) Cincinnati Bengals timeout.","(0:11) Andy Dalton pass to the left to Tyler Eifert for 5 yards to the Cin50. Tackled by Coty Sensabaugh.","(0:17) Andy Dalton pass to the right to A.J. Green for 14 yards to the Cin45. Tackled by Janoris Jenkins.","(0:40) Andy Dalton pass to the left to Brandon LaFell for 9 yards to the Cin31. Tackled by Eli Apple.","(1:11) Giovani Bernard rush to the left for 2 yards to the Cin22. Tackled by Jay Bromley and Keenan Robinson.","(1:17) Robbie Gould kicks off to the Cin-3. Alex Erickson return for 23 yards to Cin20. Tackled by Romeo Okwara.","(1:17) Robbie Gould extra point is good.","(1:24) Eli Manning pass to the left to Odell Beckham Jr. for 10 yards for a TOUCHDOWN.","(1:57) Paul Perkins rush to the left for 5 yards to the Cin10. Tackled by Vontaze Burfict and Karlos Dansby.","(1:57) Two Minute Warning.","(2:05) Eli Manning pass to the left to Sterling Shepard for 10 yards to the Cin15. Tackled by Darqueze Dennard.","(2:26) Eli Manning rush to the left for 6 yards to the Cin30. Tackled by Josh Shaw. Penalty: Illegal Use of Hands on Cincinnati (Josh Shaw) 5 yards.","(3:05) Paul Perkins rush to the left for 8 yards to the Cin36. Tackled by Will Clarke.","(3:35) Eli Manning pass to the middle to Jerell Adams for 8 yards to the Cin44. Tackled by Vincent Rey and Josh Shaw.","(3:42) Penalty: Offside on Cincinnati (Carlos Dunlap) 5 yards.","(4:12) Eli Manning pass to the left to Odell Beckham Jr. for 18 yards to the NYG43. Tackled by Shawn Williams.","(4:19) Eli Manning incomplete pass to the right intended for Will Tye.","(4:19) Mike Nugent kicks off to the endzone. Touchback.","(4:30) Mike Nugent 25 yard field goal attempt is GOOD. Holder: Kevin Huber.","(5:05) Andy Dalton pass to the right to A.J. Green for no gain to the NYG7. Tackled by Janoris Jenkins.","(5:09) Andy Dalton incomplete pass to the left intended for Tyler Eifert.","(5:13) Andy Dalton incomplete pass to the right intended for Giovani Bernard.","(5:27) Eli Manning pass intended for Roger Lewis INTERCEPTED by Dre Kirkpatrick and returned for 21 yards. Tackled by Roger Lewis.","(6:06) Rashad Jennings rush to the left for 3 yards to the NYG22. Tackled by Wallace Gilberry.","(6:35) Eli Manning pass to the middle to Sterling Shepard for 10 yards to the NYG19. Tackled by Darqueze Dennard.","(7:13) Eli Manning pass to the left to Will Tye for 7 yards to the NYG9. Tackled by Vincent Rey and Adam Jones.","(7:45) Rashad Jennings rush up the middle for 1 yard to the NYG2. Tackled by Vontaze Burfict and Domata Peko.","(7:56) Kevin Huber punts for 45 yards to NYG1. No return.","(8:32) Andy Dalton pass to the right to Giovani Bernard for 10 yards to the NYG46. Tackled by Landon Collins.","(9:13) Andy Dalton sacked at Cin44 for a loss of 4 yards by Robert Thomas.","(9:43) Andy Dalton pass to the left to Giovani Bernard for no gain to the Cin48. Tackled by Kelvin Sheppard and Jason Pierre-Paul.","(9:51) Eli Manning sacked at Cin48 for a loss of 11 yards by Geno Atkins.","(10:07) Eli Manning pass to the right to Odell Beckham Jr. for 7 yards to the Cin37. Tackled by George Iloka.","(10:07) Cincinnati Bengals timeout.","(10:12) Eli Manning incomplete pass to the left intended for Paul Perkins.","(10:42) Paul Perkins rush to the left for 1 yard to the Cin44. Tackled by Will Clarke.","(11:20) Eli Manning pass to the middle to Odell Beckham Jr. for 21 yards to the Cin45. Tackled by George Iloka.","(11:58) Paul Perkins rush to the right for 3 yards to the NYG34. Tackled by Vontaze Burfict and Vincent Rey.","(12:03) Eli Manning incomplete pass to the middle intended for Paul Perkins.","(12:41) Eli Manning pass to the right to Will Tye for 10 yards to the NYG31. Tackled by Karlos Dansby.","(13:24) Paul Perkins rush to the right for 1 yard to the NYG21. Tackled by Shawn Williams and Karlos Dansby.","(13:30) Eli Manning incomplete pass to the right intended for Paul Perkins.","(13:40) Kevin Huber punts for 51 yards to NYG12. Dwayne Harris return for 8 yards to NYG20. Tackled by Ryan Hewitt.","(13:49) Andy Dalton pass to the middle to A.J. Green for 11 yards to the Cin37. Tackled by Dominique Rodgers-Cromartie.","(14:15) Penalty: Holding on Cincinnati (Giovani Bernard) -10 yards.","(14:18) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Jason Pierre-Paul.","(15:00) Giovani Bernard rush to the right for no gain to the Cin36. Tackled by Damon Harrison and Olivier Vernon.","(0:28) Andy Dalton pass to the right to Giovani Bernard for 9 yards to the Cin36. Tackled by Devon Kennard.","(1:09) Jeremy Hill rush to the left for 3 yards to the Cin27. Tackled by Damon Harrison and Olivier Vernon.","(1:22) Brad Wing punts for 55 yards to Cin15. Alex Erickson return for 9 yards to Cin24. Tackled by Zak DeOssie.","(1:27) Eli Manning incomplete pass to the middle intended for Will Tye defensed by Vontaze Burfict.","(1:59) Eli Manning pass to the right to Odell Beckham Jr. for 5 yards to the NYG30. Tackled by Dre Kirkpatrick.","(2:04) Eli Manning incomplete pass to the right intended for Rashad Jennings defensed by Karlos Dansby.","(2:27) Penalty: Illegal Block on New York (Marshall Newhouse) -10 yards.","(2:39) Paul Perkins rush to the left for 2 yards to the NYG30. Tackled by Michael Johnson. Penalty: Illegal Use of Hands on Cincinnati (Adam Jones) 5 yards.","(3:15) Eli Manning pass to the left to Odell Beckham Jr. for 7 yards to the NYG28. Tackled by Adam Jones.","(3:58) Eli Manning pass to the left to Odell Beckham Jr. for 5 yards to the NYG21. Tackled by Vincent Rey.","(4:28) Paul Perkins rush to the left for 2 yards to the NYG16. Tackled by Vincent Rey and Michael Johnson.","(4:35) Kevin Huber punts for 42 yards to NYG14. No return.","(5:17) Cincinnati Bengals timeout.","(5:17) Andy Dalton pass to the right to Tyler Boyd for 11 yards to the Cin44. Tackled by Trevin Wade and Keenan Robinson.","(5:59) Jeremy Hill rush to the left for a loss of 2 yards to the Cin33. Tackled by Olivier Vernon.","(6:07) Andy Dalton incomplete pass to the right intended for Giovani Bernard.","(6:48) Jeremy Hill rush to the left for 4 yards to the Cin35. Tackled by Kelvin Sheppard.","(7:31) Jeremy Hill rush to the right for 6 yards to the Cin31. Tackled by Damon Harrison.","(7:44) Brad Wing punts for 50 yards to Cin25. No return.","(7:52) Eli Manning incomplete pass to the right intended for Roger Lewis.","(8:32) Rashad Jennings rush to the right for 3 yards to the NYG25. Tackled by Vincent Rey and Domata Peko.","(8:53) Eli Manning pass to the right to Jerell Adams for no gain to the NYG22. Tackled by Vontaze Burfict. FUMBLE, recovered by NYG.","(8:58) Mike Nugent kicks off to the NYG1. Dwayne Harris return for 21 yards to NYG22. Tackled by Nick Vigil and Tyler Kroft.","(8:58) Mike Nugent extra point is good.","(9:04) Andy Dalton pass to the left to A.J. Green for 13 yards for a TOUCHDOWN.","(9:30) Penalty: Illegal Motion on Cincinnati (A.J. Green) -5 yards.","(10:17) Andy Dalton pass to the right to Tyler Eifert for 71 yards to the NYG8. Tackled by Jonathan Casillas.","(10:59) Andy Dalton pass to the left to A.J. Green for 1 yard to the Cin21. Tackled by Janoris Jenkins and Jonathan Casillas.","(11:05) Robbie Gould kicks off to the Cin-3. Alex Erickson return for 23 yards to Cin20. Tackled by Romeo Okwara and Orleans Darkwa.","(11:05) Robbie Gould extra point is good.","(11:12) Eli Manning pass to the left to Jerell Adams for 10 yards for a TOUCHDOWN.","(11:44) Eli Manning pass to the middle to Sterling Shepard for 13 yards to the Cin10. Tackled by George Iloka.","(12:18) Eli Manning pass to the right to Roger Lewis for 2 yards to the Cin23. Tackled by Dre Kirkpatrick.","(12:59) Eli Manning pass to the middle to Rashad Jennings for 16 yards to the Cin25. Tackled by George Iloka.","(13:19) Rashad Jennings rush to the left for 5 yards to the Cin41. Tackled by Adam Jones.","(13:57) Rashad Jennings rush to the left for 3 yards to the Cin46. Tackled by George Iloka and Vincent Rey.","(14:26) Eli Manning pass to the left to Odell Beckham Jr. for 6 yards to the Cin49. Tackled by Vontaze Burfict.","(14:55) Eli Manning pass to the middle to Will Tye for 25 yards to the NYG45. Tackled by Shawn Williams and George Iloka.","(15:00) Mike Nugent kicks off to the NYG4. Dwayne Harris return for 16 yards to NYG20. Tackled by Marquis Flowers and Rex Burkhead."]