["(0:41) Ryan Mallett rush up the middle for a loss of 1 yard to the Cle31.","(1:15) Ryan Mallett rush up the middle for a loss of 2 yards to the Cle30.","(2:00) Chris Moore rush to the left for 10 yards to the Cle28. Tackled by Christian Kirksey.","(2:00) Two Minute Warning.","(2:24) Javorius Allen rush to the right for no gain to the Cle38. Tackled by Stephen Paea.","(3:07) Javorius Allen rush to the left for 3 yards to the Cle38. Tackled by Cam Johnson.","(3:17) Britton Colquitt punts for 51 yards to Bal48. Devin Hester return for 11 yards to Cle41. Tackled by Marcus Burley.","(3:20) Josh McCown incomplete pass to the left intended for Corey Coleman defensed by Brent Urban.","(3:27) Josh McCown incomplete pass to the middle intended for Isaiah Crowell defensed by Michael Pierce.","(4:07) Baltimore Ravens timeout.","(4:07) Isaiah Crowell rush to the right for no gain to the Cle1. Tackled by Brent Urban.","(4:09) Sam Koch punts for 39 yards to Cle1. No return.","(4:13) Joe Flacco incomplete pass to the left intended for Breshad Perriman.","(4:19) Penalty: Holding on Baltimore (Vladimir Ducasse) -10 yards.","(4:19) Baltimore Ravens timeout.","(4:25) Joe Flacco incomplete pass to the right intended for Kyle Juszczyk.","(5:08) Terrance West rush to the left for no gain to the Cle30. Tackled by Danny Shelton.","(5:15) Josh McCown sacked at Cle33 for a loss of 8 yards by Terrell Suggs. FUMBLE, recovered by Bal (Matt Judon) and returned for 3 yards. Tackled by Joe Thomas.","(5:40) Josh McCown pass to the right to Isaiah Crowell for 8 yards to the Cle41. Tackled by C.J. Mosley.","(5:48) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr. defensed by Tavon Young.","(6:21) Josh McCown pass to the middle to Gary Barnidge for 8 yards to the Cle33. Tackled by C.J. Mosley.","(6:21) Justin Tucker kicks off to the endzone. Touchback.","(6:21) Justin Tucker extra point is good.","(6:30) Joe Flacco pass to the left to Breshad Perriman for 27 yards for a TOUCHDOWN.","(7:10) Terrance West rush to the left for 4 yards to the Cle27. Tackled by Carl Nassib.","(7:53) Kenneth Dixon rush to the right for 10 yards to the Cle31. Tackled by Ed Reynolds.","(8:34) Terrance West rush to the left for 5 yards to the Cle41. Tackled by Christian Kirksey.","(9:18) Joe Flacco pass to the left to Kamar Aiken for 7 yards to the Cle46. Tackled by Jamie Collins and Ed Reynolds.","(10:06) Terrance West rush to the left for 3 yards to the Bal47. Tackled by Cam Johnson.","(10:34) Joe Flacco pass to the right to Breshad Perriman for 12 yards to the Bal44. Tackled by Demario Davis and Ibraheim Campbell.","(11:12) Terrance West rush to the left for no gain to the Bal32. Tackled by Tramon Williams and Jamie Collins.","(11:51) Kenneth Dixon rush to the right for 6 yards to the Bal32. Tackled by Ibraheim Campbell.","(12:34) Kenneth Dixon rush to the left for 5 yards to the Bal26. Tackled by Ibraheim Campbell.","(13:13) Terrance West rush to the right for 6 yards to the Bal21. Tackled by Christian Kirksey.","(13:48) Terrance West rush up the middle for 5 yards to the Bal15. Tackled by Ibraheim Campbell and Emmanuel Ogbah.","(14:03) Josh McCown pass intended for Terrelle Pryor Sr. INTERCEPTED by Eric Weddle and returned for 25 yards. Tackled by Isaiah Crowell. Penalty: Illegal Block on Baltimore (C.J. Mosley) -10 yards.","(14:32) Josh McCown sacked at Bal38 for a loss of 12 yards by Timmy Jernigan.","(15:00) Josh McCown pass to the middle to Duke Johnson Jr. for 15 yards to the Bal26. Tackled by Eric Weddle.","(0:05) Josh McCown pass to the right to Terrelle Pryor Sr. for 18 yards to the Bal41. Tackled by Jimmy Smith.","(0:47) Duke Johnson Jr. rush to the left for 6 yards to the Cle41. Tackled by Zachary Orr.","(1:22) Josh McCown pass to the left to Duke Johnson Jr. for 4 yards to the Cle35. Tackled by Tavon Young and Zachary Orr.","(2:05) Josh McCown pass to the right to Duke Johnson Jr. for 6 yards to the Cle31. Tackled by Eric Weddle.","(2:05) Justin Tucker kicks off to the endzone. Touchback.","(2:05) Joe Flacco 2 pt conversion pass to Kyle Juszczyk is GOOD.","(2:10) Joe Flacco pass to the middle to Steve Smith Sr. for 11 yards for a TOUCHDOWN.","(2:47) Joe Flacco pass to the middle to Dennis Pitta for 1 yard to the Cle11. Tackled by Jamie Meder.","(3:17) Terrance West rush to the left for 2 yards to the Cle12. Tackled by Christian Kirksey and Danny Shelton.","(3:59) Joe Flacco pass to the middle to Breshad Perriman for 25 yards to the Cle14. Tackled by Ed Reynolds.","(4:32) Kenneth Dixon rush to the right for no gain to the Cle39. Tackled by Danny Shelton and Emmanuel Ogbah.","(5:02) Joe Flacco pass to the middle to Dennis Pitta for 4 yards to the Cle39. Tackled by Briean Boddy-Calhoun.","(5:13) Britton Colquitt punts for 32 yards to Cle43. No return.","(5:52) Josh McCown sacked at Cle11 for a loss of 9 yards by Za'Darius Smith. FUMBLE, recovered by Cle (Josh McCown).","(6:35) Duke Johnson Jr. rush to the right for no gain to the Cle20. Tackled by Albert McClellan.","(6:39) Josh McCown incomplete pass to the left intended for Andrew Hawkins defensed by Jerraud Powers.","(6:49) Joe Flacco pass intended for Kenneth Dixon INTERCEPTED by Joe Haden. No return. Touchback.","(7:29) Terrance West rush up the middle for a loss of 1 yard to the Cle15. Tackled by Danny Shelton.","(8:09) Joe Flacco pass to the middle to Mike Wallace for 23 yards to the Cle14. Tackled by Briean Boddy-Calhoun.","(8:45) Terrance West rush to the left for 3 yards to the Cle37. Tackled by Christian Kirksey and Cam Johnson.","(8:52) Josh McCown pass intended for Gary Barnidge INTERCEPTED by Jerraud Powers defensed by Terrell Suggs and returned for 1 yard. Tackled by Corey Coleman.","(8:58) Josh McCown incomplete pass to the middle intended for Isaiah Crowell.","(9:36) Isaiah Crowell rush to the left for 2 yards to the Cle27. Tackled by Eric Weddle.","(9:36) Justin Tucker kicks off to the endzone. Touchback.","(9:36) Justin Tucker extra point is good.","(9:41) Joe Flacco pass to the middle to Darren Waller for 4 yards for a TOUCHDOWN.","(10:16) Terrance West rush to the right for 1 yard to the Cle4. Tackled by Cam Johnson.","(10:22) Joe Flacco incomplete pass to the right intended for Terrance West.","(11:01) Joe Flacco pass to the left to Steve Smith Sr. for 12 yards to the Cle5. Tackled by Tramon Williams.","(11:32) Joe Flacco pass to the left to Dennis Pitta for 5 yards to the Cle17. Tackled by Tramon Williams.","(12:03) Kenneth Dixon rush to the right for 6 yards to the Cle22. Tackled by Jamie Collins.","(12:40) Joe Flacco pass to the left to Terrance West for 12 yards to the Cle28. Tackled by Ed Reynolds.","(13:08) Terrance West rush to the right for 4 yards to the Cle40. Tackled by Ibraheim Campbell and Carl Nassib.","(13:34) Joe Flacco pass to the left to Mike Wallace for 20 yards to the Cle44. Tackled by Ed Reynolds.","(13:41) Britton Colquitt punts for 40 yards to Bal36. No return.","(13:50) Cody Kessler incomplete pass to the right intended for Duke Johnson Jr..","(14:33) Cody Kessler pass to the right to Corey Coleman for a loss of 3 yards to the Cle24. Tackled by Tavon Young.","(15:00) Isaiah Crowell rush to the right for 2 yards to the Cle27. Tackled by Timmy Jernigan.","(15:00) Justin Tucker kicks off to the endzone. Touchback.","(0:04) Justin Tucker 40 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:09) Joe Flacco incomplete pass to the middle.","(0:23) Joe Flacco pass to the left to Dennis Pitta for no gain to the Cle22. Tackled by Christian Kirksey.","(0:33) Joe Flacco pass to the right to Dennis Pitta for 13 yards to the Cle37. Tackled by Ibraheim Campbell. Penalty: Unnecessary Roughness on Cleveland (Ibraheim Campbell) 15 yards.","(0:37) Joe Flacco incomplete pass to the right intended for Steve Smith Sr. defensed by Christian Kirksey.","(0:41) Joe Flacco incomplete pass to the middle intended for Kamar Aiken defensed by Tramon Williams.","(0:41) Baltimore Ravens timeout.","(0:49) Joe Flacco pass to the left to Mike Wallace for 9 yards to the Bal50. Tackled by Ibraheim Campbell.","(0:49) Baltimore Ravens timeout.","(0:55) Joe Flacco pass to the right to Mike Wallace for 7 yards to the Bal41. Tackled by Joe Haden.","(0:55) Baltimore Ravens timeout.","(1:01) Joe Flacco pass to the left to Kyle Juszczyk for 1 yard to the Bal34. Tackled by Jamie Collins.","(1:06) Joe Flacco pass to the left to Steve Smith Sr. for 14 yards to the Bal33.","(1:12) Joe Flacco incomplete pass to the right intended for Kenneth Dixon.","(1:18) Penalty: Holding on Baltimore (Vladimir Ducasse) -10 yards.","(1:39) Joe Flacco pass to the middle to Kenneth Dixon for 8 yards to the Bal29. Tackled by Ibraheim Campbell and Christian Kirksey.","(1:45) Britton Colquitt punts for 40 yards to Bal31. Lardarius Webb - no return. Tackled by Ibraheim Campbell. Penalty: Holding on Baltimore (Matt Judon) -10 yards.","(1:56) Cody Kessler incomplete pass to the left intended for Terrelle Pryor Sr. defensed by Jimmy Smith.","(1:56) Two Minute Warning.","(2:01) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr..","(2:34) Cody Kessler pass to the right to Isaiah Crowell for 2 yards to the Cle29. Tackled by Tavon Young.","(3:10) Cody Kessler pass to the right to Terrelle Pryor Sr. for 7 yards to the Cle27. Tackled by Jimmy Smith.","(3:26) Penalty: Offside on Baltimore (Timmy Jernigan) 5 yards.","(3:37) Sam Koch punts for 50 yards to Cle14. Duke Johnson Jr. return for 1 yard to Cle15. Tackled by Darren Waller.","(4:24) Joe Flacco sacked at Bal36 for a loss of 10 yards by Demario Davis.","(5:03) Terrance West rush up the middle for a loss of 2 yards to the Bal46. Tackled by Jamie Meder.","(5:50) Joe Flacco pass to the left to Kyle Juszczyk for 3 yards to the Bal48. Tackled by Tramon Williams.","(6:24) Joe Flacco pass to the left to Kenneth Dixon for 16 yards to the Bal45. Tackled by Christian Kirksey.","(6:30) Cody Parkey kicks off to the Bal1. Devin Hester return for 28 yards to Bal29. Tackled by Dominique Alexander.","(6:30) Cody Parkey extra point is good.","(6:36) Cody Kessler pass to the right to Seth DeValve for 25 yards for a TOUCHDOWN.","(7:20) Isaiah Crowell rush up the middle for 3 yards to the Bal25. Tackled by Brandon Williams.","(7:54) Isaiah Crowell rush to the left for 9 yards to the Bal28. Tackled by C.J. Mosley.","(8:20) Cody Kessler pass to the left to Terrelle Pryor Sr. for 7 yards to the Bal37. Tackled by Albert McClellan.","(8:27) Penalty: Pass Interference on Baltimore (Tavon Young) 16 yards.","(9:06) Cody Kessler pass to the right to Randall Telfer for a loss of 3 yards to the Cle40. Tackled by Albert McClellan.","(9:49) Cody Kessler pass to the right to Terrelle Pryor Sr. for 13 yards to the Cle43. Tackled by Jimmy Smith.","(10:29) Isaiah Crowell rush to the right for 5 yards to the Cle30. Tackled by C.J. Mosley and Za'Darius Smith.","(10:29) Justin Tucker kicks off to the endzone. Touchback.","(10:33) Justin Tucker 25 yard field goal attempt is GOOD. Holder: Sam Koch.","(10:40) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(11:16) Terrance West rush to the right for 3 yards to the Cle7. Tackled by Cam Johnson and Emmanuel Ogbah.","(11:51) Joe Flacco rush to the left for 3 yards to the Cle10. Tackled by Christian Kirksey.","(12:27) Joe Flacco pass to the left to Kenneth Dixon for 12 yards to the Cle13. Tackled by Ed Reynolds.","(13:04) Terrance West rush to the left for 2 yards to the Cle25. Tackled by Christian Kirksey and Danny Shelton.","(13:47) Joe Flacco pass to the right to Steve Smith Sr. for 17 yards to the Cle27. Tackled by Briean Boddy-Calhoun.","(14:22) Terrance West rush to the left for 4 yards to the Cle44. Tackled by Jamie Collins.","(14:30) Britton Colquitt punts for 41 yards to Cle48. No return.","(14:34) Cody Kessler incomplete pass to the left intended for Corey Coleman defensed by Tavon Young.","(15:00) Cody Kessler pass to the left to Terrelle Pryor Sr. for 3 yards to the Cle7. Tackled by Jimmy Smith.","(0:10) Cody Kessler rush up the middle for 3 yards to the Cle4. Tackled by Zachary Orr.","(0:17) Joe Flacco pass intended for Steve Smith Sr. INTERCEPTED by Briean Boddy-Calhoun. No return.","(0:48) Kenneth Dixon rush up the middle for 11 yards to the Cle34. Tackled by Tracy Howard.","(1:25) Joe Flacco pass to the left to Kenneth Dixon for 1 yard to the Cle45. Tackled by Tracy Howard.","(2:08) Kyle Juszczyk rush up the middle for 3 yards to the Cle46. Tackled by Jamie Collins and Demario Davis.","(2:45) Joe Flacco pass to the right to Kamar Aiken for 8 yards to the Cle49. Tackled by Tramon Williams.","(3:23) Terrance West rush to the right for 17 yards to the Bal43. Tackled by Tracy Howard.","(3:31) Penalty: Illegal Contact on Cleveland (Tramon Williams) 5 yards.","(4:05) Joe Flacco pass to the middle to Dennis Pitta for 3 yards to the Bal21. Tackled by Derrick Kindred.","(4:12) Britton Colquitt punts for 42 yards to Bal18. No return.","(4:17) Cody Kessler incomplete pass to the right intended for Gary Barnidge.","(4:59) Kevin Hogan rush up the middle for 1 yard to the Cle40. Tackled by C.J. Mosley.","(5:32) Isaiah Crowell rush to the left for a loss of 2 yards to the Cle39. Tackled by Michael Pierce.","(6:21) Cody Kessler pass to the left to Isaiah Crowell for 20 yards to the Cle41. Tackled by Eric Weddle.","(7:00) Isaiah Crowell rush up the middle for 1 yard to the Cle21. Tackled by Lawrence Guy.","(7:07) Sam Koch punts for 46 yards to Cle0. Touchback.","(7:40) Joe Flacco sacked at Cle46 for a loss of 9 yards by Jamie Collins.","(8:19) Terrance West rush to the right for 3 yards to the Cle37. Tackled by Emmanuel Ogbah.","(8:54) Terrance West rush to the left for 3 yards to the Cle40. Tackled by Christian Kirksey and Jamie Meder.","(9:02) Penalty: Roughing Passer on Cleveland (Emmanuel Ogbah) 15 yards.","(9:42) Joe Flacco pass to the middle to Darren Waller for 10 yards to the Bal42. Tackled by Jamie Collins.","(9:54) Britton Colquitt punts for 54 yards to Bal16. Devin Hester return for 16 yards to Bal32. Tackled by Briean Boddy-Calhoun.","(10:28) Cody Kessler sacked at Cle30 for a loss of 10 yards by Lardarius Webb.","(10:28) Cleveland Browns timeout.","(10:35) Cody Kessler incomplete pass to the left intended for Duke Johnson Jr..","(11:19) Isaiah Crowell rush to the right for 3 yards to the Cle40. Tackled by Albert McClellan.","(11:44) Cody Kessler pass to the left to Corey Coleman for 13 yards to the Cle37. Tackled by Zachary Orr.","(12:08) Cody Kessler pass to the right to Corey Coleman for 7 yards to the Cle24. Tackled by Tavon Young.","(12:13) Cody Kessler incomplete pass to the right intended for Gary Barnidge.","(12:27) Sam Koch punts for 49 yards to Cle20. Duke Johnson Jr. return for a loss of 3 yards to Cle17. Tackled by Chris Moore.","(12:34) Joe Flacco incomplete pass to the right intended for Kamar Aiken defensed by Joe Haden.","(13:12) Joe Flacco pass to the right to Kenneth Dixon for 5 yards to the Bal31. Tackled by Christian Kirksey.","(13:45) Terrance West rush to the left for a loss of 1 yard to the Bal26. Tackled by Jamie Collins.","(14:26) Joe Flacco pass to the left to Steve Smith Sr. for 6 yards to the Bal27. Tackled by Jamie Collins.","(14:55) Terrance West rush to the right for 4 yards to the Bal21. Tackled by Christian Kirksey.","(14:55) Cleveland Browns timeout.","(15:00) Cody Parkey kicks off to the Bal3. Devin Hester return for 14 yards to Bal17. Tackled by Cam Johnson."]