["(0:35) Marcus Mariota rush up the middle for a loss of 1 yard to the GB46.","(0:41) Brett Hundley incomplete pass to the right intended for Jeff Janis defensed by Perrish Cox.","(0:45) Brett Hundley incomplete pass to the middle intended for Jeff Janis.","(0:51) Brett Hundley incomplete pass to the right intended for Jeff Janis defensed by Jason McCourty.","(0:58) Brett Hundley pass to the left to Ty Montgomery for 8 yards to the GB45. Tackled by Jason McCourty.","(1:10) Brett Kern punts for 46 yards to GB25. Trevor Davis return for 12 yards to GB37. Tackled by Nate Palmer.","(2:00) Marcus Mariota sacked at Ten29 for a loss of 8 yards by Datone Jones.","(2:00) Two Minute Warning.","(2:46) Derrick Henry rush to the left for 4 yards to the Ten37. Tackled by Kentrell Brice.","(3:32) Derrick Henry rush to the right for 2 yards to the Ten33. Tackled by Morgan Burnett.","(3:42) Jacob Schum punts for 57 yards to Ten20. Marc Mariani return for 11 yards to Ten31. Tackled by Jayrone Elliott.","(3:47) Aaron Rodgers incomplete pass to the right intended for Davante Adams.","(3:54) Aaron Rodgers incomplete pass to the left intended for Trevor Davis.","(4:00) Aaron Rodgers sacked at GB23 for a loss of 8 yards by Brian Orakpo.","(4:27) Aaron Rodgers pass to the right to Richard Rodgers for 5 yards to the GB31. Tackled by Kevin Byard.","(4:47) Aaron Rodgers pass to the right to Richard Rodgers for 6 yards to the GB26. Tackled by Kevin Byard.","(4:52) Ryan Succop kicks off to the GB-8. Jeff Janis return for 28 yards to GB20. Tackled by Da'Norris Searcy.","(4:56) Ryan Succop 23 yard field goal attempt is GOOD. Holder: Brett Kern.","(5:43) Marcus Mariota rush to the left for 1 yard to the GB5. Tackled by Blake Martinez.","(5:43) Green Bay Packers timeout.","(5:50) DeMarco Murray rush to the right for 2 yards to the GB6. Tackled by Joe Thomas and Blake Martinez.","(5:50) Green Bay Packers timeout.","(5:57) DeMarco Murray rush up the middle for 2 yards to the GB8. Tackled by Kenny Clark.","(6:40) DeMarco Murray rush to the right for 6 yards to the GB10. Tackled by Micah Hyde.","(7:19) DeMarco Murray rush to the right for 4 yards to the GB16. Tackled by Demetri Goodson and Blake Martinez.","(8:03) Marcus Mariota pass to the right to Rishard Matthews for 22 yards to the GB20. Tackled by Micah Hyde.","(8:46) DeMarco Murray rush to the left for 9 yards to the GB42. Tackled by Joe Thomas.","(8:46) Green Bay Packers timeout.","(8:55) DeMarco Murray rush to the right for a loss of 2 yards to the Ten49. Tackled by Jayrone Elliott.","(9:06) Aaron Rodgers pass intended for Richard Rodgers INTERCEPTED by Perrish Cox. No return. Tackled by Richard Rodgers.","(9:51) Aaron Rodgers sacked at GB16 for a loss of 9 yards by Derrick Morgan.","(9:55) Aaron Rodgers incomplete pass to the middle intended for Jordy Nelson.","(9:56) Ryan Succop kicks off to the endzone. Touchback.","(10:01) Ryan Succop 51 yard field goal attempt is GOOD. Holder: Brett Kern.","(10:50) Marcus Mariota pass to the right to Delanie Walker for 8 yards to the GB33. Tackled by Kentrell Brice and Ha Ha Clinton-Dix.","(10:55) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe defensed by Ladarius Gunter.","(11:35) DeMarco Murray rush up the middle for 1 yard to the GB41. Tackled by Blake Martinez and Mike Pennel.","(12:00) Marcus Mariota rush to the left for 2 yards to the Ten43. Tackled by Ha Ha Clinton-Dix. Penalty: Unnecessary Roughness on Green Bay (Ha Ha Clinton-Dix) 15 yards.","(12:07) Aaron Rodgers incomplete pass to the right intended for Richard Rodgers.","(12:15) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Perrish Cox.","(12:20) Aaron Rodgers incomplete pass to the middle intended for Randall Cobb.","(12:52) James Starks rush to the right for 1 yard to the Ten41. Tackled by Kevin Byard.","(13:34) Aaron Rodgers pass to the right to Jordy Nelson for 17 yards to the Ten42. Tackled by Brice McCain.","(13:34) Penalty: False Start on Green Bay (Don Barclay) -5 yards.","(13:44) Brett Kern punts for 42 yards to GB44. Micah Hyde return for 2 yards to GB46. Tackled by Valentino Blake.","(14:19) Marcus Mariota sacked at Ten14 for a loss of 13 yards by Morgan Burnett.","(15:00) Marcus Mariota pass to the middle to Delanie Walker for 8 yards to the Ten27. Tackled by Blake Martinez.","(0:18) Penalty: False Start on Tennessee (Jack Conklin) -5 yards.","(0:57) DeMarco Murray rush to the left for a loss of 1 yard to the Ten24. Tackled by Ha Ha Clinton-Dix and Nick Perry.","(0:57) Mason Crosby kicks off to the endzone. Touchback.","(1:02) Mason Crosby 38 yard field goal attempt is GOOD. Holder: Jacob Schum.","(1:44) Aaron Rodgers pass to the middle to Randall Cobb for 11 yards to the Ten20. Tackled by Sean Spence.","(2:28) Aaron Rodgers sacked at Ten31 for a loss of 11 yards by Brian Orakpo.","(2:28) Penalty: Delay of Game on Green Bay (Aaron Rodgers) -5 yards.","(2:36) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(2:42) Penalty: Offside on Tennessee (Jurrell Casey) 5 yards.","(2:59) Aaron Rodgers pass to the left to Randall Cobb for 6 yards to the Ten20. Tackled by Brice McCain.","(3:38) Aaron Rodgers pass to the right to Jordy Nelson for 3 yards to the Ten26. Tackled by Kevin Byard.","(4:19) James Starks rush up the middle for 3 yards to the Ten29. Tackled by Derrick Morgan.","(4:49) Aaron Rodgers pass to the middle to Jordy Nelson for 14 yards to the Ten32. Tackled by Jason McCourty.","(5:35) Aaron Rodgers pass to the right to Ty Montgomery for 3 yards to the Ten46. Tackled by Valentino Blake.","(5:41) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Valentino Blake.","(6:22) Aaron Rodgers pass to the middle to Geronimo Allison for 17 yards to the Ten49. Tackled by Wesley Woodyard.","(6:27) Ryan Succop kicks off to the GB11. Ty Montgomery return for 23 yards to GB34. Tackled by Phillip Supernaw and David Bass.","(6:27) Marcus Mariota 2 pt conversion pass is NO GOOD - intended for Rishard Matthews.","(6:35) Marcus Mariota pass to the right to Tajae Sharpe for 33 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Tennessee (Tajae Sharpe) -15 yards.","(7:15) Marcus Mariota pass to the right to Kendall Wright for 2 yards to the GB33. Tackled by Nick Perry.","(7:46) DeMarco Murray rush up the middle for 3 yards to the GB35. Tackled by Blake Martinez.","(8:17) Marcus Mariota pass to the right to DeMarco Murray for a loss of 2 yards to the Ten47. Tackled by Quinten Rollins. Penalty: Unsports. Conduct on Green Bay (Mike Daniels) 15 yards.","(8:53) DeMarco Murray rush to the right for 4 yards to the Ten49. Tackled by Quinten Rollins.","(8:53) Mason Crosby onside kickoff to the Ten40. No return. Penalty: Offside on Green Bay 5 yards.","(8:53) James Starks 2 pt rush attempt.","(9:02) Aaron Rodgers rush up the middle for 20 yards for a TOUCHDOWN. Penalty: Unnecessary Roughness on Tennessee (Perrish Cox) 15 yards.","(9:46) Aaron Rodgers pass to the right to James Starks for 2 yards to the Ten20. Tackled by Brice McCain.","(10:25) Aaron Rodgers pass to the left to Davante Adams for 35 yards to the Ten22. Tackled by Jason McCourty.","(10:30) Aaron Rodgers incomplete pass to the right intended for Justin Perillo.","(11:17) Aaron Rodgers pass to the left to Jordy Nelson for 5 yards to the GB43. Tackled by Kevin Byard.","(11:24) Aaron Rodgers incomplete pass to the left intended for James Starks defensed by Sean Spence.","(11:49) James Starks rush to the right for 7 yards to the GB38. Tackled by Brice McCain.","(12:28) Aaron Rodgers rush up the middle for no gain to the GB31. Tackled by Jurrell Casey.","(12:59) Aaron Rodgers pass to the right to Jordy Nelson for 9 yards to the GB31. Tackled by Perrish Cox.","(13:05) Aaron Rodgers incomplete pass to the right intended for Randall Cobb.","(13:13) Brett Kern punts for 44 yards to GB22. No return.","(13:48) DeMarco Murray rush up the middle for 1 yard to the Ten34. Tackled by Morgan Burnett and Nick Perry.","(14:27) DeMarco Murray rush to the right for no gain to the Ten33. Tackled by Blake Martinez.","(15:00) Marcus Mariota pass to the left to Delanie Walker for 8 yards to the Ten33. Tackled by Ladarius Gunter.","(15:00) Mason Crosby kicks off to the endzone. Touchback.","(0:01) Aaron Rodgers pass intended for Davante Adams INTERCEPTED by Brice McCain and returned for 33 yards. Tackled by Bryan Bulaga.","(0:01) Green Bay Packers timeout.","(0:10) Aaron Rodgers rush to the left for 7 yards to the GB47. Tackled by Brian Orakpo.","(0:14) Marcus Mariota incomplete pass to the right intended for DeMarco Murray.","(0:14) Tennessee Titans timeout.","(0:21) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(0:26) Penalty: Delay of Game on Green Bay (Ha Ha Clinton-Dix) 5 yards.","(0:26) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(0:31) Marcus Mariota incomplete pass to the right intended for Kendall Wright.","(0:31) Tennessee Titans timeout.","(0:37) Marcus Mariota pass to the left to Tajae Sharpe for 14 yards to the GB45. Tackled by Ha Ha Clinton-Dix.","(0:43) Mason Crosby kicks off to the Ten13. Marc Mariani return for 28 yards to Ten41. Tackled by Kentrell Brice.","(0:43) Mason Crosby extra point is NO GOOD.","(0:51) Aaron Rodgers pass to the left to James Starks for 13 yards for a TOUCHDOWN.","(0:57) Aaron Rodgers pass to the left to Davante Adams for 6 yards to the Ten13.","(1:41) Aaron Rodgers pass to the middle to Davante Adams for 38 yards to the Ten19. Tackled by Rashad Johnson.","(1:45) Aaron Rodgers incomplete pass to the right intended for Richard Rodgers.","(1:51) Aaron Rodgers incomplete pass to the left intended for Geronimo Allison.","(1:55) Aaron Rodgers pass to the right to Jordy Nelson for 18 yards to the GB43.","(1:55) Ryan Succop kicks off to the endzone. Touchback.","(1:55) Ryan Succop extra point is good.","(2:00) Marcus Mariota pass to the right to Kendall Wright for 6 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:16) Marcus Mariota rush to the left for 6 yards to the GB6. Tackled by Ha Ha Clinton-Dix.","(2:22) Marcus Mariota incomplete pass to the right intended for Delanie Walker.","(2:35) Brett Kern punts for 34 yards to GB22. Trevor Davis - no return. FUMBLE, recovered by Ten (LeShaun Sims). Penalty: Unsports. Conduct on Green Bay (Kyler Fackrell) 12 yards.","(2:40) Marcus Mariota incomplete pass to the middle intended for Delanie Walker defensed by Kentrell Brice.","(2:40) Green Bay Packers timeout.","(2:43) Derrick Henry rush up the middle for a loss of 1 yard to the Ten44. Tackled by Nick Perry.","(3:16) Derrick Henry rush up the middle for 1 yard to the Ten45. Tackled by Nick Perry.","(3:55) Derrick Henry rush to the right for 19 yards to the Ten44. Tackled by Morgan Burnett.","(3:55) Mason Crosby kicks off to the endzone. Touchback.","(4:00) Mason Crosby 29 yard field goal attempt is GOOD. Holder: Jacob Schum.","(4:04) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Perrish Cox.","(4:49) Aaron Rodgers pass to the right to Richard Rodgers for 12 yards to the Ten11. Tackled by Daimion Stafford.","(5:33) Aaron Rodgers pass to the right to James Starks for a loss of 4 yards to the Ten23. Tackled by Jurrell Casey and Daimion Stafford.","(5:56) Penalty: Holding on Green Bay (Lane Taylor) -10 yards.","(6:41) Aaron Rodgers pass to the right to Jordy Nelson for 7 yards to the Ten9. Tackled by LeShaun Sims.","(7:00) Aaron Rodgers pass to the right to Jordy Nelson for 8 yards to the Ten16. Tackled by LeShaun Sims.","(7:41) Aaron Rodgers pass to the right to Jordy Nelson for 15 yards to the Ten24. Tackled by Da'Norris Searcy.","(8:19) Aaron Rodgers pass to the right to Davante Adams for 46 yards to the Ten39. Tackled by Da'Norris Searcy.","(8:45) Penalty: Holding on Green Bay (David Bakhtiari) -10 yards.","(8:45) Ryan Succop kicks off to the endzone. Touchback.","(8:45) Ryan Succop extra point is good.","(8:52) Marcus Mariota pass to the left to Rishard Matthews for 32 yards for a TOUCHDOWN.","(9:30) Marcus Mariota pass to the right to DeMarco Murray for 35 yards to the GB32. Tackled by Kentrell Brice.","(10:14) Marcus Mariota pass to the right to Delanie Walker for 2 yards to the Ten33. Tackled by Blake Martinez.","(10:49) DeMarco Murray rush to the right for 6 yards to the Ten31. Tackled by Kyler Fackrell.","(10:49) Mason Crosby kicks off to the endzone. Touchback.","(10:49) Mason Crosby extra point is good.","(10:53) Aaron Rodgers pass to the left to Jordy Nelson for 1 yard for a TOUCHDOWN.","(10:57) Penalty: Offside on Tennessee (Brian Orakpo) 0 yards.","(11:42) Aaron Rodgers pass to the right to Randall Cobb for 6 yards to the Ten1. Tackled by Avery Williamson.","(12:12) Aaron Rodgers pass to the left to Randall Cobb for 8 yards to the Ten7. Tackled by Jason McCourty.","(12:57) Aaron Rodgers pass to the left to Davante Adams for 17 yards to the Ten15. Tackled by Da'Norris Searcy.","(13:29) James Starks rush to the left for 11 yards to the Ten32. Tackled by Jason McCourty.","(13:59) Aaron Rodgers pass to the right to Davante Adams for 14 yards to the Ten43. Tackled by Rashad Johnson.","(14:30) Aaron Rodgers pass to the right to Richard Rodgers for 4 yards to the GB43. Tackled by Rashad Johnson.","(15:00) James Starks rush to the right for 5 yards to the GB39. Tackled by DaQuan Jones and Rashad Johnson.","(0:08) Aaron Rodgers pass to the right to Jordy Nelson for 9 yards to the GB34. Tackled by Perrish Cox.","(0:08) Ryan Succop kicks off to the endzone. Touchback.","(0:08) Ryan Succop extra point is good.","(0:13) Marcus Mariota pass to the left to Anthony Fasano for 9 yards for a TOUCHDOWN.","(0:59) Marcus Mariota pass to the middle to Delanie Walker for 19 yards to the GB9. Tackled by Ladarius Gunter.","(1:37) Derrick Henry rush to the right for a loss of 2 yards to the GB28. Tackled by Jayrone Elliott.","(2:15) Marcus Mariota pass to the right to Rishard Matthews for 9 yards to the GB26.","(2:46) Marcus Mariota pass to the right to Delanie Walker for 14 yards to the GB35. Tackled by Kentrell Brice.","(3:29) Derrick Henry rush up the middle for 1 yard to the GB49. Tackled by Joe Thomas and Morgan Burnett.","(4:08) Derrick Henry rush up the middle for 2 yards to the Ten50. Tackled by Datone Jones and Joe Thomas.","(4:48) Marcus Mariota pass to the left to Delanie Walker for 14 yards to the Ten48. Tackled by Ha Ha Clinton-Dix.","(5:25) Derrick Henry rush to the right for 5 yards to the Ten34. Tackled by Blake Martinez.","(5:35) Jacob Schum punts for 54 yards to Ten27. Marc Mariani return for 12 yards to Ten39. Tackled by Joe Thomas. Penalty: Holding on Tennessee (Nate Palmer) -10 yards.","(6:08) Aaron Rodgers sacked at GB19 for a loss of 8 yards by Kevin Byard.","(6:53) Ty Montgomery rush up the middle for 2 yards to the GB27. Tackled by Daimion Stafford and Austin Johnson.","(6:58) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(6:58) Ryan Succop kicks off to the endzone. Touchback.","(6:58) Ryan Succop extra point is good.","(7:04) DeMarco Murray pass to the right to Delanie Walker for 10 yards for a TOUCHDOWN.","(7:39) DeMarco Murray rush to the right for 2 yards to the GB10. Tackled by Blake Martinez.","(7:39) Green Bay Packers timeout.","(8:30) Marcus Mariota pass to the right to Delanie Walker for 41 yards to the GB12. Tackled by Joe Thomas.","(9:11) Marcus Mariota pass to the left to Tajae Sharpe for 21 yards to the Ten47. Tackled by Ha Ha Clinton-Dix.","(9:42) DeMarco Murray rush to the left for 10 yards to the Ten26. Tackled by Micah Hyde.","(10:24) DeMarco Murray rush up the middle for 1 yard to the Ten16. Tackled by Mike Daniels and Nick Perry.","(10:31) Penalty: Unnecessary Roughness on Green Bay (Letroy Guion) 15 yards. Penalty: Disqualification on Tennessee (Taylor Lewan) -15 yards.","(10:31) Jacob Schum punts for 48 yards to Ten15. No return.","(11:12) Aaron Rodgers sacked at GB37 for a loss of 10 yards by DaQuan Jones.","(11:15) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(11:44) Ty Montgomery rush up the middle for 2 yards to the GB47. Tackled by Avery Williamson.","(12:14) Penalty: False Start on Green Bay (David Bakhtiari) -5 yards.","(12:44) Aaron Rodgers pass to the left to Jordy Nelson for 20 yards to the GB50. Tackled by Rashad Johnson.","(12:48) Aaron Rodgers incomplete pass to the right intended for Randall Cobb.","(13:17) Ty Montgomery rush up the middle for 5 yards to the GB30. Tackled by Daimion Stafford.","(13:17) Ryan Succop kicks off to the endzone. Touchback.","(13:17) Ryan Succop extra point is good.","(13:28) DeMarco Murray rush to the left for 75 yards for a TOUCHDOWN.","(13:28) Penalty: Encroachment on Green Bay (Mike Daniels) 5 yards.","(13:38) Jacob Schum punts for 43 yards to Ten0. Touchback.","(13:41) Aaron Rodgers incomplete pass to the middle intended for Randall Cobb.","(14:22) James Starks rush up the middle for 3 yards to the Ten43. Tackled by Kevin Byard.","(14:59) James Starks rush to the left for 3 yards to the Ten46. Tackled by Brian Orakpo.","(15:00) Ryan Succop onside kickoff to the Ten49. Onside kick recovered by receiving team by Joe Thomas."]