["(0:36) Case Keenum rush up the middle for a loss of 1 yard to the NYJ40.","(1:10) Case Keenum rush up the middle for a loss of 1 yard to the NYJ39.","(1:52) Case Keenum rush up the middle for a loss of 1 yard to the NYJ38.","(2:00) Bryce Petty pass intended for Quincy Enunwa INTERCEPTED by Alec Ogletree and returned for 7 yards. Tackled by Wesley Johnson.","(2:00) Two Minute Warning.","(2:06) Bryce Petty pass to the right to Bilal Powell for 3 yards to the NYJ42. Tackled by Maurice Alexander.","(2:34) Bryce Petty pass to the right to Bilal Powell for 11 yards to the NYJ39. Tackled by Maurice Alexander.","(2:55) Bryce Petty pass to the right to Charone Peake for 5 yards to the NYJ28. Tackled by E.J. Gaines.","(3:01) Johnny Hekker punts for 49 yards to NYJ23. No return.","(3:01) Los Angeles Rams timeout.","(3:45) Benny Cunningham rush up the middle for 5 yards to the LA28. Tackled by Sheldon Richardson and Rontez Miles.","(3:45) New York Jets timeout.","(3:50) Case Keenum pass to the middle to Benny Cunningham for a loss of 3 yards to the LA23. Tackled by David Harris.","(3:51) New York Jets timeout.","(3:58) Benny Cunningham rush to the right for 6 yards to the LA26. Tackled by David Harris.","(4:05) Penalty: Holding on Los Angeles (Greg Robinson) -10 yards.","(4:10) Case Keenum pass to the left to Todd Gurley for 8 yards to the LA30. Tackled by Calvin Pryor.","(4:46) Todd Gurley rush to the left for 2 yards to the LA22. Tackled by Muhammad Wilkerson.","(4:52) Lachlan Edwards punts for 32 yards to LA20. No return.","(4:57) Bryce Petty incomplete pass to the middle intended for Robby Anderson defensed by Dominique Easley.","(5:00) Bryce Petty incomplete pass to the left intended for Quincy Enunwa defensed by Robert Quinn.","(5:04) Bryce Petty incomplete pass to the right intended for C.J. Spiller.","(5:45) Matt Forte rush up the middle for 7 yards to the NYJ48. Tackled by Maurice Alexander.","(6:11) Bryce Petty pass to the right to Bilal Powell for 6 yards to the NYJ41. Tackled by Mark Barron.","(6:46) Bryce Petty pass to the left to Bilal Powell for 10 yards to the NYJ35. Tackled by Alec Ogletree.","(6:52) Greg Zuerlein kicks off to the NYJ2. C.J. Spiller return for 23 yards to NYJ25. Tackled by Marqui Christian and Cody Davis.","(6:52) Greg Zuerlein 34 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(7:01) Case Keenum incomplete pass to the left intended for Benny Cunningham defensed by Darron Lee.","(7:05) Case Keenum incomplete pass to the left intended for Tavon Austin defensed by Buster Skrine.","(7:45) Todd Gurley rush up the middle for 4 yards to the NYJ16. Tackled by Leonard Williams.","(8:04) Case Keenum pass to the left to Pharoh Cooper for 6 yards to the NYJ20. Tackled by Buster Skrine.","(8:45) Todd Gurley rush up the middle for 4 yards to the NYJ26. Tackled by Steve McLendon.","(9:23) Todd Gurley rush up the middle for 11 yards to the NYJ30. Tackled by Julian Stanford and Calvin Pryor.","(9:31) Case Keenum incomplete pass to the left intended for Kenny Britt.","(10:14) Benny Cunningham rush up the middle for 2 yards to the NYJ41. Tackled by Muhammad Wilkerson and Jordan Jenkins.","(10:52) Todd Gurley rush up the middle for 9 yards to the NYJ43. Tackled by Calvin Pryor.","(11:03) Lachlan Edwards punts for 35 yards to LA48. No return.","(11:03) Bryce Petty incomplete pass to the left intended for Quincy Enunwa defensed by Alec Ogletree.","(11:09) Bryce Petty incomplete pass to the left intended for Quincy Enunwa.","(11:43) Matt Forte rush to the left for 2 yards to the NYJ17. Tackled by E.J. Gaines and Mark Barron.","(11:56) Johnny Hekker punts for 78 yards to NYJ5. Jalin Marshall return for 10 yards to NYJ15. Tackled by Cory Littleton.","(12:25) Case Keenum pass to the left to Kenny Britt for 8 yards to the LA17. Tackled by Darrelle Revis.","(13:02) Todd Gurley rush to the right for 1 yard to the LA9. Tackled by Muhammad Wilkerson and Leonard Williams.","(13:04) Case Keenum incomplete pass to the left intended for Kenny Britt.","(13:11) Lachlan Edwards punts for 32 yards to LA8. No return.","(13:14) Bryce Petty incomplete pass to the right intended for Robby Anderson defensed by Troy Hill.","(13:56) Matt Forte rush to the right for a loss of 1 yard to the LA40. Tackled by Dominique Easley.","(14:37) Bryce Petty pass to the middle to Matt Forte for 7 yards to the LA39. Tackled by Josh Forrest and Mark Barron.","(15:00) Matt Forte rush up the middle for 4 yards to the NYJ39. Tackled by Mark Barron and Alec Ogletree. Penalty: Unnecessary Roughness on Los Angeles (Dominique Easley) 15 yards.","(0:15) Bryce Petty pass to the left to Bilal Powell for 8 yards to the NYJ35. Tackled by Alec Ogletree and Lamarcus Joyner.","(0:20) Greg Zuerlein kicks off to the NYJ11. C.J. Spiller return for 16 yards to NYJ27. Tackled by T.J. McDonald.","(0:24) Greg Zuerlein 38 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(0:29) Case Keenum incomplete pass to the right intended for Tavon Austin.","(1:15) Case Keenum sacked at NYJ20 for a loss of 1 yard by Steve McLendon.","(1:42) Penalty: Pass Interference on Los Angeles (Brian Quick) -10 yards.","(2:21) Todd Gurley rush up the middle for a loss of 2 yards to the NYJ9. Tackled by Deon Simon.","(2:21) New York Jets timeout.","(2:51) Case Keenum pass to the right to Tavon Austin for 20 yards to the NYJ7. Tackled by Marcus Gilchrist.","(3:29) Case Keenum pass to the left to Tavon Austin for a loss of 1 yard to the NYJ27. Tackled by Sheldon Richardson.","(4:08) Case Keenum pass to the right to Benny Cunningham for 6 yards to the NYJ26. Tackled by David Harris.","(4:49) Todd Gurley rush to the right for 1 yard to the NYJ32. Tackled by Muhammad Wilkerson.","(5:28) Todd Gurley rush to the left for 6 yards to the NYJ33. Tackled by Darryl Roberts.","(6:08) Benny Cunningham rush to the right for 4 yards to the NYJ39. Tackled by David Harris.","(6:49) Case Keenum rush up the middle for 7 yards to the NYJ43. Tackled by Lorenzo Mauldin.","(6:55) Case Keenum incomplete pass to the left intended for Tavon Austin defensed by Lorenzo Mauldin.","(7:35) Case Keenum rush up the middle for 7 yards to the LA50. Tackled by David Harris.","(8:11) Todd Gurley rush up the middle for 5 yards to the LA43. Tackled by Jordan Jenkins.","(8:35) Todd Gurley rush up the middle for 13 yards to the LA38. Tackled by Buster Skrine.","(8:45) Lachlan Edwards punts for 31 yards to LA25. No return.","(8:49) Bryce Petty incomplete pass to the right intended for Brandon Marshall defensed by Robert Quinn.","(9:27) Bryce Petty pass to the right to Charone Peake for 4 yards to the NYJ44. Tackled by Trumaine Johnson.","(10:09) Matt Forte rush up the middle for a loss of 1 yard to the NYJ40. Tackled by Ethan Westbrooks.","(10:48) Matt Forte rush up the middle for 23 yards to the NYJ41. Tackled by T.J. McDonald.","(11:31) Bryce Petty pass to the right to Bilal Powell for 8 yards to the NYJ18. Tackled by Ethan Westbrooks and Alec Ogletree.","(12:10) Matt Forte rush up the middle for 5 yards to the NYJ10. Tackled by Mark Barron.","(12:20) Johnny Hekker punts for 52 yards to NYJ12. Jalin Marshall - no return. Tackled by Bryce Hager. Penalty: Illegal Block on New York -5 yards.","(12:54) Case Keenum pass to the right to Kenny Britt for 3 yards to the LA36. Tackled by Buster Skrine.","(13:29) Tavon Austin rush to the right for 4 yards to the LA33. Tackled by Calvin Pryor and Sheldon Richardson.","(13:33) Case Keenum incomplete pass to the right intended for Lance Kendricks defensed by David Harris.","(13:33) Lachlan Edwards punts for 59 yards to LA14. Tavon Austin return for 15 yards to LA29. Tackled by Jordan Jenkins.","(14:21) Bryce Petty pass to the left to Brandon Marshall for 3 yards to the NYJ27. Tackled by Maurice Alexander.","(14:25) Bryce Petty incomplete pass to the right intended for Quincy Enunwa.","(15:00) Matt Forte rush to the right for a loss of 1 yard to the NYJ24. Tackled by Michael Brockers.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback.","(0:07) Bilal Powell rush to the left for 17 yards to the LA38. Tackled by Dominique Easley.","(0:11) Bryce Petty incomplete pass to the middle.","(0:15) Bryce Petty pass to the left to Brandon Marshall for 6 yards to the NYJ45. Tackled by Trumaine Johnson.","(0:20) Matt Forte rush to the left for 15 yards to the NYJ39. Tackled by Alec Ogletree.","(0:26) Penalty: Illegal Use of Hands on New York (Ben Ijalana) -11 yards.","(0:26) New York Jets timeout.","(0:33) Bryce Petty pass to the left to Matt Forte for 4 yards to the NYJ35. Tackled by Troy Hill.","(0:43) Johnny Hekker punts for 45 yards to NYJ31. Nick Marshall - no return. Tackled by Mike Thomas.","(0:46) Case Keenum incomplete pass to the right intended for Brian Quick.","(0:51) Case Keenum incomplete pass to the right intended for Brian Quick defensed by Darryl Roberts.","(0:56) Case Keenum pass to the right to Benny Cunningham for 4 yards to the LA24. Tackled by Julian Stanford.","(1:06) Lachlan Edwards punts for 48 yards to LA20. Tavon Austin - no return. Tackled by Nick Marshall.","(1:11) Bryce Petty incomplete pass to the right intended for Robby Anderson.","(1:54) Bryce Petty sacked at NYJ32 for a loss of 6 yards by William Hayes.","(2:00) Bryce Petty pass to the left to Bilal Powell for 2 yards to the NYJ38. Tackled by Alec Ogletree.","(2:00) Two Minute Warning.","(2:40) Bilal Powell rush to the left for 14 yards to the NYJ36. Tackled by T.J. McDonald and Troy Hill.","(3:20) Bilal Powell rush to the left for 3 yards to the NYJ22. Tackled by Alec Ogletree and Robert Quinn.","(3:33) Matt Forte rush up the middle for 4 yards to the NYJ14. Tackled by Alec Ogletree. Penalty: Illegal Use of Hands on Los Angeles (Michael Brockers) 5 yards.","(3:49) Johnny Hekker punts for 63 yards to NYJ20. Jalin Marshall - no return. FUMBLE, recovered by NYJ (Jalin Marshall). Penalty: Illegal Block on New York (Nick Marshall) -10 yards.","(4:24) Case Keenum sacked at LA17 for a loss of 3 yards by Lorenzo Mauldin and Steve McLendon.","(5:04) Todd Gurley rush up the middle for 2 yards to the LA20. Tackled by Julian Stanford.","(5:09) Case Keenum incomplete pass to the left intended for Tavon Austin.","(5:24) Lachlan Edwards punts for 54 yards to LA6. Tavon Austin return for 12 yards to LA18. Tackled by Julian Stanford.","(5:57) Matt Forte rush up the middle for 2 yards to the NYJ40. Tackled by William Hayes.","(6:36) Matt Forte rush up the middle for no gain to the NYJ38. Tackled by Alec Ogletree.","(7:10) Matt Forte rush to the left for no gain to the NYJ38. Tackled by Eugene Sims.","(7:16) Penalty: Holding on Los Angeles (Lamarcus Joyner) 5 yards.","(7:55) Matt Forte rush to the left for a loss of 1 yard to the NYJ33. Tackled by Mark Barron.","(8:33) Bryce Petty pass to the left to Robby Anderson for 9 yards to the NYJ34. Tackled by E.J. Gaines.","(9:02) Bryce Petty pass to the left to Quincy Enunwa for 7 yards to the NYJ25. Tackled by Troy Hill.","(9:05) Bryce Petty incomplete pass to the right intended for Brandon Marshall.","(9:43) Matt Forte rush to the right for 4 yards to the NYJ18. Tackled by Alec Ogletree.","(9:50) Johnny Hekker punts for 33 yards to NYJ14. No return.","(10:25) Case Keenum sacked at NYJ47 for a loss of 6 yards by Darron Lee and David Harris.","(11:10) Todd Gurley rush to the left for no gain to the NYJ41. Tackled by David Harris and Sheldon Richardson.","(11:53) Todd Gurley rush to the right for 2 yards to the NYJ41. Tackled by Leonard Williams and Julian Stanford.","(12:31) Penalty: Delay of Game on Los Angeles (Kenny Britt) -5 yards.","(12:31) Case Keenum pass to the left to Kenny Britt for 46 yards to the NYJ38. Tackled by Darrelle Revis.","(12:35) Nick Folk kicks off to the LA-2. Benny Cunningham return for 18 yards to LA16. Tackled by Antonio Allen.","(12:35) Nick Folk extra point is NO GOOD.","(12:40) Bryce Petty pass to the left to Brandon Marshall for no gain to the LA4. Lateral to Bilal Powell for 4 yards for a TOUCHDOWN.","(12:45) Bryce Petty incomplete pass to the middle intended for Matt Forte.","(13:23) Matt Forte rush to the right for 1 yard to the LA4. Tackled by Lamarcus Joyner.","(13:52) Matt Forte rush to the left for 28 yards to the LA5. Tackled by Maurice Alexander.","(14:21) Bryce Petty pass to the right to Brandon Marshall for 6 yards to the LA33. Tackled by E.J. Gaines.","(15:00) Bilal Powell rush to the left for 3 yards to the LA39. Tackled by T.J. McDonald and Aaron Donald.","(0:34) C.J. Spiller rush up the middle for 4 yards to the LA42. Tackled by Lamarcus Joyner.","(1:05) Bryce Petty pass to the left to Robby Anderson for 52 yards to the LA46. Tackled by E.J. Gaines.","(1:41) Matt Forte rush up the middle for 1 yard to the NYJ2. Tackled by Eugene Sims.","(1:50) Johnny Hekker punts for 42 yards to NYJ1. No return.","(2:45) Penalty: Delay of Game on Los Angeles (Johnny Hekker) -5 yards.","(2:45) Todd Gurley rush to the left for a loss of 6 yards to the NYJ38. Tackled by Sheldon Richardson.","(3:25) Todd Gurley rush up the middle for a loss of 1 yard to the NYJ32. Tackled by Steve McLendon.","(4:04) Todd Gurley rush to the left for 9 yards to the NYJ31. Tackled by David Harris.","(4:35) Case Keenum pass to the left to Brian Quick for 10 yards to the NYJ40. Tackled by Buster Skrine.","(5:14) Case Keenum pass to the right to Brian Quick for 6 yards to the LA50. Tackled by David Harris.","(5:53) Todd Gurley rush up the middle for no gain to the LA44. Tackled by Leonard Williams.","(6:31) Case Keenum pass to the left to Kenny Britt for 9 yards to the LA44. Tackled by Darrelle Revis.","(6:36) Case Keenum incomplete pass to the right intended for Tavon Austin.","(7:14) Todd Gurley rush to the left for 3 yards to the LA35. Tackled by David Harris and Sheldon Richardson.","(7:26) Lachlan Edwards punts for 51 yards to LA21. Tavon Austin return for 11 yards to LA32. Tackled by Antonio Allen.","(8:03) Bryce Petty pass to the left to Robby Anderson for 8 yards to the NYJ28. Tackled by Troy Hill.","(8:21) Penalty: Illegal Substitution on New York -5 yards.","(8:52) Matt Forte rush to the right for 1 yard to the NYJ25. Tackled by Aaron Donald and Lamarcus Joyner.","(9:32) Matt Forte rush to the right for 5 yards to the NYJ24. Tackled by William Hayes.","(9:37) Greg Zuerlein kicks off to the NYJ-1. C.J. Spiller return for 20 yards to NYJ19. Tackled by Chase Reynolds.","(9:38) Greg Zuerlein 20 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(9:40) Case Keenum incomplete pass to the left intended for Benny Cunningham.","(10:24) Case Keenum pass to the right to Lance Kendricks for no gain to the NYJ2. Tackled by Rontez Miles.","(11:09) Benny Cunningham rush up the middle for a loss of 1 yard to the NYJ2. Tackled by Calvin Pryor. FUMBLE, recovered by LA (Benny Cunningham).","(11:34) Benny Cunningham rush to the right for 24 yards to the NYJ1. Tackled by Marcus Gilchrist.","(12:10) Case Keenum pass to the left to Kenny Britt for 25 yards to the NYJ25.","(12:42) Case Keenum pass to the left to Kenny Britt for 6 yards to the LA50. Tackled by Darrelle Revis.","(12:45) Case Keenum incomplete pass to the left intended for Kenny Britt.","(13:21) Tavon Austin rush up the middle for 6 yards to the LA44. Tackled by Sheldon Richardson.","(13:50) Case Keenum pass to the left to Kenny Britt for 12 yards to the LA38.","(14:15) Todd Gurley rush to the right for 1 yard to the LA26. Tackled by Lorenzo Mauldin.","(15:00) Todd Gurley rush up the middle for no gain to the LA25. Tackled by David Harris.","(15:00) Nick Folk kicks off to the endzone. Touchback."]