["(0:40) Brock Osweiler rush up the middle for a loss of 1 yard to the Hou40.","(1:20) Brock Osweiler rush up the middle for a loss of 1 yard to the Hou41.","(1:24) Andrew Luck incomplete pass to the right intended for Robert Turbin.","(1:24) Houston Texans timeout.","(1:57) Andrew Luck pass to the left to T.Y. Hilton for 6 yards to the Hou42. Tackled by Brian Cushing.","(1:57) Two Minute Warning.","(2:06) Andrew Luck pass to the right to T.Y. Hilton for 3 yards to the Hou48. Tackled by Kareem Jackson.","(2:11) Andrew Luck incomplete pass to the left intended for Chester Rogers defensed by Eddie Pleasant.","(2:41) Andrew Luck pass to the left to Robert Turbin for 10 yards to the Ind49. Tackled by Kareem Jackson.","(2:47) Andrew Luck pass to the right to T.Y. Hilton for 14 yards to the Ind39. Tackled by Kareem Jackson.","(2:47) Nick Novak kicks off to the endzone. Touchback.","(2:51) Nick Novak 34 yard field goal attempt is GOOD. Holder: Shane Lechler.","(3:34) Alfred Blue rush up the middle for 1 yard to the Ind17. Tackled by David Parry.","(3:34) Indianapolis Colts timeout.","(3:40) Lamar Miller rush to the left for 2 yards to the Ind18. Tackled by Erik Walden and Hassan Ridgeway.","(3:40) Indianapolis Colts timeout.","(3:50) Alfred Blue rush to the right for 1 yard to the Ind20. Tackled by Akeem Ayers and Antonio Morrison.","(3:56) Penalty: Too Many Men on Field on Indianapolis 5 yards.","(3:56) Penalty: Holding on Indianapolis (Erik Walden) 5 yards.","(4:01) Penalty: Holding on Houston (Greg Mancz) -10 yards.","(4:47) Brock Osweiler pass to the left to Lamar Miller for 15 yards to the Ind21. Tackled by Antonio Morrison.","(5:21) Brock Osweiler pass to the left to DeAndre Hopkins for 11 yards to the Ind36. Tackled by Vontae Davis.","(5:52) Penalty: Holding on Houston (Greg Mancz) -10 yards.","(6:32) Brock Osweiler pass to the right to Will Fuller V for 6 yards to the Ind37. Tackled by Rashaan Melvin.","(7:17) Indianapolis Colts timeout.","(7:17) Alfred Blue rush up the middle for 1 yard to the Ind43. Tackled by Josh McNary. FUMBLE, recovered by Hou.","(7:52) Alfred Blue rush to the right for 7 yards to the Ind44. Tackled by Antonio Morrison and Trent Cole.","(8:29) Lamar Miller rush to the right for 20 yards to the Hou49. Tackled by Darius Butler.","(9:06) Lamar Miller rush up the middle for 4 yards to the Hou29. Tackled by Mike Adams.","(9:06) Pat McAfee kicks off to the endzone. Touchback.","(9:06) Adam Vinatieri extra point is good.","(9:14) Andrew Luck pass to the right to T.Y. Hilton for 35 yards for a TOUCHDOWN.","(9:39) Frank Gore rush up the middle for 4 yards to the Hou35. Tackled by Brian Cushing.","(10:11) Andrew Luck pass to the middle to T.Y. Hilton for 14 yards to the Hou39. Tackled by Christian Covington.","(10:16) Andrew Luck incomplete pass to the left intended for T.Y. Hilton defensed by Benardrick McKinney.","(10:23) Andrew Luck incomplete pass to the middle intended for Phillip Dorsett.","(10:58) Penalty: Face Mask on Houston (Antonio Smith) 15 yards.","(11:24) Andrew Luck pass to the right to Robert Turbin for 9 yards to the Ind32. Tackled by Benardrick McKinney.","(11:29) Andrew Luck incomplete pass to the middle intended for Phillip Dorsett.","(11:48) Andrew Luck pass to the middle to Jack Doyle for 6 yards to the Ind23. Tackled by Benardrick McKinney.","(11:53) Nick Novak kicks off to the Ind-1. Jordan Todman return for 18 yards to Ind17. Tackled by Brian Peters.","(11:58) Nick Novak 41 yard field goal attempt is GOOD. Holder: Shane Lechler.","(12:38) Jonathan Grimes rush up the middle for 6 yards to the Ind22. Tackled by Henry Anderson.","(12:44) Brock Osweiler incomplete pass to the right intended for Will Fuller V defensed by Rashaan Melvin.","(13:06) Brock Osweiler sacked at Ind28 for a loss of 11 yards by Trent Cole.","(13:50) Alfred Blue rush up the middle for 3 yards to the Ind17. Tackled by Darryl Morris and Edwin Jackson.","(14:27) Lamar Miller rush to the left for 8 yards to the Ind20. Tackled by Mike Adams.","(15:00) Lamar Miller rush up the middle for 20 yards to the Ind28. Tackled by Mike Adams.","(0:25) Brock Osweiler pass to the left to C.J. Fiedorowicz for 20 yards to the Ind48. Tackled by Antonio Morrison.","(1:02) Lamar Miller rush up the middle for 3 yards to the Hou32. Tackled by Edwin Jackson and Antonio Morrison.","(1:36) Lamar Miller rush to the left for 8 yards to the Hou29. Tackled by Edwin Jackson.","(1:40) Penalty: Holding on Indianapolis (Vontae Davis) 5 yards.","(2:22) Lamar Miller rush to the left for 2 yards to the Hou16. Tackled by Edwin Jackson and Rashaan Melvin.","(2:29) Brock Osweiler incomplete pass to the left intended for C.J. Fiedorowicz.","(2:36) Andrew Luck sacked at Hou14 for a loss of 11 yards by Jadeveon Clowney. FUMBLE, recovered by Hou (Whitney Mercilus). Tackled by Joe Reitz.","(3:22) Frank Gore rush to the left for a loss of 1 yard to the Hou3. Tackled by Vince Wilfork and D.J. Reader.","(3:56) Robert Turbin rush up the middle for 3 yards to the Hou2. Tackled by Whitney Mercilus.","(4:02) Penalty: Pass Interference on Houston (Robert Nelson Jr.) 28 yards.","(4:45) Frank Gore rush up the middle for 1 yard to the Hou33. Tackled by D.J. Reader and Jadeveon Clowney.","(5:14) Frank Gore rush to the right for 13 yards to the Hou34. Tackled by Kareem Jackson.","(5:44) Andrew Luck pass to the left to Chester Rogers for 21 yards to the Hou47. Tackled by A.J. Bouye.","(6:22) Andrew Luck pass to the right to T.Y. Hilton for 9 yards to the Ind32. Tackled by Whitney Mercilus.","(6:29) Penalty: Holding on Indianapolis (Anthony Castonzo) -10 yards.","(7:06) Andrew Luck pass to the left to Jack Doyle for 15 yards to the Ind33. Tackled by Benardrick McKinney.","(7:28) Frank Gore rush up the middle for 4 yards to the Ind18. Tackled by Brian Cushing and Benardrick McKinney.","(7:40) Shane Lechler punts for 54 yards to Ind12. Chester Rogers return for 2 yards to Ind14. Tackled by Don Jones.","(8:29) Brock Osweiler pass to the left to Keith Mumphery for 6 yards to the Hou34. Tackled by Rashaan Melvin and Edwin Jackson.","(9:12) Alfred Blue rush up the middle for 3 yards to the Hou28. Tackled by Erik Walden.","(9:53) Alfred Blue rush up the middle for no gain to the Hou25. Tackled by Antonio Morrison and Hassan Ridgeway.","(9:53) Pat McAfee kicks off to the endzone. Touchback.","(9:53) Adam Vinatieri extra point is good.","(10:00) Andrew Luck pass to the right to Frank Gore for 18 yards for a TOUCHDOWN.","(10:18) Penalty: Pass Interference on Houston (Robert Nelson Jr.) 41 yards.","(10:37) Penalty: False Start on Indianapolis (Joe Reitz) -5 yards.","(11:08) Robert Turbin rush to the left for 2 yards to the Ind46. Tackled by Vince Wilfork.","(11:48) Andrew Luck pass to the left to T.Y. Hilton for 9 yards to the Ind44. Tackled by Kareem Jackson.","(11:52) Andrew Luck incomplete pass to the right intended for Phillip Dorsett.","(12:23) Andrew Luck pass to the right to Phillip Dorsett for 8 yards to the Ind35. Tackled by Robert Nelson Jr..","(12:46) Frank Gore rush to the left for 2 yards to the Ind27. Tackled by Jadeveon Clowney and Christian Covington.","(12:46) Nick Novak kicks off to the endzone. Touchback.","(12:49) Nick Novak 24 yard field goal attempt is GOOD. Holder: Shane Lechler.","(12:54) Brock Osweiler incomplete pass to the left intended for C.J. Fiedorowicz defensed by Darryl Morris.","(12:59) Brock Osweiler incomplete pass to the left intended for Will Fuller V.","(13:23) Lamar Miller rush to the right for 2 yards to the Ind6. Tackled by Hassan Ridgeway and Antonio Morrison.","(13:54) Lamar Miller rush up the middle for 2 yards to the Ind16. Tackled by David Parry. Penalty: Unnecessary Roughness on Indianapolis (Erik Walden) 8 yards.","(14:11) Andrew Luck pass intended for Jack Doyle INTERCEPTED by Andre Hal and returned for 24 yards. Tackled by Robert Turbin.","(14:52) Andrew Luck pass to the middle to Jack Doyle for 8 yards to the Ind35. Tackled by Whitney Mercilus.","(14:56) Andrew Luck incomplete pass to the right intended for Phillip Dorsett.","(15:00) Nick Novak kicks off to the Ind-2. Josh Ferguson return for 14 yards to Ind12. Tackled by Akeem Hunt. Penalty: Unnecessary Roughness on Houston (Denzel Rice) 15 yards.","(0:12) Andrew Luck rush up the middle for a loss of 1 yard to the Ind29.","(0:12) Penalty: Too Many Men on Field on Houston 5 yards.","(0:12) Nick Novak kicks off to the endzone. Touchback.","(0:17) Nick Novak 52 yard field goal attempt is GOOD. Holder: Shane Lechler.","(0:22) Brock Osweiler incomplete pass to the middle intended for C.J. Fiedorowicz defensed by T.J. Green.","(0:23) Brock Osweiler incomplete pass to the middle.","(0:40) Brock Osweiler pass to the right to Jonathan Grimes for 6 yards to the Ind33. Tackled by Erik Walden.","(0:46) Brock Osweiler pass to the left to Will Fuller V for 16 yards to the Ind39.","(0:51) 55 yard field goal attempt by Adam Vinatieri is NO GOOD. Holder: Pat McAfee.","(0:56) Andrew Luck incomplete pass to the right intended for Phillip Dorsett defensed by Andre Hal.","(1:01) Andrew Luck incomplete pass to the right intended for Donte Moncrief defensed by Robert Nelson Jr..","(1:06) Andrew Luck incomplete pass to the left intended for Robert Turbin.","(1:06) Indianapolis Colts timeout.","(1:14) Andrew Luck pass to the middle to Jack Doyle for 14 yards to the Hou37. Tackled by Kareem Jackson.","(1:19) Andrew Luck incomplete pass to the left intended for Donte Moncrief defensed by A.J. Bouye.","(1:41) Robert Turbin rush to the right for 5 yards to the Ind49. Tackled by Benardrick McKinney.","(2:00) Andrew Luck pass to the middle to T.Y. Hilton for 8 yards to the Ind44. Tackled by Brian Cushing.","(2:00) Two Minute Warning.","(2:14) Andrew Luck pass to the left to Robert Turbin for 11 yards to the Ind36. Tackled by Benardrick McKinney and Brian Cushing.","(2:21) Andrew Luck incomplete pass to the right.","(2:26) Andrew Luck incomplete pass to the middle intended for T.Y. Hilton.","(2:26) Nick Novak kicks off to the endzone. Touchback.","(2:26) Nick Novak extra point is good.","(2:29) Lamar Miller rush up the middle for 2 yards for a TOUCHDOWN.","(3:09) Brock Osweiler pass to the right to C.J. Fiedorowicz for 6 yards to the Ind2. Tackled by Mike Adams.","(3:54) Lamar Miller rush to the right for 3 yards to the Ind8. Tackled by Arthur Jones.","(4:34) Lamar Miller rush to the right for 2 yards to the Ind11. Tackled by David Parry.","(5:17) Akeem Hunt rush up the middle for 19 yards to the Ind13. Tackled by Edwin Jackson and Mike Adams.","(6:00) Alfred Blue rush up the middle for 5 yards to the Ind32. Tackled by Hassan Ridgeway and Arthur Jones.","(6:37) Lamar Miller rush to the left for no gain to the Ind37. Tackled by Edwin Jackson.","(7:17) Brock Osweiler pass to the left to DeAndre Hopkins for 22 yards to the Ind37. Tackled by Mike Adams.","(8:01) Lamar Miller rush to the left for no gain to the Hou41. Tackled by Edwin Jackson.","(8:39) Lamar Miller rush to the left for 6 yards to the Hou41. Tackled by Rashaan Melvin.","(9:13) Lamar Miller rush to the right for 7 yards to the Hou35. Tackled by Edwin Jackson and Rashaan Melvin.","(9:45) Lamar Miller rush to the right for 8 yards to the Hou28. Tackled by Erik Walden.","(9:57) Pat McAfee punts for 49 yards to Hou0. Touchback.","(10:14) Penalty: Delay of Game on Indianapolis (Pat McAfee) -5 yards.","(11:04) Andrew Luck pass to the left to Jack Doyle for 12 yards to the Hou44. Tackled by Kareem Jackson and A.J. Bouye.","(11:08) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(11:32) Penalty: Holding on Indianapolis (Joe Haeg) -10 yards.","(11:36) Andrew Luck incomplete pass to the middle intended for Dwayne Allen defensed by Quintin Demps.","(11:51) Brock Osweiler pass intended for C.J. Fiedorowicz INTERCEPTED by Akeem Ayers and returned for 25 yards. Tackled by Oday Aboushi.","(12:33) Alfred Blue rush up the middle for 4 yards to the Ind41. Tackled by Josh McNary.","(13:07) Alfred Blue rush to the left for 5 yards to the Ind45. Tackled by Rashaan Melvin.","(13:11) Penalty: Pass Interference on Indianapolis (Vontae Davis) 6 yards.","(13:56) Alfred Blue rush to the left for 3 yards to the Hou44. Tackled by Arthur Jones.","(14:31) Alfred Blue rush up the middle for 3 yards to the Hou41. Tackled by David Parry and Arthur Jones.","(15:00) Brock Osweiler pass to the left to Ryan Griffin for 12 yards to the Hou38. Tackled by Mike Adams.","(0:21) Brock Osweiler pass to the left to Alfred Blue for no gain to the Hou26. Tackled by Antonio Morrison.","(1:00) Alfred Blue rush to the right for 6 yards to the Hou26. Tackled by Antonio Morrison and Arthur Jones.","(1:08) Pat McAfee punts for 32 yards to Hou20. No return.","(1:44) Andrew Luck pass to the right to Robert Turbin for 3 yards to the Ind48. Tackled by Robert Nelson Jr..","(2:21) Andrew Luck pass to the right to Phillip Dorsett for 4 yards to the Ind45. Tackled by Robert Nelson Jr..","(2:28) Andrew Luck incomplete pass to the left intended for Robert Turbin.","(3:14) Andrew Luck pass to the right to Frank Gore for 15 yards to the Ind41. Tackled by Robert Nelson Jr. and Quintin Demps.","(4:00) Frank Gore rush up the middle for 1 yard to the Ind26. Tackled by Corey Moore and Brian Cushing.","(4:00) Nick Novak kicks off to the endzone. Touchback.","(4:04) Nick Novak 21 yard field goal attempt is GOOD. Holder: Shane Lechler.","(4:08) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(4:11) Brock Osweiler incomplete pass to the right intended for Jonathan Grimes defensed by Darius Butler.","(4:54) Alfred Blue rush to the right for 3 yards to the Ind3. Tackled by Henry Anderson and Arthur Jones.","(5:25) Alfred Blue rush to the right for 4 yards to the Ind6. Tackled by Arthur Jones.","(6:01) Alfred Blue rush up the middle for 6 yards to the Ind10. Tackled by Trent Cole.","(6:11) Andrew Luck pass intended for Dwayne Allen INTERCEPTED by Quintin Demps and returned for 15 yards. Tackled by Frank Gore.","(6:24) Shane Lechler punts for 57 yards to Ind16. Chester Rogers return for 2 yards to Ind18. Tackled by Corey Moore.","(7:02) Brock Osweiler pass to the right to Ryan Griffin for 11 yards to the Hou27. Tackled by T.J. Green.","(7:02) Houston Texans timeout.","(7:50) Brock Osweiler sacked at Hou16 for a loss of 5 yards by Hassan Ridgeway.","(8:26) Lamar Miller rush up the middle for 3 yards to the Hou21. Tackled by Akeem Ayers and Edwin Jackson.","(8:31) Pat McAfee kicks off to the Hou0. Akeem Hunt return for 18 yards to Hou18. Tackled by Josh Ferguson.","(8:35) Adam Vinatieri 32 yard field goal attempt is GOOD. Holder: Pat McAfee.","(8:40) Andrew Luck incomplete pass to the left intended for Donte Moncrief.","(8:44) Andrew Luck incomplete pass to the left intended for Donte Moncrief.","(9:19) Frank Gore rush up the middle for 2 yards to the Hou14. Tackled by Akeem Dent.","(9:33) Houston Texans timeout.","(9:33) Andrew Luck pass to the right to T.Y. Hilton for 17 yards to the Hou16. Tackled by Kareem Jackson.","(10:13) Frank Gore rush to the right for 4 yards to the Hou33. Tackled by Benardrick McKinney.","(10:50) Andrew Luck rush to the right for 33 yards to the Hou37. Tackled by Quintin Demps.","(11:30) Andrew Luck pass to the right to Phillip Dorsett for 7 yards to the Ind30. Tackled by Robert Nelson Jr..","(11:36) Andrew Luck incomplete pass to the right intended for T.Y. Hilton defensed by Whitney Mercilus.","(12:21) Frank Gore rush to the left for 11 yards to the Ind23. Tackled by Benardrick McKinney and A.J. Bouye.","(12:27) Shane Lechler punts for 45 yards to Ind12. No return.","(13:01) Brock Osweiler pass to the left to C.J. Fiedorowicz for 6 yards to the Hou43. Tackled by T.J. Green.","(13:41) Lamar Miller rush up the middle for no gain to the Hou37. Tackled by Trent Cole.","(14:11) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(14:16) Brock Osweiler pass to the right to Keith Mumphery for 10 yards to the Hou37. Tackled by Vontae Davis.","(14:53) Lamar Miller rush up the middle for 5 yards to the Hou27. Tackled by Arthur Jones.","(15:00) Pat McAfee kicks off to the Hou0. Akeem Hunt return for 18 yards to Hou18. Tackled by Jordan Todman and Josh McNary."]