["(0:32) Eli Manning rush up the middle for a loss of 1 yard to the Dal5.","(0:48) Eli Manning rush up the middle for a loss of 1 yard to the Dal4.","(0:52) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Janoris Jenkins.","(0:57) Dak Prescott incomplete pass to the right intended for Cole Beasley defensed by Devon Kennard.","(1:03) Dak Prescott incomplete pass to the middle intended for Lance Dunbar.","(1:06) Dak Prescott incomplete pass to the right intended for Jason Witten.","(1:15) Brad Wing punts for 33 yards to Dal3. No return.","(1:15) Penalty: Delay of Game on New York (Eli Manning) -5 yards.","(1:15) New York Giants timeout.","(2:00) Rashad Jennings rush to the right for 1 yard to the Dal31. Tackled by Cedric Thornton and Sean Lee.","(2:00) Two Minute Warning.","(2:08) Rashad Jennings rush to the right for 3 yards to the Dal32. Tackled by Sean Lee and Anthony Hitchens.","(2:08) Dallas Cowboys timeout.","(2:13) Rashad Jennings rush to the right for 3 yards to the Dal35. Tackled by Anthony Hitchens and Sean Lee.","(2:25) Dak Prescott pass to the left to Dez Bryant for 10 yards to the Dal38. Tackled by Janoris Jenkins. FUMBLE, recovered by NYG (Landon Collins) and returned for 6 yards. Tackled by Jason Witten.","(2:31) Dak Prescott pass to the left to Lance Dunbar for 4 yards to the Dal28. Tackled by Dominique Rodgers-Cromartie.","(2:39) Dak Prescott incomplete pass to the left intended for Cole Beasley.","(2:46) Brad Wing punts for 39 yards to Dal24. No return.","(2:46) Dallas Cowboys timeout.","(2:52) Rashad Jennings rush to the left for 5 yards to the NYG37. Tackled by Benson Mayowa and David Irving.","(2:55) Eli Manning incomplete pass to the middle intended for Sterling Shepard defensed by Justin Durant.","(2:55) Dallas Cowboys timeout.","(3:00) Rashad Jennings rush to the left for a loss of 1 yard to the NYG32. Tackled by Benson Mayowa and Sean Lee.","(3:14) Chris Jones punts for 52 yards to NYG28. Odell Beckham Jr. return for 5 yards to NYG33. Tackled by Andrew Gachkar and Vince Mayle.","(3:54) Dak Prescott pass to the left to Terrance Williams for 7 yards to the Dal20. Tackled by Janoris Jenkins.","(4:02) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(4:40) Ezekiel Elliott rush to the left for 2 yards to the Dal13. Tackled by Olivier Vernon.","(4:49) Brad Wing punts for 50 yards to Dal11. No return.","(5:29) Paul Perkins rush to the left for 9 yards to the NYG39. Tackled by Sean Lee and Barry Church.","(6:14) Paul Perkins rush to the right for a loss of 2 yards to the NYG30. Tackled by Sean Lee.","(6:55) Paul Perkins rush to the right for 1 yard to the NYG32. Tackled by Barry Church.","(7:05) Chris Jones punts for 44 yards to NYG31. No return.","(7:40) Ezekiel Elliott rush to the left for a loss of 6 yards to the Dal25. Tackled by Devon Kennard.","(7:47) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(8:27) Ezekiel Elliott rush up the middle for a loss of 1 yard to the Dal31. Tackled by Damon Harrison.","(9:06) Dak Prescott pass to the right to Terrance Williams for 13 yards to the Dal32. Tackled by Kelvin Sheppard.","(9:40) Ezekiel Elliott rush to the left for 4 yards to the Dal19. Tackled by Keenan Robinson and Romeo Okwara.","(9:47) Eli Manning pass intended for Victor Cruz INTERCEPTED by Anthony Brown. No return. Tackled by Victor Cruz.","(10:24) Rashad Jennings rush to the left for 1 yard to the Dal22. Tackled by David Irving and Cedric Thornton.","(10:59) Rashad Jennings rush to the left for 13 yards to the Dal23. Tackled by Sean Lee and Byron Jones.","(11:29) Eli Manning pass to the left to Victor Cruz for 4 yards to the Dal36. Tackled by Anthony Brown.","(12:01) Eli Manning pass to the right to Odell Beckham Jr. for 7 yards to the Dal40. Tackled by Brandon Carr and Barry Church.","(12:37) Rashad Jennings rush up the middle for 1 yard to the Dal47. Tackled by Terrell McClain and Jack Crawford.","(13:13) Eli Manning pass to the right to Sterling Shepard for 17 yards to the Dal48. Tackled by Anthony Brown.","(13:39) Penalty: Holding on New York (Marshall Newhouse) -10 yards.","(14:12) Paul Perkins rush to the right for 2 yards to the NYG45. Tackled by Tyrone Crawford.","(14:41) Paul Perkins rush to the left for 9 yards to the NYG43. Tackled by Barry Church.","(14:54) Chris Jones punts for 51 yards to NYG30. Dwayne Harris return for 4 yards to NYG34. Tackled by Keith Smith.","(15:00) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Dominique Rodgers-Cromartie.","(0:24) Dak Prescott pass to the left to Jason Witten for 1 yard to the Dal19. Tackled by Landon Collins.","(1:01) Ezekiel Elliott rush up the middle for 4 yards to the Dal18. Tackled by Romeo Okwara and Keenan Robinson.","(1:07) Robbie Gould kicks off to the Dal-2. Lance Dunbar return for 16 yards to Dal14. Tackled by Deontae Skinner.","(1:07) Robbie Gould extra point is good.","(1:18) Eli Manning pass to the left to Odell Beckham Jr. for 61 yards for a TOUCHDOWN.","(1:50) Rashad Jennings rush to the left for no gain to the NYG39. Tackled by Benson Mayowa and Tyrone Crawford.","(2:06) Dak Prescott pass intended for Dez Bryant INTERCEPTED by Leon Hall and returned for 29 yards. Tackled by Travis Frederick.","(2:51) Dak Prescott sacked at Dal49 for no gain by Jonathan Casillas.","(3:19) Dak Prescott pass to the left to Cole Beasley for 3 yards to the NYG41. Tackled by Leon Hall. Penalty: Holding on Dallas (Terrance Williams) -10 yards.","(3:55) Ezekiel Elliott rush to the right for 2 yards to the NYG44. Tackled by Olivier Vernon and Romeo Okwara.","(4:29) Dak Prescott pass to the right to Cole Beasley for 18 yards to the NYG46. Tackled by Coty Sensabaugh.","(5:06) Ezekiel Elliott rush to the left for 13 yards to the Dal36.","(5:44) Ezekiel Elliott rush to the right for no gain to the Dal23. Tackled by Olivier Vernon and Devon Kennard.","(5:50) Robbie Gould kicks off to the Dal11. Alfred Morris return for 12 yards to Dal23. Tackled by Deontae Skinner and Eric Pinkins.","(5:54) Robbie Gould 39 yard field goal attempt is GOOD. Holder: Brad Wing.","(5:58) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(6:04) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(6:40) Paul Perkins rush to the right for 2 yards to the Dal21. Tackled by Anthony Hitchens and Sean Lee.","(7:09) Eli Manning pass to the middle to Sterling Shepard for 14 yards to the Dal23. Tackled by Orlando Scandrick.","(7:52) Paul Perkins rush up the middle for a loss of 1 yard to the Dal37. Tackled by Orlando Scandrick and Sean Lee. FUMBLE, recovered by NYG (Paul Perkins).","(8:25) Paul Perkins rush to the left for 3 yards to the Dal36. Tackled by Byron Jones and Terrell McClain.","(8:54) Eli Manning pass to the middle to Jerell Adams for 5 yards to the Dal39. Tackled by Anthony Hitchens and Sean Lee.","(9:26) Paul Perkins rush to the left for 6 yards to the Dal44. Tackled by Jack Crawford.","(10:06) Paul Perkins rush to the right for 4 yards to the NYG50. Tackled by David Irving and Cedric Thornton.","(10:39) Paul Perkins rush up the middle for 2 yards to the NYG46. Tackled by Barry Church and Jack Crawford.","(10:50) Chris Jones punts for 38 yards to NYG44. Odell Beckham Jr. - no return. FUMBLE, recovered by NYG (Odell Beckham Jr.).","(11:32) Dak Prescott pass to the right to Jason Witten for 8 yards to the Dal18. Tackled by Keenan Robinson and Eli Apple.","(12:14) Dak Prescott rush up the middle for 1 yard to the Dal10. Tackled by Olivier Vernon and Romeo Okwara.","(12:20) Dak Prescott incomplete pass to the right intended for Jason Witten defensed by Keenan Robinson defensed by Romeo Okwara.","(12:32) Brad Wing punts for 57 yards to Dal15. Cole Beasley return for 3 yards to Dal18. Tackled by Kelvin Sheppard and Zak DeOssie. Penalty: Holding on Dallas (Leon McFadden) -9 yards.","(13:14) Eli Manning pass to the middle to Rashad Jennings for 5 yards to the NYG28. Tackled by Sean Lee.","(13:44) Rashad Jennings rush up the middle for 4 yards to the NYG23. Tackled by Terrell McClain and Sean Lee.","(13:51) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(14:05) Chris Jones punts for 48 yards to NYG24. Odell Beckham Jr. return for 5 yards to NYG29. Tackled by Gavin Escobar. Penalty: Illegal Block on New York (B.J. Goodson) -10 yards.","(14:10) Dak Prescott incomplete pass to the right intended for Jason Witten.","(14:18) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(15:00) Ezekiel Elliott rush to the right for 3 yards to the Dal28. Tackled by Keenan Robinson and Dominique Rodgers-Cromartie.","(15:00) Robbie Gould kicks off to the endzone. Touchback.","(0:02) 55 yard field goal attempt by Dan Bailey is NO GOOD. Holder: Chris Jones.","(0:02) New York Giants timeout.","(0:02) Dallas Cowboys timeout.","(0:11) Dak Prescott pass to the left to Terrance Williams for 18 yards to the NYG37. Tackled by Eli Apple.","(0:16) Dak Prescott pass to the right to Lance Dunbar for 4 yards to the Dal45. Tackled by Jonathan Casillas.","(0:16) Dallas Cowboys timeout.","(0:23) Dak Prescott pass to the right to Cole Beasley for 13 yards to the Dal41. Tackled by Landon Collins.","(0:32) Dak Prescott pass to the left to Cole Beasley for 7 yards to the Dal28. Tackled by Landon Collins and Dominique Rodgers-Cromartie.","(0:42) Brad Wing punts for 46 yards to Dal31. Cole Beasley - no return. Tackled by Dwayne Harris. Penalty: Holding on Dallas -10 yards.","(0:42) Dallas Cowboys timeout.","(0:50) Bobby Rainey rush up the middle for 5 yards to the NYG23. Tackled by Sean Lee and Barry Church.","(1:27) Eli Manning pass to the right to Bobby Rainey for 4 yards to the NYG18. Tackled by Jeff Heath.","(1:31) Eli Manning incomplete pass to the right intended for Victor Cruz.","(1:38) Chris Jones punts for 31 yards to NYG14. No return.","(1:38) New York Giants timeout.","(1:56) Dak Prescott pass to the left to Lance Dunbar for 4 yards to the NYG45. Tackled by Romeo Okwara.","(2:00) Dak Prescott incomplete pass to the right intended for Cole Beasley defensed by Dominique Rodgers-Cromartie.","(2:00) Two Minute Warning.","(2:28) Ezekiel Elliott rush to the left for 4 yards to the NYG49. Tackled by Robert Thomas and Damon Harrison.","(2:56) Ezekiel Elliott rush to the left for 14 yards to the Dal47. Tackled by Dominique Rodgers-Cromartie.","(3:10) Brad Wing punts for 42 yards to Dal43. Cole Beasley - no return. Tackled by Kelvin Sheppard and Keenan Robinson. Penalty: Holding on Dallas (Byron Jones) -10 yards.","(3:14) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by Barry Church.","(3:26) Eli Manning incomplete pass to the right intended for Roger Lewis.","(3:51) Paul Perkins rush to the right for 5 yards to the NYG15. Tackled by Sean Lee.","(4:00) Chris Jones punts for 30 yards to NYG10. No return.","(4:54) Dak Prescott sacked at NYG40 for a loss of 8 yards by Devon Kennard. FUMBLE, recovered by Dal (Doug Free).","(5:01) Dak Prescott incomplete pass to the left intended for Terrance Williams.","(5:37) Ezekiel Elliott rush to the right for a loss of 1 yard to the NYG32. Tackled by Johnathan Hankins and Romeo Okwara.","(6:16) Ezekiel Elliott rush to the right for 13 yards to the NYG31. Tackled by Andrew Adams and Landon Collins.","(6:47) Penalty: Offside on New York (Olivier Vernon) 5 yards.","(7:26) Ezekiel Elliott rush up the middle for 2 yards to the NYG49. Tackled by Coty Sensabaugh and Damon Harrison.","(7:36) Eli Manning sacked at Dal49 for a loss of 11 yards by Benson Mayowa. FUMBLE, recovered by Dal (Sean Lee). Tackled by Bobby Hart.","(8:11) Rashad Jennings rush to the right for 5 yards to the Dal38. Tackled by Brandon Carr and Anthony Hitchens.","(8:38) Eli Manning pass to the middle to Will Tye for 7 yards to the Dal43. Tackled by Sean Lee and Anthony Hitchens.","(8:49) Chris Jones punts for 45 yards to NYG38. Odell Beckham Jr. return for 12 yards to NYG50. Tackled by L.P. Ladouceur.","(8:55) Dak Prescott incomplete pass to the left intended for Lance Dunbar.","(9:42) Dak Prescott sacked at Dal17 for a loss of 5 yards by Romeo Okwara.","(10:24) Ezekiel Elliott rush to the right for 4 yards to the Dal22. Tackled by Leon Hall and Devon Kennard.","(11:02) Ezekiel Elliott rush to the right for 15 yards to the Dal18. Tackled by Leon Hall.","(11:13) Brad Wing punts for 35 yards to Dal3. No return.","(11:53) Eli Manning pass to the middle to Shane Vereen for 10 yards to the Dal38. Tackled by Orlando Scandrick.","(11:59) Eli Manning incomplete pass to the right intended for Victor Cruz.","(12:14) Penalty: False Start on New York (Paul Perkins) -5 yards.","(12:47) Paul Perkins rush to the left for no gain to the Dal43. Tackled by Terrell McClain and Benson Mayowa.","(12:53) Penalty: Roughing Passer on Dallas (Anthony Hitchens) 15 yards.","(13:33) Paul Perkins rush to the right for 3 yards to the NYG42. Tackled by Byron Jones and Anthony Hitchens.","(13:41) Dak Prescott pass intended for Dez Bryant INTERCEPTED by Janoris Jenkins. No return. Tackled by Dez Bryant.","(14:23) Ezekiel Elliott rush to the left for 4 yards to the NYG47. Tackled by Johnathan Hankins and Kerry Wynn.","(15:00) Ezekiel Elliott rush to the left for 4 yards to the Dal49. Tackled by Kerry Wynn and Landon Collins.","(0:38) Dak Prescott pass to the right to Jason Witten for 13 yards to the Dal45. Tackled by Kelvin Sheppard and Jonathan Casillas.","(0:45) Eli Manning sacked at Dal31 for a loss of 7 yards. FUMBLE, recovered by Dal (Cedric Thornton) and returned for 1 yard. Tackled by Weston Richburg.","(1:27) Eli Manning pass to the right to Odell Beckham Jr. for 7 yards to the Dal24. Tackled by Brandon Carr and Justin Durant.","(1:35) Eli Manning incomplete pass to the right intended for Odell Beckham Jr. defensed by Brandon Carr.","(2:15) Rashad Jennings rush to the right for no gain to the Dal31. Tackled by Sean Lee.","(2:42) Eli Manning pass to the right to Rashad Jennings for 7 yards to the Dal31. Tackled by Terrell McClain.","(3:16) Eli Manning pass to the middle to Odell Beckham Jr. for 19 yards to the Dal38. Tackled by Brandon Carr and Byron Jones.","(3:56) Eli Manning pass to the left to Sterling Shepard for 8 yards to the NYG43. Tackled by Byron Jones.","(4:38) Eli Manning pass to the right to Jerell Adams for 6 yards to the NYG35. Tackled by Barry Church.","(4:44) Dan Bailey kicks off to the NYG9. Bobby Rainey return for 20 yards to NYG29. Tackled by Kyle Wilber and Andrew Gachkar.","(4:44) Dan Bailey extra point is good.","(4:51) Dak Prescott pass to the right to Terrance Williams for 31 yards for a TOUCHDOWN.","(5:00) Dak Prescott incomplete pass to the right intended for Brice Butler defensed by Eli Apple.","(5:39) Ezekiel Elliott rush to the left for 3 yards to the NYG31. Tackled by Jonathan Casillas and Keenan Robinson.","(6:15) Ezekiel Elliott rush to the right for 8 yards to the NYG34. Tackled by Andrew Adams and Olivier Vernon.","(6:22) Dak Prescott incomplete pass to the right intended for Ezekiel Elliott.","(6:55) Ezekiel Elliott rush to the right for 9 yards to the NYG47. Tackled by Damon Harrison and Romeo Okwara. Penalty: Holding on New York (Johnathan Hankins) 5 yards.","(7:31) Ezekiel Elliott rush to the right for 2 yards to the Dal44. Tackled by Devon Kennard and Keenan Robinson.","(8:02) Dak Prescott pass to the right to Terrance Williams for 7 yards to the Dal42. Tackled by Landon Collins.","(8:44) Ezekiel Elliott rush to the right for 2 yards to the Dal35. Tackled by Andrew Adams and Kelvin Sheppard.","(8:50) Dak Prescott incomplete pass to the left intended for Ezekiel Elliott.","(9:00) Brad Wing punts for 43 yards to Dal33. No return.","(9:39) Eli Manning sacked at NYG24 for a loss of 8 yards by Tyrone Crawford.","(10:20) Eli Manning pass to the left to Paul Perkins for no gain to the NYG32. Tackled by Sean Lee.","(10:50) Paul Perkins rush to the left for 2 yards to the NYG32. Tackled by Sean Lee.","(10:58) Chris Jones punts for 45 yards to NYG30. No return.","(11:05) Dak Prescott incomplete pass to the left intended for Dez Bryant.","(11:45) Dak Prescott pass to the left to Jason Witten for 4 yards to the Dal25. Tackled by Dominique Rodgers-Cromartie.","(12:26) Ezekiel Elliott rush to the right for 3 yards to the Dal21. Tackled by Jonathan Casillas.","(12:33) Brad Wing punts for 44 yards to Dal18. No return.","(12:39) Eli Manning incomplete pass to the right intended for Shane Vereen.","(13:12) Rashad Jennings rush to the left for 4 yards to the NYG38. Tackled by Benson Mayowa and Barry Church.","(13:19) Penalty: Holding on New York (Bobby Hart) -10 yards.","(13:54) Rashad Jennings rush to the right for 3 yards to the NYG44. Tackled by Maliek Collins and Terrell McClain.","(14:19) Eli Manning pass to the right to Will Tye for 12 yards to the NYG41. Tackled by Brandon Carr.","(14:53) Rashad Jennings rush to the left for 3 yards to the NYG29. Tackled by Maliek Collins.","(15:00) Dan Bailey kicks off to the NYG6. Bobby Rainey return for 20 yards to NYG26. Tackled by Byron Jones."]