["(0:18) Matt Cassel rush up the middle for a loss of 1 yard to the Det48.","(0:28) Matthew Stafford pass intended for Eric Ebron INTERCEPTED by Perrish Cox and returned for 3 yards.","(0:28) Detroit Lions timeout.","(0:34) Matthew Stafford pass to the left to Theo Riddick for no gain to the Det45. Tackled by Daimion Stafford.","(0:38) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(1:04) Matthew Stafford pass to the middle to Eric Ebron for 29 yards to the Det45. Tackled by Da'Norris Searcy.","(1:04) Detroit Lions timeout.","(1:09) Matthew Stafford sacked at Det16 for a loss of 9 yards by Brian Orakpo.","(1:13) Matthew Stafford incomplete pass to the left intended for Anquan Boldin.","(1:13) Ryan Succop kicks off to the endzone. Touchback.","(1:13) Marcus Mariota sacked on 2 pt conversion attempt.","(1:19) Marcus Mariota pass to the middle to Andre Johnson for 9 yards for a TOUCHDOWN.","(2:00) Marcus Mariota pass to the right to Tajae Sharpe for 3 yards to the Det9. Tackled by Quandre Diggs.","(2:00) Two Minute Warning.","(2:08) Marcus Mariota pass to the left to DeMarco Murray for 7 yards to the Det12. Tackled by Tavon Wilson and Tahir Whitehead.","(2:13) Penalty: Pass Interference on Tennessee (Rishard Matthews) -10 yards.","(2:19) Derrick Henry rush to the left for 6 yards to the Det9. Tackled by Nevin Lawson.","(2:57) Marcus Mariota pass to the middle to Rishard Matthews for 10 yards to the Det15. Tackled by Tahir Whitehead.","(3:05) Marcus Mariota pass to the left to DeMarco Murray for 22 yards to the Det25. Tackled by Glover Quin.","(3:11) Marcus Mariota pass to the left to DeMarco Murray for 5 yards to the Det47. Tackled by Rafael Bush.","(3:55) Derrick Henry rush to the left for 2 yards to the Ten48. Tackled by Thurston Armbrister.","(4:37) Marcus Mariota pass to the left to Phillip Supernaw for 7 yards to the Ten46. Tackled by Tahir Whitehead.","(5:19) Marcus Mariota pass to the right to Tajae Sharpe for 7 yards to the Ten39. Tackled by Glover Quin.","(5:53) Marcus Mariota pass to the right to DeMarco Murray for 4 yards to the Ten32. Tackled by Brandon Copeland.","(6:35) DeMarco Murray rush to the right for 1 yard to the Ten28. Tackled by Thurston Armbrister.","(7:04) DeMarco Murray rush to the right for 10 yards to the Ten27. Tackled by Thurston Armbrister.","(7:15) Sam Martin punts for 48 yards to Ten10. Marc Mariani return for 7 yards to Ten17. Tackled by Don Carey. FUMBLE, recovered by Ten.","(7:22) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(8:01) Dwayne Washington rush to the left for a loss of 2 yards to the Det42. Tackled by Daimion Stafford.","(8:40) Matthew Stafford pass to the left to Golden Tate for 8 yards to the Det44. Tackled by Jason McCourty.","(8:52) Brett Kern punts for 54 yards to Det23. Andre Roberts return for 13 yards to Det36. Tackled by Beau Brinkley.","(8:58) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe defensed by Darius Slay.","(9:39) Marcus Mariota pass to the right to Rishard Matthews for 3 yards to the Ten23. Tackled by Darius Slay.","(9:43) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe.","(9:48) Penalty: Pass Interference on Detroit (Darius Slay) 8 yards.","(10:35) DeMarco Murray rush up the middle for 3 yards to the Ten12. Tackled by Tavon Wilson.","(10:42) Sam Martin punts for 38 yards to Ten9. No return.","(11:17) Penalty: Delay of Game on Detroit (Sam Martin) -5 yards.","(11:52) Matthew Stafford pass to the left to Theo Riddick for 8 yards to the Ten42. Tackled by Jurrell Casey.","(11:59) Matthew Stafford incomplete pass to the left intended for Golden Tate defensed by Jason McCourty.","(12:43) Matthew Stafford sacked at Det50 for a loss of 6 yards by Karl Klug.","(13:06) Theo Riddick rush to the left for 10 yards to the Ten44. Tackled by Wesley Woodyard.","(13:46) Theo Riddick rush to the right for 3 yards to the Det46. Tackled by Avery Williamson.","(14:11) Matthew Stafford pass to the right to Marvin Jones Jr. for 10 yards to the Det43. Tackled by Perrish Cox.","(14:54) Matthew Stafford pass to the left to Theo Riddick for 8 yards to the Det33. Tackled by Kevin Dodd.","(14:54) Ryan Succop kicks off to the endzone. Touchback.","(14:54) Ryan Succop extra point is good.","(15:00) Marcus Mariota pass to the left to Delanie Walker for 30 yards for a TOUCHDOWN.","(0:06) Derrick Henry rush to the left for 5 yards to the Det30. Tackled by Brandon Copeland.","(0:22) Marcus Mariota pass to the left to Derrick Henry for 9 yards to the Det35. Tackled by Tahir Whitehead.","(0:26) Penalty: Pass Interference on Detroit (Nevin Lawson) 5 yards.","(1:00) Derrick Henry rush up the middle for 6 yards to the Det49. Tackled by Tyrunn Walker.","(1:40) Marcus Mariota pass to the right to Rishard Matthews for 20 yards to the Ten45. Tackled by Tavon Wilson.","(1:40) Sam Martin kicks off to the endzone. Touchback.","(1:44) Matt Prater 27 yard field goal attempt is GOOD. Holder: Sam Martin.","(1:49) Matthew Stafford incomplete pass to the left intended for Eric Ebron defensed by Daimion Stafford.","(1:54) Matthew Stafford incomplete pass to the left intended for Theo Riddick.","(2:27) Matthew Stafford pass to the left to Marvin Jones Jr. for 1 yard to the Ten9. Tackled by Jason McCourty.","(2:32) Penalty: Roughing Passer on Tennessee (David Bass) 10 yards.","(3:09) Dwayne Washington rush up the middle for 1 yard to the Ten20. Tackled by Avery Williamson.","(3:54) Matthew Stafford rush to the right for 24 yards to the Ten21. Tackled by Jason McCourty.","(4:24) Penalty: Pass Interference on Detroit (Anquan Boldin) -10 yards.","(5:01) Theo Riddick rush up the middle for 6 yards to the Ten35. Tackled by Aaron Wallace.","(5:07) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(5:12) Penalty: Holding on Tennessee (Perrish Cox) 5 yards.","(5:58) Theo Riddick rush to the right for 1 yard to the Ten46. Tackled by Karl Klug and Sean Spence.","(6:38) Matthew Stafford pass to the right to Eric Ebron for 7 yards to the Ten47. Tackled by Kevin Byard.","(6:44) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(7:21) Dwayne Washington rush to the right for 4 yards to the Det46. Tackled by Sean Spence.","(7:44) Matthew Stafford pass to the right to Eric Ebron for 11 yards to the Ten43. Tackled by Daimion Stafford. Penalty: Unnecessary Roughness on Detroit (Golden Tate) -15 yards.","(8:23) Dwayne Washington rush to the left for 28 yards to the Det46. Tackled by Avery Williamson.","(8:50) Penalty: Holding on Detroit (Laken Tomlinson) -10 yards.","(8:58) Marcus Mariota pass intended for Rishard Matthews INTERCEPTED by Glover Quin. No return.","(9:37) DeMarco Murray rush to the left for 5 yards to the Ten42. Tackled by Devin Taylor.","(10:16) Marcus Mariota pass to the right to Delanie Walker for 9 yards to the Ten37. Tackled by Tahir Whitehead and Glover Quin.","(10:54) Marcus Mariota pass to the left to Tajae Sharpe for 12 yards to the Ten28. Tackled by Tavon Wilson.","(11:28) Marcus Mariota rush to the left for 6 yards to the Ten16. Tackled by Tahir Whitehead.","(12:12) DeMarco Murray rush up the middle for 4 yards to the Ten10. Tackled by Stefan Charles.","(12:18) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(12:30) Sam Martin punts for 51 yards to Ten10. Marc Mariani return for 2 yards to Ten12. Tackled by Thurston Armbrister. Penalty: Illegal Block on Tennessee (Brice McCain) -6 yards.","(12:35) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(13:19) Matthew Stafford pass to the middle to Anquan Boldin for 6 yards to the Det39. Tackled by Da'Norris Searcy and Avery Williamson.","(13:51) Matthew Stafford sacked at Det33 for a loss of 1 yard by Brian Orakpo.","(14:07) Penalty: Illegal Shift on Detroit -5 yards.","(14:37) Matthew Stafford pass to the left to Marvin Jones Jr. for 8 yards to the Det39. Tackled by Jason McCourty.","(15:00) Theo Riddick rush up the middle for 6 yards to the Det31. Tackled by Rashad Johnson.","(15:00) Ryan Succop kicks off to the endzone. Touchback.","(0:15) Matthew Stafford sacked at Det28 for a loss of 6 yards by Kevin Dodd.","(0:26) Brett Kern punts for 51 yards to Det24. Andre Roberts return for 10 yards to Det34. Tackled by Kevin Byard.","(0:27) Detroit Lions timeout.","(0:31) Marcus Mariota sacked at Ten25 for no gain by Kerry Hyder.","(0:51) Marcus Mariota pass to the right to Rishard Matthews for 7 yards to the Ten25. Tackled by Tavon Wilson.","(0:58) Marcus Mariota incomplete pass to the left intended for Rishard Matthews defensed by Nevin Lawson.","(1:04) Sam Martin kicks off to the Ten3. Antonio Andrews return for 15 yards to Ten18. Tackled by Brandon Copeland.","(1:09) Matt Prater 42 yard field goal attempt is GOOD. Holder: Sam Martin.","(1:09) Tennessee Titans timeout.","(1:14) Theo Riddick rush up the middle for 2 yards to the Ten24. Tackled by Angelo Blackson.","(1:19) Matthew Stafford incomplete pass to the right.","(1:23) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(1:30) Matthew Stafford pass to the left to Golden Tate for 5 yards to the Ten16. Tackled by Sean Spence. Penalty: Holding on Detroit (Anquan Boldin) -10 yards.","(1:35) Penalty: Holding on Detroit (Laken Tomlinson) -10 yards.","(1:40) Penalty: Pass Interference on Detroit (Eric Ebron) -10 yards.","(1:44) Penalty: Pass Interference on Tennessee (Perrish Cox) 4 yards.","(1:44) Tennessee Titans timeout.","(1:48) Theo Riddick rush up the middle for 3 yards to the Ten5. Tackled by Brian Orakpo.","(2:00) Matthew Stafford pass to the right to Marvin Jones Jr. for 47 yards to the Ten8. Tackled by Brice McCain.","(2:00) Two Minute Warning.","(2:10) Theo Riddick rush to the left for 1 yard to the Det45. Tackled by Kevin Dodd.","(2:16) Matthew Stafford incomplete pass to the left intended for Anquan Boldin.","(3:00) Ameer Abdullah rush up the middle for 24 yards to the Det44. Tackled by Avery Williamson.","(3:06) Penalty: Illegal Use of Hands on Tennessee (Kevin Dodd) 5 yards.","(3:38) Matthew Stafford pass to the right to Marvin Jones Jr. for 9 yards to the Det15. Tackled by Perrish Cox.","(4:19) Matthew Stafford pass to the right to Marvin Jones Jr. for 4 yards to the Det6. Tackled by Perrish Cox.","(5:02) Ameer Abdullah rush to the left for 1 yard to the Det2. Tackled by Brian Orakpo.","(5:11) Brett Kern punts for 37 yards to Det1. No return.","(5:54) Marcus Mariota sacked at Det38 for a loss of 12 yards by Haloti Ngata and Devin Taylor.","(6:01) Marcus Mariota incomplete pass to the right intended for Anthony Fasano defensed by A'Shawn Robinson.","(6:42) Derrick Henry rush up the middle for no gain to the Det26. Tackled by Kyle Van Noy.","(7:27) DeMarco Murray rush up the middle for 67 yards to the Det26. Tackled by Darius Slay.","(7:36) Sam Martin punts for 32 yards to Ten7. No return.","(8:18) Theo Riddick rush to the right for a loss of 1 yard to the Ten39. Tackled by Rashad Johnson and Aaron Wallace.","(8:38) Matthew Stafford pass to the right to Marvin Jones Jr. for 9 yards to the Ten38. Tackled by Perrish Cox.","(9:13) Theo Riddick rush to the left for a loss of 1 yard to the Ten47. Tackled by Wesley Woodyard and Angelo Blackson.","(9:35) Matthew Stafford rush up the middle for 7 yards to the Det49. Tackled by Da'Norris Searcy. Penalty: Illegal Use of Hands on Tennessee (Kevin Dodd) 5 yards.","(10:20) Matthew Stafford pass to the right to Theo Riddick for 12 yards to the Det42. Tackled by Karl Klug.","(10:26) Matthew Stafford incomplete pass to the left intended for Golden Tate.","(10:52) Penalty: Holding on Detroit (Travis Swanson) -10 yards.","(11:15) Matthew Stafford pass to the right to Anquan Boldin for 6 yards to the Det40. Tackled by Perrish Cox.","(11:19) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(11:55) Theo Riddick rush to the left for 7 yards to the Det34. Tackled by Rashad Johnson.","(12:03) Ryan Succop kicks off to the Det-3. Dwayne Washington return for 25 yards to Det22. Tackled by Jason McCourty. Penalty: Offside on Tennessee (Kevin Byard) 5 yards.","(12:08) Ryan Succop 46 yard field goal attempt is GOOD. Holder: Brett Kern.","(12:57) Marcus Mariota pass to the middle to DeMarco Murray for 8 yards to the Det28. Tackled by Tahir Whitehead.","(13:39) Marcus Mariota pass to the right to DeMarco Murray for 3 yards to the Det36. Tackled by Stefan Charles.","(13:57) Derrick Henry rush to the left for 3 yards to the Det24. Tackled by Darius Slay. Penalty: Illegal Crackback on Tennessee (Tajae Sharpe) -15 yards.","(14:02) Marcus Mariota incomplete pass to the left intended for Anthony Fasano.","(14:22) Marcus Mariota pass to the middle to Tajae Sharpe for 11 yards to the Det27. Tackled by Nevin Lawson.","(15:00) Derrick Henry rush to the right for 4 yards to the Det38. Tackled by Haloti Ngata.","(0:20) Penalty: Offside on Detroit (Devin Taylor) 5 yards.","(1:05) Marcus Mariota pass to the right to Delanie Walker for 5 yards to the Det47. Tackled by Tahir Whitehead.","(1:24) Marcus Mariota rush up the middle for 5 yards to the Ten43. Tackled by Antwione Williams and Devin Taylor. Penalty: Holding on Detroit (Darius Slay) 5 yards.","(1:33) Marcus Mariota incomplete pass to the left intended for Andre Johnson.","(2:13) Marcus Mariota pass to the right to Delanie Walker for a loss of 1 yard to the Ten38. Tackled by Tavon Wilson.","(2:45) Derrick Henry rush to the left for 5 yards to the Ten39. Tackled by Wallace Gilberry.","(3:33) Marcus Mariota pass to the left to Delanie Walker for 8 yards to the Ten34. Tackled by Tavon Wilson.","(4:15) Marcus Mariota pass to the right to Anthony Fasano for 1 yard to the Ten26. Tackled by Tahir Whitehead.","(4:15) Sam Martin kicks off to the endzone. Touchback.","(4:15) Matt Prater extra point is good.","(4:23) Matthew Stafford pass to the left to Anquan Boldin for 24 yards for a TOUCHDOWN.","(4:28) Matthew Stafford incomplete pass to the right intended for Eric Ebron defensed by Da'Norris Searcy.","(4:34) Penalty: Holding on Detroit (Eric Ebron) -10 yards.","(5:06) Ameer Abdullah rush to the right for 4 yards to the Ten14. Tackled by Karl Klug.","(5:47) Matthew Stafford pass to the left to Eric Ebron for 6 yards to the Ten18. Tackled by Jason McCourty.","(6:06) Ameer Abdullah rush to the right for 3 yards to the Ten24. Tackled by Avery Williamson.","(6:26) Matthew Stafford pass to the right to Anquan Boldin for 12 yards to the Ten27. Tackled by Wesley Woodyard.","(6:43) Matthew Stafford pass to the left to Marvin Jones Jr. for 30 yards to the Ten39. Tackled by Jason McCourty.","(7:03) Ameer Abdullah rush up the middle for 5 yards to the Det31. Tackled by David Bass.","(7:10) Penalty: Offside on Tennessee (DaQuan Jones) 5 yards.","(7:16) Brett Kern kicks off to the Det21. Andre Roberts return for 10 yards to Det31. Tackled by Sean Spence. Penalty: Holding on Detroit (Brandon Copeland) -10 yards.","(7:20) DeMarco Murray rush to the right for a loss of 5 yards to the Ten0. Tackled by Devin Taylor. Safety.","(7:28) Sam Martin punts for 48 yards to Ten10. No return. Penalty: Holding on Tennessee (Brice McCain) -5 yards.","(7:34) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(7:37) Matthew Stafford incomplete pass to the middle intended for Anquan Boldin.","(7:57) Ameer Abdullah rush to the right for 1 yard to the Det42. Tackled by Da'Norris Searcy.","(8:02) 51 yard field goal attempt by Ryan Succop is NO GOOD. Holder: Brett Kern.","(8:50) Marcus Mariota sacked at Det33 for a loss of 2 yards by Devin Taylor.","(9:33) DeMarco Murray rush up the middle for a loss of 2 yards to the Det31. Tackled by Khyri Thornton.","(9:33) Tennessee Titans timeout.","(10:19) DeMarco Murray rush up the middle for 3 yards to the Det29. Tackled by A'Shawn Robinson.","(10:47) Penalty: Offside on Detroit (Khyri Thornton) 5 yards.","(11:23) Marcus Mariota pass to the left to Delanie Walker for 32 yards to the Det37. Tackled by Nevin Lawson.","(12:03) Derrick Henry rush to the left for 9 yards to the Ten31. Tackled by Tahir Whitehead and Devin Taylor.","(12:43) DeMarco Murray rush to the left for 3 yards to the Ten22. Tackled by Devin Taylor.","(13:10) Marcus Mariota pass to the right to DeMarco Murray for 7 yards to the Ten19. Tackled by Rafael Bush.","(13:47) DeMarco Murray rush up the middle for 1 yard to the Ten12. Tackled by Tyrunn Walker and Antwione Williams.","(14:31) DeMarco Murray rush up the middle for a loss of 1 yard to the Ten11. Tackled by Antwione Williams.","(14:55) Penalty: Offside on Detroit (Haloti Ngata) 5 yards.","(15:00) Sam Martin kicks off to the Ten-4. Marc Mariani return for 19 yards to Ten15. Tackled by Antwione Williams. Penalty: Holding on Tennessee (Cody Riggs) -8 yards."]