["(0:28) Trevor Siemian rush up the middle for a loss of 1 yard to the Den11.","(0:33) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(0:33) Denver Broncos timeout.","(0:47) Andy Dalton pass to the right to Giovani Bernard for 5 yards to the Den11. Tackled by Chris Harris Jr..","(1:14) Andy Dalton sacked at Den16 for a loss of 5 yards by Von Miller.","(1:34) Andy Dalton sacked at Den11 for no gain by Shane Ray.","(1:41) Andy Dalton pass to the right to Giovani Bernard for 10 yards to the Den11. Tackled by Brandon Marshall.","(2:00) Andy Dalton rush to the right for 4 yards to the Den21. Tackled by Brandon Marshall.","(2:00) Two Minute Warning.","(2:19) Andy Dalton pass to the left to Brandon LaFell for 27 yards to the Den25. Tackled by Bradley Roby.","(2:19) Penalty: False Start on Cincinnati (A.J. Green) -5 yards.","(2:42) Andy Dalton pass to the right to Tyler Boyd for 9 yards to the Den47. Tackled by Will Parks.","(3:02) Andy Dalton pass to the left to C.J. Uzomah for 9 yards to the Cin44. Tackled by Darian Stewart and Chris Harris Jr..","(3:25) Andy Dalton pass to the right to A.J. Green for 20 yards to the Cin35. Tackled by Will Parks.","(3:33) Penalty: Holding on Cincinnati (Russell Bodine) -10 yards.","(3:55) Andy Dalton pass to the middle to Giovani Bernard for 5 yards to the Cin25. Tackled by Darian Stewart.","(4:03) Riley Dixon punts for 36 yards to Cin0. Touchback.","(4:03) Cincinnati Bengals timeout.","(4:07) C.J. Anderson rush to the right for 1 yard to the Cin36. Tackled by Margus Hunt.","(4:07) Cincinnati Bengals timeout.","(4:12) C.J. Anderson rush to the right for 1 yard to the Cin37. Tackled by Margus Hunt.","(4:12) Cincinnati Bengals timeout.","(4:17) C.J. Anderson rush to the left for 2 yards to the Cin38. Tackled by Domata Peko.","(4:23) Andy Dalton pass intended for C.J. Uzomah INTERCEPTED by Will Parks defensed by T.J. Ward and returned for 1 yard. Tackled by C.J. Uzomah.","(4:23) Brandon McManus kicks off to the endzone. Touchback.","(4:23) Brandon McManus extra point is good.","(4:32) Trevor Siemian pass to the left to Demaryius Thomas for 55 yards for a TOUCHDOWN.","(4:36) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas defensed by Adam Jones.","(5:16) C.J. Anderson rush to the right for a loss of 1 yard to the Den45. Tackled by Geno Atkins.","(6:02) Trevor Siemian pass to the left to Jeff Heuerman for 29 yards to the Den46. Tackled by George Iloka.","(6:09) Kevin Huber punts for 51 yards to Den17. No return.","(6:13) Andy Dalton incomplete pass to the left intended for A.J. Green.","(6:20) Andy Dalton incomplete pass to the right.","(6:56) Andy Dalton pass to the right to Brandon LaFell for 7 yards to the Cin32. Tackled by Aqib Talib.","(6:56) Brandon McManus kicks off to the endzone. Touchback.","(6:56) Trevor Siemian 2 pt rush attempt.","(7:01) Trevor Siemian pass to the left to John Phillips for 1 yard for a TOUCHDOWN.","(7:42) Andy Janovich rush to the right for 2 yards to the Cin1. Tackled by George Iloka.","(8:10) Trevor Siemian pass to the right to Emmanuel Sanders for 17 yards to the Cin3. Tackled by Josh Shaw.","(8:47) Devontae Booker rush to the left for 2 yards to the Cin20. Tackled by Pat Sims.","(9:18) Trevor Siemian pass to the left to Bennie Fowler for 13 yards to the Cin22. Tackled by Adam Jones and Shawn Williams.","(9:55) Trevor Siemian pass to the left to Demaryius Thomas for 16 yards to the Cin35. Tackled by Shawn Williams.","(10:13) Penalty: False Start on Denver (Demaryius Thomas) -5 yards.","(10:48) Trevor Siemian pass to the left to Emmanuel Sanders for 11 yards to the Cin46. Tackled by Darqueze Dennard.","(11:34) Trevor Siemian sacked at Den43 for a loss of 3 yards by Will Clarke.","(12:12) Devontae Booker rush to the right for 3 yards to the Den46. Tackled by Carlos Dunlap and Shawn Williams.","(12:44) Trevor Siemian pass to the left to John Phillips for 8 yards to the Den43. Tackled by Adam Jones.","(13:24) Devontae Booker rush to the left for 2 yards to the Den35. Tackled by Rey Maualuga and Margus Hunt.","(13:55) Trevor Siemian pass to the right to Demaryius Thomas for 9 yards to the Den33. Tackled by Dre Kirkpatrick.","(14:17) Penalty: Holding on Cincinnati (Michael Johnson) 5 yards.","(14:48) Trevor Siemian rush up the middle for 1 yard to the Den19. Tackled by Domata Peko.","(14:52) Mike Nugent kicks off to the Den0. Cody Latimer return for 18 yards to Den18. Tackled by Clayton Fejedelem.","(14:56) Mike Nugent 34 yard field goal attempt is GOOD. Holder: Kevin Huber.","(15:00) Andy Dalton incomplete pass to the right intended for Brandon LaFell defensed by Chris Harris Jr..","(0:16) Giovani Bernard rush to the right for a loss of 3 yards to the Den16. Tackled by Brandon Marshall and Shane Ray.","(0:53) Giovani Bernard rush to the right for 2 yards to the Den13. Tackled by Darius Kilgo.","(1:35) Jeremy Hill rush to the left for 1 yard to the Den15. Tackled by Brandon Marshall and Adam Gotsis.","(2:11) Andy Dalton pass to the right to A.J. Green for 9 yards to the Den16. Tackled by Aqib Talib.","(2:44) Andy Dalton pass to the left to Giovani Bernard for 10 yards to the Den25. Tackled by Darian Stewart.","(3:26) Jeremy Hill rush to the left for 2 yards to the Den35. Tackled by Todd Davis.","(4:01) Jeremy Hill rush to the left for 4 yards to the Den37. Tackled by Dekoda Watson.","(4:40) Andy Dalton pass to the left to James Wright for 10 yards to the Den41.","(5:03) Andy Dalton pass to the right to Giovani Bernard for 6 yards to the Cin49. Tackled by Corey Nelson.","(5:49) Andy Dalton rush up the middle for 15 yards to the Cin43. Tackled by T.J. Ward.","(6:20) Penalty: Holding on Cincinnati (Kevin Zeitler) -10 yards.","(6:55) Andy Dalton pass to the left to A.J. Green for 3 yards to the Cin38. Tackled by Chris Harris Jr..","(7:25) Andy Dalton rush up the middle for 10 yards to the Cin35. Tackled by Aqib Talib.","(8:10) Jeremy Hill rush to the right for 1 yard to the Cin25. Tackled by Todd Davis.","(8:22) Riley Dixon punts for 53 yards to Cin20. Alex Erickson return for 4 yards to Cin24. Tackled by Shaquil Barrett and Dekoda Watson.","(8:55) C.J. Anderson rush to the left for 13 yards to the Den27. Tackled by Vincent Rey and Adam Jones.","(9:36) Trevor Siemian sacked at Den14 for a loss of 6 yards by Carlos Dunlap.","(10:12) C.J. Anderson rush to the right for no gain to the Den20. Tackled by Rey Maualuga.","(10:20) Kevin Huber punts for 53 yards to Den0. Touchback.","(10:59) Andy Dalton pass to the left to Tyler Boyd for 2 yards to the Cin47. Tackled by Derek Wolfe.","(11:23) Andy Dalton pass to the middle to A.J. Green for 4 yards to the Den45. Tackled by Bradley Roby. Penalty: Illegal Block on Cincinnati (Brandon LaFell) -10 yards.","(12:03) Andy Dalton sacked at Den49 for a loss of 4 yards by Shane Ray.","(12:43) Andy Dalton sacked at Den45 for a loss of 8 yards by Shane Ray.","(12:48) Trevor Siemian pass to the left to Demaryius Thomas for 9 yards to the Den34. Tackled by Adam Jones. FUMBLE, recovered by Cin (Karlos Dansby). Tackled by Demaryius Thomas.","(13:00) Kevin Huber punts for 50 yards to Den14. Jordan Norwood return for 11 yards to Den25. Tackled by Josh Shaw and James Wright.","(13:07) Andy Dalton incomplete pass to the right.","(13:13) Andy Dalton incomplete pass to the right intended for A.J. Green.","(13:52) Jeremy Hill rush to the left for no gain to the Cin36. Tackled by Todd Davis.","(14:26) Andy Dalton pass to the right to A.J. Green for 7 yards to the Cin36. Tackled by Aqib Talib.","(15:00) Jeremy Hill rush to the left for 4 yards to the Cin29. Tackled by Shane Ray and Darian Stewart.","(15:00) Brandon McManus kicks off to the endzone. Touchback.","(0:28) Andy Dalton rush up the middle for a loss of 1 yard to the Cin24.","(0:28) Brandon McManus kicks off to the endzone. Touchback.","(0:28) Brandon McManus extra point is BLOCKED.","(0:32) Trevor Siemian pass to the right to Emmanuel Sanders for 7 yards for a TOUCHDOWN.","(0:32) Denver Broncos timeout.","(0:41) Trevor Siemian pass to the right to Emmanuel Sanders for 2 yards to the Cin7. Tackled by Dre Kirkpatrick.","(1:24) C.J. Anderson rush to the left for 9 yards to the Cin9. Tackled by Josh Shaw and Derron Smith.","(1:27) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(2:00) Trevor Siemian pass to the middle to Cody Latimer for 10 yards to the Cin18. Tackled by Vincent Rey.","(2:00) Two Minute Warning.","(2:24) Trevor Siemian pass to the right to Emmanuel Sanders for 1 yard to the Cin28. Tackled by Vincent Rey.","(2:24) Denver Broncos timeout.","(2:30) Trevor Siemian incomplete pass to the left intended for John Phillips defensed by Shawn Williams.","(3:00) Trevor Siemian pass to the left to Andy Janovich for 13 yards to the Cin29. Tackled by Adam Jones.","(3:19) Penalty: Holding on Cincinnati (George Iloka) 5 yards.","(4:03) Devontae Booker rush to the right for 1 yard to the Cin47. Tackled by Rey Maualuga.","(4:43) Trevor Siemian pass to the right to Devontae Booker for 17 yards to the Cin48. Tackled by George Iloka.","(4:49) Penalty: Holding on Denver (Ty Sambrailo) -10 yards.","(4:57) Mike Nugent kicks off to the Den-1. Cody Latimer return for 46 yards to Den45. Tackled by James Wright and Mike Nugent.","(4:57) Mike Nugent extra point is good.","(5:02) Jeremy Hill rush to the left for 4 yards for a TOUCHDOWN.","(5:36) Andy Dalton pass to the right to A.J. Green for 11 yards to the Den4. Tackled by Shaquil Barrett.","(6:19) Andy Dalton pass to the middle to C.J. Uzomah for 22 yards to the Den15. Tackled by Darian Stewart.","(6:55) Jeremy Hill rush to the left for 1 yard to the Den37. Tackled by Shane Ray and Adam Gotsis.","(6:59) Andy Dalton incomplete pass to the right intended for C.J. Uzomah.","(7:37) Andy Dalton pass to the right to A.J. Green for 14 yards to the Den38. Tackled by T.J. Ward.","(7:42) Penalty: Pass Interference on Denver (Bradley Roby) 6 yards.","(8:26) Jeremy Hill rush to the left for 4 yards to the Cin42. Tackled by Von Miller and Brandon Marshall.","(8:33) Andy Dalton incomplete pass to the right.","(8:43) Riley Dixon punts for 46 yards to Cin38. No return.","(8:48) Trevor Siemian incomplete pass to the right intended for C.J. Anderson.","(8:51) Trevor Siemian incomplete pass to the right intended for C.J. Anderson defensed by Karlos Dansby.","(9:29) C.J. Anderson rush to the left for 2 yards to the Den16. Tackled by Domata Peko.","(9:40) Kevin Huber punts for 45 yards to Den14. No return.","(10:20) Giovani Bernard rush to the right for 1 yard to the Cin41. Tackled by Jared Crick and Brandon Marshall.","(11:03) Giovani Bernard rush to the right for 4 yards to the Cin40. Tackled by Todd Davis.","(11:44) Giovani Bernard rush to the left for 4 yards to the Cin36. Tackled by Brandon Marshall.","(12:22) Jeremy Hill rush to the right for 2 yards to the Cin32. Tackled by Derek Wolfe.","(13:07) Andy Dalton rush up the middle for 11 yards to the Cin30. Tackled by Chris Harris Jr..","(13:51) Brandon LaFell rush to the left for a loss of 2 yards to the Cin19. Tackled by Jared Crick.","(13:57) Brandon McManus kicks off to the Cin2. Rex Burkhead return for 19 yards to Cin21. Tackled by Kapri Bibbs.","(13:57) Brandon McManus extra point is good.","(14:04) Trevor Siemian pass to the left to Emmanuel Sanders for 41 yards for a TOUCHDOWN.","(14:29) Trevor Siemian pass to the left to C.J. Anderson for 4 yards to the Cin41. Tackled by Vincent Rey.","(15:00) C.J. Anderson rush to the left for 1 yard to the Cin45. Tackled by Vincent Rey and Pat Sims.","(0:12) Riley Dixon punts for 45 yards to Cin46. Adam Jones - no return. Tackled by Zaire Anderson. FUMBLE, recovered by Den (Shiloh Keo). Tackled by James Wright.","(0:18) Trevor Siemian incomplete pass to the right intended for John Phillips.","(0:44) C.J. Anderson rush to the right for no gain to the Den9. Tackled by Rey Maualuga and Will Clarke.","(0:49) Trevor Siemian incomplete pass to the middle intended for C.J. Anderson.","(0:56) Kevin Huber punts for 32 yards to Den9. No return.","(1:33) Andy Dalton pass to the left to Tyler Boyd for 7 yards to the Den41. Tackled by Shiloh Keo.","(1:38) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Aqib Talib.","(2:07) Jeremy Hill rush to the right for no gain to the Den48. Tackled by Billy Winn.","(2:51) Andy Dalton rush up the middle for 1 yard to the Den48. Tackled by Todd Davis.","(3:26) Jeremy Hill rush to the right for 6 yards to the Den49. Tackled by Derek Wolfe.","(4:00) Jeremy Hill rush to the left for 3 yards to the Cin45. Tackled by Derek Wolfe.","(4:05) Brandon McManus kicks off to the Cin6. Rex Burkhead return for 21 yards to Cin27. Tackled by Kapri Bibbs. Penalty: Unnecessary Roughness on Denver (Kapri Bibbs) 15 yards.","(4:08) Brandon McManus 20 yard field goal attempt is GOOD. Holder: Riley Dixon.","(4:14) Trevor Siemian incomplete pass to the left intended for Jordan Norwood.","(4:54) C.J. Anderson rush to the right for 3 yards to the Cin2. Tackled by Shawn Williams.","(4:58) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(5:03) Penalty: Illegal Contact on Cincinnati (Dre Kirkpatrick) 4 yards.","(5:42) Trevor Siemian pass to the left to Demaryius Thomas for 5 yards to the Cin9. Tackled by Karlos Dansby.","(6:23) Trevor Siemian pass to the left to Demaryius Thomas for 6 yards to the Cin14. Tackled by Adam Jones.","(6:32) Penalty: Illegal Shift on Denver (Jeff Heuerman) -5 yards.","(7:07) Trevor Siemian pass to the left to Emmanuel Sanders for 10 yards to the Cin15. Tackled by Derron Smith and Josh Shaw.","(7:09) Penalty: Unnecessary Roughness on Cincinnati (Karlos Dansby) 15 yards.","(7:48) C.J. Anderson rush to the right for a loss of 1 yard to the Cin40. Tackled by Domata Peko.","(7:54) Trevor Siemian incomplete pass to the middle intended for Emmanuel Sanders defensed by Rey Maualuga.","(8:29) Trevor Siemian pass to the left to Emmanuel Sanders for 19 yards to the Cin39. Tackled by Adam Jones.","(9:10) Jordan Norwood rush to the left for no gain to the Den42. Tackled by Vincent Rey.","(9:17) Penalty: Holding on Cincinnati (Adam Jones) 5 yards.","(10:00) Trevor Siemian rush up the middle for 5 yards to the Den37. Tackled by Vincent Rey.","(10:36) C.J. Anderson rush to the right for 7 yards to the Den32. Tackled by Shawn Williams and Carlos Dunlap.","(11:07) C.J. Anderson rush to the left for no gain to the Den25. Tackled by Geno Atkins and Domata Peko.","(11:07) Mike Nugent kicks off to the endzone. Touchback.","(11:07) Mike Nugent extra point is good.","(11:10) Jeremy Hill rush to the right for 3 yards for a TOUCHDOWN.","(11:10) Cincinnati Bengals timeout.","(12:05) Jeremy Hill rush to the left for 50 yards to the Den3. Tackled by Darian Stewart.","(12:44) Jeremy Hill rush to the left for 8 yards to the Cin47. Tackled by Chris Harris Jr. and Brandon Marshall.","(13:22) Andy Dalton pass to the right to A.J. Green for 9 yards to the Cin39. Tackled by Aqib Talib.","(13:57) Jeremy Hill rush to the right for 4 yards to the Cin30. Tackled by Brandon Marshall.","(14:05) Riley Dixon punts for 51 yards to Cin26. No return.","(14:09) Trevor Siemian incomplete pass to the right intended for Jordan Norwood defensed by Carlos Dunlap.","(14:52) Trevor Siemian pass to the left to Emmanuel Sanders for 9 yards to the Den23. Tackled by George Iloka.","(14:56) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(15:00) Mike Nugent kicks off to the Den-5. Cody Latimer return for 19 yards to Den14. Tackled by Margus Hunt and Nick Vigil."]