["(0:29) DeAngelo Williams rush to the left for 1 yard to the Pit24. Tackled by Ron Brooks.","(0:36) Donnie Jones punts for 40 yards to Pit23. No return.","(1:16) Wendell Smallwood rush up the middle for 1 yard to the Phi37. Tackled by Vince Williams.","(2:00) Wendell Smallwood rush to the right for 4 yards to the Phi36. Tackled by Cameron Heyward.","(2:00) Two Minute Warning.","(2:17) Wendell Smallwood rush to the left for 2 yards to the Phi32. Tackled by Jarvis Jones.","(3:05) Wendell Smallwood rush to the left for 7 yards to the Phi30. Tackled by Artie Burns.","(3:49) Wendell Smallwood rush up the middle for 4 yards to the Phi23. Tackled by Vince Williams.","(4:35) Wendell Smallwood rush to the left for a loss of 1 yard to the Phi19. Tackled by Jarvis Jones.","(4:44) Ben Roethlisberger pass intended for Darrius Heyward-Bey INTERCEPTED by Rodney McLeod. No return. Touchback.","(4:49) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates.","(5:21) Ben Roethlisberger pass to the left to Sammie Coates for 7 yards to the Pit50. Tackled by Nolan Carroll and Jordan Hicks.","(5:58) Ben Roethlisberger pass to the left to Markus Wheaton for 2 yards to the Pit43. Tackled by Nigel Bradham.","(6:30) Ben Roethlisberger pass to the middle to DeAngelo Williams for 6 yards to the Pit41. Tackled by Steven Means.","(7:03) Ben Roethlisberger pass to the right to Antonio Brown for 13 yards to the Pit35. Tackled by Nolan Carroll.","(7:07) Ben Roethlisberger incomplete pass to the left intended for Markus Wheaton defensed by Rodney McLeod.","(7:08) Donnie Jones punts for 43 yards to Pit22. No return.","(7:22) Penalty: Holding on Philadelphia (Najee Goode) -10 yards.","(7:30) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(8:14) Wendell Smallwood rush to the right for 5 yards to the Phi45. Tackled by Mike Mitchell and Sean Davis.","(8:53) Wendell Smallwood rush to the left for 1 yard to the Phi40. Tackled by William Gay.","(9:35) Wendell Smallwood rush up the middle for 12 yards to the Phi39. Tackled by Sean Davis.","(9:46) Ben Roethlisberger pass to the middle to Antonio Brown for 5 yards to the Phi27. Tackled by Jalen Mills.","(9:49) Ben Roethlisberger incomplete pass to the right intended for DeAngelo Williams.","(9:54) Ben Roethlisberger incomplete pass to the left intended for DeAngelo Williams.","(10:42) Ben Roethlisberger sacked at Phi32 for a loss of 9 yards by Brandon Graham.","(11:11) Penalty: Offside on Philadelphia (Marcus Smith) 5 yards.","(11:31) Ben Roethlisberger pass to the middle to Antonio Brown for 20 yards to the Phi43. Tackled by Jalen Mills. Penalty: Face Mask on Philadelphia (Jalen Mills) 15 yards.","(11:41) Donnie Jones punts for 35 yards to Pit37. No return.","(12:21) Kenjon Barner rush to the right for a loss of 1 yard to the Phi28. Tackled by Arthur Moats.","(12:52) Penalty: Holding on Philadelphia (Jason Kelce) -10 yards.","(13:37) Carson Wentz pass to the right to Nelson Agholor for 3 yards to the Phi39. Tackled by Mike Mitchell.","(14:20) Wendell Smallwood rush to the left for 5 yards to the Phi36. Tackled by Javon Hargrave.","(15:00) Carson Wentz pass to the middle to Nelson Agholor for 11 yards to the Phi31. Tackled by Mike Mitchell.","(0:38) Kenjon Barner rush to the right for no gain to the Phi20. Tackled by Cameron Heyward.","(0:47) Jordan Berry punts for 47 yards to Phi18. Darren Sproles return for 2 yards to Phi20. Tackled by Darrius Heyward-Bey.","(0:54) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown defensed by Jaylen Watkins.","(0:58) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown.","(1:01) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(1:43) Ben Roethlisberger pass to the right to DeAngelo Williams for 10 yards to the Pit35. Tackled by Stephen Tulloch.","(1:52) Caleb Sturgis kicks off to the Pit2. Sammie Coates return for 23 yards to Pit25. Tackled by Mychal Kendricks and Chris Maragos.","(1:52) Caleb Sturgis extra point is good.","(1:52) Kenjon Barner rush to the right for 8 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Philadelphia (Kenjon Barner) -15 yards.","(2:31) Kenjon Barner rush to the left for 14 yards to the Pit8. Tackled by Sean Davis.","(3:10) Kenjon Barner rush up the middle for 4 yards to the Pit22. Tackled by Stephon Tuitt.","(3:16) Penalty: Roughing Passer on Pittsburgh (Stephon Tuitt) 15 yards.","(3:25) Ben Roethlisberger sacked at Pit45 for a loss of 9 yards by Fletcher Cox. FUMBLE, recovered by Phi (Brandon Graham) and returned for 4 yards. Tackled by Alejandro Villanueva.","(4:10) Ben Roethlisberger sacked at Phi46 for a loss of 8 yards by Bennie Logan.","(4:50) Ben Roethlisberger pass to the right to Antonio Brown for 18 yards to the Phi38. Tackled by Jalen Mills.","(4:58) Ben Roethlisberger incomplete pass to the left intended for Markus Wheaton defensed by Malcolm Jenkins.","(4:58) Penalty: False Start on Pittsburgh (Alejandro Villanueva) -5 yards.","(5:03) Penalty: Pass Interference on Philadelphia (Jalen Mills) 19 yards.","(5:41) Ben Roethlisberger pass to the right to Antonio Brown for 5 yards to the Pit30. Tackled by Jalen Mills.","(5:45) Ben Roethlisberger incomplete pass to the middle intended for Jesse James defensed by Jordan Hicks.","(5:45) Caleb Sturgis kicks off to the endzone. Touchback.","(5:45) Caleb Sturgis extra point is good.","(5:48) Wendell Smallwood rush to the right for 1 yard for a TOUCHDOWN.","(6:30) Wendell Smallwood rush to the left for no gain to the Pit1. Tackled by Cameron Heyward.","(7:15) Wendell Smallwood rush up the middle for 12 yards to the Pit1. Tackled by William Gay.","(7:55) Wendell Smallwood rush up the middle for 14 yards to the Pit13. Tackled by Sean Davis.","(8:36) Darren Sproles rush to the left for no gain to the Pit27. Tackled by Jarvis Jones.","(9:21) Carson Wentz pass to the right to Brent Celek for 24 yards to the Pit27. Tackled by Sean Davis.","(10:04) Kenjon Barner rush up the middle for 1 yard to the Phi49. Tackled by Stephon Tuitt.","(10:43) Penalty: Face Mask on Pittsburgh (William Gay) 15 yards.","(10:46) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown defensed by Malcolm Jenkins.","(10:55) Penalty: Running into Kicker on Philadelphia (Chris Maragos) 5 yards.","(11:01) Ben Roethlisberger incomplete pass to the middle intended for Eli Rogers.","(11:05) Ben Roethlisberger incomplete pass to the left intended for Eli Rogers defensed by Nolan Carroll.","(11:10) Ben Roethlisberger incomplete pass to the right intended for Jesse James.","(11:45) DeAngelo Williams rush to the right for 13 yards to the Phi38. Tackled by Rodney McLeod.","(11:51) Ben Roethlisberger incomplete pass to the right intended for DeAngelo Williams defensed by Jordan Hicks.","(12:15) Philadelphia Eagles timeout.","(12:15)  FUMBLE, recovered by Pit (Ben Roethlisberger). Ben Roethlisberger pass to the right to Antonio Brown for 19 yards to the Pit49. Tackled by Jalen Mills.","(12:54) Ben Roethlisberger pass to the right to Antonio Brown for 5 yards to the Pit30. Tackled by Jalen Mills.","(12:54) Caleb Sturgis kicks off to the endzone. Touchback.","(12:54) Caleb Sturgis extra point is good.","(13:08) Carson Wentz pass to the right to Darren Sproles for 73 yards for a TOUCHDOWN.","(13:32) Penalty: False Start on Philadelphia (Jason Peters) -5 yards.","(14:15) Carson Wentz pass to the right to Jordan Matthews for 7 yards to the Phi32. Tackled by Vince Williams.","(15:00) Wendell Smallwood rush to the left for no gain to the Phi25. Tackled by James Harrison.","(15:00) Chris Boswell kicks off to the endzone. Touchback.","(0:27) DeAngelo Williams rush up the middle for no gain to the Pit15. Tackled by Bennie Logan and Fletcher Cox.","(0:38) Donnie Jones punts for 47 yards to Pit12. Eli Rogers return for 3 yards to Pit15. Tackled by Chris Maragos.","(0:44) Carson Wentz pass to the left to Darren Sproles for 6 yards to the Phi41. Tackled by Vince Williams.","(0:49) Carson Wentz incomplete pass to the right intended for Trey Burton.","(0:54) Carson Wentz incomplete pass to the left intended for Trey Burton.","(1:22) Carson Wentz pass to the left to Trey Burton for 16 yards to the Phi35. Tackled by Cameron Heyward.","(1:23) Pittsburgh Steelers timeout.","(1:30) Darren Sproles rush to the left for a loss of 1 yard to the Phi19. Tackled by Ryan Shazier and Cameron Heyward.","(1:33) Carson Wentz incomplete pass to the left intended for Josh Huff defensed by Artie Burns.","(1:46) Jordan Berry punts for 63 yards to Phi6. Darren Sproles return for 14 yards to Phi20. Tackled by Shamarko Thomas.","(1:46) Philadelphia Eagles timeout.","(1:52) Ben Roethlisberger pass to the left to Eli Rogers for no gain to the Pit31. Tackled by Rodney McLeod.","(1:58) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(1:58) Two Minute Warning.","(2:02) Ben Roethlisberger pass to the right to Antonio Brown for 10 yards to the Pit31. Tackled by Fletcher Cox and Malcolm Jenkins.","(2:25) DeAngelo Williams rush to the left for 6 yards to the Pit31. Tackled by Rodney McLeod. Penalty: Holding on Pittsburgh (Alejandro Villanueva) -10 yards.","(2:25) Caleb Sturgis kicks off to the endzone. Touchback.","(2:29) Caleb Sturgis 38 yard field goal attempt is GOOD. Holder: Donnie Jones.","(3:06) Carson Wentz pass to the right to Darren Sproles for 3 yards to the Pit19. Tackled by L.J. Fort.","(3:48) Kenjon Barner rush up the middle for 2 yards to the Pit22. Tackled by Stephon Tuitt.","(3:52) Carson Wentz incomplete pass to the middle intended for Trey Burton.","(4:19) Kenjon Barner rush to the left for 14 yards to the Pit24. Tackled by James Harrison.","(4:40) Carson Wentz pass to the left to Darren Sproles for 4 yards to the Pit38. Tackled by William Gay.","(5:07) Carson Wentz rush to the right for 10 yards to the Pit42.","(5:09) Penalty: Pass Interference on Pittsburgh (William Gay) 9 yards.","(5:34) Penalty: False Start on Philadelphia (Jason Kelce) -5 yards.","(6:20) Carson Wentz pass to the left to Dorial Green-Beckham for 2 yards to the Phi44. Tackled by Artie Burns.","(7:00) Carson Wentz pass to the right to Nelson Agholor for 7 yards to the Phi42. Tackled by Stephon Tuitt.","(7:34) Carson Wentz pass to the left to Dorial Green-Beckham for 12 yards to the Phi35. Tackled by James Harrison.","(7:40) Chris Boswell kicks off to the Phi0. Josh Huff return for 23 yards to Phi23. Tackled by Jordan Dangerfield and Sammie Coates.","(7:43) Chris Boswell 40 yard field goal attempt is GOOD. Holder: Jordan Berry.","(8:22) Ben Roethlisberger sacked at Phi22 for a loss of 9 yards by Fletcher Cox.","(9:03) Ben Roethlisberger pass to the right to Sammie Coates for 2 yards to the Phi13. Tackled by Malcolm Jenkins.","(9:43) Daryl Richardson rush up the middle for 1 yard to the Phi15. Tackled by Malcolm Jenkins.","(10:24) Ben Roethlisberger pass to the left to Antonio Brown for 20 yards to the Phi16. Tackled by Ron Brooks.","(11:12) Ben Roethlisberger pass to the right to Sammie Coates for 41 yards to the Phi36. Tackled by Rodney McLeod.","(11:53) Ben Roethlisberger pass to the middle to Jesse James for 6 yards to the Pit23. Tackled by Stephen Tulloch.","(11:59) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown defensed by Malcolm Jenkins.","(12:04) Caleb Sturgis kicks off to the Pit-3. Fitzgerald Toussaint return for 20 yards to Pit17. Tackled by Kamu Grugier-Hill.","(12:04) Caleb Sturgis extra point is good.","(12:09) Carson Wentz pass to the left to Jordan Matthews for 12 yards for a TOUCHDOWN.","(12:52) Wendell Smallwood rush to the right for 1 yard to the Pit12. Tackled by Anthony Chickillo.","(13:33) Wendell Smallwood rush to the left for 11 yards to the Pit13. Tackled by Sean Davis.","(14:13) Carson Wentz pass to the middle to Brent Celek for 15 yards to the Pit24. Tackled by Mike Mitchell.","(14:19) Carson Wentz incomplete pass to the left intended for Trey Burton.","(15:00) Carson Wentz pass to the left to Josh Huff for 11 yards to the Pit39. Tackled by Lawrence Timmons and Jarvis Jones.","(0:46) Carson Wentz pass to the right to Dorial Green-Beckham for 19 yards to the Phi50. Tackled by Ross Cockrell.","(0:48) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham.","(1:20) Carson Wentz pass to the left to Josh Huff for 6 yards to the Phi41. Tackled by Sean Davis. Penalty: Holding on Philadelphia (Jordan Matthews) -10 yards.","(2:00)  FUMBLE, recovered by Phi (Carson Wentz). Carson Wentz pass to the right to Darren Sproles for 2 yards to the Phi35. Tackled by Ryan Shazier.","(2:30) Carson Wentz pass to the right to Trey Burton for 3 yards to the Phi18. Tackled by William Gay. Penalty: Unnecessary Roughness on Pittsburgh (Lawrence Timmons) 15 yards.","(3:10) Ryan Mathews rush to the right for a loss of 3 yards to the Phi15. Tackled by Stephon Tuitt.","(3:21) Jordan Berry punts for 55 yards to Phi18. No return.","(3:29) Ben Roethlisberger incomplete pass to the left intended for Eli Rogers.","(3:32) Ben Roethlisberger incomplete pass to the left intended for Markus Wheaton defensed by Nolan Carroll.","(4:13) Ben Roethlisberger pass to the right to DeAngelo Williams for 5 yards to the Pit27. Tackled by Malcolm Jenkins.","(4:45) Ben Roethlisberger pass to the right to Antonio Brown for 12 yards to the Pit22.","(5:24) Ben Roethlisberger pass to the left to DeAngelo Williams for 2 yards to the Pit10. Tackled by Jordan Hicks.","(5:29) Caleb Sturgis kicks off to the Pit1. Sammie Coates return for 15 yards to Pit16. Tackled by Bryan Braman. Penalty: Holding on Pittsburgh (Vince Williams) -8 yards.","(5:32) Caleb Sturgis 29 yard field goal attempt is GOOD. Holder: Donnie Jones.","(6:08) Carson Wentz pass to the left to Josh Huff for 2 yards to the Pit11. Tackled by William Gay.","(6:53) Carson Wentz pass to the right to Josh Huff for 1 yard to the Pit13. Tackled by Ross Cockrell.","(6:58) Carson Wentz incomplete pass to the left intended for Brent Celek.","(7:31) Carson Wentz pass to the left to Darren Sproles for 40 yards to the Pit14. Tackled by Robert Golden.","(8:08) Carson Wentz pass to the right to Brent Celek for 22 yards to the Phi46. Tackled by Ross Cockrell.","(8:49) Ryan Mathews rush up the middle for a loss of 2 yards to the Phi24. Tackled by Robert Golden.","(8:56) Chris Boswell 36 yard field goal attempt is BLOCKED by Bennie Logan.","(9:06) Ben Roethlisberger incomplete pass to the left intended for Markus Wheaton defensed by Nolan Carroll.","(9:52) DeAngelo Williams rush to the right for a loss of 4 yards to the Phi18. Tackled by Nigel Bradham.","(10:34) DeAngelo Williams rush to the left for 1 yard to the Phi14. Tackled by Connor Barwin.","(11:20) Ben Roethlisberger rush to the right for 7 yards to the Phi15. Tackled by Fletcher Cox.","(11:53) DeAngelo Williams rush to the left for 4 yards to the Phi22. Tackled by Mychal Kendricks.","(12:31) DeAngelo Williams rush up the middle for no gain to the Phi26. Tackled by Nigel Bradham.","(13:03) Ben Roethlisberger pass to the left to Antonio Brown for 13 yards to the Phi26. Tackled by Malcolm Jenkins.","(13:37) Ben Roethlisberger pass to the right to Eli Rogers for 32 yards to the Phi39. Tackled by Rodney McLeod.","(14:20) Ben Roethlisberger pass to the left to Jesse James for 4 yards to the Pit29. Tackled by Jordan Hicks.","(15:00) Ben Roethlisberger pass to the left to Antonio Brown for no gain to the Pit25. Tackled by Nigel Bradham.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback."]