["(8:43) Jay Ajayi rush to the left for 11 yards for a TOUCHDOWN.","(9:18) Ryan Tannehill pass to the left to Jarvis Landry for 32 yards to the Cle11. Tackled by Jordan Poyer.","(9:39) Jay Ajayi rush to the right for 1 yard to the Cle43. Tackled by Danny Shelton.","(9:54) Britton Colquitt punts for 44 yards to Mia43. Jarvis Landry return for 13 yards to Cle44. Tackled by Jordan Poyer and Charley Hughlett.","(10:34) Duke Johnson Jr. rush to the left for 4 yards to the Cle13. Tackled by Neville Hewitt.","(11:15) Cody Kessler pass to the left to Duke Johnson Jr. for a loss of 1 yard to the Cle9. Tackled by Neville Hewitt.","(11:44) Penalty: Holding on Cleveland (Austin Pasztor) -10 yards.","(12:15) Cody Kessler sacked at Cle20 for a loss of 7 yards by Ndamukong Suh.","(12:38) Cody Kessler pass to the middle to Terrelle Pryor Sr. for 9 yards to the Cle27. Tackled by Byron Maxwell.","(12:47) Cody Kessler incomplete pass to the right intended for Andrew Hawkins.","(13:28) Isaiah Crowell rush to the right for 9 yards to the Cle18. Tackled by Neville Hewitt.","(13:36) Matt Darr punts for 47 yards to Cle9. No return.","(13:40) Ryan Tannehill incomplete pass to the left intended for DeVante Parker.","(13:46) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry.","(14:27) Isaiah Pead rush to the right for 4 yards to the Mia44. Tackled by Emmanuel Ogbah.","(14:55) Ryan Tannehill pass to the right to Dion Sims for 18 yards to the Mia40. Tackled by Jordan Poyer.","(15:00) Cody Parkey kicks off to the Mia-5. Jakeem Grant return for 27 yards to Mia22. Tackled by George Atkinson III.","(0:04) 46 yard field goal attempt by Cody Parkey is NO GOOD. Holder: Britton Colquitt.","(0:04) Cleveland Browns timeout.","(0:20) Cody Kessler rush up the middle for a loss of 1 yard to the Mia28.","(0:26) Ryan Tannehill sacked at Mia27 for a loss of 8 yards by Corey Lemonier. FUMBLE, recovered by Cle (Corey Lemonier). Tackled by Ja'Wuan James.","(0:26) Miami Dolphins timeout.","(0:36) Ryan Tannehill pass to the middle to Damien Williams for 9 yards to the Mia35. Tackled by Jordan Poyer.","(0:36) Miami Dolphins timeout.","(0:42) Ryan Tannehill pass to the right to Dion Sims for 10 yards to the Mia26. Tackled by Jordan Poyer.","(0:52) Britton Colquitt punts for 36 yards to Mia16. No return.","(0:58) Cody Kessler incomplete pass to the left intended for Terrelle Pryor Sr. defensed by Byron Maxwell.","(1:19) Cody Kessler pass to the right to Gary Barnidge for 6 yards to the Cle48. Tackled by Neville Hewitt.","(1:19) Cleveland Browns timeout.","(1:56) Terrelle Pryor Sr. pass to the left to Gary Barnidge for 3 yards to the Cle42. Tackled by Byron Maxwell.","(1:56) Two Minute Warning.","(2:02) Penalty: Illegal Contact on Miami (Michael Thomas) 5 yards.","(2:09) Duke Johnson Jr. rush to the left for 8 yards to the Cle34. Tackled by Neville Hewitt.","(2:17) Matt Darr punts for 48 yards to Cle26. No return.","(2:22) Ryan Tannehill incomplete pass to the left intended for DeVante Parker.","(3:06) Ryan Tannehill pass to the left to Kenny Stills for 1 yard to the Mia26. Tackled by Christian Kirksey.","(3:14) Ryan Tannehill incomplete pass to the middle intended for Jarvis Landry defensed by Jordan Poyer.","(3:14) Cody Parkey kicks off to the endzone. Touchback.","(3:18) Cody Parkey 38 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(3:24) Cody Kessler incomplete pass to the right intended for Duke Johnson Jr. defensed by Reshad Jones.","(3:24) Cleveland Browns timeout.","(4:03) Isaiah Crowell rush to the right for 4 yards to the Mia20. Tackled by Neville Hewitt and Cameron Wake.","(4:43) Duke Johnson Jr. rush to the left for 4 yards to the Mia24. Tackled by Chris Jones.","(4:43) Penalty: False Start on Cleveland (Alvin Bailey) -5 yards.","(4:58) Cody Kessler pass to the left to Terrelle Pryor Sr. for 40 yards to the Mia23. Tackled by Reshad Jones.","(5:27) Terrelle Pryor Sr. pass to the left to Ricardo Louis for 6 yards to the Cle37. Tackled by Byron Maxwell and Donald Butler.","(6:12) Isaiah Crowell rush up the middle for 25 yards to the Cle31. Tackled by Reshad Jones.","(6:17) Cody Kessler incomplete pass to the left intended for Isaiah Crowell.","(6:28) Matt Darr punts for 55 yards to Cle12. Jordan Poyer - no return. Tackled by Michael Thomas. Penalty: Holding on Cleveland (Tank Carder) -6 yards.","(6:33) Ryan Tannehill incomplete pass to the right. Penalty: Intentional Grounding on Miami (Ryan Tannehill) -14 yards.","(6:39) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry.","(6:50) Ryan Tannehill incomplete pass to the right.","(7:28) Ryan Tannehill pass to the right to Jarvis Landry for 9 yards to the Mia47. Tackled by Tracy Howard.","(8:04) Isaiah Pead rush to the left for 4 yards to the Mia38. Tackled by Corey Lemonier.","(8:11) Britton Colquitt punts for 46 yards to Mia34. No return.","(8:15) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr. defensed by Byron Maxwell.","(8:19) Cody Kessler incomplete pass to the left intended for Duke Johnson Jr..","(8:22) Cody Kessler incomplete pass to the right intended for Gary Barnidge.","(8:32) Matt Darr punts for 47 yards to Cle20. No return.","(9:10) Kenyan Drake rush to the right for a loss of 1 yard to the Mia33. Tackled by Corey Lemonier.","(9:44) Ryan Tannehill pass to the left to Jarvis Landry for 3 yards to the Mia34. Tackled by Christian Kirksey.","(10:12) Kenyan Drake rush to the left for 6 yards to the Mia31. Tackled by Jordan Poyer.","(10:12) Cody Parkey kicks off to the endzone. Touchback.","(10:12) Cody Kessler 2 pt conversion pass to Gary Barnidge is GOOD.","(10:19) Terrelle Pryor Sr. rush to the left for 3 yards for a TOUCHDOWN.","(10:45) Penalty: Offside on Miami (Ndamukong Suh) 3 yards.","(10:56) Penalty: Offside on Miami (Cameron Wake) 5 yards.","(10:59) Cody Kessler incomplete pass to the right intended for Ricardo Louis defensed by Xavien Howard.","(11:43) Isaiah Crowell rush to the left for 3 yards to the Mia11. Tackled by Chris Jones.","(12:20) Cody Kessler pass to the right to Ricardo Louis for 28 yards to the Mia14. Tackled by Reshad Jones.","(13:02) Cody Kessler pass to the middle to Terrelle Pryor Sr. for 25 yards to the Mia42. Tackled by Jason Jones.","(13:06) Terrelle Pryor Sr. incomplete pass to the right intended for Andrew Hawkins.","(13:06) Miami Dolphins timeout.","(13:38) Cody Kessler pass to the left to Duke Johnson Jr. for 7 yards to the Cle33. Tackled by Xavien Howard.","(13:44) Cody Kessler incomplete pass to the left intended for Terrelle Pryor Sr..","(14:12) Cody Kessler pass to the right to Andrew Hawkins for 9 yards to the Cle26. Tackled by Michael Thomas.","(14:17) Andrew Franks kicks off to the Cle4. Tracy Howard return for 13 yards to Cle17. Tackled by Neville Hewitt.","(14:17) Andrew Franks extra point is good.","(14:29) Ryan Tannehill pass to the right to Damien Williams for 10 yards for a TOUCHDOWN.","(15:00) Jay Ajayi rush to the right for 3 yards to the Cle10. Tackled by Xavier Cooper.","(0:28) Ryan Tannehill pass to the middle to Dion Sims for 6 yards to the Cle13. Tackled by Jordan Poyer.","(1:13) Ryan Tannehill pass to the left to Jarvis Landry for 14 yards to the Cle19. Tackled by Emmanuel Ogbah.","(1:40) Jay Ajayi rush to the left for 8 yards to the Cle33. Tackled by Derrick Kindred.","(2:33) Ryan Tannehill pass to the right to DeVante Parker for 23 yards to the Cle41. Tackled by Jordan Poyer.","(2:41) Britton Colquitt punts for 49 yards to Mia36. No return.","(3:21) Cody Kessler sacked at Cle15 for a loss of 3 yards by Andre Branch.","(4:06) Cody Kessler pass to the left to Malcolm Johnson for 3 yards to the Cle18. Tackled by Ndamukong Suh and Kiko Alonso.","(4:50) Isaiah Crowell rush to the right for no gain to the Cle15. Tackled by Ndamukong Suh.","(5:12) Terrelle Pryor Sr. rush to the left for 4 yards to the Cle25. Tackled by Byron Maxwell. Penalty: Holding on Cleveland (Ricardo Louis) -10 yards.","(5:17) Andrew Franks kicks off to the Cle10. George Atkinson III return for 21 yards to Cle31. Tackled by Isa Abdul-Quddus. Penalty: Illegal Block on Cleveland (Rashard Higgins) -10 yards.","(5:17) Andrew Franks extra point is good.","(5:17) Ryan Tannehill pass to the left to Jarvis Landry for 42 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Miami (Jarvis Landry) -15 yards.","(6:06) Ryan Tannehill pass to the left to Jarvis Landry for 16 yards to the Cle42. Tackled by Derrick Kindred.","(6:51) Isaiah Pead rush to the left for 2 yards to the Mia42. Tackled by Jamie Meder.","(6:58) Penalty: Illegal Contact on Cleveland (Jamar Taylor) 5 yards.","(7:27) Kenyan Drake rush up the middle for 3 yards to the Mia35. Tackled by Christian Kirksey.","(7:52) 42 yard field goal attempt by Cody Parkey is NO GOOD. Holder: Britton Colquitt.","(8:17) Cody Kessler pass to the left to Duke Johnson Jr. for 5 yards to the Mia24. Tackled by Xavien Howard.","(8:50) Penalty: Delay of Game on Cleveland (Cody Kessler) -5 yards.","(9:29) Isaiah Crowell rush up the middle for 1 yard to the Mia24. Tackled by Reshad Jones.","(9:38) Penalty: Holding on Cleveland (Austin Pasztor) -10 yards.","(10:16) Duke Johnson Jr. rush to the left for 2 yards to the Mia15. Tackled by Jelani Jenkins.","(10:42) Duke Johnson Jr. rush to the right for 15 yards to the Mia17. Tackled by Isa Abdul-Quddus.","(11:36) Cody Kessler pass to the left to Ricardo Louis for 6 yards to the Mia32. Tackled by Xavien Howard. FUMBLE, recovered by Cle (Ricardo Louis).","(12:16) Cody Kessler pass to the right to Gary Barnidge for 23 yards to the Mia38. Tackled by Reshad Jones.","(12:55) Terrelle Pryor Sr. sacked at Cle39 for a loss of 1 yard by Ndamukong Suh and Reshad Jones.","(13:35) Isaiah Crowell rush up the middle for 1 yard to the Cle40. Tackled by Kiko Alonso.","(14:21) Cody Kessler pass to the right to Terrelle Pryor Sr. for 8 yards to the Cle39. Tackled by Byron Maxwell.","(14:54) Isaiah Crowell rush to the left for 6 yards to the Cle31. Tackled by Kiko Alonso.","(14:56) Penalty: False Start on Cleveland (Austin Pasztor) -5 yards.","(15:00) Andrew Franks kicks off to the Cle13. Tracy Howard return for 17 yards to Cle30. Tackled by Damien Williams.","(0:05) Ryan Tannehill pass to the middle to Kenny Stills for 28 yards to the Cle22. Tackled by Jordan Poyer.","(0:10) Ryan Tannehill incomplete pass to the left intended for DeVante Parker.","(0:17) Penalty: Illegal Contact on Cleveland (Christian Kirksey) 5 yards.","(0:21) Ryan Tannehill incomplete pass to the left intended for Kenny Stills defensed by Emmanuel Ogbah.","(0:21) Ryan Tannehill incomplete pass to the middle.","(0:35) Ryan Tannehill pass to the left to Kenny Stills for 16 yards to the Mia45. Tackled by Demario Davis.","(0:35) Miami Dolphins timeout.","(0:42) Ryan Tannehill pass to the right to Kenyan Drake for 4 yards to the Mia29. Tackled by Tramon Williams.","(0:42) Cody Parkey kicks off to the endzone. Touchback.","(0:46) Cody Parkey 48 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(0:46) Miami Dolphins timeout.","(0:54) Cody Kessler pass to the middle to Duke Johnson Jr. for 5 yards to the Mia30. Tackled by Bobby McCain.","(1:00) Penalty: Holding on Cleveland (Austin Pasztor) -10 yards.","(1:05) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr. defensed by Byron Maxwell.","(1:10) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr..","(1:10) Penalty: False Start on Cleveland (Austin Pasztor) -5 yards.","(1:10) Cleveland Browns timeout.","(1:17) Cody Kessler pass to the right to Terrelle Pryor Sr. for 25 yards to the Mia20. Tackled by Xavien Howard.","(1:18) Cleveland Browns timeout.","(1:21) Duke Johnson Jr. rush to the right for 3 yards to the Mia45. Tackled by Kiko Alonso.","(1:32) Cody Kessler pass to the right to Terrelle Pryor Sr. for 10 yards to the Mia48.","(1:57) Duke Johnson Jr. rush to the right for 17 yards to the Cle42. Tackled by Kiko Alonso.","(1:57) Andrew Franks kicks off to the endzone. Touchback.","(2:00) Andrew Franks 37 yard field goal attempt is GOOD. Holder: Matt Darr.","(2:00) Two Minute Warning.","(2:28) Ryan Tannehill pass to the middle to Dion Sims for 12 yards to the Cle19. Tackled by Christian Kirksey.","(2:28) Miami Dolphins timeout.","(3:10) Ryan Tannehill pass to the left to Damien Williams for a loss of 9 yards to the Cle31. Tackled by Emmanuel Ogbah.","(3:10) Penalty: False Start on Miami (Dion Sims) -5 yards.","(3:16) Ryan Tannehill incomplete pass to the left intended for Jarvis Landry.","(3:54) Damien Williams rush to the right for 15 yards to the Cle17. Tackled by Jordan Poyer.","(4:37) Ryan Tannehill pass to the right to Kenny Stills for 18 yards to the Cle32. Tackled by Briean Boddy-Calhoun.","(5:22) Ryan Tannehill pass to the left to Kenyan Drake for 7 yards to the Mia50. Tackled by Jamar Taylor.","(5:52) Kenyan Drake rush to the right for 3 yards to the Mia43. Tackled by Briean Boddy-Calhoun.","(6:15) Ryan Tannehill pass to the right to Kenny Stills for 13 yards to the Mia40. Tackled by Briean Boddy-Calhoun and Jordan Poyer.","(6:47) Ryan Tannehill rush up the middle for 2 yards to the Mia27. Tackled by Nate Orchard.","(6:47) Cody Parkey kicks off to the endzone. Touchback.","(6:47) Cody Parkey extra point is good.","(7:01) Ryan Tannehill pass intended for Kenny Stills INTERCEPTED by Briean Boddy-Calhoun and returned for 27 yards for a TOUCHDOWN.","(7:45) Isaiah Pead rush up the middle for 3 yards to the Mia21. Tackled by Demario Davis and Christian Kirksey.","(8:10) Isaiah Pead rush to the right for 4 yards to the Mia18. Tackled by Christian Kirksey.","(8:17) Britton Colquitt punts for 48 yards to Mia14. No return.","(8:27) Cody Kessler incomplete pass to the left intended for Terrelle Pryor Sr..","(9:21) Isaiah Crowell rush up the middle for no gain to the Cle38. Tackled by Julius Warmsley.","(9:43) Cody Kessler pass to the right to Andrew Hawkins for 5 yards to the Cle38. Tackled by Xavien Howard.","(10:27) Isaiah Crowell rush to the left for 8 yards to the Cle33. Tackled by Kiko Alonso.","(11:06) Isaiah Crowell rush to the right for 9 yards to the Cle25. Tackled by Koa Misi.","(11:27) Matt Darr punts for 54 yards to Cle16. No return.","(11:55) Ryan Tannehill pass to the left to DeVante Parker for 2 yards to the Mia30. Tackled by Briean Boddy-Calhoun.","(12:19) Penalty: False Start on Miami (Branden Albert) -5 yards.","(12:52) Kenyan Drake rush to the right for 4 yards to the Mia33. Tackled by Jordan Poyer.","(13:32) Ryan Tannehill pass to the left to Jarvis Landry for 4 yards to the Mia29. Tackled by Derrick Kindred and Jordan Poyer.","(13:32) Cody Parkey kicks off to the endzone. Touchback.","(13:47) Cody Parkey 46 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(14:28) Cody Kessler pass to the left to Gary Barnidge for 8 yards to the Mia28. Tackled by Kiko Alonso.","(15:00) Isaiah Crowell rush up the middle for a loss of 3 yards to the Mia36. Tackled by Reshad Jones.","(0:07) Isaiah Crowell rush up the middle for 4 yards to the Mia33. Tackled by Ndamukong Suh.","(0:49) Cody Kessler pass to the right to Terrelle Pryor Sr. for 18 yards to the Mia37. Tackled by Jelani Jenkins.","(1:06) Duke Johnson Jr. rush to the left for a loss of 2 yards to the Cle45. Tackled by Mario Williams.","(1:32) Andrew Hawkins rush to the left for 1 yard to the Cle47. Tackled by Reshad Jones.","(1:44) Penalty: Roughing Passer on Miami (Jelani Jenkins) 15 yards.","(2:16) Duke Johnson Jr. rush up the middle for 4 yards to the Cle31. Tackled by Koa Misi and Jelani Jenkins.","(2:57) Duke Johnson Jr. rush to the left for 14 yards to the Cle27. Tackled by Byron Maxwell and Kiko Alonso.","(3:35) Terrelle Pryor Sr. rush to the right for a loss of 1 yard to the Cle13. Tackled by Reshad Jones.","(3:44) Matt Darr punts for 42 yards to Cle14. No return.","(3:56) Ryan Tannehill incomplete pass to the left intended for Jarvis Landry.","(4:31) Jarvis Landry rush to the right for 3 yards to the Mia44. Tackled by Danny Shelton.","(5:08) Jay Ajayi rush up the middle for no gain to the Mia41. Tackled by Danny Shelton.","(6:04) Jay Ajayi rush to the right for 1 yard to the Mia41. Tackled by Demario Davis.","(6:23) Jay Ajayi rush to the right for 4 yards to the Mia40. Tackled by Jamie Meder.","(6:54) Ryan Tannehill pass to the left to Jordan Cameron for 5 yards to the Mia36. Tackled by Christian Kirksey.","(7:03) 41 yard field goal attempt by Cody Parkey is NO GOOD. Holder: Britton Colquitt.","(7:36) Cody Kessler pass to the left to Duke Johnson Jr. for a loss of 4 yards to the Mia23. Tackled by Reshad Jones.","(7:45) Terrelle Pryor Sr. incomplete pass to the right intended for Rashard Higgins.","(8:24) Isaiah Crowell rush to the right for 6 yards to the Mia19. Tackled by Koa Misi.","(9:05) Terrelle Pryor Sr. pass to the left to Gary Barnidge for 26 yards to the Mia25. Tackled by Isa Abdul-Quddus.","(9:43) Terrelle Pryor Sr. rush to the left for 15 yards to the Cle49. Tackled by Xavien Howard.","(10:16) Cody Kessler pass to the right to Terrelle Pryor Sr. for 9 yards to the Cle34. Tackled by Byron Maxwell.","(10:16) Andrew Franks kicks off to the endzone. Touchback.","(10:16) Andrew Franks extra point is good.","(10:26) Ryan Tannehill pass to the right to DeVante Parker for 26 yards for a TOUCHDOWN.","(11:00) Jarvis Landry rush to the left for 13 yards to the Cle26. Tackled by Derrick Kindred.","(11:31) Kenyan Drake rush up the middle for 11 yards to the Cle39. Tackled by Demario Davis.","(12:15) Kenyan Drake rush to the right for 8 yards to the Mia50. Tackled by Christian Kirksey.","(12:53) Kenyan Drake rush to the left for 3 yards to the Mia42. Tackled by Tramon Williams.","(13:01) Cody Kessler sacked at Mia39 for a loss of 7 yards by Cameron Wake. FUMBLE, recovered by Mia (Jason Jones). Tackled by Alvin Bailey.","(13:41) Cody Kessler rush up the middle for no gain to the Mia32. FUMBLE, recovered by Cle (Cody Kessler).","(14:20) Isaiah Crowell rush up the middle for 6 yards to the Mia32. Tackled by Jason Jones.","(14:20) Penalty: Delay of Game on Cleveland (Cody Kessler) -5 yards.","(14:29) Ryan Tannehill pass intended for Kenny Stills INTERCEPTED by Jamar Taylor and returned for a loss of 3 yards. Tackled by Jordan Cameron.","(15:00) Kenyan Drake rush to the left for no gain to the Mia25. Tackled by Christian Kirksey.","(15:00) Cody Parkey kicks off to the endzone. Touchback."]