["(0:02) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery defensed by Brandon Carr.","(0:05) Brian Hoyer incomplete pass to the right intended for Kevin White.","(0:09) Brian Hoyer incomplete pass to the middle.","(0:24) Brian Hoyer pass to the left to Jordan Howard for 15 yards to the Dal16. Tackled by Barry Church and Damien Wilson.","(0:26) Penalty: Offside on Dallas (Benson Mayowa) 5 yards.","(0:26) Brian Hoyer incomplete pass to the middle.","(0:40) Brian Hoyer pass to the left to Jordan Howard for 14 yards to the Dal36. Tackled by Byron Jones. FUMBLE, recovered by Chi (Jordan Howard).","(1:04) Brian Hoyer pass to the right to Eddie Royal for 10 yards to the Chi50. Tackled by Anthony Brown.","(1:09) Brian Hoyer incomplete pass to the left intended for Jordan Howard.","(1:16) Brian Hoyer incomplete pass to the right intended for Kevin White.","(1:39) Brian Hoyer pass to the left to Cameron Meredith for 24 yards to the Chi40. Tackled by Anthony Brown.","(1:49) Chris Jones punts for 47 yards to Chi8. Eddie Royal return for 8 yards to Chi16. Tackled by Byron Jones.","(1:55) Ezekiel Elliott rush to the left for a loss of 2 yards to the Dal45. Tackled by Jerrell Freeman and Mitch Unrein.","(1:55) Chicago Bears timeout.","(2:00) Ezekiel Elliott rush to the right for no gain to the Dal47. Tackled by Willie Young.","(2:00) Two Minute Warning.","(2:10) Ezekiel Elliott rush up the middle for 3 yards to the Dal47. Tackled by Jerrell Freeman.","(2:20) Brian Hoyer sacked at Dal44 for a loss of 5 yards. FUMBLE, recovered by Dal (Benson Mayowa). Tackled by Brian Hoyer.","(2:26) Brian Hoyer incomplete pass to the right.","(2:26) Dallas Cowboys timeout.","(2:33) Brian Hoyer incomplete pass to the right intended for Cameron Meredith.","(2:59) Brian Hoyer pass to the right to Jordan Howard for 13 yards to the Dal39. Tackled by Justin Durant.","(3:04) Brian Hoyer incomplete pass to the right intended for Kevin White.","(3:31) Brian Hoyer pass to the right to Kevin White for 32 yards to the Chi48. Tackled by Morris Claiborne.","(4:00) Brian Hoyer pass to the right to Eddie Royal for 5 yards to the Chi16. Tackled by Morris Claiborne.","(4:08) Chris Jones punts for 42 yards to Chi11. No return.","(4:50) Ezekiel Elliott rush to the left for no gain to the Dal47. Tackled by Mitch Unrein and Sam Acho.","(4:50) Chicago Bears timeout.","(4:55) Ezekiel Elliott rush to the left for 2 yards to the Dal47. Tackled by Willie Young and Will Sutton.","(4:55) Chicago Bears timeout.","(5:05) Ezekiel Elliott rush to the right for 7 yards to the Dal45. Tackled by Jonathan Bullard.","(5:47) Ezekiel Elliott rush to the left for 4 yards to the Dal38. Tackled by Jerrell Freeman and Jacoby Glenn.","(6:28) Ezekiel Elliott rush up the middle for 9 yards to the Dal34. Tackled by Jerrell Freeman and Chris Prosinski.","(6:28) Connor Barth kicks off to the endzone. Touchback.","(6:28) Connor Barth extra point is good.","(6:35) Brian Hoyer pass to the left to Zach Miller for 6 yards for a TOUCHDOWN.","(7:04) Brian Hoyer pass to the left to Alshon Jeffery for 19 yards to the Dal6. Tackled by Barry Church.","(7:29) Brian Hoyer pass to the left to Alshon Jeffery for 6 yards to the Dal25. Tackled by Brandon Carr.","(7:55) Brian Hoyer pass to the left to Alshon Jeffery for 10 yards to the Dal31. Tackled by Brandon Carr.","(8:01) Penalty: False Start on Chicago (Kyle Long) -5 yards.","(8:01) Brian Hoyer incomplete pass to the right intended for Kevin White.","(8:29) Brian Hoyer pass to the right to Zach Miller for 26 yards to the Dal36. Tackled by Barry Church.","(8:36) Brian Hoyer incomplete pass to the right intended for Kevin White.","(9:02) Brian Hoyer pass to the right to Kevin White for 13 yards to the Chi38. Tackled by Morris Claiborne.","(9:02) Dan Bailey kicks off to the endzone. Touchback.","(9:02) Dan Bailey extra point is good.","(9:09) Dak Prescott pass to the right to Dez Bryant for 17 yards for a TOUCHDOWN.","(9:57) Dak Prescott pass to the right to Cole Beasley for 5 yards to the Chi17. Tackled by Chris Prosinski.","(10:30) Dak Prescott pass to the right to Ezekiel Elliott for 18 yards to the Chi22. Tackled by Tracy Porter.","(10:56) Penalty: Illegal Block on Dallas (Chaz Green) -15 yards.","(11:02) Penalty: Roughing Passer on Chicago (Willie Young) 15 yards.","(11:39) Ezekiel Elliott rush to the left for 5 yards to the Chi40. Tackled by Will Sutton.","(12:15) Ezekiel Elliott rush up the middle for 3 yards to the Chi45. Tackled by Jonathan Bullard.","(12:52) Dak Prescott pass to the right to Cole Beasley for 8 yards to the Chi48. Tackled by Sherrick McManis.","(13:38) Ezekiel Elliott rush to the right for 1 yard to the Dal44. Tackled by Willie Young and Jacoby Glenn.","(14:21) Ezekiel Elliott rush to the right for 14 yards to the Dal43. Tackled by Jonathan Anderson.","(15:00) Dak Prescott pass to the right to Dez Bryant for 12 yards to the Dal29. Tackled by Tracy Porter.","(0:37) Ezekiel Elliott rush to the right for 5 yards to the Dal17. Tackled by Akiem Hicks and Cornelius Washington.","(0:44) Patrick O'Donnell punts for 28 yards to Dal12. No return.","(1:21) Brian Hoyer pass to the right to Kevin White for 2 yards to the Dal40. Tackled by Maliek Collins and Justin Durant.","(2:02) Brian Hoyer pass to the left to Kevin White for no gain to the Dal42. Tackled by Brandon Carr.","(2:34) Jordan Howard rush to the left for no gain to the Dal42. Tackled by Terrell McClain.","(3:03) Jordan Howard rush up the middle for 14 yards to the Dal42. Tackled by J.J. Wilcox and Sean Lee.","(3:29) Brian Hoyer pass to the right to Kevin White for 7 yards to the Chi44. Tackled by Morris Claiborne.","(3:34) 47 yard field goal attempt by Dan Bailey is NO GOOD. Holder: Chris Jones.","(3:41) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Chris Prosinski.","(3:46) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(4:21) Ezekiel Elliott rush to the right for 7 yards to the Chi29. Tackled by Cornelius Washington.","(4:29) Brian Hoyer pass to the left to Cameron Meredith for no gain to the Chi36. Tackled by J.J. Wilcox. FUMBLE, recovered by Dal (Tyrone Crawford). Tackled by Cameron Meredith.","(5:05) Jordan Howard rush to the left for a loss of 3 yards to the Chi36. Tackled by Maliek Collins.","(5:20) Chris Jones punts for 51 yards to Chi15. Eddie Royal return for 9 yards to Chi24. Tackled by Rod Smith. Penalty: Face Mask on Dallas (Rod Smith) 15 yards.","(6:06) Ezekiel Elliott rush to the left for 1 yard to the Dal34. Tackled by Jerrell Freeman and Christian Jones.","(6:28) Ezekiel Elliott rush up the middle for 6 yards to the Dal33. Tackled by Willie Young and Jonathan Anderson.","(7:08) Dak Prescott pass to the right to Ezekiel Elliott for 2 yards to the Dal27. Tackled by Jerrell Freeman.","(7:08) Connor Barth kicks off to the endzone. Touchback.","(7:08) Connor Barth extra point is good.","(7:14) Brian Hoyer pass to the right to Zach Miller for 2 yards for a TOUCHDOWN.","(7:20) Brian Hoyer incomplete pass to the right intended for Zach Miller defensed by Byron Jones.","(7:59) Jordan Howard rush up the middle for 1 yard to the Dal2. Tackled by Kyle Wilber.","(8:05) Brian Hoyer incomplete pass to the right intended for Kevin White.","(8:51) Brian Hoyer pass to the right to Zach Miller for 11 yards to the Dal3. Tackled by Anthony Hitchens.","(9:29) Jordan Howard rush to the left for no gain to the Dal14. Tackled by Byron Jones and Brandon Carr.","(10:02) Jeremy Langford rush to the left for 23 yards to the Dal14. Tackled by Barry Church.","(10:34) Brian Hoyer pass to the left to Jeremy Langford for 10 yards to the Dal37. Tackled by Brandon Carr.","(11:24) Brian Hoyer rush to the left for 3 yards to the Dal47. Tackled by Sean Lee.","(12:00) Brian Hoyer pass to the right to Alshon Jeffery for 13 yards to the Chi50. Tackled by Barry Church.","(12:02) Brian Hoyer incomplete pass to the middle intended for Alshon Jeffery.","(12:26) Dak Prescott pass to the right to Terrance Williams for 47 yards to the Chi22. Tackled by Jacoby Glenn. FUMBLE, recovered by Chi (Adrian Amos) and returned for 21 yards. Tackled by Dak Prescott.","(13:05) Ezekiel Elliott rush to the left for a loss of 1 yard to the Dal31. Tackled by Sam Acho.","(13:15) Patrick O'Donnell punts for 42 yards to Dal29. Lucky Whitehead return for 3 yards to Dal32. Tackled by Jonathan Anderson.","(13:21) Brian Hoyer incomplete pass to the right intended for Kevin White defensed by Morris Claiborne.","(14:51) Brian Hoyer pass to the left to Kevin White for 8 yards to the Chi29. Tackled by Kyle Wilber and Anthony Hitchens.","(14:51) Jordan Howard rush to the right for a loss of 3 yards to the Chi21. Tackled by Sean Lee.","(15:00) Dan Bailey kicks off to the Chi2. Deonte Thompson return for 22 yards to Chi24. Tackled by Damien Wilson.","(0:05) Brian Hoyer incomplete pass to the right.","(0:10) Brian Hoyer incomplete pass to the left intended for Kevin White.","(0:10) Penalty: False Start on Chicago (Cody Whitehair) -5 yards.","(0:10) Chicago Bears timeout.","(0:17) Brian Hoyer pass to the left to Zach Miller for 11 yards to the Dal43. Tackled by Anthony Brown.","(0:23) Brian Hoyer pass to the right to Jordan Howard for 5 yards to the Chi46. Tackled by Morris Claiborne.","(0:23) Chicago Bears timeout.","(0:30) Brian Hoyer pass to the right to Zach Miller for 9 yards to the Chi41. Tackled by Barry Church.","(0:30) Chicago Bears timeout.","(0:38) Brian Hoyer pass to the middle to Zach Miller for 7 yards to the Chi32. Tackled by Anthony Brown and Barry Church.","(0:38) Dan Bailey kicks off to the endzone. Touchback.","(0:38) Dan Bailey extra point is good.","(0:43) Alfred Morris rush up the middle for 3 yards for a TOUCHDOWN.","(1:14) Ezekiel Elliott rush to the right for 6 yards to the Chi3. Tackled by Adrian Amos.","(1:54) Dak Prescott rush up the middle for 12 yards to the Chi9. Tackled by Cre'von LeBlanc.","(1:54) Two Minute Warning.","(2:01) Dak Prescott incomplete pass to the middle intended for Dez Bryant defensed by Will Sutton.","(2:44) Ezekiel Elliott rush to the right for 2 yards to the Chi21. Tackled by Jacoby Glenn.","(3:27) Dak Prescott pass to the right to Cole Beasley for 9 yards to the Chi23. Tackled by Jerrell Freeman.","(4:13) Ezekiel Elliott rush to the right for 2 yards to the Chi32. Tackled by Jerrell Freeman.","(4:53) Ezekiel Elliott rush to the right for 8 yards to the Chi34. Tackled by Tracy Porter.","(5:38) Dak Prescott pass to the right to Terrance Williams for 12 yards to the Chi42. Tackled by Harold Jones-Quartey.","(6:19) Ezekiel Elliott rush to the right for 3 yards to the Dal46. Tackled by Will Sutton and Mitch Unrein.","(6:58) Dak Prescott pass to the left to Terrance Williams for 12 yards to the Dal43. Tackled by Jacoby Glenn.","(7:39) Ezekiel Elliott rush to the right for 4 yards to the Dal31. Tackled by Akiem Hicks and Leonard Floyd.","(7:47) Connor Barth kicks off to the Dal2. Lucky Whitehead return for 25 yards to Dal27. Tackled by Chris Prosinski.","(7:47) Penalty: Offside on Chicago (Jonathan Anderson) -5 yards.","(7:52) Connor Barth 34 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(8:44) Penalty: False Start on Chicago (Patrick Scales) -5 yards.","(8:44) Brian Hoyer pass to the right to Eddie Royal for 6 yards to the Dal11. Tackled by Morris Claiborne.","(8:49) Brian Hoyer incomplete pass to the right intended for Jordan Howard.","(9:28)  FUMBLE, recovered by Chi (Brian Hoyer). Jordan Howard rush up the middle for a loss of 1 yard to the Dal17. Tackled by Tyrone Crawford.","(10:06) Brian Hoyer pass to the left to Alshon Jeffery for 22 yards to the Dal16. Tackled by Justin Durant.","(10:42) Jordan Howard rush to the left for 1 yard to the Dal38. Tackled by Cedric Thornton.","(11:11) Jordan Howard rush to the right for 36 yards to the Dal39. Tackled by J.J. Wilcox.","(11:11) Dan Bailey kicks off to the endzone. Touchback.","(11:11) Dan Bailey extra point is good.","(11:16) Lance Dunbar rush to the left for 1 yard for a TOUCHDOWN.","(11:56) Dak Prescott pass to the left to Cole Beasley for 29 yards to the Chi1. Tackled by Jacoby Glenn.","(12:35) Alfred Morris rush to the left for 3 yards to the Chi30. Tackled by Sam Acho.","(13:11) Alfred Morris rush up the middle for 5 yards to the Chi33. Tackled by Jerrell Freeman.","(13:45) Dak Prescott pass to the right to Cole Beasley for 8 yards to the Chi38. Tackled by Christian Jones.","(14:26) Dak Prescott pass to the right to Alfred Morris for 2 yards to the Chi46. Tackled by Leonard Floyd.","(15:00) Dak Prescott rush to the left for 17 yards to the Chi48. Tackled by Harold Jones-Quartey.","(0:15) Alfred Morris rush to the right for 7 yards to the Dal35. Tackled by Sam Acho.","(0:20) Dak Prescott incomplete pass to the right intended for Geoff Swaim.","(0:29) Patrick O'Donnell punts for 40 yards to Dal28. No return.","(0:34) Brian Hoyer incomplete pass to the left intended for Jeremy Langford defensed by Barry Church.","(1:17) Jeremy Langford rush up the middle for 1 yard to the Chi32. Tackled by Byron Jones.","(1:54) Brian Hoyer pass to the middle to Zach Miller for 6 yards to the Chi31. Tackled by Sean Lee and Anthony Hitchens.","(1:54) Dan Bailey kicks off to the endzone. Touchback.","(1:59) Dan Bailey 49 yard field goal attempt is GOOD. Holder: Chris Jones.","(2:06) Dak Prescott incomplete pass to the left intended for Brice Butler defensed by Jacoby Glenn.","(2:51) Dak Prescott pass to the middle to Jason Witten for 7 yards to the Chi31. Tackled by Jerrell Freeman and Mitch Unrein.","(3:30) Alfred Morris rush to the right for 1 yard to the Chi38. Tackled by Jerrell Freeman.","(3:39) Penalty: Holding on Dallas (Chaz Green) -10 yards.","(4:22) Ezekiel Elliott rush up the middle for 11 yards to the Chi29. Tackled by Harold Jones-Quartey and Jerrell Freeman.","(5:03) Dak Prescott pass to the right to Terrance Williams for 17 yards to the Chi40. Tackled by Jacoby Glenn.","(5:36) Dak Prescott pass to the right to Cole Beasley for 9 yards to the Dal43. Tackled by Adrian Amos.","(6:11) Ezekiel Elliott rush to the right for 3 yards to the Dal34. Tackled by Harold Jones-Quartey.","(6:53) Ezekiel Elliott rush to the right for 6 yards to the Dal31. Tackled by Nick Kwiatkoski and Will Sutton.","(7:01) Patrick O'Donnell punts for 49 yards to Dal25. No return.","(7:39) Brian Hoyer pass to the right to Jeremy Langford for 5 yards to the Chi26. Tackled by Byron Jones and Barry Church.","(8:16) Penalty: Illegal Use of Hands on Chicago (Charles Leno Jr.) -10 yards.","(8:56) Jeremy Langford rush to the right for 7 yards to the Chi31. Tackled by Barry Church and Tyrone Crawford.","(9:30) Brian Hoyer rush to the right for a loss of 1 yard to the Chi24. Tackled by Tyrone Crawford.","(9:30) Dan Bailey kicks off to the endzone. Touchback.","(9:30) Dan Bailey extra point is good.","(9:45) Dak Prescott rush up the middle for 1 yard for a TOUCHDOWN.","(10:07) Dallas Cowboys timeout.","(10:07) Dak Prescott pass to the right to Jason Witten for 18 yards to the Chi1. Tackled by Leonard Floyd.","(10:34) Ezekiel Elliott rush to the right for 5 yards to the Chi19. Tackled by Tracy Porter.","(10:57) Dak Prescott pass to the left to Cole Beasley for 5 yards to the Chi24. Tackled by Adrian Amos.","(11:37) Ezekiel Elliott rush to the left for 1 yard to the Chi29. Tackled by Will Sutton.","(12:12) Lucky Whitehead rush to the right for 3 yards to the Chi30. Tackled by Harold Jones-Quartey.","(12:54) Dak Prescott rush up the middle for 6 yards to the Chi33. Tackled by Leonard Floyd.","(13:33) Ezekiel Elliott rush to the left for 4 yards to the Chi39. Tackled by Leonard Floyd.","(14:23) Dak Prescott pass to the left to Dez Bryant for 11 yards to the Chi43. Tackled by Christian Jones.","(15:00) Ezekiel Elliott rush up the middle for 21 yards to the Dal46. Tackled by Tracy Porter and Harold Jones-Quartey.","(15:00) Connor Barth kicks off to the endzone. Touchback."]