["(0:38) Tyrod Taylor rush up the middle for a loss of 2 yards to the Buf17.","(1:07) Tyrod Taylor rush up the middle for a loss of 1 yard to the Buf19.","(1:14) Carson Palmer pass intended for Michael Floyd INTERCEPTED by Corey White. No return. Touchback.","(1:18) Carson Palmer pass to the left to John Brown for 8 yards to the Buf28. Tackled by Stephon Gilmore.","(1:26) Carson Palmer pass to the left to Michael Floyd for 25 yards to the Buf36.","(1:51) Carson Palmer sacked at Ari39 for a loss of 1 yard by Lorenzo Alexander and Kyle Williams. FUMBLE, recovered by Ari (Earl Watford).","(2:00) Colton Schmidt punts for 25 yards to Ari40. No return.","(2:00) Two Minute Warning.","(2:05) Jonathan Williams rush to the right for 1 yard to the Buf35. Tackled by Markus Golden and Patrick Peterson.","(2:05) Arizona Cardinals timeout.","(2:09) Jonathan Williams rush up the middle for no gain to the Buf34. Tackled by Josh Mauro and Tony Jefferson.","(2:09) Arizona Cardinals timeout.","(2:13) Jonathan Williams rush to the right for 1 yard to the Buf34. Tackled by Tony Jefferson and Deone Bucannon.","(2:25) Carson Palmer pass intended for Michael Floyd INTERCEPTED by Stephon Gilmore and returned for 34 yards. Tackled by Earl Watford.","(2:28) Carson Palmer incomplete pass to the middle intended for David Johnson.","(2:52) Carson Palmer sacked at Buf20 for a loss of 6 yards by Jerry Hughes.","(3:04) Colton Schmidt kicks off to the Ari35. John Brown return for 51 yards to Buf14. Tackled by Jonathan Meeks.","(3:08) LeSean McCoy rush to the right for a loss of 1 yard to the Buf0. Tackled by Corey Peters. Safety.","(3:16) Carson Palmer pass intended for Jaron Brown INTERCEPTED by Corey Graham. No return.","(3:23) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald defensed by Nickell Robey-Coleman.","(3:45) Carson Palmer pass to the right to Jaron Brown for 15 yards to the Buf23. Tackled by Robert Blanton.","(4:11)  FUMBLE, recovered by Ari (Carson Palmer). Carson Palmer pass to the right to Jaron Brown for 23 yards to the Buf38. Tackled by Corey White.","(4:16) Carson Palmer incomplete pass to the left intended for Jaron Brown.","(4:16) Penalty: Delay of Game on Arizona (Carson Palmer) -5 yards.","(4:22) Carson Palmer incomplete pass to the middle intended for David Johnson.","(4:42) Carson Palmer pass to the left to John Brown for 19 yards to the Ari44. Tackled by Stephon Gilmore.","(4:48) Carson Palmer incomplete pass to the right intended for Michael Floyd.","(4:48) Jordan Gay kicks off to the endzone. Touchback.","(4:52) Dan Carpenter 45 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(4:52) Arizona Cardinals timeout.","(4:57) LeSean McCoy rush to the right for 4 yards to the Ari27. Tackled by D.J. Swearinger and Markus Golden.","(5:41) LeSean McCoy rush up the middle for 1 yard to the Ari31. Tackled by Markus Golden.","(6:18) Tyrod Taylor pass to the left to Robert Woods for 8 yards to the Ari32. Tackled by Marcus Cooper and Tyvon Branch.","(6:30) Penalty: Holding on Buffalo (Cyrus Kouandjio) -10 yards.","(6:40) Carson Palmer pass intended for John Brown INTERCEPTED by Stephon Gilmore and returned for 14 yards. Tackled by Earl Watford.","(7:03) Carson Palmer pass to the left to Larry Fitzgerald for 9 yards to the Ari25. Tackled by Corey Graham.","(7:31) Carson Palmer pass to the left to John Brown for 12 yards to the Ari16.","(7:35) Carson Palmer incomplete pass to the right intended for Michael Floyd.","(7:45) Colton Schmidt punts for 43 yards to Ari4. No return.","(8:15) Tyrod Taylor sacked at Ari47 for a loss of 7 yards by Tony Jefferson.","(8:17) Tyrod Taylor incomplete pass to the right intended for Charles Clay.","(8:44) Tyrod Taylor rush up the middle for a loss of 3 yards to the Ari33. Tackled by Tyrann Mathieu. FUMBLE, recovered by Buf.","(9:19) Tyrod Taylor pass to the right to Nick O'Leary for 28 yards to the Ari30. Tackled by Tony Jefferson.","(9:56) LeSean McCoy rush up the middle for 6 yards to the Buf42. Tackled by Tony Jefferson.","(10:32) LeSean McCoy rush to the right for 5 yards to the Buf36. Tackled by Calais Campbell.","(10:36) Chandler Catanzaro kicks off to the Buf24. Jerome Felton return for 7 yards to Buf31. Tackled by D.J. Swearinger and Alani Fua.","(10:41) Chandler Catanzaro 60 yard field goal attempt is GOOD. Holder: Drew Butler.","(11:22) Carson Palmer pass to the middle to Larry Fitzgerald for 5 yards to the Buf42. Tackled by Corey Graham.","(11:28) Carson Palmer incomplete pass to the left intended for Michael Floyd.","(11:54) Carson Palmer sacked at Buf47 for a loss of 9 yards by Corey Graham.","(11:55) Buffalo Bills timeout.","(12:27) Penalty: Holding on Arizona (A.Q. Shipley) -10 yards.","(12:32) Penalty: Pass Interference on Buffalo (Zach Brown) 5 yards.","(12:55) Carson Palmer pass to the right to Larry Fitzgerald for 13 yards to the Buf33. Tackled by Kevon Seymour.","(13:03) Colton Schmidt punts for 26 yards to Buf46. No return.","(13:49) Tyrod Taylor pass to the left to Robert Woods for 7 yards to the Buf20. Tackled by Tyrann Mathieu.","(14:31) LeSean McCoy rush to the right for a loss of 2 yards to the Buf13. Tackled by Calais Campbell.","(15:00) LeSean McCoy rush to the right for 2 yards to the Buf25. Tackled by Tyrann Mathieu. Penalty: Holding on Buffalo (Jordan Mills) -10 yards.","(0:08) Tyrod Taylor sacked at Buf23 for a loss of 8 yards by Markus Golden.","(0:12) Chandler Catanzaro kicks off to the Buf20. Jerome Felton return for 11 yards to Buf31. Tackled by D.J. Swearinger.","(0:12) Carson Palmer 2 pt conversion pass is NO GOOD - intended for Jaron Brown.","(0:19) David Johnson rush to the left for 22 yards for a TOUCHDOWN.","(0:42) Carson Palmer pass to the left to Michael Floyd for 17 yards to the Buf22. Tackled by Robert Blanton.","(1:03) Carson Palmer pass to the left to Michael Floyd for 15 yards to the Buf39.","(1:39) Carson Palmer pass to the right to John Brown for 15 yards to the Ari46. Tackled by Corey White.","(1:59) Carson Palmer pass to the left to Larry Fitzgerald for 7 yards to the Ari31. Tackled by Nickell Robey-Coleman.","(2:20) Carson Palmer pass to the right to John Brown for 7 yards to the Ari24. Tackled by Corey White.","(2:25) Jordan Gay kicks off to the Ari-3. Andre Ellington return for 20 yards to Ari17. Tackled by Kevon Seymour.","(2:25) Dan Carpenter extra point is good.","(2:40) Drew Butler rush up the middle for no gain to the Buf12. FUMBLE, recovered by Buf (Aaron Williams) and returned for 53 yards for a TOUCHDOWN.","(2:49) Penalty: Delay of Game on Arizona (Carson Palmer) -5 yards.","(3:38) David Johnson rush up the middle for no gain to the Buf7. Tackled by Jerry Hughes and Jerel Worthy.","(4:20) David Johnson rush to the right for no gain to the Buf7. Tackled by Corey White.","(4:38) Penalty: Offside on Buffalo (Jerry Hughes) 5 yards.","(5:22) David Johnson rush to the right for 4 yards to the Buf12. Tackled by Zach Brown.","(5:56) Carson Palmer pass to the right to Darren Fells for 7 yards to the Buf16. Tackled by Duke Williams.","(6:36) Chris Johnson rush to the right for 5 yards to the Buf23. Tackled by Lorenzo Alexander and Corey White.","(7:13) Chris Johnson rush up the middle for no gain to the Buf28. Tackled by Zach Brown.","(7:46) Carson Palmer pass to the right to Larry Fitzgerald for 11 yards to the Buf28. Tackled by Corey White.","(8:25) David Johnson rush to the left for 13 yards to the Buf39. Tackled by Corey Graham.","(9:07) Carson Palmer pass to the left to David Johnson for 12 yards to the Ari48. Tackled by Kevon Seymour and Preston Brown.","(9:39) Carson Palmer pass to the right to Larry Fitzgerald for 12 yards to the Ari36. Tackled by Corey White.","(10:25) David Johnson rush up the middle for a loss of 1 yard to the Ari24. Tackled by Preston Brown and Kyle Williams.","(10:31) Carson Palmer incomplete pass to the middle intended for David Johnson.","(10:31) Jordan Gay kicks off to the endzone. Touchback.","(10:31) Dan Carpenter extra point is NO GOOD.","(10:39) Tyrod Taylor rush to the right for 20 yards for a TOUCHDOWN.","(11:21) Tyrod Taylor rush to the left for 6 yards to the Ari20. Tackled by Marcus Cooper.","(11:27) Tyrod Taylor incomplete pass to the left intended for LeSean McCoy.","(12:06) Tyrod Taylor pass to the right to Walt Powell for 14 yards to the Ari26. Tackled by Patrick Peterson.","(12:43) LeSean McCoy rush to the left for no gain to the Ari40. Tackled by Calais Campbell.","(13:20) LeSean McCoy rush up the middle for 7 yards to the Ari40. Tackled by Marcus Cooper.","(13:27) Chandler Catanzaro punts for 19 yards to Ari47. No return.","(13:31) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald.","(14:17) Carson Palmer pass to the left to Troy Niklas for no gain to the Ari28. Tackled by Zach Brown.","(15:00) David Johnson rush to the right for 3 yards to the Ari28. Tackled by Lorenzo Alexander and Corbin Bryant.","(15:00) Jordan Gay kicks off to the endzone. Touchback.","(0:07) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(0:13) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin defensed by Marcus Cooper.","(0:13) Buffalo Bills timeout.","(0:21) Tyrod Taylor sacked at Buf48 for a loss of 2 yards by Chandler Jones.","(0:21) Buffalo Bills timeout.","(0:30) LeSean McCoy rush up the middle for 9 yards to the Buf49. Tackled by Tony Jefferson. FUMBLE, recovered by Buf (Jordan Mills).","(0:34) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(0:52) Tyrod Taylor pass to the left to LeSean McCoy for 3 yards to the Buf40. Tackled by Kevin Minter.","(0:52) Buffalo Bills timeout.","(0:58) Mike Gillislee rush up the middle for 8 yards to the Buf37. Tackled by Tyvon Branch.","(1:05) Tyrod Taylor pass to the left to Robert Woods for 4 yards to the Buf29. Tackled by Tyvon Branch.","(1:05) Chandler Catanzaro kicks off to the endzone. Touchback.","(1:05) Chandler Catanzaro extra point is good.","(1:09) David Johnson rush up the middle for 4 yards for a TOUCHDOWN.","(1:13) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(1:18) Penalty: Holding on Buffalo (Lorenzo Alexander) 5 yards.","(2:00) David Johnson rush to the left for 1 yard to the Buf9. Tackled by Adolphus Washington and Stephon Gilmore.","(2:00) Two Minute Warning.","(2:13) David Johnson rush to the right for 6 yards to the Buf10. Tackled by Zach Brown.","(2:57) Carson Palmer pass to the left to Darren Fells for 8 yards to the Buf16. Tackled by Robert Blanton and Jonathan Meeks.","(3:38) David Johnson rush up the middle for 3 yards to the Buf24. Tackled by Leger Douzable.","(4:19) David Johnson rush to the left for 4 yards to the Buf27. Tackled by Zach Brown.","(4:59) Carson Palmer pass to the right to David Johnson for 11 yards to the Buf31. Tackled by Zach Brown.","(5:32) Carson Palmer pass to the right to Michael Floyd for 8 yards to the Buf42. Tackled by Corey White.","(6:05) Carson Palmer pass to the right to Jaron Brown for 11 yards to the Ari50. Tackled by Corbin Bryant.","(6:36) Penalty: Illegal Formation on Arizona (Michael Floyd) -5 yards.","(7:08) Carson Palmer sacked at Ari29 for a loss of 4 yards by Lorenzo Alexander. Penalty: Unnecessary Roughness on Buffalo (Jerry Hughes) 15 yards.","(7:35) Penalty: Pass Interference on Arizona (John Brown) -10 yards.","(8:15) David Johnson rush up the middle for 6 yards to the Ari43. Tackled by Preston Brown and Lorenzo Alexander.","(8:20) Carson Palmer incomplete pass to the left intended for Jermaine Gresham defensed by Stephon Gilmore.","(8:57) David Johnson rush to the left for 11 yards to the Ari37. Tackled by Zach Brown.","(9:33) David Johnson rush to the left for 1 yard to the Ari26. Tackled by Zach Brown and Adolphus Washington.","(10:13) Carson Palmer pass to the right to John Brown for 9 yards to the Ari25. Tackled by Corey White.","(10:20) Carson Palmer incomplete pass to the middle intended for John Brown defensed by Stephon Gilmore.","(10:25) Jordan Gay kicks off to the Ari1. Andre Ellington return for 15 yards to Ari16. Tackled by Nickell Robey-Coleman.","(10:25) Dan Carpenter extra point is good.","(10:32) LeSean McCoy rush to the left for 5 yards for a TOUCHDOWN.","(11:13) Mike Gillislee rush to the left for 6 yards to the Ari5. Tackled by D.J. Swearinger and Deone Bucannon.","(11:18) Tyrod Taylor incomplete pass to the right intended for Charles Clay defensed by Calais Campbell.","(11:56) LeSean McCoy rush to the right for 8 yards to the Ari11. Tackled by Patrick Peterson and D.J. Swearinger.","(12:34) Tyrod Taylor rush to the right for 10 yards to the Ari19. Tackled by Calais Campbell.","(13:16) LeSean McCoy rush to the right for 18 yards to the Ari29. Tackled by Tony Jefferson.","(13:16) Penalty: Encroachment on Arizona (Corey Peters) 5 yards.","(13:25) Chandler Catanzaro punts for 47 yards to Buf43. No return. Penalty: Illegal Touch on Arizona (Justin Bethel) 5 yards.","(14:01) Carson Palmer pass to the left to David Johnson for 5 yards to the Ari10. Tackled by Preston Brown.","(14:01) Penalty: False Start on Arizona (Jared Veldheer) -5 yards.","(14:06) Carson Palmer incomplete pass to the left intended for John Brown.","(14:10) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald defensed by Jerry Hughes.","(14:14) Tyrod Taylor pass intended for Marquise Goodwin INTERCEPTED by Patrick Peterson. No return.","(14:51) Tyrod Taylor rush up the middle for no gain to the Ari49. FUMBLE, recovered by Buf (Tyrod Taylor).","(14:55) Tyrod Taylor incomplete pass to the left intended for Walt Powell.","(15:00) Penalty: Illegal Use of Hands on Buffalo (Richie Incognito) -10 yards.","(0:02) Drew Butler punts for 40 yards to Buf30. Brandon Tate return for 31 yards to Ari39. Tackled by Deone Bucannon and Drew Butler.","(0:07) Carson Palmer incomplete pass to the right intended for Jaron Brown defensed by Aaron Williams.","(0:48) David Johnson rush to the left for 5 yards to the Ari30. Tackled by Lorenzo Alexander and Zach Brown.","(0:55) Carson Palmer incomplete pass to the left intended for John Brown defensed by Corey Graham.","(0:55) Jordan Gay kicks off to the endzone. Touchback.","(0:55) Dan Carpenter extra point is good.","(0:59) LeSean McCoy rush up the middle for 24 yards for a TOUCHDOWN.","(1:13) Tyrod Taylor pass to the left to Robert Woods for 24 yards to the Ari24. Tackled by Patrick Peterson.","(1:18) Tyrod Taylor incomplete pass to the right intended for Walt Powell.","(1:39) Penalty: Pass Interference on Buffalo (Robert Woods) -10 yards.","(2:02) Tyrod Taylor pass to the right to Walt Powell for 9 yards to the Ari38. Tackled by Marcus Cooper.","(2:25) LeSean McCoy rush to the left for 6 yards to the Ari47. Tackled by Kevin Minter.","(2:34) Drew Butler punts for 31 yards to Buf47. No return.","(2:40) Carson Palmer incomplete pass to the right intended for John Brown.","(2:47) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Corey Graham.","(3:29) David Johnson rush to the left for a loss of 3 yards to the Ari22. Tackled by Kyle Williams.","(3:29) Jordan Gay kicks off to the endzone. Touchback.","(3:32) Dan Carpenter 19 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(4:24) Tyrod Taylor pass to the right to Walt Powell for 5 yards to the Ari1. Tackled by Marcus Cooper and Tony Jefferson.","(5:01) Tyrod Taylor rush to the left for a loss of 3 yards to the Ari6. Tackled by Chandler Jones.","(5:34) Mike Gillislee rush up the middle for 6 yards to the Ari3. Tackled by Deone Bucannon and Rodney Gunter.","(6:13) LeSean McCoy rush to the left for 17 yards to the Ari9. Tackled by Markus Golden and Tony Jefferson.","(6:46) Tyrod Taylor pass to the left to Robert Woods for 3 yards to the Ari26. Tackled by Tyvon Branch.","(7:20) Tyrod Taylor rush to the left for 49 yards to the Ari29. Tackled by Marcus Cooper.","(7:28) Drew Butler punts for 50 yards to Buf14. Brandon Tate return for 8 yards to Buf22. Tackled by Justin Bethel.","(8:04) Carson Palmer sacked at Ari36 for a loss of 7 yards by Kyle Williams.","(8:44) Carson Palmer pass to the left to Larry Fitzgerald for 3 yards to the Ari43. Tackled by Zach Brown.","(9:24) David Johnson rush up the middle for 2 yards to the Ari40. Tackled by Zach Brown and Brandon Spikes.","(9:32) Colton Schmidt punts for 39 yards to Ari38. No return.","(9:39) Tyrod Taylor incomplete pass to the right intended for Robert Woods.","(9:45) Tyrod Taylor incomplete pass to the right intended for Robert Woods.","(10:17) LeSean McCoy rush to the right for 1 yard to the Buf23. Tackled by Corey Peters and Markus Golden.","(10:52) Tyrod Taylor pass to the left to Marquise Goodwin for 6 yards to the Buf22. Tackled by Deone Bucannon.","(11:32) Tyrod Taylor pass to the right to Robert Woods for 5 yards to the Buf16. Tackled by Marcus Cooper.","(11:43) Drew Butler punts for 25 yards to Buf11. No return.","(11:50) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(12:32) David Johnson rush to the left for 2 yards to the Buf36. Tackled by Zach Brown and Adolphus Washington.","(12:37) Carson Palmer incomplete pass to the right intended for Michael Floyd.","(12:47) Colton Schmidt punts for 45 yards to Buf50. John Brown return for 12 yards to Buf38. Tackled by Preston Brown.","(13:19) Tyrod Taylor sacked at Buf5 for a loss of 13 yards by Kevin Minter.","(13:57) Tyrod Taylor pass to the left to LeSean McCoy for 3 yards to the Buf18. Tackled by Kevin Minter.","(14:17) Penalty: False Start on Buffalo (Jordan Mills) -5 yards.","(14:54) Tyrod Taylor pass to the right to LeSean McCoy for no gain to the Buf20. Tackled by Patrick Peterson.","(15:00) Chandler Catanzaro kicks off to the Buf0. Brandon Tate return for 20 yards to Buf20. Tackled by Gabe Martin."]