["(0:15) Joe Flacco rush up the middle for a loss of 1 yard to the Jax40.","(0:25) Blake Bortles pass intended for Allen Hurns INTERCEPTED by Zachary Orr defensed by Lardarius Webb and returned for 8 yards.","(0:32) Penalty: Holding on Jacksonville (Jermey Parnell) -10 yards.","(0:32) Jacksonville Jaguars timeout.","(0:43) Blake Bortles sacked at Jax24 for a loss of 7 yards by Terrell Suggs.","(1:02) Blake Bortles pass to the middle to T.J. Yeldon for 6 yards to the Jax31. Tackled by C.J. Mosley.","(1:02) Justin Tucker kicks off to the endzone. Touchback.","(1:07) Justin Tucker 54 yard field goal attempt is GOOD. Holder: Sam Koch.","(1:07) Jacksonville Jaguars timeout.","(1:13) Joe Flacco pass to the right to Kyle Juszczyk for 2 yards to the Jax35. Tackled by Jalen Ramsey.","(1:13) Jacksonville Jaguars timeout.","(1:18) Justin Forsett rush to the right for 1 yard to the Jax37. Tackled by Dante Fowler Jr..","(2:00) Justin Forsett rush up the middle for 6 yards to the Jax38. Tackled by Telvin Smith.","(2:00) Two Minute Warning.","(2:14) Joe Flacco pass to the left to Steve Smith Sr. for 5 yards to the Jax44. Tackled by Paul Posluszny.","(2:18) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(2:54) Joe Flacco pass to the left to Justin Forsett for 4 yards to the Jax49. Tackled by Davon House.","(2:59) Joe Flacco pass to the left to Steve Smith Sr. for 4 yards to the Bal47.","(3:06) Jason Myers 52 yard field goal attempt is BLOCKED by Brent Urban. Return blocked field goal by Zachary Orr to the Bal43. Tackled by Tyson Alualu.","(3:06) Baltimore Ravens timeout.","(3:10) Blake Bortles sacked at Bal34 for a loss of 9 yards by Lawrence Guy.","(3:10) Baltimore Ravens timeout.","(3:16) Blake Bortles pass to the right to Allen Hurns for 4 yards to the Bal25. Tackled by Shareece Wright.","(3:16) Baltimore Ravens timeout.","(3:17) Chris Ivory rush up the middle for no gain to the Bal29. Tackled by Zachary Orr.","(3:27) Joe Flacco pass intended for Justin Forsett INTERCEPTED by Paul Posluszny defensed by Dante Fowler Jr.. No return. Tackled by Ryan Jensen.","(4:08) Terrance West rush up the middle for 1 yard to the Bal30. Tackled by Paul Posluszny.","(4:16) Blake Bortles pass intended for T.J. Yeldon INTERCEPTED by Tavon Young defensed by Timmy Jernigan and returned for 6 yards. Tackled by T.J. Yeldon.","(4:54) Chris Ivory rush up the middle for 2 yards to the Bal31. Tackled by Lawrence Guy.","(5:17) Chris Ivory rush up the middle for a loss of 2 yards to the Bal33. Tackled by Zachary Orr.","(5:31) Joe Flacco pass intended for Dennis Pitta INTERCEPTED by Tashaun Gipson and returned for 30 yards. Tackled by Chris Moore.","(6:09) Terrance West rush up the middle for 6 yards to the Bal41. Tackled by Johnathan Cyprien.","(6:46) Joe Flacco pass to the right to Steve Smith Sr. for 5 yards to the Bal35. Tackled by Tashaun Gipson.","(7:20) Joe Flacco pass to the right to Steve Smith Sr. for 15 yards to the Bal30. Tackled by Johnathan Cyprien.","(7:26) Penalty: Holding on Baltimore (Ronnie Stanley) -10 yards.","(7:27) Jason Myers kicks off to the endzone. Touchback.","(7:29) Jason Myers 49 yard field goal attempt is GOOD. Holder: Brad Nortman.","(7:38) Blake Bortles incomplete pass to the middle intended for Allen Hurns defensed by Timmy Jernigan.","(8:25) Blake Bortles pass to the left to Marcedes Lewis for 7 yards to the Bal31. Tackled by Albert McClellan and Zachary Orr.","(9:01) Chris Ivory rush to the right for 1 yard to the Bal38. Tackled by Shareece Wright.","(9:11) Brad Nortman punts for 35 yards to Bal39. Devin Hester - no return. FUMBLE, recovered by Jax (Denard Robinson) and returned for 22 yards. Tackled by Devin Hester.","(9:49) Blake Bortles pass to the left to T.J. Yeldon for 5 yards to the Jax26. Tackled by Jimmy Smith.","(10:25) Blake Bortles sacked at Jax21 for a loss of 8 yards by Timmy Jernigan.","(11:07) Blake Bortles sacked at Jax29 for a loss of 2 yards by Terrell Suggs.","(11:11) Penalty: Illegal Use of Hands on Baltimore (Jimmy Smith) 5 yards.","(11:53) Blake Bortles pass to the right to Allen Robinson for 7 yards to the Jax26. Tackled by Shareece Wright.","(12:05) Sam Koch punts for 53 yards to Jax13. Rashad Greene return for 6 yards to Jax19. Tackled by Tavon Young.","(12:08) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(12:54) Justin Forsett rush up the middle for 2 yards to the Bal34. Tackled by Sheldon Day.","(13:28) Joe Flacco pass to the right to Justin Forsett for 5 yards to the Bal32. Tackled by Johnathan Cyprien.","(13:49) Terrance West rush up the middle for 3 yards to the Bal22. Tackled by Paul Posluszny. Penalty: Illegal Use of Hands on Jacksonville (Dante Fowler Jr.) 5 yards.","(14:11) Penalty: False Start on Baltimore (Ronnie Stanley) -5 yards.","(14:49) Terrance West rush up the middle for 4 yards to the Bal24. Tackled by Davon House.","(14:57) Brad Nortman punts for 44 yards to Bal0. Touchback.","(15:00) Blake Bortles incomplete pass to the right intended for Julius Thomas defensed by C.J. Mosley.","(0:11) Blake Bortles pass to the right to Julius Thomas for 5 yards to the Bal44. Tackled by C.J. Mosley.","(0:34) Chris Ivory rush up the middle for no gain to the Bal49. Tackled by Brandon Williams.","(1:19) Blake Bortles pass to the left to Chris Ivory for 9 yards to the Bal49. Tackled by Eric Weddle.","(2:04) Blake Bortles rush to the right for 6 yards to the Jax42. Tackled by Terrell Suggs.","(2:43) Chris Ivory rush up the middle for 3 yards to the Jax36. Tackled by C.J. Mosley and Zachary Orr.","(3:22) Blake Bortles pass to the left to Julius Thomas for 8 yards to the Jax33. Tackled by C.J. Mosley.","(3:33) Sam Koch punts for 50 yards to Jax28. Rashad Greene return for a loss of 3 yards to Jax25. Tackled by Maurice Canady.","(3:38) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(4:21) Justin Forsett rush up the middle for 7 yards to the Bal22. Tackled by Johnathan Cyprien.","(4:26) Joe Flacco incomplete pass to the middle intended for Breshad Perriman.","(4:59) Penalty: Holding on Baltimore (Marshal Yanda) -10 yards.","(4:59) Jason Myers kicks off to the endzone. Touchback.","(4:59) Jason Myers extra point is good.","(5:09) Blake Bortles pass to the right to Allen Robinson for 11 yards for a TOUCHDOWN.","(5:39) Blake Bortles pass to the right to Marqise Lee for 3 yards to the Bal11. Tackled by Jimmy Smith.","(6:24) T.J. Yeldon rush to the left for a loss of 1 yard to the Bal14. Tackled by Brandon Williams and Albert McClellan.","(6:43) Blake Bortles rush up the middle for 9 yards to the Bal13.","(7:11) Blake Bortles pass to the left to Marqise Lee for 20 yards to the Bal22. Tackled by Eric Weddle.","(7:50) Chris Ivory rush to the left for 3 yards to the Bal42. Tackled by Brandon Williams.","(8:27) Blake Bortles pass to the left to Marqise Lee for 11 yards to the Bal45. Tackled by Zachary Orr.","(8:32) Blake Bortles incomplete pass to the left intended for Julius Thomas.","(9:07) Blake Bortles pass to the middle to Allen Hurns for 17 yards to the Jax44. Tackled by Zachary Orr.","(9:41) Blake Bortles rush up the middle for 2 yards to the Jax27. Tackled by Matt Judon.","(10:15) Blake Bortles pass to the right to Allen Hurns for 3 yards to the Jax25. Tackled by Shareece Wright.","(10:21) Justin Tucker kicks off to the Jax7. Corey Grant return for 15 yards to Jax22. Tackled by Albert McClellan.","(10:24) Justin Tucker 37 yard field goal attempt is GOOD. Holder: Sam Koch.","(10:30) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(11:11) Joe Flacco pass to the left to Steve Smith Sr. for 5 yards to the Jax19. Tackled by Johnathan Cyprien.","(11:56) Joe Flacco pass to the right to Justin Forsett for no gain to the Jax24. Tackled by Johnathan Cyprien and Jalen Ramsey.","(12:30) Joe Flacco pass to the left to Steve Smith Sr. for 21 yards to the Jax24. Tackled by Johnathan Cyprien.","(13:02) Joe Flacco pass to the right to Mike Wallace for 7 yards to the Jax45. Tackled by Davon House.","(13:46) Terrance West rush up the middle for 2 yards to the Bal48. Tackled by Malik Jackson.","(14:28) Terrance West rush up the middle for 6 yards to the Bal46. Tackled by Dan Skuta.","(15:00) Terrance West rush up the middle for 15 yards to the Bal40. Tackled by Tashaun Gipson.","(15:00) Jason Myers kicks off to the endzone. Touchback.","(0:00) Justin Tucker 42 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:05) Penalty: Unsports. Conduct on Jacksonville (Dante Fowler Jr.) 15 yards.","(0:29) Joe Flacco pass to the right to Chris Moore for 2 yards to the Jax39. Tackled by Jalen Ramsey.","(0:29) Baltimore Ravens timeout.","(0:39) Joe Flacco sacked at Jax41 for a loss of 7 yards by Yannick Ngakoue. FUMBLE, recovered by Bal (Joe Flacco).","(0:43) Joe Flacco pass to the left to Breshad Perriman for 7 yards to the Jax34.","(0:51) Joe Flacco pass to the left to Dennis Pitta for 8 yards to the Jax41. Tackled by Dwayne Gratz.","(0:51) Baltimore Ravens timeout.","(0:56) Joe Flacco pass to the right to Dennis Pitta for 4 yards to the Jax49. Tackled by Paul Posluszny.","(1:01) Penalty: Roughing Passer on Jacksonville (Malik Jackson) 15 yards.","(1:27) Joe Flacco pass to the left to Dennis Pitta for 5 yards to the Bal32. Tackled by Paul Posluszny.","(1:55) Joe Flacco pass to the right to Justin Forsett for 2 yards to the Bal27. Tackled by Jalen Ramsey.","(1:55) Jason Myers kicks off to the endzone. Touchback.","(1:55) Jason Myers extra point is good.","(2:00) Blake Bortles pass to the right to Allen Robinson for 3 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:44) Chris Ivory rush up the middle for 2 yards to the Bal3. Tackled by Lawrence Guy.","(3:22) Blake Bortles pass to the middle to Allen Robinson for 6 yards to the Bal5. Tackled by Shareece Wright.","(4:00) Blake Bortles pass to the left to Marqise Lee for 6 yards to the Bal11. Tackled by C.J. Mosley.","(4:05) Blake Bortles incomplete pass to the middle intended for Allen Hurns defensed by Eric Weddle.","(4:38) Blake Bortles pass to the right to Allen Robinson for 12 yards to the Bal17. Tackled by Lardarius Webb.","(5:15) T.J. Yeldon rush to the left for a loss of 1 yard to the Bal29. Tackled by Za'Darius Smith.","(5:45) T.J. Yeldon rush up the middle for 9 yards to the Bal28. Tackled by Za'Darius Smith.","(6:00) Sam Koch punts for 54 yards to Jax21. Rashad Greene return for 42 yards to Bal37. Tackled by Anthony Levine Sr..","(6:30) Joe Flacco pass to the right to Justin Forsett for 3 yards to the Bal25. Tackled by Telvin Smith and Paul Posluszny.","(6:36) Baltimore Ravens timeout.","(7:20) Joe Flacco pass to the right to Dennis Pitta for 7 yards to the Bal22. Tackled by Paul Posluszny.","(8:02) Joe Flacco sacked at Bal15 for a loss of 8 yards by Malik Jackson.","(8:40) Joe Flacco pass to the right to Mike Wallace for 15 yards to the Bal23. Tackled by Johnathan Cyprien.","(8:50) Brad Nortman punts for 39 yards to Bal16. No return. Penalty: Holding on Baltimore (Tavon Young) -8 yards.","(8:55) Blake Bortles incomplete pass to the left intended for Marqise Lee defensed by Zachary Orr.","(9:01) Blake Bortles incomplete pass to the left intended for Allen Hurns defensed by Eric Weddle.","(9:28) Blake Bortles pass to the right to Marcedes Lewis for 7 yards to the Bal45. Tackled by Albert McClellan. Penalty: Holding on Jacksonville (Jermey Parnell) -10 yards.","(9:54) Penalty: Offside on Baltimore (Terrell Suggs) 5 yards.","(10:29) Chris Ivory rush to the right for 1 yard to the Jax43. Tackled by Zachary Orr.","(11:02) Blake Bortles pass to the middle to Allen Hurns for 16 yards to the Jax42. Tackled by Eric Weddle.","(11:07) Justin Tucker kicks off to the Jax1. Corey Grant return for 25 yards to Jax26. Tackled by Tavon Young.","(11:11) Justin Tucker 43 yard field goal attempt is GOOD. Holder: Sam Koch.","(11:56) Joe Flacco pass to the left to Justin Forsett for a loss of 2 yards to the Jax25. Tackled by Telvin Smith.","(12:40) Joe Flacco pass to the left to Dennis Pitta for 5 yards to the Jax23. Tackled by Davon House.","(13:20) Breshad Perriman rush to the right for 2 yards to the Jax28. Tackled by Johnathan Cyprien.","(13:58) Terrance West rush up the middle for 5 yards to the Jax30. Tackled by Telvin Smith.","(14:37) Joe Flacco rush to the right for 6 yards to the Jax35. Tackled by Johnathan Cyprien.","(15:00) Joe Flacco pass to the right to Steve Smith Sr. for 9 yards to the Jax41. Tackled by Jalen Ramsey.","(0:31) Joe Flacco pass to the left to Kamar Aiken for 5 yards to the Bal50. Tackled by Paul Posluszny.","(1:08) Terrance West rush up the middle for 1 yard to the Bal45. Tackled by Telvin Smith.","(1:54) Joe Flacco pass to the left to Breshad Perriman for 15 yards to the Bal44. Tackled by Davon House.","(2:06) Blake Bortles pass intended for Allen Robinson INTERCEPTED by C.J. Mosley. No return. Tackled by Marqise Lee.","(2:35) Blake Bortles pass to the right to Allen Robinson for 14 yards to the Jax44. Tackled by Shareece Wright.","(3:15) T.J. Yeldon rush to the right for 4 yards to the Jax30. Tackled by Timmy Jernigan.","(3:47) Blake Bortles pass to the right to Marqise Lee for 4 yards to the Jax26. Tackled by Shareece Wright and Anthony Levine Sr..","(3:52) Justin Tucker kicks off to the Jax4. Corey Grant return for 18 yards to Jax22. Tackled by Kamalei Correa.","(3:52) Justin Tucker extra point is good.","(4:00) Joe Flacco rush to the left for 7 yards for a TOUCHDOWN.","(4:40) Justin Forsett rush up the middle for 2 yards to the Jax7. Tackled by Tyson Alualu.","(5:04) Terrance West rush to the left for 2 yards to the Jax19. Tackled by Paul Posluszny. Penalty: Unnecessary Roughness on Jacksonville (Yannick Ngakoue) 10 yards.","(5:39) Joe Flacco pass to the right to Steve Smith Sr. for 23 yards to the Jax21. Tackled by Tashaun Gipson.","(6:16) Joe Flacco pass to the middle to Dennis Pitta for 13 yards to the Jax44. Tackled by Paul Posluszny.","(6:52) Joe Flacco pass to the left to Mike Wallace for 12 yards to the Bal43. Tackled by Dwayne Gratz.","(7:27) Justin Forsett rush to the right for 1 yard to the Bal31. Tackled by Telvin Smith.","(7:55) Mike Wallace rush to the left for 5 yards to the Bal30. Tackled by Telvin Smith.","(8:04) Brad Nortman punts for 43 yards to Bal25. No return.","(8:09) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(8:15) Blake Bortles incomplete pass to the left intended for Julius Thomas defensed by Kamalei Correa.","(8:53) Chris Ivory rush up the middle for 2 yards to the Jax32. Tackled by Eric Weddle.","(9:01) Sam Koch punts for 44 yards to Jax42. Rashad Greene - no return. Tackled by Tavon Young. Penalty: Illegal Block on Jacksonville (Davon House) -10 yards.","(9:07) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(9:13) Joe Flacco incomplete pass to the middle intended for Breshad Perriman defensed by Telvin Smith.","(9:45) Joe Flacco pass to the right to Terrance West for 8 yards to the Bal14. Tackled by Paul Posluszny.","(9:56) Brad Nortman punts for 49 yards to Bal6. No return.","(10:01) Blake Bortles incomplete pass to the right intended for Allen Robinson.","(10:42) Chris Ivory rush up the middle for a loss of 2 yards to the Jax45. Tackled by Za'Darius Smith.","(11:14) Chris Ivory rush up the middle for 4 yards to the Jax47. Tackled by C.J. Mosley.","(11:41) Blake Bortles pass to the left to Allen Robinson for 4 yards to the Jax43. Tackled by Jimmy Smith.","(12:18) Blake Bortles pass to the middle to Marcedes Lewis for 6 yards to the Jax39. Tackled by Zachary Orr.","(12:52) T.J. Yeldon rush to the right for 3 yards to the Jax33. Tackled by Michael Pierce.","(13:02) Sam Koch punts for 42 yards to Jax24. Rashad Greene return for 6 yards to Jax30. Tackled by Chris Carter.","(13:05) Penalty: False Start on Baltimore (Morgan Cox) -5 yards.","(13:17) Penalty: Holding on Baltimore (Morgan Cox) -10 yards.","(13:22) Joe Flacco incomplete pass to the left intended for Steve Smith Sr..","(13:26) Joe Flacco incomplete pass to the right intended for Steve Smith Sr. defensed by Telvin Smith.","(14:01) Justin Forsett rush to the right for 1 yard to the Bal49. Tackled by Paul Posluszny and Tyson Alualu.","(14:07) Brad Nortman punts for 39 yards to Bal48. No return.","(14:13) Blake Bortles incomplete pass to the right intended for Allen Robinson.","(14:50) T.J. Yeldon rush up the middle for 3 yards to the Jax13. Tackled by Brandon Williams.","(14:55) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(15:00) Justin Tucker kicks off to the Jax0. Arrelious Benn - no return. Tackled by Maxx Williams."]