["(0:39) Alex Smith rush up the middle for a loss of 1 yard to the KC17.","(1:13) Alex Smith rush up the middle for a loss of 1 yard to the KC18.","(1:54) Alex Smith rush up the middle for a loss of 1 yard to the KC19.","(2:00) Ryan Fitzpatrick pass intended for Brandon Marshall INTERCEPTED by D.J. White. No return. Touchback.","(2:00) Two Minute Warning.","(2:07) Bilal Powell rush up the middle for 3 yards to the KC17. Tackled by Derrick Johnson.","(2:27) Bilal Powell rush up the middle for 12 yards to the KC20. Tackled by Daniel Sorensen.","(2:51) Ryan Fitzpatrick pass to the left to Bilal Powell for 8 yards to the KC32. Tackled by Derrick Johnson.","(3:18) Ryan Fitzpatrick pass to the left to Bilal Powell for 5 yards to the KC40. Tackled by Frank Zombo.","(3:28) Cairo Santos kicks off to the NYJ1. Quincy Enunwa return for 54 yards to KC45. Tackled by James O'Shaughnessy.","(3:28) Cairo Santos extra point is good.","(3:44) Ryan Fitzpatrick pass intended for Matt Forte INTERCEPTED by Derrick Johnson and returned for 55 yards for a TOUCHDOWN.","(4:10) Ryan Fitzpatrick pass to the left to Robby Anderson for 8 yards to the NYJ49. Tackled by Phillip Gaines.","(4:21) Dustin Colquitt punts for 46 yards to NYJ29. Jalin Marshall return for 12 yards to NYJ41. Tackled by Tyreek Hill and D.J. Alexander.","(4:21) New York Jets timeout.","(4:28) Spencer Ware rush to the right for 11 yards to the KC25. Tackled by Steve McLendon.","(4:28) New York Jets timeout.","(4:33) Spencer Ware rush to the right for a loss of 2 yards to the KC14. Tackled by Leonard Williams.","(4:33) New York Jets timeout.","(4:38) Spencer Ware rush up the middle for a loss of 6 yards to the KC16. Tackled by Muhammad Wilkerson.","(4:43) Ryan Fitzpatrick pass intended for Brandon Marshall INTERCEPTED by Daniel Sorensen. No return.","(4:48) Ryan Fitzpatrick incomplete pass to the left intended for Eric Decker defensed by Eric Berry.","(4:53) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa.","(4:59) Ryan Fitzpatrick incomplete pass to the right intended for Eric Decker defensed by Daniel Sorensen.","(5:31) Ryan Fitzpatrick pass to the right to Jalin Marshall for 11 yards to the KC40. Tackled by Allen Bailey.","(5:36) Ryan Fitzpatrick incomplete pass to the left intended for Matt Forte.","(5:43) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa.","(6:07) Bilal Powell rush up the middle for 13 yards to the NYJ49. Tackled by Daniel Sorensen.","(6:26) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa defensed by Ron Parker.","(6:39) Ryan Fitzpatrick pass to the right to Brandon Marshall for 7 yards to the NYJ36. Tackled by Ron Parker.","(6:45) Dustin Colquitt punts for 48 yards to NYJ29. No return.","(6:51) Alex Smith incomplete pass to the right intended for Chris Conley.","(6:51) Kansas City Chiefs timeout.","(7:39) Alex Smith pass to the right to Jeremy Maclin for 4 yards to the KC23. Tackled by David Harris.","(8:16) Spencer Ware rush up the middle for a loss of 1 yard to the KC19. Tackled by Sheldon Richardson.","(8:25) Ryan Fitzpatrick pass intended for Quincy Enunwa INTERCEPTED by Marcus Peters defensed by Steven Nelson. No return. Touchback.","(8:29) Ryan Fitzpatrick incomplete pass to the middle intended for Quincy Enunwa defensed by Steven Nelson.","(8:34) Penalty: Pass Interference on Kansas City (Phillip Gaines) 10 yards.","(9:14) Ryan Fitzpatrick pass to the left to Jalin Marshall for 8 yards to the KC16. Tackled by Phillip Gaines.","(9:59) Ryan Fitzpatrick pass to the right to Matt Forte for a loss of 5 yards to the KC24. Tackled by Derrick Johnson.","(10:27) Ryan Fitzpatrick rush up the middle for 2 yards to the KC19. Tackled by Tamba Hali.","(10:54) Ryan Fitzpatrick rush up the middle for 8 yards to the KC21. Tackled by Phillip Gaines.","(11:34) Matt Forte rush up the middle for 1 yard to the KC29. Tackled by Chris Jones and Dezman Moses.","(12:11) Ryan Fitzpatrick pass to the middle to Eric Decker for 31 yards to the KC30. Tackled by Ron Parker.","(12:17) Ryan Fitzpatrick incomplete pass to the left intended for Eric Decker.","(12:21) Ryan Fitzpatrick incomplete pass to the right intended for Jalin Marshall.","(12:27) Spencer Ware rush up the middle for no gain to the NYJ39. Tackled by Calvin Pryor.","(12:59) Alex Smith pass to the right to Jeremy Maclin for 5 yards to the NYJ39. Tackled by Buster Skrine.","(13:43) Spencer Ware rush to the left for 1 yard to the NYJ44. Tackled by Deon Simon.","(14:27) Alex Smith pass to the left to Anthony Sherman for 3 yards to the NYJ45. Tackled by Darron Lee.","(15:00) Spencer Ware rush up the middle for 16 yards to the NYJ48. Tackled by Darrelle Revis.","(0:10) Alex Smith pass to the right to Demetrius Harris for 8 yards to the KC36. Tackled by Marcus Gilchrist and Jordan Jenkins.","(0:53) Spencer Ware rush up the middle for 4 yards to the KC28. Tackled by Steve McLendon.","(1:30) Spencer Ware rush up the middle for 4 yards to the KC24. Tackled by David Harris.","(1:37) Ryan Fitzpatrick pass intended for Bilal Powell INTERCEPTED by Eric Berry defensed by Derrick Johnson. No return. Touchback.","(1:41) Ryan Fitzpatrick incomplete pass to the left intended for Eric Decker defensed by Eric Berry.","(2:21) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 4 yards to the KC5. Tackled by Tamba Hali.","(2:51) Ryan Fitzpatrick pass to the left to Bilal Powell for 7 yards to the KC9. Tackled by Derrick Johnson.","(3:36) Matt Forte rush to the left for 2 yards to the KC16. Tackled by Tamba Hali.","(3:43) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(4:24) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 18 yards to the KC18. Tackled by Ron Parker.","(5:08) Matt Forte rush to the left for 7 yards to the KC36. Tackled by Eric Berry.","(5:43) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 9 yards to the KC43. Tackled by Steven Nelson.","(6:21) Matt Forte rush up the middle for 5 yards to the NYJ48. Tackled by Jaye Howard.","(6:57) Ryan Fitzpatrick pass to the left to Matt Forte for 4 yards to the NYJ43. Tackled by Jaye Howard.","(7:01) Penalty: Pass Interference on Kansas City (Phillip Gaines) 19 yards.","(7:07) Spencer Ware rush to the right for 5 yards to the NYJ1. Tackled by Marcus Gilchrist. FUMBLE, out of end zone, possession to NYJ. Touchback.","(7:48) Alex Smith pass to the right to Chris Conley for 13 yards to the NYJ6. Tackled by Darrelle Revis and Marcus Gilchrist.","(8:36) Alex Smith pass to the right to Travis Kelce for 42 yards to the NYJ19. Tackled by Marcus Gilchrist.","(9:14) Spencer Ware rush up the middle for 2 yards to the KC39. Tackled by Sheldon Richardson.","(9:27) Lachlan Edwards punts for 51 yards to KC18. Tyreek Hill return for 19 yards to KC37.","(9:33) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(10:16) Bilal Powell rush up the middle for 2 yards to the NYJ31. Tackled by Derrick Johnson.","(10:47) Ryan Fitzpatrick pass to the left to Bilal Powell for 6 yards to the NYJ29. Tackled by Eric Berry.","(11:35) Matt Forte rush up the middle for 15 yards to the NYJ23. Tackled by Steven Nelson.","(11:42) Dustin Colquitt punts for 41 yards to NYJ8. No return.","(12:17) Alex Smith pass to the left to Spencer Ware for 8 yards to the NYJ49. Tackled by Antonio Allen and Buster Skrine.","(12:17) Penalty: False Start on Kansas City (Travis Kelce) -5 yards.","(12:17) Kansas City Chiefs timeout.","(12:23) Alex Smith incomplete pass to the left intended for Tyreek Hill.","(12:58) Charcandrick West rush up the middle for 1 yard to the KC48. Tackled by Sheldon Richardson.","(13:38) Alex Smith pass to the right to Jeremy Maclin for 17 yards to the KC47. Tackled by Darron Lee.","(14:17) Alex Smith pass to the left to Chris Conley for 20 yards to the KC30. Tackled by Marcus Gilchrist.","(14:55) Spencer Ware rush to the right for 1 yard to the KC10. Tackled by Muhammad Wilkerson.","(15:00) Nick Folk kicks off to the KC4. Tyreek Hill return for 5 yards to KC9. Tackled by Bruce Carter.","(0:29) Alex Smith sacked at KC32 for a loss of 8 yards by Sheldon Richardson and Leonard Williams.","(0:34) Alex Smith incomplete pass to the middle intended for Jeremy Maclin.","(0:40) Alex Smith incomplete pass to the right intended for Jeremy Maclin defensed by Juston Burris.","(0:45) Alex Smith pass to the left to Charcandrick West for 6 yards to the KC40. Tackled by Marcus Williams.","(0:45) Penalty: Encroachment on New York (Muhammad Wilkerson) 5 yards.","(0:45) Kansas City Chiefs timeout.","(1:28) Charcandrick West rush up the middle for 2 yards to the KC29. Tackled by Lorenzo Mauldin.","(1:34) Alex Smith pass to the right to Charcandrick West for no gain to the KC27. Tackled by Darrelle Revis.","(2:00) Alex Smith pass to the right to Travis Kelce for 11 yards to the KC27. Tackled by Calvin Pryor.","(2:00) Two Minute Warning.","(2:06) Nick Folk kicks off to the KC0. Tyreek Hill return for 16 yards to KC16. Tackled by Braedon Bowman.","(2:09) Nick Folk 28 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(2:13) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(2:57) Matt Forte rush up the middle for 2 yards to the KC10. Tackled by Tamba Hali.","(3:02) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall defensed by Justin March.","(3:48) Ryan Fitzpatrick pass to the left to Robby Anderson for 26 yards to the KC12. Tackled by Phillip Gaines.","(4:23) Matt Forte rush to the left for 7 yards to the KC38. Tackled by Steven Nelson.","(5:03) Ryan Fitzpatrick pass to the middle to Bilal Powell for 6 yards to the KC45. Tackled by Derrick Johnson.","(5:49) Matt Forte rush to the right for 5 yards to the NYJ49. Tackled by Jaye Howard.","(5:54) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa defensed by Ron Parker.","(6:02) Cairo Santos kicks off to the NYJ0. Jalin Marshall return for 29 yards to NYJ29. Tackled by D.J. Alexander. Penalty: Face Mask on Kansas City (Dezman Moses) 15 yards.","(6:02) Cairo Santos extra point is good.","(6:02) Cairo Santos kicks off to the NYJ4. Jalin Marshall return for 19 yards to NYJ23. Tackled by Anthony Sherman. FUMBLE, recovered by KC (Demetrius Harris) and returned for 27 yards for a TOUCHDOWN.","(6:15) Cairo Santos 27 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(6:21) Alex Smith incomplete pass to the right intended for Chris Conley.","(7:04) Spencer Ware rush to the right for a loss of 5 yards to the NYJ9. Tackled by Darron Lee.","(7:47) Alex Smith pass to the right to Travis Kelce for a loss of 1 yard to the NYJ4. Tackled by Muhammad Wilkerson and Jordan Jenkins.","(8:32) Alex Smith pass to the left to Travis Kelce for 15 yards to the NYJ3. Tackled by Marcus Gilchrist.","(8:34) Alex Smith incomplete pass to the right intended for Demetrius Harris.","(9:18) Alex Smith pass to the left to Tyreek Hill for 2 yards to the NYJ18. Tackled by Buster Skrine.","(9:59) Alex Smith pass to the middle to Chris Conley for 11 yards to the NYJ20. Tackled by Darrelle Revis.","(10:35) Charcandrick West rush to the right for no gain to the NYJ31. Tackled by Rontez Miles.","(10:40) Alex Smith incomplete pass to the right intended for Travis Kelce.","(11:17) Alex Smith pass to the left to Tyreek Hill for 11 yards to the NYJ31. Tackled by Marcus Williams.","(11:57) Spencer Ware rush up the middle for 2 yards to the NYJ42. Tackled by Calvin Pryor.","(12:36) Spencer Ware rush up the middle for 3 yards to the NYJ44. Tackled by David Harris.","(13:10) Alex Smith pass to the left to Demetrius Harris for 6 yards to the NYJ47. Tackled by David Harris and Jordan Jenkins.","(13:19) Ryan Fitzpatrick pass to the middle to Bilal Powell for 9 yards to the NYJ48. Tackled by Phillip Gaines. FUMBLE, recovered by KC (Eric Murray). Tackled by James Carpenter.","(13:36) Penalty: Delay of Game on New York (Ryan Fitzpatrick) -5 yards.","(14:21) Matt Forte rush up the middle for 3 yards to the NYJ44. Tackled by Derrick Johnson.","(14:26) Ryan Fitzpatrick incomplete pass to the middle intended for Quincy Enunwa.","(15:00) Matt Forte rush up the middle for 10 yards to the NYJ41. Tackled by Phillip Gaines.","(0:13) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 6 yards to the NYJ31. Tackled by Frank Zombo.","(0:13) Cairo Santos kicks off to the endzone. Touchback.","(0:13) Cairo Santos extra point is good.","(0:21) Alex Smith pass to the left to Travis Kelce for 12 yards for a TOUCHDOWN.","(1:05) Alex Smith pass to the middle to Tyreek Hill for 13 yards to the NYJ12. Tackled by Darrelle Revis.","(1:53) Spencer Ware rush to the right for 13 yards to the NYJ25. Tackled by Sheldon Richardson.","(2:24) Tyreek Hill rush to the left for a loss of 3 yards to the NYJ38. Tackled by Darron Lee.","(2:30) Ryan Fitzpatrick pass intended for Jalin Marshall INTERCEPTED by Marcus Peters. No return. Tackled by Jalin Marshall.","(2:36) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall defensed by Steven Nelson.","(3:12) Matt Forte rush up the middle for 1 yard to the NYJ22. Tackled by Derrick Johnson.","(3:54) Ryan Fitzpatrick rush up the middle for 12 yards to the NYJ21. Tackled by Frank Zombo. FUMBLE, recovered by NYJ (Ryan Fitzpatrick).","(4:32) Matt Forte rush to the right for 5 yards to the NYJ9. Tackled by Marcus Peters.","(5:09) Matt Forte rush up the middle for 3 yards to the NYJ4. Tackled by Dee Ford.","(5:21) Dustin Colquitt punts for 37 yards to NYJ1. No return.","(6:05) Alex Smith sacked at NYJ38 for a loss of 8 yards by Darron Lee and Lorenzo Mauldin.","(6:52) Spencer Ware rush to the left for 7 yards to the NYJ30. Tackled by David Harris.","(7:09) Penalty: Holding on Kansas City (Mitch Morse) -10 yards.","(7:46) Spencer Ware rush up the middle for 4 yards to the NYJ27. Tackled by Steve McLendon.","(8:15) Alex Smith pass to the left to Ross Travis for 6 yards to the NYJ31. Tackled by Buster Skrine and Jordan Jenkins.","(8:26) Penalty: Offside on New York (Steve McLendon) 5 yards.","(8:59) Alex Smith pass to the right to Charcandrick West for 2 yards to the NYJ42. Tackled by Jordan Jenkins.","(9:44) Spencer Ware rush to the left for 17 yards to the NYJ44. Tackled by Sheldon Richardson.","(10:16) Alex Smith pass to the left to Jeremy Maclin for 9 yards to the KC39. Tackled by Marcus Williams.","(10:19) Alex Smith incomplete pass to the right intended for Jeremy Maclin.","(10:56) Alex Smith pass to the right to Travis Kelce for 10 yards to the KC30. Tackled by David Harris.","(11:37) Spencer Ware rush to the left for a loss of 1 yard to the KC20. Tackled by Leonard Williams.","(12:12) Alex Smith pass to the left to Ross Travis for 4 yards to the KC21. Tackled by Darron Lee.","(12:21) Lachlan Edwards punts for 35 yards to KC7. Tyreek Hill return for 10 yards to KC17. Tackled by Josh Martin.","(12:48) Ryan Fitzpatrick pass to the right to Brandon Marshall for 9 yards to the KC42. Tackled by Eric Berry.","(12:53) Ryan Fitzpatrick incomplete pass to the left intended for Eric Decker.","(13:36) Matt Forte rush up the middle for a loss of 2 yards to the NYJ49. Tackled by Frank Zombo and Derrick Johnson.","(14:15) Ryan Fitzpatrick pass to the middle to Brandon Marshall for 11 yards to the KC49. Tackled by Phillip Gaines.","(14:55) Matt Forte rush up the middle for 1 yard to the NYJ40. Tackled by Frank Zombo and Derrick Johnson.","(15:00) Cairo Santos kicks off to the NYJ5. Jalin Marshall return for 34 yards to NYJ39. Tackled by Demetrius Harris."]