["(0:04) Jameis Winston rush up the middle for 10 yards to the LA5. Tackled by Robert Quinn.","(0:04) Tampa Bay Buccaneers timeout.","(0:09) Jameis Winston incomplete pass to the right intended for Brandon Myers.","(0:14) Penalty: Illegal Contact on Los Angeles (Mark Barron) 5 yards.","(0:21) Penalty: False Start on Tampa Bay (Donovan Smith) -5 yards.","(0:21) Jameis Winston incomplete pass to the left intended for Vincent Jackson.","(0:26) Jameis Winston incomplete pass to the right intended for Vincent Jackson.","(0:49) Jameis Winston pass to the right to Charles Sims for 12 yards to the LA15. Tackled by Mark Barron.","(0:54) Jameis Winston incomplete pass to the right intended for Vincent Jackson.","(1:16) Jameis Winston pass to the middle to Charles Sims for 7 yards to the LA27. Tackled by Lamarcus Joyner and Mark Barron.","(1:36) Jameis Winston pass to the right to Adam Humphries for 6 yards to the LA34. Tackled by Alec Ogletree.","(1:42) Jameis Winston pass to the left to Vincent Jackson for 16 yards to the LA40. Tackled by Troy Hill.","(1:52) Johnny Hekker punts for 64 yards to TB31. Adam Humphries return for 13 yards to TB44. Tackled by Bryce Hager.","(2:00) Case Keenum incomplete pass to the right intended for Kenny Britt.","(2:00) Two Minute Warning.","(2:05) Case Keenum rush up the middle for a loss of 4 yards to the LA5. Tackled by Clinton McDonald.","(2:05) Tampa Bay Buccaneers timeout.","(2:10) Todd Gurley rush to the right for 3 yards to the LA9. Tackled by William Gholston and Clinton McDonald.","(2:15) Roberto Aguayo kicks off to the LA1. Tavon Austin return for 5 yards to LA6. Tackled by Josh Keyes.","(2:15) Jameis Winston 2 pt conversion pass is NO GOOD - intended for Vincent Jackson.","(2:24) Jameis Winston pass to the right to Mike Evans for 7 yards for a TOUCHDOWN.","(2:28) Jameis Winston incomplete pass to the right intended for Cameron Brate defensed by Alec Ogletree.","(2:37) Charles Sims rush up the middle for 23 yards to the LA7. Tackled by Trumaine Johnson.","(2:58) Jameis Winston pass to the left to Adam Humphries for 9 yards to the LA30. Tackled by Lamarcus Joyner.","(3:04) Jameis Winston incomplete pass to the right intended for Charles Sims.","(3:07) Jameis Winston incomplete pass to the right intended for Russell Shepard.","(3:37) Jameis Winston pass to the left to Adam Humphries for 29 yards to the LA39. Tackled by T.J. McDonald.","(3:45) Penalty: Holding on Tampa Bay (Donovan Smith) -10 yards.","(3:50) Jameis Winston incomplete pass to the right intended for Adam Humphries defensed by Aaron Donald.","(3:55) Jameis Winston incomplete pass to the left intended for Adam Humphries.","(4:15) Jameis Winston pass to the right to Mike Evans for 13 yards to the TB42. Tackled by T.J. McDonald.","(4:38) Jameis Winston pass to the right to Charles Sims for 4 yards to the TB29. Tackled by Lamarcus Joyner and Alec Ogletree.","(4:38) Greg Zuerlein kicks off to the endzone. Touchback.","(4:38) Case Keenum 2 pt rush attempt.","(4:38) Los Angeles Rams timeout.","(4:49) Case Keenum pass to the left to Tavon Austin for 43 yards for a TOUCHDOWN.","(5:32) Todd Gurley rush to the right for 4 yards to the TB43. Tackled by Kwon Alexander and Clinton McDonald.","(6:09) Todd Gurley rush up the middle for 4 yards to the TB47. Tackled by Lavonte David.","(6:46) Todd Gurley rush up the middle for 4 yards to the LA49. Tackled by Clinton McDonald.","(7:26) Benny Cunningham rush up the middle for 7 yards to the LA45. Tackled by William Gholston.","(7:33) Penalty: Pass Interference on Tampa Bay (Alterraun Verner) 20 yards.","(8:19) Case Keenum pass to the left to Todd Gurley for a loss of 5 yards to the LA18. Tackled by Clinton McDonald.","(8:55) Todd Gurley rush up the middle for a loss of 2 yards to the LA23. Tackled by Lavonte David and Gerald McCoy.","(8:55) Roberto Aguayo kicks off to the endzone. Touchback.","(8:55) Jameis Winston 2 pt conversion pass is NO GOOD - intended for Vincent Jackson.","(9:00) Jameis Winston pass to the right to Cameron Brate for 1 yard for a TOUCHDOWN.","(9:41) Jameis Winston pass to the left to Russell Shepard for 6 yards to the LA1. Tackled by Troy Hill.","(9:52) Jameis Winston incomplete pass to the right.","(10:18) Jameis Winston pass to the right to Brandon Myers for 7 yards to the LA7. Tackled by Mark Barron.","(10:41) Jameis Winston pass to the right to Vincent Jackson for 6 yards to the LA14. Tackled by Troy Hill.","(11:06) Jameis Winston pass to the right to Charles Sims for 33 yards to the LA20. Tackled by Maurice Alexander.","(11:33) Jameis Winston pass to the right to Cameron Brate for 8 yards to the TB47. Tackled by Troy Hill.","(11:39) Penalty: Pass Interference on Los Angeles (Troy Hill) 14 yards.","(11:39) Greg Zuerlein kicks off to the endzone. Touchback.","(11:39) Greg Zuerlein extra point is good.","(11:56) Jameis Winston sacked at LA23 for a loss of 10 yards by Robert Quinn. FUMBLE, recovered by LA (Ethan Westbrooks) and returned for 77 yards for a TOUCHDOWN.","(12:02) Jameis Winston incomplete pass to the middle intended for Cameron Brate.","(12:40) Jacquizz Rodgers rush up the middle for 4 yards to the LA13. Tackled by Alec Ogletree.","(13:14) Jameis Winston pass to the right to Mike Evans for 15 yards to the LA17. Tackled by Trumaine Johnson.","(13:50) Jameis Winston pass to the right to Mike Evans for 11 yards to the LA32. Tackled by Trumaine Johnson.","(14:21) Jameis Winston pass to the right to Mike Evans for 17 yards to the LA43. Tackled by Cody Davis.","(14:56) Jameis Winston pass to the right to Adam Humphries for 6 yards to the TB40. Tackled by Lamarcus Joyner.","(15:00) Jameis Winston incomplete pass to the left intended for Mike Evans.","(0:09) Penalty: Holding on Tampa Bay (Demar Dotson) -10 yards.","(0:48) Jameis Winston pass to the left to Cameron Brate for 14 yards to the TB44. Tackled by Maurice Alexander.","(0:48) Greg Zuerlein kicks off to the endzone. Touchback. Penalty: Offside on Los Angeles (Isaiah Johnson) 5 yards.","(0:48) Greg Zuerlein extra point is good.","(0:53) Todd Gurley rush to the left for 1 yard for a TOUCHDOWN.","(1:34) Todd Gurley rush up the middle for no gain to the TB1. Tackled by Daryl Smith.","(1:59) Todd Gurley rush up the middle for 16 yards to the TB1. Tackled by Keith Tandy.","(2:35) Case Keenum pass to the left to Bradley Marquez for 12 yards to the TB17. Tackled by Kwon Alexander and Chris Conte.","(3:13) Todd Gurley rush to the left for 9 yards to the TB29. Tackled by Vernon Hargreaves III.","(3:44) Case Keenum pass to the left to Kenny Britt for 19 yards to the TB38. Tackled by Vernon Hargreaves III.","(4:19) Todd Gurley rush up the middle for 3 yards to the LA43. Tackled by Kwon Alexander.","(4:40) Todd Gurley rush up the middle for 9 yards to the LA40. Tackled by Brent Grimes.","(4:46) 41 yard field goal attempt by Roberto Aguayo is NO GOOD. Holder: Bryan Anger.","(4:51) Jameis Winston incomplete pass to the right intended for Mike Evans defensed by Alec Ogletree.","(5:31) Jameis Winston pass to the left to Adam Humphries for 6 yards to the LA23. Tackled by Michael Brockers.","(6:01) Charles Sims rush to the right for 1 yard to the LA29. Tackled by Ethan Westbrooks and Lamarcus Joyner.","(6:32) Jameis Winston pass to the left to Mike Evans for 17 yards to the LA30. Tackled by Trumaine Johnson.","(7:00) Jameis Winston pass to the left to Mike Evans for 12 yards to the LA47. Tackled by Trumaine Johnson.","(7:29) Jameis Winston pass to the left to Charles Sims for 7 yards to the TB41. Tackled by Trumaine Johnson.","(8:00) Jameis Winston rush up the middle for no gain to the TB34. FUMBLE, recovered by TB (Jameis Winston).","(8:08) Johnny Hekker punts for 46 yards to TB34. No return.","(8:12) Case Keenum incomplete pass to the left intended for Lance Kendricks.","(8:17) Case Keenum incomplete pass to the left intended for Mike Thomas.","(8:24) Case Keenum incomplete pass to the left intended for Tavon Austin.","(8:37) Bryan Anger punts for 50 yards to LA16. Tavon Austin return for 4 yards to LA20. Tackled by Jacquizz Rodgers.","(8:43) Jameis Winston incomplete pass to the right intended for Adam Humphries.","(9:16) Charles Sims rush to the right for 1 yard to the TB34. Tackled by Mark Barron and Alec Ogletree.","(9:59) Jameis Winston rush to the right for 4 yards to the TB33. Tackled by Mark Barron.","(10:10) Johnny Hekker punts for 64 yards to TB16. Adam Humphries return for 13 yards to TB29. Tackled by Cory Littleton.","(10:28) Case Keenum pass to the left to Benny Cunningham for 10 yards to the LA20. Tackled by Alterraun Verner.","(11:07) Todd Gurley rush to the left for no gain to the LA10. Tackled by Bradley McDougald.","(11:43) Todd Gurley rush to the left for a loss of 1 yard to the LA10. Tackled by Kwon Alexander.","(11:49) Bryan Anger punts for 34 yards to LA11. No return.","(11:54) Jameis Winston incomplete pass to the right intended for Cameron Brate defensed by Maurice Alexander.","(11:59) Jameis Winston incomplete pass to the left intended for Alan Cross.","(12:42) Charles Sims rush to the left for 4 yards to the LA45. Tackled by Lamarcus Joyner.","(13:18) Jameis Winston pass to the middle to Adam Humphries for 6 yards to the LA49. Tackled by Lamarcus Joyner.","(13:52) Charles Sims rush to the left for 8 yards to the TB45. Tackled by Troy Hill.","(13:59) Jameis Winston incomplete pass to the right intended for Brandon Myers.","(14:26) Charles Sims rush to the right for 6 yards to the TB37. Tackled by Mark Barron.","(15:00) Charles Sims rush to the left for 6 yards to the TB31. Tackled by Ethan Westbrooks and Alec Ogletree.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback.","(0:22) Jameis Winston rush up the middle for a loss of 1 yard to the TB24.","(0:22) Greg Zuerlein kicks off to the endzone. Touchback.","(0:22) Greg Zuerlein extra point is good.","(0:28) Todd Gurley rush up the middle for 1 yard for a TOUCHDOWN.","(0:33) Case Keenum incomplete pass to the right intended for Lance Kendricks.","(0:33) Los Angeles Rams timeout.","(0:39) Todd Gurley rush up the middle for 2 yards to the TB1. Tackled by DaVonte Lambert.","(0:45) Penalty: Offside on Tampa Bay (Clinton McDonald) 3 yards.","(0:45) Penalty: False Start on Los Angeles (Tyler Higbee) -5 yards.","(0:45) Tampa Bay Buccaneers timeout.","(0:49) Penalty: Pass Interference on Tampa Bay (Brent Grimes) 5 yards.","(0:49) Los Angeles Rams timeout.","(0:53) Todd Gurley rush to the left for 2 yards to the TB6. Tackled by William Gholston.","(1:22) Case Keenum rush to the right for 5 yards to the TB8. Tackled by Kwon Alexander.","(2:00) Todd Gurley rush to the right for 1 yard to the TB13. Tackled by Lavonte David and Clinton McDonald.","(2:00) Two Minute Warning.","(2:23) Tavon Austin rush to the left for 8 yards to the TB14. Tackled by Howard Jones.","(2:32) Jameis Winston pass intended for Charles Sims INTERCEPTED by Mark Barron defensed by Trumaine Johnson and returned for 7 yards. Tackled by Charles Sims.","(3:00) Jameis Winston sacked at TB12 for a loss of 6 yards by T.J. McDonald. Penalty: Unnecessary Roughness on Los Angeles (Alec Ogletree) 15 yards.","(3:04) Jameis Winston incomplete pass to the left intended for Mike Evans defensed by Trumaine Johnson.","(3:13) Johnny Hekker punts for 37 yards to TB18. No return.","(3:45) Todd Gurley rush to the right for no gain to the LA45. Tackled by Gerald McCoy and Chris Conte.","(4:21) Case Keenum pass to the left to Brian Quick for 9 yards to the LA45. Tackled by Vernon Hargreaves III.","(5:00) Todd Gurley rush to the right for no gain to the LA36. Tackled by Lavonte David.","(5:26) Case Keenum pass to the right to Kenny Britt for 7 yards to the LA36. Tackled by Lavonte David.","(6:03) Todd Gurley rush to the right for 4 yards to the LA29. Tackled by William Gholston.","(6:03) Roberto Aguayo kicks off to the endzone. Touchback.","(6:03) Roberto Aguayo extra point is good.","(6:10) Jameis Winston pass to the right to Cameron Brate for 3 yards for a TOUCHDOWN.","(6:48) Jameis Winston pass to the right to Cameron Brate for 20 yards to the LA3. Tackled by Troy Hill and Mark Barron.","(7:23) Jameis Winston pass to the right to Charles Sims for 6 yards to the LA23. Tackled by Troy Hill and Mark Barron.","(7:48) Penalty: Illegal Use of Hands on Tampa Bay (Donovan Smith) -10 yards.","(7:57) Jameis Winston incomplete pass to the middle intended for Cameron Brate.","(7:57) Tampa Bay Buccaneers timeout.","(8:37) Jacquizz Rodgers rush up the middle for 3 yards to the LA19. Tackled by William Hayes.","(9:07) Jameis Winston pass to the left to Jacquizz Rodgers for 8 yards to the LA22. Tackled by Trumaine Johnson.","(9:37) Jacquizz Rodgers rush to the right for 4 yards to the LA30. Tackled by Troy Hill.","(10:08) Jacquizz Rodgers rush up the middle for 2 yards to the LA34. Tackled by Robert Quinn and Aaron Donald.","(10:33) Penalty: Offside on Los Angeles (Aaron Donald) 5 yards.","(10:51) Jacquizz Rodgers rush up the middle for 2 yards to the LA41. Tackled by Alec Ogletree.","(11:05) Case Keenum pass to the right to Kenny Britt for 8 yards to the LA48. Tackled by Lavonte David. FUMBLE, recovered by TB (Chris Conte) and returned for 10 yards. Tackled by Rob Havenstein.","(11:46) Todd Gurley rush to the right for 1 yard to the LA40. Tackled by Chris Conte.","(12:23) Tavon Austin rush to the right for 14 yards to the LA39. Tackled by Vernon Hargreaves III.","(12:23) Roberto Aguayo kicks off to the endzone. Touchback.","(12:23) Roberto Aguayo extra point is good. Penalty: Disqualification on Los Angeles (Eugene Sims) 15 yards.","(12:27) Charles Sims rush up the middle for 1 yard for a TOUCHDOWN.","(13:11) Charles Sims rush up the middle for no gain to the LA1. Tackled by Alec Ogletree.","(13:53) Charles Sims rush up the middle for 1 yard to the LA1. Tackled by Dominique Easley.","(14:32) Jameis Winston pass to the right to Mike Evans for 14 yards to the LA2. Tackled by Trumaine Johnson.","(15:00) Jameis Winston pass to the middle to Adam Humphries for 5 yards to the LA16. Tackled by Lamarcus Joyner.","(0:38) Jameis Winston pass to the left to Adam Humphries for 2 yards to the LA21. Tackled by Troy Hill and Lamarcus Joyner.","(1:29) Penalty: False Start on Tampa Bay (Demar Dotson) -5 yards.","(1:29) Jameis Winston pass to the right to Mike Evans for 7 yards to the LA18. Tackled by Mark Barron and Trumaine Johnson.","(2:03) Jameis Winston pass to the left to Adam Humphries for 31 yards to the LA25. Tackled by Troy Hill.","(2:26) Jameis Winston pass to the right to Mike Evans for 19 yards to the TB44. Tackled by Maurice Alexander.","(2:26) Greg Zuerlein kicks off to the endzone. Touchback.","(2:31) Greg Zuerlein 53 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(2:36) Case Keenum incomplete pass to the middle intended for Bradley Marquez.","(3:14) Case Keenum pass to the left to Kenny Britt for 4 yards to the TB35. Tackled by Vernon Hargreaves III.","(3:51) Todd Gurley rush up the middle for 6 yards to the TB39. Tackled by Kwon Alexander and Lavonte David.","(4:11) Penalty: Illegal Formation on Los Angeles (Brian Quick) -5 yards.","(4:50) Case Keenum pass to the left to Tavon Austin for 13 yards to the TB40. Tackled by Chris Conte.","(5:15) Benny Cunningham rush up the middle for 22 yards to the LA47. Tackled by Chris Conte.","(5:22) Case Keenum incomplete pass to the left intended for Lance Kendricks defensed by Alterraun Verner defensed by Lavonte David.","(6:08) Case Keenum sacked at LA25 for a loss of 7 yards by Lavonte David.","(6:17) Bryan Anger punts for 52 yards to LA32. No return.","(6:23) Jameis Winston incomplete pass to the middle intended for Mike Evans.","(7:04) Charles Sims rush to the right for 4 yards to the TB16. Tackled by Eugene Sims and Ethan Westbrooks.","(7:38) Charles Sims rush to the right for 4 yards to the TB12. Tackled by Alec Ogletree.","(7:50) Johnny Hekker punts for 45 yards to TB8. No return.","(7:53) Case Keenum incomplete pass to the left intended for Kenny Britt.","(7:59) Case Keenum incomplete pass to the middle intended for Tavon Austin.","(8:37) Todd Gurley rush up the middle for 7 yards to the LA47. Tackled by Kwon Alexander.","(8:45) Roberto Aguayo kicks off to the LA-4. Benny Cunningham return for 44 yards to LA40. Tackled by Roberto Aguayo.","(8:45) Roberto Aguayo extra point is NO GOOD.","(8:54) Case Keenum pass intended for Tavon Austin INTERCEPTED by Kwon Alexander and returned for 38 yards for a TOUCHDOWN.","(9:56) Todd Gurley rush to the left for 2 yards to the LA35. Tackled by William Gholston.","(9:56) Case Keenum pass to the right to Tavon Austin for 4 yards to the LA33. Tackled by Chris Conte.","(10:08) Bryan Anger punts for 55 yards to LA21. Tavon Austin return for 8 yards to LA29. Tackled by Josh Keyes.","(10:49) Jameis Winston pass to the right to Vincent Jackson for 15 yards to the TB24. Tackled by Troy Hill.","(10:55) Jameis Winston incomplete pass to the right intended for Cameron Brate defensed by Aaron Donald.","(11:32) Charles Sims rush to the right for a loss of 4 yards to the TB9. Tackled by Aaron Donald.","(11:58) Penalty: Clipping on Tampa Bay (Brandon Myers) -12 yards.","(11:58) Greg Zuerlein kicks off to the endzone. Touchback.","(11:58) Greg Zuerlein extra point is good.","(12:05) Case Keenum pass to the left to Brian Quick for 44 yards for a TOUCHDOWN.","(12:39) Todd Gurley rush to the left for 3 yards to the TB44. Tackled by Chris Conte.","(12:43) Case Keenum incomplete pass to the middle intended for Todd Gurley.","(13:10) Case Keenum pass to the left to Tavon Austin for 14 yards to the TB47.","(13:48) Todd Gurley rush to the right for 3 yards to the LA39. Tackled by DaVonte Lambert.","(14:21) Case Keenum pass to the left to Tavon Austin for 8 yards to the LA36. Tackled by Chris Conte.","(14:21) Tampa Bay Buccaneers timeout.","(14:56) Todd Gurley rush to the left for 3 yards to the LA28. Tackled by William Gholston.","(15:00) Case Keenum incomplete pass to the left intended for Lance Kendricks defensed by Vernon Hargreaves III.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback."]