["(0:13) Trevone Boykin rush up the middle for a loss of 2 yards to the Sea40.","(0:55) Terrence Magee rush to the left for 3 yards to the Sea42. Tackled by DeForest Buckner and Michael Wilhoite.","(0:56) Phil Dawson kicks off to the Sea39. Luke Willson - no return. Tackled by Nick Bellore.","(0:56) Carlos Hyde 2 pt rush attempt. Successful.","(1:01) Carlos Hyde rush to the right for 8 yards for a TOUCHDOWN.","(1:33) Blaine Gabbert pass to the left to Carlos Hyde for 2 yards to the Sea8. Tackled by Kam Chancellor.","(1:55) Carlos Hyde rush to the left for 3 yards to the Sea10. Tackled by Jarran Reed and Garrison Smith.","(1:55) Two Minute Warning.","(2:03) Blaine Gabbert pass to the left to Rod Streater for 19 yards to the Sea13. Tackled by Jeremy Lane.","(2:41) Shaun Draughn rush to the left for no gain to the Sea32. Tackled by Michael Bennett and Cliff Avril.","(3:10) Carlos Hyde rush up the middle for 7 yards to the Sea32. Tackled by Kam Chancellor.","(3:36) Blaine Gabbert pass to the left to Quinton Patton for 8 yards to the Sea39. Tackled by Deshawn Shead.","(3:40) Blaine Gabbert incomplete pass to the left intended for Quinton Patton.","(3:45) Trevone Boykin pass intended for Tanner McEvoy INTERCEPTED by Nick Bellore and returned for 4 yards. Tackled by Tanner McEvoy.","(4:26) Alex Collins rush up the middle for 1 yard to the Sea50. Tackled by Nick Bellore and Ronald Blair.","(5:08) Trevone Boykin pass to the right to Jermaine Kearse for 2 yards to the Sea49. Tackled by Eric Reid.","(5:52) Terrence Magee rush up the middle for 4 yards to the Sea47. Tackled by Mike Purcell and Arik Armstead.","(6:27) Terrence Magee rush up the middle for 5 yards to the Sea43. Tackled by DeForest Buckner and Nick Bellore.","(7:09) Alex Collins rush to the left for 4 yards to the Sea38. Tackled by Eric Reid and Rashard Robinson.","(7:50) Trevone Boykin pass to the left to Jermaine Kearse for 9 yards to the Sea34. Tackled by Michael Wilhoite.","(7:50) Phil Dawson kicks off to the endzone. Touchback.","(7:50) Phil Dawson extra point is good.","(7:53) Carlos Hyde rush to the left for 8 yards for a TOUCHDOWN.","(8:24) Carlos Hyde rush up the middle for 2 yards to the Sea8. Tackled by Michael Bennett.","(8:58) Carlos Hyde rush up the middle for 2 yards to the Sea10. Tackled by Garrison Smith and Frank Clark.","(9:32) Blaine Gabbert rush to the left for 5 yards to the Sea12. Tackled by Deshawn Shead.","(9:36) Blaine Gabbert incomplete pass to the left intended for Jeremy Kerley.","(10:17) Carlos Hyde rush up the middle for 3 yards to the Sea17. Tackled by Tony McDaniel and K.J. Wright.","(10:48) Shaun Draughn rush to the right for 3 yards to the Sea20. Tackled by Deshawn Shead.","(11:22) Blaine Gabbert pass to the right to Torrey Smith for 11 yards to the Sea23. Tackled by Richard Sherman.","(11:49) Shaun Draughn rush up the middle for 7 yards to the Sea34. Tackled by Jeremy Lane.","(12:23) Carlos Hyde rush to the left for no gain to the Sea41. Tackled by Bobby Wagner and Kam Chancellor.","(12:53) Carlos Hyde rush up the middle for 34 yards to the Sea41. Tackled by Deshawn Shead.","(12:53) Steven Hauschka kicks off to the endzone. Touchback.","(12:53) Steven Hauschka extra point is good.","(12:59) Trevone Boykin pass to the left to Doug Baldwin for 16 yards for a TOUCHDOWN.","(13:40) Alex Collins rush up the middle for 4 yards to the SF16. Tackled by Ahmad Brooks and Eric Reid.","(14:18) Trevone Boykin rush to the right for no gain to the SF20. Tackled by Ahmad Brooks.","(15:00) Trevone Boykin pass to the left to Doug Baldwin for 23 yards to the SF20. Tackled by Keith Reaser.","(0:10) Trevone Boykin pass to the right to Doug Baldwin for 4 yards to the SF43. Tackled by NaVorro Bowman.","(0:48) Christine Michael rush to the left for 4 yards to the SF47. Tackled by Quinton Dial and DeForest Buckner.","(1:30) Christine Michael rush up the middle for 7 yards to the Sea49. Tackled by NaVorro Bowman.","(1:38) Bradley Pinion punts for 29 yards to Sea42. No return.","(1:44) Blaine Gabbert incomplete pass to the right intended for Jeremy Kerley.","(2:21) Blaine Gabbert rush to the left for 4 yards to the SF29. Tackled by K.J. Wright.","(2:29) Blaine Gabbert incomplete pass to the right intended for Blake Bell.","(2:29) Steven Hauschka kicks off to the endzone. Touchback.","(2:32) Steven Hauschka 22 yard field goal attempt is GOOD. Holder: Jon Ryan.","(2:35) Trevone Boykin incomplete pass to the right intended for Doug Baldwin.","(2:35) Seattle Seahawks timeout.","(3:19) Christine Michael rush to the right for 1 yard to the SF4. Tackled by Gerald Hodges Jr. and Tank Carradine.","(3:56) Trevone Boykin pass to the left to Christine Michael for 5 yards to the SF5. Tackled by Keith Reaser.","(4:42) Trevone Boykin pass to the right to Doug Baldwin for 6 yards to the SF10. Tackled by Eric Reid.","(5:23) Christine Michael rush up the middle for 1 yard to the SF16. Tackled by Mike Purcell and Eric Reid.","(6:03) Christine Michael rush to the left for 3 yards to the SF17. Tackled by Gerald Hodges Jr. and Mike Purcell.","(6:12) Blaine Gabbert pass intended for Quinton Patton INTERCEPTED by Bobby Wagner and returned for 9 yards. Tackled by Blake Bell and Aaron Burbridge.","(6:16) Blaine Gabbert incomplete pass to the left intended for Garrett Celek defensed by Kam Chancellor.","(6:53) Carlos Hyde rush up the middle for 2 yards to the SF27. Tackled by Jarran Reed and Ahtyba Rubin.","(6:53) Steven Hauschka kicks off to the endzone. Touchback.","(6:56) Steven Hauschka 33 yard field goal attempt is GOOD. Holder: Jon Ryan.","(7:36) Christine Michael rush to the right for no gain to the SF14. Tackled by Mike Purcell and Quinton Dial.","(7:36) Seattle Seahawks timeout.","(8:32) Penalty: Too Many Men on Field on San Francisco 5 yards.","(8:32) Russell Wilson pass to the right to Doug Baldwin for 10 yards to the SF19. Tackled by Gerald Hodges Jr..","(8:57) Penalty: Holding on Seattle (Justin Britt) -10 yards.","(9:40) Christine Michael rush to the left for 3 yards to the SF19. Tackled by DeForest Buckner and Arik Armstead.","(10:11) Penalty: Horse Collar Tackle on San Francisco (Eli Harold) 15 yards.","(10:15) Russell Wilson incomplete pass to the left intended for Jimmy Graham.","(11:01) Russell Wilson sacked at SF37 for a loss of 11 yards by Glenn Dorsey.","(11:20) Bradley Pinion punts for 41 yards to Sea12. Tyler Lockett return for 62 yards to SF26. Tackled by Aaron Burbridge.","(11:24) Blaine Gabbert incomplete pass to the left intended for Jeremy Kerley defensed by Bobby Wagner.","(11:52) Blaine Gabbert rush to the left for 2 yards to the SF47. Tackled by K.J. Wright.","(12:23) Carlos Hyde rush up the middle for 4 yards to the SF45. Tackled by Jarran Reed and Ahtyba Rubin.","(12:37) Jon Ryan punts for 45 yards to SF41. No return.","(12:39) Russell Wilson incomplete pass to the right intended for Jimmy Graham.","(13:23) Christine Michael rush to the left for 5 yards to the Sea14. Tackled by DeForest Buckner and Gerald Hodges Jr..","(13:28) Russell Wilson incomplete pass to the right.","(13:35) Bradley Pinion punts for 48 yards to Sea9. No return.","(13:54) Blaine Gabbert pass to the right to Garrett Celek for 2 yards to the SF43. Tackled by Kam Chancellor.","(14:24) Carlos Hyde rush to the right for 6 yards to the SF41. Tackled by K.J. Wright and Bobby Wagner.","(14:29) Blaine Gabbert incomplete pass to the left intended for Quinton Patton defensed by Deshawn Shead.","(15:00) Blaine Gabbert rush to the left for 10 yards to the SF35. Tackled by Deshawn Shead.","(15:00) Steven Hauschka kicks off to the endzone. Touchback.","(0:40) Russell Wilson sacked at Sea20 for a loss of 6 yards by Ahmad Brooks.","(0:53) Bradley Pinion punts for 45 yards to Sea32. Tyler Lockett return for a loss of 6 yards to Sea26. Tackled by Kyle Nelson.","(0:53) Seattle Seahawks timeout.","(0:57) Shaun Draughn rush up the middle for a loss of 2 yards to the SF23. Tackled by Jeremy Lane and Cassius Marsh.","(1:01) Blaine Gabbert incomplete pass to the right intended for Shaun Draughn.","(1:07) Blaine Gabbert incomplete pass to the right intended for Torrey Smith defensed by Richard Sherman.","(1:13) Steven Hauschka kicks off to the SF-1. Chris Davis return for 26 yards to SF25. Tackled by Kevin Pierre-Louis.","(1:16) Steven Hauschka 33 yard field goal attempt is GOOD. Holder: Jon Ryan.","(1:16) San Francisco 49ers timeout.","(1:22) Christine Michael rush up the middle for no gain to the SF15. Tackled by NaVorro Bowman.","(1:59) Christine Michael rush to the left for 9 yards to the SF15. Tackled by Antoine Bethea.","(1:59) Two Minute Warning.","(2:04) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(2:40) Russell Wilson pass to the right to Jimmy Graham for 40 yards to the SF24. Tackled by Eric Reid and Jaquiski Tartt.","(3:17) Russell Wilson pass to the left to Jimmy Graham for 3 yards to the Sea36. Tackled by NaVorro Bowman.","(3:46) Penalty: Holding on Seattle (J'Marcus Webb) -10 yards.","(3:52) Russell Wilson incomplete pass to the right intended for Luke Willson defensed by Ahmad Brooks.","(3:55) 53 yard field goal attempt by Phil Dawson is NO GOOD. Holder: Bradley Pinion.","(4:35) Blaine Gabbert pass to the middle to Torrey Smith for 13 yards to the Sea35. Tackled by Deshawn Shead.","(5:15) Carlos Hyde rush to the right for a loss of 3 yards to the Sea48. Tackled by Kam Chancellor and Bobby Wagner.","(5:34) Penalty: False Start on San Francisco (Joe Staley) -5 yards.","(6:08) Carlos Hyde rush up the middle for 1 yard to the Sea40. Tackled by Garrison Smith and Mike Morgan.","(6:25) Blaine Gabbert pass to the left to Jeremy Kerley for 20 yards to the Sea41. Tackled by Deshawn Shead. FUMBLE, recovered by SF.","(6:54) Shaun Draughn rush to the right for 2 yards to the SF39. Tackled by Michael Bennett.","(7:26) Blaine Gabbert pass to the right to Garrett Celek for 5 yards to the SF37. Tackled by Bobby Wagner and Kam Chancellor.","(7:53) Carlos Hyde rush to the right for 7 yards to the SF32. Tackled by Garrison Smith.","(7:53) Steven Hauschka kicks off to the endzone. Touchback.","(7:53) Steven Hauschka extra point is good.","(8:00) Russell Wilson pass to the left to Jimmy Graham for 18 yards for a TOUCHDOWN.","(8:48) Russell Wilson pass to the left to Doug Baldwin for 59 yards to the SF18. Tackled by Eric Reid.","(8:52) Russell Wilson incomplete pass to the middle defensed by Ahmad Brooks.","(9:34) Doug Baldwin rush to the left for a loss of 4 yards to the Sea23. Tackled by Ahmad Brooks.","(9:41) Phil Dawson kicks off to the Sea8. Paul Richardson return for 19 yards to Sea27. Tackled by Jaquiski Tartt.","(9:44) Phil Dawson 22 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(10:10) Blaine Gabbert pass to the right to Shaun Draughn for 2 yards to the Sea4. Tackled by Richard Sherman.","(10:41) Carlos Hyde rush up the middle for 1 yard to the Sea6. Tackled by Frank Clark and Tony McDaniel.","(11:09) Carlos Hyde rush to the right for 5 yards to the Sea7. Tackled by Earl Thomas.","(11:39) Blaine Gabbert pass to the left to Garrett Celek for 18 yards to the Sea12. Tackled by Earl Thomas.","(11:46) Russell Wilson pass to the left to Jimmy Graham for 9 yards to the Sea29. Tackled by NaVorro Bowman. FUMBLE, recovered by SF (Gerald Hodges Jr.).","(12:23) Russell Wilson rush to the left for 3 yards to the Sea20. Tackled by Antoine Bethea.","(12:59) Russell Wilson pass to the right to Luke Willson for 7 yards to the Sea17. Tackled by Jaquiski Tartt and Tank Carradine.","(13:41) Christine Michael rush to the right for 2 yards to the Sea10. Tackled by DeForest Buckner and Eric Reid.","(13:48) Bradley Pinion punts for 41 yards to Sea8. No return.","(13:51) Blaine Gabbert incomplete pass to the middle intended for Jeremy Kerley.","(14:29) Carlos Hyde rush to the left for 4 yards to the Sea49. Tackled by Ahtyba Rubin and Cliff Avril.","(15:00) Blaine Gabbert pass to the right to Vance McDonald for 2 yards to the SF47. Tackled by Kam Chancellor.","(0:11) Blaine Gabbert pass to the right to Torrey Smith for 11 yards to the SF45. Tackled by K.J. Wright.","(0:23) Jon Ryan punts for 57 yards to SF14. Jeremy Kerley return for 20 yards to SF34. Tackled by Kelcie McCray.","(1:03) Russell Wilson pass to the right to Alex Collins for 10 yards to the Sea29. Tackled by Eli Harold.","(1:42) Christine Michael rush to the right for a loss of 1 yard to the Sea19. Tackled by Tramaine Brock.","(2:22) Christine Michael rush to the right for no gain to the Sea20. Tackled by Gerald Hodges Jr. and Mike Purcell.","(2:32) Bradley Pinion punts for 61 yards to Sea0. Touchback.","(3:08) Carlos Hyde rush to the right for 2 yards to the SF39. Tackled by Ahtyba Rubin and Cliff Avril.","(3:40) Carlos Hyde rush up the middle for 3 yards to the SF37. Tackled by K.J. Wright and Bobby Wagner.","(4:08) Carlos Hyde rush up the middle for 4 yards to the SF34. Tackled by K.J. Wright and Bobby Wagner.","(4:08) Steven Hauschka kicks off to the endzone. Touchback. Penalty: Offside on Seattle (Dewey McDonald) 5 yards.","(4:08) Steven Hauschka extra point is good.","(4:11) Christine Michael rush up the middle for 4 yards for a TOUCHDOWN.","(4:49) Russell Wilson pass to the left to Jimmy Graham for 12 yards to the SF4. Tackled by Tramaine Brock and NaVorro Bowman.","(5:28) Christine Michael rush to the left for a loss of 3 yards to the SF16. Tackled by NaVorro Bowman.","(6:06) Alex Collins rush up the middle for 3 yards to the SF13. Tackled by Gerald Hodges Jr. and Mike Purcell.","(6:38) Russell Wilson pass to the left to Alex Collins for 9 yards to the SF16. Tackled by Tramaine Brock.","(7:19) Christine Michael rush to the left for 12 yards to the SF25. Tackled by DeForest Buckner and Tramaine Brock.","(7:24) Russell Wilson incomplete pass to the left intended for Jimmy Graham defensed by Eric Reid.","(8:10) Russell Wilson pass to the middle to Jimmy Graham for 18 yards to the SF37. Tackled by Eric Reid.","(8:54) Christine Michael rush to the left for 6 yards to the Sea45. Tackled by Jimmie Ward.","(9:12) Penalty: False Start on Seattle (Jimmy Graham) -5 yards.","(9:50) Christine Michael rush to the right for 4 yards to the Sea44. Tackled by Eric Reid.","(10:11) Penalty: Holding on Seattle (Justin Britt) -10 yards.","(10:38) Russell Wilson pass to the right to Doug Baldwin for 12 yards to the Sea50.","(11:19) Russell Wilson pass to the right to Christine Michael for no gain to the Sea38. Tackled by DeForest Buckner.","(11:58) Christine Michael rush up the middle for 8 yards to the Sea48. Tackled by Eric Reid. Penalty: Holding on Seattle (Luke Willson) -10 yards.","(12:32) Russell Wilson pass to the right to Luke Willson for 2 yards to the Sea40. Tackled by Eric Reid.","(12:45) Bradley Pinion punts for 54 yards to Sea14. Tyler Lockett return for 14 yards to Sea28. Tackled by Aaron Burbridge and Dontae Johnson. Penalty: Holding on San Francisco (Kyle Nelson) 10 yards.","(13:19) Blaine Gabbert pass to the left to Jeremy Kerley for 4 yards to the SF32. Tackled by Jeremy Lane.","(13:50) Blaine Gabbert pass to the right to Vance McDonald for 2 yards to the SF28. Tackled by Kam Chancellor.","(14:17) Blaine Gabbert rush to the right for 1 yard to the SF26. Tackled by Ahtyba Rubin.","(14:17) Steven Hauschka kicks off to the endzone. Touchback.","(14:17) Steven Hauschka extra point is good.","(14:24) Christine Michael rush to the left for 41 yards for a TOUCHDOWN.","(14:56) Russell Wilson pass to the left to Doug Baldwin for 34 yards to the SF41. Tackled by Antoine Bethea.","(15:00) Russell Wilson incomplete pass to the left intended for Christine Michael defensed by Jimmie Ward.","(15:00) Phil Dawson kicks off to the endzone. Touchback."]