["(0:36) Alfred Blue rush up the middle for 8 yards to the Hou16. Tackled by Anthony Johnson.","(1:08) Alfred Blue rush to the left for 4 yards to the Hou8. Tackled by Jamie Collins.","(1:15) Ryan Allen punts for 40 yards to Hou4. No return.","(1:15) Penalty: Delay of Game on New England (Ryan Allen) -5 yards.","(2:00) Jacoby Brissett rush to the right for 2 yards to the Hou39. Tackled by Max Bullough.","(2:00) Two Minute Warning.","(2:32) LeGarrette Blount rush to the left for 2 yards to the Hou41. Tackled by Joel Heath and Akeem Dent.","(3:11) LeGarrette Blount rush to the right for 1 yard to the Hou43. Tackled by Brennan Scarlett.","(3:17) Brock Osweiler incomplete pass to the left intended for Will Fuller.","(3:21) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(3:26) Brock Osweiler incomplete pass to the left defensed by Trey Flowers.","(3:58) Lamar Miller rush up the middle for 1 yard to the Hou45. Tackled by Jamie Collins and Shea McClellin.","(4:27) Brock Osweiler pass to the right to Ryan Griffin for 7 yards to the Hou44. Tackled by Cyrus Jones and Jamie Collins.","(4:54) Brock Osweiler pass to the left to Ryan Griffin for 6 yards to the Hou37. Tackled by Shea McClellin.","(5:21) Lamar Miller rush to the right for 15 yards to the Hou31. Tackled by Duron Harmon.","(5:27) Brock Osweiler incomplete pass to the middle intended for Jaelen Strong.","(6:01) Brock Osweiler pass to the right to Ryan Griffin for 7 yards to the Hou16. Tackled by Patrick Chung.","(6:36) Brock Osweiler pass to the left to Lamar Miller for 4 yards to the Hou9. Tackled by Jamie Collins.","(6:41) Brock Osweiler incomplete pass to the right intended for Ryan Griffin.","(6:52) Ryan Allen punts for 47 yards to Hou5. No return.","(6:52) Houston Texans timeout.","(7:03) Jacoby Brissett pass to the left to James White for 2 yards to the NE48. Tackled by Kareem Jackson.","(7:42) LeGarrette Blount rush up the middle for a loss of 2 yards to the NE46. Tackled by Quintin Demps and Christian Covington.","(8:19) LeGarrette Blount rush to the left for 2 yards to the NE48. Tackled by D.J. Reader.","(8:24) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(8:57) Jonathan Grimes rush up the middle for 2 yards to the NE45. Tackled by Trey Flowers.","(9:25) Brock Osweiler pass to the left to Jonathan Grimes for 6 yards to the NE47. Tackled by Logan Ryan and Jamie Collins.","(9:28) Brock Osweiler incomplete pass to the right intended for Jaelen Strong.","(9:47) Brock Osweiler rush to the left for 13 yards to the Hou47. Tackled by Cyrus Jones.","(10:28) Brock Osweiler pass to the right to Jonathan Grimes for 4 yards to the Hou34. Tackled by Malcolm Butler.","(11:00) Brock Osweiler pass to the right to Jonathan Grimes for 5 yards to the Hou30. Tackled by Logan Ryan.","(11:00) Stephen Gostkowski kicks off to the endzone. Touchback.","(11:00) Stephen Gostkowski extra point is good.","(11:08) LeGarrette Blount rush to the left for 41 yards for a TOUCHDOWN.","(11:40) LeGarrette Blount rush to the left for 6 yards to the Hou41. Tackled by Kareem Jackson and Benardrick McKinney.","(11:51) Shane Lechler punts for 46 yards to NE43. Danny Amendola return for 10 yards to Hou47. Tackled by Jon Weeks.","(12:24) Lamar Miller rush up the middle for 7 yards to the Hou11. Tackled by Anthony Johnson.","(12:49) Lamar Miller rush to the right for 4 yards to the Hou8. Tackled by Jabaal Sheard. Penalty: Unnecessary Roughness on Houston (Jaelen Strong) -4 yards.","(13:27) Brock Osweiler sacked at Hou4 for a loss of 10 yards by Jabaal Sheard.","(13:33) Ryan Allen punts for 49 yards to Hou14. No return.","(13:38) Jacoby Brissett incomplete pass to the middle intended for James White.","(14:09) Jacoby Brissett rush to the right for 1 yard to the NE37. Tackled by John Simon.","(14:12) Jacoby Brissett incomplete pass to the right intended for Julian Edelman.","(14:16) Brock Osweiler incomplete pass to the right intended for Will Fuller defensed by Malcolm Butler.","(14:16) Houston Texans timeout.","(15:00) Brock Osweiler pass to the left to Jonathan Grimes for no gain to the NE36. Tackled by Jamie Collins.","(0:15) Jonathan Grimes rush to the left for a loss of 1 yard to the NE36. Tackled by Jamie Collins and Trey Flowers.","(0:43) Brock Osweiler pass to the right to Ryan Griffin for 7 yards to the NE35. Tackled by Jonathan Freeny.","(1:14) Lamar Miller rush to the right for 4 yards to the NE42. Tackled by Anthony Johnson and Chris Long.","(1:45) Brock Osweiler pass to the right to Lamar Miller for 7 yards to the NE46. Tackled by Malcolm Butler and Jonathan Freeny.","(2:20) Brock Osweiler pass to the right to Jaelen Strong for 15 yards to the Hou47. Tackled by Patrick Chung.","(2:52) Brock Osweiler pass to the left to Ryan Griffin for 6 yards to the Hou32. Tackled by Jonathan Freeny.","(3:27) Brock Osweiler pass to the middle to Will Fuller for 6 yards to the Hou26. Tackled by Jamie Collins.","(3:36) Ryan Allen punts for 57 yards to Hou20. No return.","(4:07) Jacoby Brissett pass to the left to Julian Edelman for 3 yards to the NE23. Tackled by Johnathan Joseph and Andre Hal.","(4:16) Jacoby Brissett incomplete pass to the left intended for Chris Hogan.","(4:51) LeGarrette Blount rush to the left for 4 yards to the NE20. Tackled by Vince Wilfork and Benardrick McKinney.","(5:03) Shane Lechler punts for 55 yards to NE6. Cyrus Jones return for 10 yards to NE16. Tackled by Jonathan Grimes. FUMBLE, recovered by NE (Cyrus Jones).","(5:08) Brock Osweiler incomplete pass to the right intended for Jaelen Strong.","(5:12) Brock Osweiler incomplete pass to the middle intended for C.J. Fiedorowicz defensed by Chris Long.","(5:18) Brock Osweiler incomplete pass to the left intended for Will Fuller.","(5:36) Brock Osweiler pass to the right to DeAndre Hopkins for 16 yards to the Hou39.","(5:41) Stephen Gostkowski kicks off to the Hou2. Tyler Ervin return for 21 yards to Hou23. Tackled by Barkevious Mingo.","(5:41) Stephen Gostkowski extra point is good.","(5:46) LeGarrette Blount rush to the left for 1 yard for a TOUCHDOWN.","(5:49) Penalty: Pass Interference on Houston (A.J. Bouye) 1 yards.","(5:59) Jacoby Brissett incomplete pass to the left intended for Martellus Bennett defensed by Johnathan Joseph.","(6:28) LeGarrette Blount rush up the middle for a loss of 1 yard to the Hou2. Tackled by D.J. Reader and J.J. Watt.","(6:32) Penalty: Pass Interference on Houston (Quintin Demps) 6 yards.","(7:11) LeGarrette Blount rush to the left for a loss of 1 yard to the Hou7. Tackled by Max Bullough and Benardrick McKinney.","(7:11) Houston Texans timeout.","(7:44) LeGarrette Blount rush to the left for 9 yards to the Hou6. Tackled by Quintin Demps.","(8:12) Jacoby Brissett pass to the left to Julian Edelman for 6 yards to the Hou15. Tackled by Quintin Demps.","(8:12) Stephen Gostkowski kicks off to the Hou9. Tyler Ervin return for 12 yards to Hou21. Tackled by Nate Ebner. FUMBLE, recovered by NE (Jordan Richards). Tackled by Alfred Blue.","(8:23) Stephen Gostkowski 25 yard field goal attempt is GOOD. Holder: Ryan Allen.","(8:30) Jacoby Brissett incomplete pass to the right intended for Julian Edelman.","(9:15) Jacoby Brissett pass to the left to Chris Hogan for 3 yards to the Hou7. Tackled by Benardrick McKinney.","(9:53) LeGarrette Blount rush to the right for 1 yard to the Hou10. Tackled by Vince Wilfork and Benardrick McKinney.","(10:31) Jacoby Brissett pass to the right to Danny Amendola for 7 yards to the Hou11. Tackled by Kareem Jackson.","(11:07) Julian Edelman rush to the left for 2 yards to the Hou18. Tackled by Max Bullough.","(11:43) LeGarrette Blount rush to the left for 4 yards to the Hou20. Tackled by Whitney Mercilus and Jadeveon Clowney.","(12:21) LeGarrette Blount rush to the left for 14 yards to the Hou24. Tackled by Andre Hal.","(12:59) Jacoby Brissett rush to the left for 4 yards to the Hou38. Tackled by Max Bullough.","(13:33) LeGarrette Blount rush to the left for 4 yards to the Hou42. Tackled by Benardrick McKinney and Whitney Mercilus.","(13:58) LeGarrette Blount rush to the left for 5 yards to the Hou46. Tackled by Benardrick McKinney and Andre Hal.","(14:33) LeGarrette Blount rush to the left for 4 yards to the NE49. Tackled by Vince Wilfork.","(14:56) Jacoby Brissett pass to the left to Julian Edelman for 23 yards to the NE45. Tackled by Johnathan Joseph.","(15:00) Nick Novak kicks off to the NE-2. Cyrus Jones return for 24 yards to NE22. Tackled by Kevin Johnson.","(0:34) Jacoby Brissett rush up the middle for a loss of 1 yard to the NE32.","(1:00) Jacoby Brissett rush up the middle for a loss of 1 yard to the NE33.","(1:00) Houston Texans timeout.","(1:05) James White rush to the left for 5 yards to the NE34. Tackled by Benardrick McKinney.","(1:10) Julian Edelman rush to the right for 8 yards to the NE29. Tackled by Kareem Jackson.","(1:10) Houston Texans timeout.","(1:17) James White rush up the middle for 7 yards to the NE21. Tackled by Jadeveon Clowney.","(1:26) Shane Lechler punts for 36 yards to NE14. No return.","(2:00) Lamar Miller rush to the right for no gain to the Hou50. Tackled by Jamie Collins and Malcom Brown.","(2:00) Two Minute Warning.","(2:12) Brock Osweiler pass to the right to Ryan Griffin for 3 yards to the Hou50. Tackled by Jamie Collins.","(2:44) Brock Osweiler pass to the right to Ryan Griffin for 5 yards to the Hou47. Tackled by Devin McCourty.","(3:11) Lamar Miller rush to the right for 10 yards to the Hou42. Tackled by Devin McCourty.","(3:42) Brock Osweiler pass to the right to Ryan Griffin for 11 yards to the Hou32. Tackled by Patrick Chung and Jonathan Freeny.","(4:23) Lamar Miller rush up the middle for 4 yards to the Hou21. Tackled by Jonathan Freeny.","(4:53) Brock Osweiler pass to the right to Lamar Miller for 7 yards to the Hou17. Tackled by Jamie Collins.","(5:01) Ryan Allen punts for 52 yards to Hou10. No return.","(5:37) LeGarrette Blount rush to the right for 1 yard to the NE38. Tackled by Vince Wilfork and Benardrick McKinney.","(6:14) LeGarrette Blount rush up the middle for 2 yards to the NE37. Tackled by J.J. Watt and Vince Wilfork.","(6:52) Martellus Bennett rush to the right for 6 yards to the NE35. Tackled by Kareem Jackson and John Simon.","(7:28) Jacoby Brissett pass to the right to Danny Amendola for 16 yards to the NE29. Tackled by Kevin Johnson and A.J. Bouye.","(8:10) James White rush to the left for no gain to the NE13. Tackled by Vince Wilfork and Whitney Mercilus.","(8:10) Penalty: False Start on New England (Joe Thuney) -5 yards.","(8:15) Jacoby Brissett incomplete pass to the left intended for Malcolm Mitchell.","(8:26) Shane Lechler punts for 57 yards to NE5. Cyrus Jones return for 13 yards to NE18. Tackled by Jonathan Grimes.","(8:32) Brock Osweiler incomplete pass to the left intended for Ryan Griffin.","(9:13) Jonathan Grimes rush to the left for 3 yards to the Hou38. Tackled by Malcom Brown.","(9:18) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(9:53) Lamar Miller rush up the middle for 4 yards to the Hou35. Tackled by Jamie Collins.","(10:33) Brock Osweiler pass to the right to Lamar Miller for 9 yards to the Hou31. Tackled by Jonathan Freeny.","(11:13) Brock Osweiler pass to the right to DeAndre Hopkins for 12 yards to the Hou22. Tackled by Logan Ryan.","(11:42) Lamar Miller rush to the right for no gain to the Hou10. Tackled by Patrick Chung.","(11:51) Ryan Allen punts for 36 yards to Hou10. No return.","(12:27) Jacoby Brissett sacked at Hou46 for a loss of 6 yards by Benardrick McKinney.","(13:03) Jacoby Brissett rush up the middle for 3 yards to the Hou40. Tackled by Vince Wilfork.","(13:40) LeGarrette Blount rush to the left for no gain to the Hou43. Tackled by Benardrick McKinney and Max Bullough.","(13:49) Brock Osweiler pass intended for DeAndre Hopkins INTERCEPTED by Jamie Collins and returned for 18 yards. Tackled by Stephen Anderson and Xavier Su'a-Filo.","(14:17) Penalty: Illegal Formation on Houston (C.J. Fiedorowicz) -5 yards.","(15:00) Lamar Miller rush to the left for 5 yards to the Hou50. Tackled by Trey Flowers.","(0:20) Brock Osweiler pass to the middle to Will Fuller for 7 yards to the Hou45. Tackled by Trey Flowers.","(0:51) Lamar Miller rush to the right for a loss of 2 yards to the Hou38. Tackled by Malcolm Butler.","(1:13) Brock Osweiler pass to the right to DeAndre Hopkins for 14 yards to the Hou40.","(1:17) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins defensed by Logan Ryan.","(1:54) Lamar Miller rush to the right for 1 yard to the Hou26. Tackled by Jamie Collins.","(1:54) Stephen Gostkowski kicks off to the endzone. Touchback.","(1:54) Stephen Gostkowski extra point is good.","(2:01) Jacoby Brissett rush to the right for 27 yards for a TOUCHDOWN.","(2:01) Penalty: False Start on New England (Marcus Cannon) -5 yards.","(2:07) Stephen Gostkowski kicks off to the Hou-1. Charles James return for 18 yards to Hou17. Tackled by Brandon Bolden. FUMBLE, recovered by NE (Duron Harmon). Tackled by Akeem Dent.","(2:11) Stephen Gostkowski 24 yard field goal attempt is GOOD. Holder: Ryan Allen.","(2:16) Jacoby Brissett incomplete pass to the left intended for Rob Gronkowski.","(2:41) Julian Edelman rush to the left for 4 yards to the Hou6. Tackled by Johnathan Joseph.","(3:11) LeGarrette Blount rush up the middle for 5 yards to the Hou10. Tackled by Benardrick McKinney and Christian Covington.","(3:45) Jacoby Brissett pass to the left to Malcolm Mitchell for 27 yards to the Hou15. Tackled by Benardrick McKinney.","(4:25) LeGarrette Blount rush up the middle for 3 yards to the Hou42. Tackled by Benardrick McKinney and Whitney Mercilus.","(5:04) Jacoby Brissett pass to the left to Martellus Bennett for 5 yards to the Hou45. Tackled by Kareem Jackson and Quintin Demps.","(5:46) Jacoby Brissett rush to the right for 13 yards to the NE50. Tackled by Andre Hal.","(5:52) Penalty: Pass Interference on Houston (Johnathan Joseph) 12 yards.","(6:31) LeGarrette Blount rush up the middle for no gain to the NE25. Tackled by Benardrick McKinney.","(6:59) Jacoby Brissett pass to the left to Martellus Bennett for 5 yards to the NE25. Tackled by Benardrick McKinney.","(7:07) Shane Lechler punts for 53 yards to NE0. Touchback.","(7:41) Lamar Miller rush to the left for 6 yards to the Hou47. Tackled by Devin McCourty and Malcolm Butler.","(7:45) Brock Osweiler incomplete pass to the middle intended for Lamar Miller.","(8:24) Lamar Miller rush to the left for 2 yards to the Hou41. Tackled by Vincent Valentine and Chris Long.","(8:56) Brock Osweiler pass to the right to Will Fuller for 18 yards to the Hou39. Tackled by Logan Ryan.","(8:56) Houston Texans timeout.","(9:40) Lamar Miller rush to the right for 1 yard to the Hou21. Tackled by Vincent Valentine and Alan Branch.","(10:19) Lamar Miller rush to the left for 6 yards to the Hou20. Tackled by Jonathan Freeny and Alan Branch.","(10:56) Lamar Miller rush to the left for 3 yards to the Hou14. Tackled by Shea McClellin and Vincent Valentine.","(11:00) Ryan Allen punts for 52 yards to Hou11. No return.","(11:10) Jacoby Brissett incomplete pass to the left intended for Chris Hogan.","(11:45) Jacoby Brissett pass to the right to Julian Edelman for 6 yards to the NE37. Tackled by John Simon.","(12:16) LeGarrette Blount rush to the left for no gain to the NE31. Tackled by Kareem Jackson.","(12:25) Shane Lechler punts for 47 yards to NE16. No return. Penalty: FC Interference on Houston (Charles James) 15 yards.","(12:57) Brock Osweiler sacked at Hou37 for a loss of 11 yards by Jabaal Sheard.","(13:00) Brock Osweiler incomplete pass to the left intended for Stephen Anderson.","(13:36) Lamar Miller rush to the right for 2 yards to the Hou48. Tackled by Malcom Brown and Jamie Collins.","(13:49) Brock Osweiler pass to the right to DeAndre Hopkins for 14 yards to the Hou46.","(14:29) Lamar Miller rush to the right for a loss of 2 yards to the Hou32. Tackled by Alan Branch.","(15:00) Lamar Miller rush to the right for 9 yards to the Hou34. Tackled by Devin McCourty.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback."]