["(0:43) Andrew Luck rush up the middle for a loss of 1 yard to the Ten46.","(0:43) Ryan Succop onside kickoff to the Ten45. No return.","(0:48) Ryan Succop 44 yard field goal attempt is GOOD. Holder: Brett Kern.","(0:55) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(1:00) Marcus Mariota incomplete pass to the left intended for Derrick Henry.","(1:01) Marcus Mariota incomplete pass to the middle.","(1:18) Marcus Mariota pass to the right to Delanie Walker for 14 yards to the Ind26. Tackled by Mike Adams.","(1:26) Marcus Mariota pass to the left to Tajae Sharpe for 14 yards to the Ind40. Tackled by Vontae Davis.","(1:47) Marcus Mariota pass to the left to Tajae Sharpe for 21 yards to the Ten46. Tackled by Darius Butler and Erik Walden.","(1:47) Pat McAfee kicks off to the endzone. Touchback.","(1:47) Adam Vinatieri extra point is good.","(1:55) Marcus Mariota sacked at Ten14 for a loss of 11 yards by T.Y. McGill. FUMBLE, recovered by Ind (Robert Mathis) and returned for 14 yards for a TOUCHDOWN.","(1:55) Pat McAfee kicks off to the endzone. Touchback.","(1:55) Adam Vinatieri extra point is good.","(2:00) Andrew Luck pass to the middle to Jack Doyle for 7 yards for a TOUCHDOWN.","(2:00) Penalty: False Start on Indianapolis (Joe Reitz) -5 yards.","(2:00) Two Minute Warning.","(2:13) Robert Turbin rush up the middle for no gain to the Ten2. Tackled by Jurrell Casey and Avery Williamson.","(2:13) Tennessee Titans timeout.","(2:18) Frank Gore rush up the middle for 1 yard to the Ten2. Tackled by DaQuan Jones.","(2:18) Tennessee Titans timeout.","(2:25) Frank Gore rush up the middle for 10 yards to the Ten3. Tackled by Daimion Stafford.","(2:37) Andrew Luck pass to the left to Devin Street for 20 yards to the Ten8. Tackled by Jason McCourty. Penalty: Delay of Game on Indianapolis (Devin Street) -5 yards.","(3:23) Andrew Luck pass to the right to Frank Gore for a loss of 3 yards to the Ten28. Tackled by Angelo Blackson.","(3:28) Andrew Luck incomplete pass to the right intended for Erik Swoope defensed by Kevin Byard.","(3:33) Penalty: Pass Interference on Tennessee (Wesley Woodyard) 3 yards.","(3:38) Penalty: Illegal Shift on Indianapolis (Frank Gore) -5 yards.","(4:18) Frank Gore rush up the middle for 2 yards to the Ten23. Tackled by Derrick Morgan.","(4:51) Andrew Luck rush up the middle for 9 yards to the Ten25. Tackled by Brice McCain.","(5:27) Andrew Luck pass to the right to T.Y. Hilton for 12 yards to the Ten34. Tackled by Valentino Blake.","(5:31) Andrew Luck incomplete pass to the left intended for Devin Street.","(6:02) Andrew Luck pass to the right to Jack Doyle for 24 yards to the Ten46. Tackled by Daimion Stafford.","(6:02) Ryan Succop kicks off to the endzone. Touchback. Penalty: Offside on Tennessee (Jalston Fowler) 5 yards.","(6:07) Ryan Succop 48 yard field goal attempt is GOOD. Holder: Brett Kern.","(6:14) Marcus Mariota incomplete pass to the right intended for Kendall Wright defensed by Darius Butler.","(6:58) Marcus Mariota pass to the right to DeMarco Murray for 3 yards to the Ind30. Tackled by David Parry and Hassan Ridgeway.","(7:41) DeMarco Murray rush to the right for 2 yards to the Ind33. Tackled by Clayton Geathers.","(7:46) Penalty: Pass Interference on Indianapolis (Vontae Davis) 15 yards.","(8:24) Marcus Mariota pass to the left to Delanie Walker for 26 yards to the Ten50. Tackled by Vontae Davis.","(9:03) Marcus Mariota pass to the right to DeMarco Murray for 4 yards to the Ten24. Tackled by Patrick Robinson and Edwin Jackson.","(9:41) DeMarco Murray rush to the right for no gain to the Ten20. Tackled by David Parry and D'Qwell Jackson.","(9:49) Pat McAfee punts for 39 yards to Ten20. No return.","(9:53) Andrew Luck incomplete pass to the left intended for T.Y. Hilton defensed by Karl Klug.","(9:58) Andrew Luck incomplete pass to the right intended for Chester Rogers.","(10:42) Andrew Luck pass to the left to Frank Gore for 5 yards to the Ind41. Tackled by Sean Spence.","(11:24) Andrew Luck pass to the middle to Jack Doyle for 4 yards to the Ind36. Tackled by Sean Spence.","(12:07) Frank Gore rush to the right for no gain to the Ind32. Tackled by David Bass and DaQuan Jones.","(12:39) Andrew Luck pass to the middle to Jack Doyle for 7 yards to the Ind32. Tackled by Sean Spence.","(12:39) Ryan Succop kicks off to the endzone. Touchback.","(12:39) Ryan Succop extra point is good.","(12:43) Marcus Mariota pass to the middle to Delanie Walker for 7 yards for a TOUCHDOWN.","(13:28) DeMarco Murray rush to the right for a loss of 4 yards to the Ind7. Tackled by Arthur Jones.","(14:09) DeMarco Murray rush to the right for 5 yards to the Ind3. Tackled by Patrick Robinson and Josh McNary.","(14:14) Penalty: Pass Interference on Indianapolis (Clayton Geathers) 11 yards.","(14:56) Marcus Mariota pass to the right to Rishard Matthews for 20 yards to the Ind19. Tackled by Darius Butler.","(15:00) Marcus Mariota incomplete pass to the middle intended for Kendall Wright defensed by D'Qwell Jackson.","(0:32) Marcus Mariota rush up the middle for no gain to the Ind30. FUMBLE, recovered by Ten (Marcus Mariota).","(0:36) Penalty: Pass Interference on Indianapolis (D'Qwell Jackson) 8 yards.","(1:16) DeMarco Murray rush to the left for 1 yard to the Ind38. Tackled by Vontae Davis.","(1:45) Marcus Mariota pass to the left to Tajae Sharpe for 16 yards to the Ind39.","(1:50) Marcus Mariota incomplete pass to the right intended for Anthony Fasano defensed by Clayton Geathers.","(1:56) Marcus Mariota incomplete pass to the left intended for DeMarco Murray.","(1:56) Penalty: False Start on Tennessee (Josh Kline) -5 yards.","(2:06) Penalty: Unnecessary Roughness on Indianapolis (Josh McNary) 15 yards.","(2:46) Marcus Mariota sacked at Ten35 for a loss of 10 yards by Akeem Ayers.","(3:24) DeMarco Murray rush to the left for 11 yards to the Ten45. Tackled by D'Qwell Jackson.","(3:46) Marcus Mariota pass to the left to Delanie Walker for 9 yards to the Ten34. Tackled by Mike Adams.","(3:46) Pat McAfee kicks off to the endzone. Touchback.","(3:51) Adam Vinatieri 33 yard field goal attempt is GOOD. Holder: Pat McAfee.","(4:31) Andrew Luck sacked at Ten15 for a loss of 6 yards by Karl Klug and Derrick Morgan.","(5:16) Andrew Luck pass to the right to Jack Doyle for 3 yards to the Ten9.","(5:52) Frank Gore rush to the right for no gain to the Ten12. Tackled by Daimion Stafford.","(6:29) Andrew Luck pass to the right to T.Y. Hilton for 11 yards to the Ten12. Tackled by Valentino Blake.","(6:36) Penalty: Roughing Passer on Tennessee (DaQuan Jones) 15 yards.","(6:42) Andrew Luck incomplete pass to the middle intended for Erik Swoope.","(7:11) Andrew Luck pass to the right to T.Y. Hilton for 20 yards to the Ten38. Tackled by Brice McCain.","(7:54) Andrew Luck pass to the right to Jack Doyle for 18 yards to the Ind42. Tackled by Rashad Johnson and Daimion Stafford.","(8:38) Andrew Luck rush to the right for 3 yards to the Ind24. Tackled by Da'Norris Searcy.","(9:17) Frank Gore rush to the right for 3 yards to the Ind21. Tackled by Angelo Blackson and Avery Williamson.","(9:50) Frank Gore rush to the left for 6 yards to the Ind18. Tackled by Brian Orakpo and Derrick Morgan.","(10:01) Brett Kern punts for 62 yards to Ind1. Chester Rogers return for 11 yards to Ind12.","(10:05) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(10:36) Marcus Mariota pass to the left to Rishard Matthews for 2 yards to the Ten37. Tackled by Vontae Davis.","(11:23) DeMarco Murray rush to the right for 3 yards to the Ten35. Tackled by Clayton Geathers.","(12:03) DeMarco Murray rush to the right for 6 yards to the Ten32. Tackled by D'Qwell Jackson.","(12:23) DeMarco Murray rush up the middle for 6 yards to the Ten26. Tackled by Arthur Jones.","(12:31) Pat McAfee punts for 55 yards to Ten0. Touchback.","(12:35) Andrew Luck incomplete pass to the left intended for Devin Street.","(13:17) Frank Gore rush up the middle for 2 yards to the Ind45. Tackled by Wesley Woodyard.","(13:49) Andrew Luck pass to the right to Frank Gore for 6 yards to the Ind43. Tackled by Avery Williamson.","(14:23) Frank Gore rush to the left for 3 yards to the Ind37. Tackled by Avery Williamson.","(15:00) Andrew Luck pass to the left to Chester Rogers for 9 yards to the Ind34. Tackled by Brice McCain.","(15:00) Ryan Succop kicks off to the endzone. Touchback.","(0:34) Andrew Luck rush up the middle for a loss of 1 yard to the Ind24.","(0:34) Ryan Succop kicks off to the endzone. Touchback.","(0:34) Ryan Succop extra point is good.","(0:39) DeMarco Murray rush up the middle for 1 yard for a TOUCHDOWN.","(0:39) Tennessee Titans timeout.","(0:43) DeMarco Murray rush to the left for 1 yard to the Ind1. Tackled by Antonio Morrison.","(0:49) Penalty: Pass Interference on Indianapolis (T.J. Green) 27 yards.","(0:54) Marcus Mariota pass to the left to Kendall Wright for 5 yards to the Ind29. Tackled by Darius Butler.","(1:10) DeMarco Murray rush up the middle for 6 yards to the Ind34. Tackled by D'Qwell Jackson.","(1:16) Marcus Mariota pass to the right to Rishard Matthews for 9 yards to the Ind40.","(1:32) Marcus Mariota pass to the left to Rishard Matthews for 6 yards to the Ind49. Tackled by T.J. Green.","(1:32) Tennessee Titans timeout.","(1:42) Marcus Mariota pass to the right to Kendall Wright for 7 yards to the Ten45. Tackled by Chris Carter.","(1:47) Marcus Mariota incomplete pass to the right intended for Delanie Walker.","(1:53) Marcus Mariota pass to the left to DeMarco Murray for 13 yards to the Ten38. Tackled by Clayton Geathers.","(1:53) Indianapolis Colts timeout.","(2:00) Marcus Mariota pass to the right to Delanie Walker for 9 yards to the Ten25. Tackled by Mike Adams.","(2:00) Two Minute Warning.","(2:12) Marcus Mariota sacked at Ten16 for a loss of 4 yards by Erik Walden.","(2:23) Pat McAfee punts for 50 yards to Ten0. Touchback.","(3:12) Andrew Luck pass to the left to Robert Turbin for 19 yards to the Ind50. Tackled by Jason McCourty and Karl Klug.","(3:12) Tennessee Titans timeout.","(3:20) Andrew Luck sacked at Ind31 for a loss of 6 yards by Derrick Morgan.","(3:26) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(3:43) Penalty: False Start on Indianapolis (Anthony Castonzo) -5 yards.","(4:09) Andrew Luck pass to the right to Chester Rogers for 21 yards to the Ind42. Tackled by Perrish Cox.","(4:53) Andrew Luck pass to the left to Frank Gore for 11 yards to the Ind21. Tackled by Avery Williamson and David Bass.","(5:29) Frank Gore rush up the middle for 3 yards to the Ind10. Tackled by Daimion Stafford.","(5:37) Brett Kern punts for 48 yards to Ind7. No return.","(5:41) Marcus Mariota incomplete pass to the right intended for Andre Johnson.","(6:03) DeMarco Murray rush to the left for 9 yards to the Ten45. Tackled by D'Qwell Jackson.","(6:08) Marcus Mariota incomplete pass to the right intended for Andre Johnson.","(6:46) DeMarco Murray rush to the right for 6 yards to the Ten36. Tackled by D'Qwell Jackson and Patrick Robinson.","(7:06) DeMarco Murray rush up the middle for 5 yards to the Ten30. Tackled by Darius Butler.","(7:06) Pat McAfee kicks off to the endzone. Touchback.","(7:10) Adam Vinatieri 28 yard field goal attempt is GOOD. Holder: Pat McAfee.","(7:15) Andrew Luck incomplete pass to the middle intended for Jack Doyle.","(7:59) Andrew Luck pass to the left to Jack Doyle for 4 yards to the Ten10. Tackled by Valentino Blake.","(8:45) Andrew Luck pass to the right to Jack Doyle for 3 yards to the Ten14. Tackled by Avery Williamson.","(8:51) Penalty: Holding on Indianapolis (Joe Reitz) -10 yards.","(9:34) Andrew Luck pass to the right to T.Y. Hilton for 22 yards to the Ten7. Tackled by Perrish Cox.","(10:12) Frank Gore rush to the left for 6 yards to the Ten29. Tackled by Karl Klug and Brian Orakpo.","(10:16) Pat McAfee onside kickoff to the Ten35. Onside kick recovered by kicking team by Robert Turbin.","(10:16) Adam Vinatieri extra point is good.","(10:23) Andrew Luck pass to the middle to T.Y. Hilton for 37 yards for a TOUCHDOWN.","(11:08) Andrew Luck pass to the left to Erik Swoope for 34 yards to the Ten37. Tackled by Sean Spence.","(11:53) Robert Turbin rush up the middle for 3 yards to the Ind29. Tackled by Wesley Woodyard.","(12:32) Andrew Luck rush to the left for 7 yards to the Ind26. Tackled by Jason McCourty.","(13:11) Frank Gore rush to the left for 5 yards to the Ind19. Tackled by Wesley Woodyard and Rashad Johnson.","(13:40) Andrew Luck pass to the right to T.Y. Hilton for 7 yards to the Ind14. Tackled by Perrish Cox.","(13:51) Brett Kern punts for 29 yards to Ind7. No return.","(13:57) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe defensed by Patrick Robinson.","(14:23) Derrick Henry rush to the left for 3 yards to the Ind36. Tackled by Darius Butler.","(14:28) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(15:00) DeMarco Murray rush to the right for 14 yards to the Ind39. Tackled by Mike Adams.","(0:47) DeMarco Murray rush to the left for 4 yards to the Ten47. Tackled by David Parry and Mike Adams.","(1:20) DeMarco Murray rush to the left for 5 yards to the Ten43. Tackled by D'Qwell Jackson.","(2:03) Marcus Mariota rush to the right for 14 yards to the Ten38. Tackled by Clayton Geathers.","(2:09) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(2:21) Pat McAfee punts for 60 yards to Ten17. Marc Mariani return for 7 yards to Ten24. Tackled by Jordan Todman and Matthias Farley.","(2:26) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(3:11) Frank Gore rush to the right for 5 yards to the Ind23. Tackled by Avery Williamson.","(3:17) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(3:27) Brett Kern punts for 49 yards to Ind21. Chester Rogers return for 7 yards to Ind28. Tackled by Beau Brinkley. Penalty: Holding on Indianapolis (Patrick Robinson) -10 yards.","(3:31) Marcus Mariota incomplete pass to the right intended for DeMarco Murray.","(4:09) DeMarco Murray rush to the left for 4 yards to the Ten30. Tackled by Edwin Jackson.","(4:46) DeMarco Murray rush to the right for 1 yard to the Ten26. Tackled by Mike Adams and Edwin Jackson.","(4:46) Pat McAfee kicks off to the endzone. Touchback.","(4:46) Adam Vinatieri extra point is good.","(4:50) Andrew Luck pass to the middle to Frank Gore for 3 yards for a TOUCHDOWN.","(5:32) Frank Gore rush up the middle for 3 yards to the Ten3. Tackled by Da'Norris Searcy.","(6:05) Andrew Luck pass to the left to Erik Swoope for 17 yards to the Ten6. Tackled by Daimion Stafford.","(6:48) Frank Gore rush to the left for 2 yards to the Ten23. Tackled by DaQuan Jones.","(6:53) Penalty: Holding on Tennessee (Brice McCain) 5 yards.","(6:58) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(7:03) Andrew Luck incomplete pass to the right intended for Erik Swoope.","(7:47) Frank Gore rush to the left for 4 yards to the Ten30. Tackled by Wesley Woodyard and Avery Williamson.","(8:22) Frank Gore rush up the middle for 6 yards to the Ten34. Tackled by Jurrell Casey.","(8:34) Andrew Luck pass to the right to T.Y. Hilton for 24 yards to the Ten40. Tackled by Perrish Cox.","(9:07) Andrew Luck pass to the right to Jack Doyle for 8 yards to the Ind36. Tackled by Avery Williamson.","(9:14) Ryan Succop kicks off to the Ind-3. Jordan Todman return for 31 yards to Ind28. Tackled by David Bass.","(9:14) Brett Kern 2 pt conversion pass is NO GOOD - intended for Ryan Succop.","(9:21) Marcus Mariota pass to the left to Taylor Lewan for 10 yards for a TOUCHDOWN.","(9:59) DeMarco Murray rush up the middle for 4 yards to the Ind10. Tackled by Robert Mathis.","(10:41) Marcus Mariota pass to the left to Delanie Walker for 14 yards to the Ind14. Tackled by Mike Adams.","(11:12) Marcus Mariota pass to the left to Tajae Sharpe for 8 yards to the Ind28.","(11:32) Penalty: False Start on Tennessee (Quinton Spain) -5 yards.","(12:08) DeMarco Murray rush to the left for 4 yards to the Ind31. Tackled by D'Qwell Jackson.","(12:42) DeMarco Murray rush to the left for 4 yards to the Ind35. Tackled by Antonio Morrison.","(13:28) DeMarco Murray rush to the left for 4 yards to the Ind39. Tackled by D'Qwell Jackson.","(13:59) DeMarco Murray rush to the left for 5 yards to the Ind43. Tackled by Mike Adams.","(14:18) Marcus Mariota pass to the right to Anthony Fasano for 10 yards to the Ten37. Tackled by Clayton Geathers. Penalty: Unnecessary Roughness on Indianapolis (Akeem Ayers) 15 yards.","(14:53) Marcus Mariota pass to the left to Delanie Walker for 5 yards to the Ten27. Tackled by Vontae Davis.","(15:00) Pat McAfee kicks off to the Ten3. Marc Mariani return for 19 yards to Ten22. Tackled by Antonio Morrison."]