["(0:01) Ryan Fitzpatrick rush up the middle for a loss of 1 yard to the NYJ41.","(0:01) Penalty: Delay of Game on New York (Ryan Fitzpatrick) -5 yards.","(0:50) Matt Forte rush up the middle for 2 yards to the NYJ47. Tackled by Brandon Williams and Lawrence Guy.","(0:50) Baltimore Ravens timeout.","(0:55) Matt Forte rush to the left for 1 yard to the NYJ45. Tackled by Michael Pierce.","(1:02) Joe Flacco incomplete pass to the right intended for Chris Moore defensed by Marcus Williams.","(1:05) Joe Flacco incomplete pass to the left intended for Kamar Aiken.","(1:10) Joe Flacco incomplete pass to the left intended for Chris Moore.","(1:33) Joe Flacco pass to the left to Kyle Juszczyk for 2 yards to the NYJ44. Tackled by Julian Stanford.","(1:58) Joe Flacco pass to the right to Mike Wallace for 13 yards to the NYJ46. Tackled by Sheldon Richardson.","(1:58) Two Minute Warning.","(2:05) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(2:32) Joe Flacco pass to the right to Dennis Pitta for 6 yards to the Bal41. Tackled by Julian Stanford.","(2:36) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(3:04) Joe Flacco pass to the right to Mike Wallace for 5 yards to the Bal35. Tackled by Julian Stanford.","(3:09) Nick Folk 51 yard field goal attempt is BLOCKED by Brandon Williams.","(3:09) Baltimore Ravens timeout.","(3:17) Ryan Fitzpatrick pass to the middle to Matt Forte for 3 yards to the Bal33. Tackled by Zachary Orr.","(4:01) Matt Forte rush to the right for a loss of 2 yards to the Bal36. Tackled by Brandon Williams.","(4:41) Matt Forte rush to the left for 2 yards to the Bal34. Tackled by Albert McClellan and Michael Pierce.","(5:27) Ryan Fitzpatrick pass to the middle to Robby Anderson for 28 yards to the Bal36. Tackled by Zachary Orr.","(5:27) New York Jets timeout.","(5:34) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(6:14) Matt Forte rush to the left for 4 yards to the NYJ36. Tackled by Kamalei Correa.","(6:21) Sam Koch punts for 48 yards to NYJ34. Jalin Marshall return for a loss of 2 yards to NYJ32. Tackled by Darren Waller.","(6:26) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(7:02) Joe Flacco pass to the left to Kenneth Dixon for a loss of 1 yard to the Bal18. Tackled by Calvin Pryor.","(7:37) Joe Flacco pass to the left to Mike Wallace for no gain to the Bal19. Tackled by Buster Skrine.","(7:49) Lachlan Edwards punts for 52 yards to Bal19. Devin Hester - no return. Tackled by Charone Peake and Josh Martin.","(8:30) Ryan Fitzpatrick sacked at NYJ29 for a loss of 5 yards by Matt Judon.","(9:13) Matt Forte rush to the left for 5 yards to the NYJ34. Tackled by Timmy Jernigan and Za'Darius Smith.","(9:49) Matt Forte rush to the left for 1 yard to the NYJ29. Tackled by Eric Weddle and Zachary Orr.","(9:56) Sam Koch punts for 57 yards to NYJ28. No return.","(10:01) Joe Flacco incomplete pass to the middle intended for Mike Wallace.","(10:35) Joe Flacco pass to the right to Mike Wallace for 5 yards to the Bal15. Tackled by David Harris.","(11:11) Joe Flacco sacked at Bal10 for a loss of 5 yards by Leonard Williams.","(11:16) Lachlan Edwards punts for 32 yards to Bal15. No return.","(11:21) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(12:08) Matt Forte rush to the left for 1 yard to the Bal47. Tackled by Eric Weddle and Kamalei Correa.","(12:44) Matt Forte rush to the right for 8 yards to the Bal48. Tackled by Tavon Young.","(12:57) Penalty: Roughing Passer on Baltimore (Za'Darius Smith) 15 yards.","(13:38) Troymaine Pope rush to the left for 1 yard to the NYJ29. Tackled by Brent Urban and Michael Pierce.","(14:03) Penalty: Holding on New York (James Carpenter) -10 yards.","(14:45) Matt Forte rush up the middle for 11 yards to the NYJ38. Tackled by Eric Weddle.","(14:57) Sam Koch punts for 59 yards to NYJ11. Jalin Marshall return for 16 yards to NYJ27. Tackled by Zachary Orr.","(15:00) Joe Flacco incomplete pass to the left intended for Dennis Pitta defensed by Darrelle Revis.","(0:25) Joe Flacco pass to the left to Chris Moore for 3 yards to the Bal30. Tackled by Calvin Pryor.","(0:56) Terrance West rush to the left for 2 yards to the Bal27. Tackled by Julian Stanford and Lorenzo Mauldin.","(0:56) Nick Folk kicks off to the endzone. Touchback.","(0:56) Nick Folk extra point is good.","(1:00) Matt Forte rush to the right for 1 yard for a TOUCHDOWN.","(1:43) Matt Forte rush up the middle for 4 yards to the Bal1. Tackled by Eric Weddle and Albert McClellan.","(1:46) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(2:03) Matt Forte rush up the middle for 3 yards to the Bal3. Tackled by Kamalei Correa. FUMBLE, recovered by Bal (Timmy Jernigan) and returned for 1 yard. Tackled by Brandon Marshall. FUMBLE, recovered by NYJ (Brandon Marshall). Tackled by Zachary Orr.","(2:39) Matt Forte rush up the middle for a loss of 2 yards to the Bal6. Tackled by Zachary Orr.","(3:21) Matt Forte rush up the middle for 15 yards to the Bal4. Tackled by Eric Weddle.","(4:03) Matt Forte rush to the left for 5 yards to the Bal19. Tackled by Zachary Orr and Lawrence Guy.","(4:11) Joe Flacco pass intended for Breshad Perriman INTERCEPTED by Marcus Gilchrist and returned for 25 yards.","(4:55) Terrance West rush to the right for no gain to the Bal25. Tackled by Jarvis Jenkins and Victor Ochi.","(5:00) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(5:00) Nick Folk kicks off to the endzone. Touchback.","(5:07) Nick Folk 22 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(5:07) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa.","(5:51) Matt Forte rush to the left for 5 yards to the Bal4. Tackled by Timmy Jernigan and Matt Judon.","(6:18) Penalty: Delay of Game on New York (Ryan Fitzpatrick) -5 yards.","(7:03) Matt Forte rush to the left for a loss of 1 yard to the Bal4. Tackled by Lawrence Guy and Albert McClellan.","(7:16) Joe Flacco pass intended for Breshad Perriman INTERCEPTED by Buster Skrine and returned for 51 yards. Tackled by Ryan Jensen.","(7:52) Terrance West rush to the left for a loss of 3 yards to the Bal39. Tackled by Sheldon Richardson.","(8:00) Lachlan Edwards punts for 48 yards to Bal42. Devin Hester - no return. FUMBLE, recovered by Bal (Devin Hester).","(8:03) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Bostick defensed by Za'Darius Smith.","(8:47) Ryan Fitzpatrick pass to the left to Robby Anderson for 5 yards to the NYJ10. Tackled by Tavon Young.","(9:25) Matt Forte rush up the middle for 3 yards to the NYJ5. Tackled by Zachary Orr and Lawrence Guy.","(9:34) Sam Koch punts for 55 yards to NYJ2. No return.","(9:41) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(10:24) Joe Flacco pass to the right to Mike Wallace for 4 yards to the Bal43. Tackled by Buster Skrine.","(10:50) Lorenzo Taliaferro rush up the middle for no gain to the Bal39. Tackled by Leonard Williams.","(11:18) Joe Flacco pass to the right to Mike Wallace for 11 yards to the Bal39. Tackled by Buster Skrine.","(11:18) Lachlan Edwards punts for 17 yards to Bal28. No return.","(12:07) Ryan Fitzpatrick sacked at Bal45 for a loss of 7 yards by Timmy Jernigan.","(12:48) Ryan Fitzpatrick pass to the right to Brandon Marshall for 7 yards to the Bal38. Tackled by Tavon Young.","(13:32) Ryan Fitzpatrick sacked at Bal45 for a loss of 3 yards by Michael Pierce.","(14:25) Ryan Fitzpatrick pass to the left to Matt Forte for 31 yards to the Bal42. Tackled by Jimmy Smith.","(15:00) Matt Forte rush up the middle for 2 yards to the NYJ27. Tackled by Brandon Williams and Lawrence Guy.","(15:00) Justin Tucker kicks off to the endzone. Touchback.","(0:04) Justin Tucker 44 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:04) Joe Flacco incomplete pass to the middle.","(0:25) Joe Flacco pass to the left to Chris Moore for 8 yards to the NYJ25. Tackled by Julian Stanford.","(0:33) Joe Flacco incomplete pass to the left intended for Mike Wallace defensed by Marcus Williams.","(0:33) Baltimore Ravens timeout.","(0:39) Joe Flacco pass to the left to Dennis Pitta for 11 yards to the NYJ33. Tackled by Marcus Williams.","(0:39) Baltimore Ravens timeout.","(0:43) Joe Flacco pass to the middle to Kamar Aiken for 29 yards to the NYJ44. Tackled by Marcus Williams.","(0:43) Joe Flacco pass to the left to Lorenzo Taliaferro for a loss of 3 yards to the Bal27. Tackled by Sheldon Richardson.","(1:45) Joe Flacco pass to the right to Lorenzo Taliaferro for 5 yards to the Bal30. Tackled by David Harris.","(1:45) Nick Folk kicks off to the endzone. Touchback.","(1:45) Nick Folk extra point is good.","(1:51) Ryan Fitzpatrick pass to the middle to Matt Forte for 13 yards for a TOUCHDOWN.","(1:59) Robby Anderson rush to the left for 30 yards to the Bal13. Tackled by Lardarius Webb.","(1:59) Two Minute Warning.","(2:15) Matt Forte rush up the middle for 8 yards to the Bal43. Tackled by Za'Darius Smith and Eric Weddle.","(2:37) Ryan Fitzpatrick pass to the middle to Brandon Marshall for 21 yards to the NYJ49. Tackled by Eric Weddle.","(3:11) Ryan Fitzpatrick pass to the left to Charone Peake for 8 yards to the NYJ28. Tackled by Jerraud Powers.","(3:53) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 4 yards to the NYJ20. Tackled by Tavon Young.","(4:34) Matt Forte rush up the middle for 1 yard to the NYJ16. Tackled by Michael Pierce.","(4:42) Sam Koch punts for 27 yards to NYJ15. No return.","(5:29) Joe Flacco pass to the right to Dennis Pitta for 11 yards to the NYJ42. Tackled by Julian Stanford.","(6:08) Joe Flacco pass to the left to Lorenzo Taliaferro for 8 yards to the Bal47. Tackled by Julian Stanford.","(6:45) Joe Flacco pass to the left to Mike Wallace for 5 yards to the Bal39. Tackled by Buster Skrine.","(7:03) Penalty: Holding on Baltimore (Alex Lewis) -10 yards.","(7:28) Penalty: False Start on Baltimore (Alex Lewis) -5 yards.","(7:50) Joe Flacco pass to the left to Mike Wallace for 15 yards to the Bal49.","(8:00) Lachlan Edwards punts for 46 yards to Bal25. Devin Hester return for 9 yards to Bal34. Tackled by Kellen Davis. FUMBLE, recovered by Bal.","(8:33) Geno Smith sacked at NYJ29 for a loss of 8 yards by Matt Judon.","(9:12) Bilal Powell rush to the left for 3 yards to the NYJ37. Tackled by Albert McClellan.","(9:50) Bilal Powell rush up the middle for 1 yard to the NYJ34. Tackled by Timmy Jernigan and Albert McClellan.","(10:30) Bilal Powell rush to the left for 9 yards to the NYJ33. Tackled by Eric Weddle and Zachary Orr.","(11:15) Matt Forte rush to the right for 1 yard to the NYJ24. Tackled by Brandon Williams and Albert McClellan.","(11:49) Geno Smith pass to the left to Matt Forte for 7 yards to the NYJ23. Tackled by Zachary Orr.","(11:57) Justin Tucker kicks off to the NYJ-4. Jalin Marshall return for 20 yards to NYJ16. Tackled by Kyle Juszczyk.","(12:01) Justin Tucker 49 yard field goal attempt is GOOD. Holder: Sam Koch.","(12:05) Joe Flacco incomplete pass to the right intended for Dennis Pitta.","(12:08) Joe Flacco incomplete pass to the right intended for Kamar Aiken.","(12:08) New York Jets timeout.","(12:37) Joe Flacco rush to the right for 1 yard to the NYJ31.","(13:09) Joe Flacco pass to the right to Breshad Perriman for 11 yards to the NYJ32. Tackled by Darrelle Revis.","(13:25) Joe Flacco pass to the left to Kamar Aiken for 6 yards to the NYJ43.","(13:53) Joe Flacco pass to the left to Dennis Pitta for 12 yards to the NYJ49. Tackled by Calvin Pryor.","(14:27) Terrance West rush to the left for 3 yards to the Bal39. Tackled by Sheldon Richardson.","(15:00) Joe Flacco pass to the middle to Kamar Aiken for 20 yards to the Bal36. Tackled by Marcus Williams.","(0:33) Joe Flacco sacked at Bal16 for a loss of 9 yards by Sheldon Richardson.","(1:12) Terrance West rush to the left for no gain to the Bal25. Tackled by Steve McLendon.","(1:12) Nick Folk kicks off to the endzone. Touchback.","(1:12) Nick Folk extra point is good.","(1:24) Geno Smith pass to the middle to Quincy Enunwa for 69 yards for a TOUCHDOWN.","(2:11) Geno Smith sacked at NYJ31 for a loss of 3 yards by Brandon Williams.","(2:35) Penalty: False Start on New York (Brandon Marshall) -5 yards.","(3:01) Penalty: Illegal Use of Hands on Baltimore (Jimmy Smith) 5 yards.","(3:01) New York Jets timeout.","(3:07) Geno Smith incomplete pass to the middle intended for Brandon Marshall.","(3:47) Geno Smith rush to the left for 7 yards to the NYJ34.","(4:22) Matt Forte rush to the left for 3 yards to the NYJ27. Tackled by Za'Darius Smith and Jerraud Powers.","(4:27) Justin Tucker kicks off to the NYJ1. Jalin Marshall return for 23 yards to NYJ24. Tackled by Patrick Onwuasor and Kyle Juszczyk.","(4:31) Justin Tucker 50 yard field goal attempt is GOOD. Holder: Sam Koch.","(4:35) Joe Flacco incomplete pass to the right intended for Breshad Perriman.","(5:14) Terrance West rush to the left for 1 yard to the NYJ31. Tackled by Sheldon Richardson.","(5:48) Terrance West rush to the left for 5 yards to the NYJ32. Tackled by David Harris.","(6:30) Joe Flacco pass to the middle to Mike Wallace for 53 yards to the NYJ37. Tackled by Buster Skrine.","(6:39) Lachlan Edwards punts for 42 yards to Bal10. No return.","(6:44) Geno Smith incomplete pass to the left intended for Quincy Enunwa defensed by Anthony Levine Sr..","(7:25) Matt Forte rush to the right for 1 yard to the NYJ48. Tackled by Brandon Williams.","(7:56) Bilal Powell rush to the left for 5 yards to the NYJ47. Tackled by Brandon Williams.","(8:28) Geno Smith pass to the left to Brandon Marshall for 11 yards to the NYJ42.","(9:06) Matt Forte rush to the right for 2 yards to the NYJ31. Tackled by Albert McClellan.","(9:37) Matt Forte rush to the right for 4 yards to the NYJ29. Tackled by Tavon Young and Lardarius Webb.","(9:37) Justin Tucker kicks off to the endzone. Touchback.","(9:37) Justin Tucker extra point is good.","(9:45) Lachlan Edwards rush up the middle for no gain to the NYJ29. FUMBLE, recovered by Bal (Chris Moore) for a TOUCHDOWN.","(9:49) Geno Smith incomplete pass to the left intended for Charone Peake.","(10:30) Matt Forte rush up the middle for 6 yards to the NYJ29. Tackled by Eric Weddle and Zachary Orr.","(10:35) Geno Smith incomplete pass to the left intended for Brandon Marshall.","(11:17) Matt Forte rush to the left for 5 yards to the NYJ23. Tackled by Zachary Orr.","(12:02) Geno Smith pass to the left to Robby Anderson for 8 yards to the NYJ18. Tackled by Eric Weddle and Tavon Young.","(12:40) Matt Forte rush to the right for 1 yard to the NYJ10. Tackled by Brandon Williams.","(12:52) Sam Koch punts for 59 yards to NYJ5. Jalin Marshall return for 4 yards to NYJ9. Tackled by Marqueston Huff.","(12:54) Baltimore Ravens timeout.","(12:59) Joe Flacco incomplete pass to the middle intended for Dennis Pitta.","(13:36) Kenneth Dixon rush to the right for no gain to the Bal36. Tackled by Sheldon Richardson and Leonard Williams.","(13:41) Joe Flacco incomplete pass to the left intended for Kamar Aiken.","(14:20) Joe Flacco pass to the right to Mike Wallace for 9 yards to the Bal36. Tackled by Calvin Pryor and Buster Skrine.","(15:00) Terrance West rush to the left for 2 yards to the Bal27. Tackled by Steve McLendon and Bruce Carter.","(15:00) Nick Folk kicks off to the endzone. Touchback."]