["(0:39) Drew Brees rush up the middle for a loss of 1 yard to the Ari41.","(1:17) Drew Brees rush up the middle for a loss of 1 yard to the Ari40.","(2:00) Drew Brees pass to the left to Coby Fleener for 6 yards to the Ari39. Tackled by Tony Jefferson.","(2:00) New Orleans Saints timeout.","(2:14) Two Minute Warning.","(2:14) Mark Ingram rush up the middle for 1 yard to the Ari45. Tackled by Calais Campbell.","(2:14) Arizona Cardinals timeout.","(2:19) Mark Ingram rush up the middle for 6 yards to the Ari46. Tackled by Kevin Minter.","(2:19) Chandler Catanzaro onside kickoff to the NO48. No return.","(2:19) Chandler Catanzaro extra point is good.","(2:25) Carson Palmer pass to the left to John Brown for 30 yards for a TOUCHDOWN.","(2:25) Arizona Cardinals timeout.","(2:30) Carson Palmer pass to the left to Larry Fitzgerald for 13 yards to the NO30. Tackled by Craig Robertson.","(2:49) Carson Palmer pass to the middle to Larry Fitzgerald for 5 yards to the NO43. Tackled by Sterling Moore.","(3:10) Carson Palmer pass to the left to Larry Fitzgerald for 13 yards to the NO48. Tackled by Roman Harper.","(3:10) Penalty: False Start on Arizona (Earl Watford) -5 yards.","(3:14) Carson Palmer incomplete pass to the middle intended for David Johnson.","(3:21) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(3:27) Carson Palmer pass to the right to John Brown for 19 yards to the Ari44. Tackled by Jairus Byrd.","(3:27) Wil Lutz kicks off to the endzone. Touchback.","(3:27) Wil Lutz extra point is good.","(3:31) Tim Hightower rush to the right for 2 yards for a TOUCHDOWN.","(3:38) Mark Ingram rush to the left for 2 yards to the Ari2. Tackled by Brandon Williams.","(3:38) New Orleans Saints timeout.","(3:45) Drew Brees incomplete pass to the right intended for Coby Fleener defensed by Tony Jefferson.","(4:22) Drew Brees pass to the left to Michael Thomas for 9 yards to the Ari4. Tackled by Brandon Williams.","(4:29) Penalty: Roughing Passer on Arizona (Sio Moore) 14 yards.","(5:07) Tim Hightower rush up the middle for 2 yards to the Ari27. Tackled by Sio Moore.","(5:13) Drew Brees incomplete pass to the left intended for Willie Snead.","(5:22) Carson Palmer pass to the right to Brittan Golden for 4 yards to the Ari29. Tackled by Vonn Bell. FUMBLE, recovered by NO (Ken Crawley). Tackled by John Brown.","(5:28) Carson Palmer incomplete pass to the right intended for J.J. Nelson.","(5:33) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(5:33) Wil Lutz kicks off to the endzone. Touchback.","(5:33) Wil Lutz extra point is good. Penalty: Offside on Arizona (Justin Bethel) 5 yards.","(5:39) Drew Brees pass to the right to Michael Thomas for 4 yards for a TOUCHDOWN.","(6:20) Drew Brees pass to the left to Willie Snead for 8 yards to the Ari4. Tackled by Patrick Peterson.","(6:59) Mark Ingram rush to the right for 4 yards to the Ari12. Tackled by Sio Moore.","(7:36) Drew Brees pass to the left to Brandin Cooks for 36 yards to the Ari16. Tackled by Brandon Williams.","(7:46) Arizona Cardinals timeout.","(7:46) Drew Brees pass to the left to Brandin Cooks for 10 yards to the NO48. Tackled by Patrick Peterson.","(8:19) Mark Ingram rush up the middle for 3 yards to the NO38. Tackled by Josh Mauro.","(8:57) Drew Brees pass to the right to Willie Snead for 10 yards to the NO35. Tackled by Brandon Williams.","(8:57) Chandler Catanzaro kicks off to the endzone. Touchback.","(8:57) Chandler Catanzaro extra point is good.","(9:02) David Johnson rush up the middle for 7 yards for a TOUCHDOWN.","(9:40) Carson Palmer pass to the left to J.J. Nelson for 8 yards to the NO7. Tackled by B.W. Webb.","(10:21) Carson Palmer pass to the left to Jermaine Gresham for 10 yards to the NO15. Tackled by Jairus Byrd.","(11:06) David Johnson rush to the right for 5 yards to the NO25. Tackled by Nick Fairley.","(11:41) David Johnson rush up the middle for 13 yards to the NO30. Tackled by Sterling Moore and Jairus Byrd.","(12:20) Carson Palmer pass to the middle to Darren Fells for 13 yards to the NO43. Tackled by Vonn Bell.","(12:59) Carson Palmer pass to the right to Brittan Golden for 19 yards to the Ari44. Tackled by Sterling Moore.","(12:59) Wil Lutz kicks off to the endzone. Touchback.","(12:59) Wil Lutz extra point is good.","(13:04) Tim Hightower rush to the right for 3 yards for a TOUCHDOWN.","(13:08) Penalty: Offside on Arizona (Justin Bethel) 4 yards.","(13:51) Drew Brees pass to the right to Travaris Cadet for 7 yards to the Ari7. Tackled by Chandler Jones.","(14:23) Drew Brees pass to the right to Tim Hightower for 3 yards to the Ari14. Tackled by Chandler Jones.","(15:00) Drew Brees pass to the right to John Kuhn for a loss of 2 yards to the Ari17. Tackled by Chandler Jones.","(0:36) Drew Brees pass to the left to Mark Ingram for 17 yards to the Ari15. Tackled by Kevin Minter.","(1:11) Drew Brees pass to the right to Willie Snead for 6 yards to the Ari32. Tackled by Tyrann Mathieu.","(1:48) Drew Brees pass to the right to John Kuhn for 3 yards to the Ari38. Tackled by Tyrann Mathieu.","(2:07) Drew Brees pass to the left to Michael Thomas for 12 yards to the Ari41. Tackled by Brandon Williams.","(2:38) Tim Hightower rush to the left for 3 yards to the NO47. Tackled by Kevin Minter.","(3:18) Drew Brees pass to the left to Willie Snead for 19 yards to the NO44. Tackled by Kevin Minter.","(3:19) Chandler Catanzaro kicks off to the endzone. Touchback.","(3:19) Chandler Catanzaro extra point is good.","(3:23) David Johnson rush up the middle for 2 yards for a TOUCHDOWN.","(3:27) Penalty: Pass Interference on New Orleans (Sterling Moore) 11 yards.","(3:58) David Johnson rush up the middle for 5 yards to the NO13. Tackled by Cameron Jordan.","(4:38) Carson Palmer pass to the right to John Brown for 8 yards to the NO18. Tackled by Sterling Moore.","(5:26) Carson Palmer pass to the left to David Johnson for 25 yards to the NO26. Tackled by Craig Robertson.","(5:58) Carson Palmer pass to the left to J.J. Nelson for 11 yards to the Ari49. Tackled by B.W. Webb.","(6:06) Wil Lutz kicks off to the Ari3. Brittan Golden return for 35 yards to Ari38. Tackled by Nate Stupar.","(6:11) Wil Lutz 39 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(6:15) Drew Brees incomplete pass to the left intended for Michael Thomas.","(6:22) New Orleans Saints timeout.","(6:22) Drew Brees incomplete pass to the left intended for Willie Snead defensed by Sio Moore.","(6:59) Mark Ingram rush to the right for 5 yards to the Ari21. Tackled by Tony Jefferson.","(7:36) Drew Brees pass to the right to Brandin Cooks for 13 yards to the Ari26. Tackled by Sio Moore.","(8:12) Mark Ingram rush up the middle for no gain to the Ari39. Tackled by Markus Golden.","(8:17) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(8:48) Tim Hightower rush up the middle for 4 yards to the Ari39. Tackled by Calais Campbell.","(9:24) Drew Brees pass to the left to John Phillips for 9 yards to the Ari43. Tackled by Kevin Minter.","(9:55) Drew Brees pass to the left to Willie Snead for 11 yards to the NO48. Tackled by Brandon Williams.","(10:10) Mark Ingram rush to the left for 6 yards to the NO37. Tackled by Sio Moore.","(10:50) Drew Brees pass to the left to Michael Thomas for 9 yards to the NO31. Tackled by Marcus Cooper.","(11:31) Drew Brees pass to the left to Michael Thomas for 6 yards to the NO22. Tackled by Marcus Cooper.","(12:03) Mark Ingram rush to the left for 5 yards to the NO16. Tackled by Marcus Cooper.","(12:09) Matt Wile punts for 32 yards to NO11. No return.","(12:15) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald defensed by Sterling Moore.","(12:54) David Johnson rush up the middle for a loss of 2 yards to the NO43. Tackled by Cameron Jordan and Nate Stupar.","(13:35) David Johnson rush to the right for 5 yards to the NO41. Tackled by Roman Harper and Sterling Moore.","(14:08) Kerwynn Williams rush up the middle for 14 yards to the NO46. Tackled by Vonn Bell.","(14:16) Thomas Morstead punts for 30 yards to Ari40. No return.","(14:49) Drew Brees pass to the left to Willie Snead for 5 yards to the NO30. Tackled by Tyrann Mathieu.","(14:55) Drew Brees incomplete pass to the left intended for Mark Ingram.","(15:00) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Brandon Williams.","(15:00) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:01) Drew Brees sacked at NO28 for a loss of 16 yards by Calais Campbell.","(0:08) Travaris Cadet rush to the right for 16 yards to the NO44. Tackled by Patrick Peterson.","(0:16) Drew Brees pass to the left to Travaris Cadet for 4 yards to the NO28. Tackled by Marcus Cooper.","(0:35) Drew Brees pass to the right to Travaris Cadet for 2 yards to the NO24. Tackled by Sio Moore.","(0:40) Chandler Catanzaro kicks off to the NO1. Tommylee Lewis return for 21 yards to NO22. Tackled by Kareem Martin.","(0:40) Chandler Catanzaro extra point is good.","(0:45) Carson Palmer pass to the right to J.J. Nelson for 10 yards for a TOUCHDOWN.","(0:45) Arizona Cardinals timeout.","(0:51) Carson Palmer pass to the right to Larry Fitzgerald for 8 yards to the NO10. Tackled by Sheldon Rankins and Vonn Bell.","(0:57) Carson Palmer incomplete pass to the right intended for Jermaine Gresham.","(1:01) Penalty: Roughing Passer on New Orleans (Cameron Jordan) 15 yards.","(1:06) Carson Palmer pass to the left to John Brown for 11 yards to the NO33. Tackled by B.W. Webb.","(1:12) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(1:16) Carson Palmer incomplete pass to the middle intended for Jermaine Gresham.","(1:16) Arizona Cardinals timeout.","(1:23) Carson Palmer pass to the right to John Brown for 13 yards to the NO44. Tackled by Ken Crawley.","(1:43) Carson Palmer pass to the right to Jermaine Gresham for 23 yards to the Ari43. Tackled by Vonn Bell.","(1:51) Wil Lutz kicks off to the Ari-1. Brittan Golden return for 21 yards to Ari20. Tackled by Travaris Cadet.","(1:51) Wil Lutz extra point is good.","(2:00) Drew Brees pass to the right to Brandin Cooks for 45 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:21) Tim Hightower rush to the right for 6 yards to the Ari45. Tackled by Kevin Minter.","(2:26) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Marcus Cooper.","(3:00) Drew Brees pass to the left to Michael Thomas for 8 yards to the NO49. Tackled by Marcus Cooper.","(3:32) Drew Brees pass to the right to Tim Hightower for 3 yards to the NO41. Tackled by Sio Moore.","(3:42) Matt Wile punts for 36 yards to NO38. No return.","(4:14) Carson Palmer pass to the right to David Johnson for 4 yards to the Ari26. Tackled by Ken Crawley.","(4:18) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(4:56) David Johnson rush to the left for 2 yards to the Ari22. Tackled by Vonn Bell.","(5:32) Carson Palmer pass to the right to J.J. Nelson for 3 yards to the Ari20. Tackled by Sterling Moore.","(6:03) Carson Palmer pass to the right to Jermaine Gresham for 9 yards to the Ari17. Tackled by Vonn Bell.","(6:11) Wil Lutz kicks off to the Ari3. Brittan Golden return for 13 yards to Ari16. Tackled by De'Vante Harris and Travaris Cadet. Penalty: Holding on Arizona (Evan Boehm) -8 yards.","(6:11) Wil Lutz extra point is good. Penalty: Offside on Arizona (Justin Bethel) 5 yards.","(6:21) Drew Brees pass to the middle to Brandin Cooks for 65 yards for a TOUCHDOWN.","(7:01) Drew Brees pass to the middle to Willie Snead for 12 yards to the NO35. Tackled by D.J. Swearinger.","(7:08) Chandler Catanzaro kicks off to the NO4. Tommylee Lewis return for 19 yards to NO23. Tackled by Justin Bethel.","(7:08) Chandler Catanzaro extra point is NO GOOD.","(7:20) Drew Brees sacked at Ari47 for a loss of 7 yards by Markus Golden. FUMBLE, recovered by Ari (Calais Campbell) and returned for 53 yards for a TOUCHDOWN.","(7:25) Drew Brees incomplete pass to the right intended for Mark Ingram defensed by Kevin Minter.","(7:48) Penalty: Holding on New Orleans (Andrus Peat) -10 yards.","(8:22) Drew Brees pass to the right to Willie Snead for 5 yards to the Ari30. Tackled by D.J. Swearinger.","(8:22) New Orleans Saints timeout.","(9:03) John Kuhn rush up the middle for 1 yard to the Ari35. Tackled by Kevin Minter.","(9:37) Mark Ingram rush up the middle for 4 yards to the Ari36. Tackled by Sio Moore.","(10:11) Drew Brees pass to the right to Michael Thomas for 4 yards to the Ari40. Tackled by Kevin Minter.","(10:46) Mark Ingram rush to the right for 4 yards to the Ari44. Tackled by Kevin Minter.","(11:26) Drew Brees pass to the right to Brandin Cooks for 7 yards to the Ari48. Tackled by Tyrann Mathieu.","(11:31) 55 yard field goal attempt by Chandler Catanzaro is NO GOOD. Holder: Matt Wile.","(11:37) Carson Palmer incomplete pass to the right intended for John Brown.","(12:25) Carson Palmer pass to the right to David Johnson for 12 yards to the NO37. Tackled by Sheldon Rankins.","(13:08) Carson Palmer sacked at NO49 for a loss of 9 yards by Cameron Jordan.","(13:46) David Johnson rush to the right for 5 yards to the NO40. Tackled by Darryl Tapp.","(14:24) Carson Palmer pass to the left to J.J. Nelson for 6 yards to the NO45. Tackled by Jairus Byrd.","(15:00) David Johnson rush up the middle for 3 yards to the Ari49. Tackled by Nick Fairley.","(0:11) Carson Palmer pass to the left to David Johnson for 14 yards to the Ari46. Tackled by Jairus Byrd.","(0:11) New Orleans Saints timeout.","(0:52) Kerwynn Williams rush up the middle for no gain to the Ari32. Tackled by Roman Harper.","(1:26) Carson Palmer pass to the middle to Larry Fitzgerald for 7 yards to the Ari32. Tackled by Craig Robertson and Vonn Bell.","(1:33) Wil Lutz kicks off to the Ari1. Brittan Golden return for 24 yards to Ari25. Tackled by Tommylee Lewis.","(1:33) Wil Lutz extra point is good.","(1:41) Drew Brees pass to the right to Travaris Cadet for 10 yards for a TOUCHDOWN.","(1:45) Drew Brees incomplete pass to the left intended for Willie Snead defensed by Tony Jefferson.","(2:17) Tim Hightower rush to the left for a loss of 1 yard to the Ari10. Tackled by D.J. Swearinger.","(2:22) Penalty: Face Mask on Arizona (Markus Golden) 11 yards.","(2:53) Drew Brees pass to the left to Mark Ingram for a loss of 3 yards to the Ari20. Tackled by Sio Moore.","(3:22) Tim Hightower rush up the middle for 2 yards to the Ari17. Tackled by Josh Mauro.","(3:54) Drew Brees pass to the right to Travaris Cadet for 7 yards to the Ari19. Tackled by Sio Moore.","(4:32) Tim Hightower rush up the middle for 4 yards to the Ari26. Tackled by Tyrann Mathieu.","(4:42) Carson Palmer pass to the left to Larry Fitzgerald for no gain to the Ari30. Tackled by Paul Kruger. FUMBLE, recovered by NO (Craig Robertson). Tackled by Taylor Boggs.","(5:18) David Johnson rush up the middle for 4 yards to the Ari30. Tackled by Paul Kruger.","(5:27) Wil Lutz kicks off to the Ari0. Brittan Golden return for 26 yards to Ari26. Tackled by Chris Banjo.","(5:32) Wil Lutz 37 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(6:10) Mark Ingram rush up the middle for 3 yards to the Ari19. Tackled by Tony Jefferson.","(6:44) Drew Brees pass to the left to Tim Hightower for 5 yards to the Ari22. Tackled by Kevin Minter.","(7:24) Drew Brees sacked at Ari27 for a loss of 8 yards by Calais Campbell.","(8:03) Mark Ingram rush to the left for 11 yards to the Ari19. Tackled by Sio Moore.","(8:41) Tim Hightower rush to the left for 3 yards to the Ari30. Tackled by Sio Moore.","(8:58) Penalty: False Start on New Orleans (Senio Kelemete) -5 yards.","(9:20) Tim Hightower rush to the left for 9 yards to the Ari28. Tackled by Marcus Cooper.","(9:42) Drew Brees pass to the left to Brandin Cooks for 10 yards to the Ari37. Tackled by Marcus Cooper.","(10:15) Mark Ingram rush up the middle for no gain to the Ari47. Tackled by Tony Jefferson.","(10:48) Mark Ingram rush to the right for 5 yards to the Ari47. Tackled by Tony Jefferson and Kevin Minter.","(11:24) Mark Ingram rush up the middle for 5 yards to the NO48. Tackled by Chandler Jones.","(11:56) Drew Brees pass to the right to Coby Fleener for 4 yards to the NO43. Tackled by Patrick Peterson.","(12:22) Mark Ingram rush up the middle for 14 yards to the NO39. Tackled by Tony Jefferson and Tyrann Mathieu.","(12:27) Drew Brees incomplete pass to the left intended for Brandon Coleman defensed by Kevin Minter.","(12:27) Chandler Catanzaro kicks off to the endzone. Touchback.","(12:27) Chandler Catanzaro extra point is good.","(12:38) Kerwynn Williams rush to the right for 49 yards for a TOUCHDOWN.","(13:16) Carson Palmer pass to the left to Larry Fitzgerald for 11 yards to the NO49. Tackled by B.W. Webb.","(13:53) David Johnson rush to the left for 4 yards to the Ari40. Tackled by Nate Stupar.","(14:20) Carson Palmer pass to the left to Andre Ellington for 9 yards to the Ari36. Tackled by Vonn Bell.","(14:26) Carson Palmer incomplete pass to the left intended for J.J. Nelson defensed by B.W. Webb.","(14:51) Penalty: Offside on New Orleans (Vonn Bell) 5 yards.","(14:54) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald.","(15:00) Wil Lutz kicks off to the Ari-2. Brittan Golden return for 24 yards to Ari22. Tackled by Chris Banjo."]