["(0:05) Ryan Succop 53 yard field goal attempt is GOOD. Holder: Brett Kern.","(0:05) Kansas City Chiefs timeout.","(0:05) Marcus Mariota incomplete pass to the middle.","(0:21) Marcus Mariota pass to the right to Delanie Walker for 15 yards to the KC35. Tackled by Ron Parker.","(0:40) Marcus Mariota pass to the middle to Delanie Walker for 6 yards to the Ten50. Tackled by Ramik Wilson.","(0:47) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(1:07) Marcus Mariota pass to the left to Rishard Matthews for 19 yards to the Ten44. Tackled by Ron Parker.","(1:16) Dustin Colquitt punts for 42 yards to Ten25. No return.","(2:00) Alex Smith rush to the right for no gain to the KC33. Tackled by Al Woods.","(2:00) Two Minute Warning.","(2:25) Charcandrick West rush up the middle for 3 yards to the KC33. Tackled by Austin Johnson.","(3:12) Spencer Ware rush to the left for 5 yards to the KC30. Tackled by Jurrell Casey.","(3:12) Ryan Succop kicks off to the endzone. Touchback.","(3:12) Marcus Mariota 2 pt conversion pass is NO GOOD.","(3:14) Derrick Henry rush up the middle for 1 yard for a TOUCHDOWN.","(3:56) Marcus Mariota pass to the left to DeMarco Murray for 15 yards to the KC1. Tackled by Ramik Wilson.","(3:56) Kansas City Chiefs timeout.","(4:01) Marcus Mariota incomplete pass to the right intended for Rishard Matthews defensed by Steven Nelson.","(4:48) Derrick Henry rush to the left for a loss of 1 yard to the KC16. Tackled by Eric Berry.","(5:11) Marcus Mariota pass to the right to Kendall Wright for 6 yards to the KC15.","(5:46) Marcus Mariota pass to the middle to Delanie Walker for 14 yards to the KC21. Tackled by Steven Nelson.","(5:52) Marcus Mariota incomplete pass to the left intended for DeMarco Murray.","(6:00) Marcus Mariota incomplete pass to the right.","(6:07) Penalty: Pass Interference on Kansas City (Terrance Mitchell) 20 yards.","(6:46) Marcus Mariota pass to the middle to Delanie Walker for 16 yards to the Ten45. Tackled by Eric Berry.","(6:46) Tennessee Titans timeout.","(6:53) Marcus Mariota incomplete pass to the middle intended for Tajae Sharpe defensed by Terrance Mitchell.","(7:30) DeMarco Murray rush up the middle for 5 yards to the Ten29. Tackled by Ron Parker.","(7:54) Marcus Mariota pass to the left to DeMarco Murray for 12 yards to the Ten24. Tackled by Eric Berry.","(8:02) Dustin Colquitt punts for 49 yards to Ten12. No return.","(9:24) Penalty: Delay of Game on Kansas City (Dustin Colquitt) -5 yards.","(9:24) Spencer Ware rush up the middle for 1 yard to the KC44. Tackled by DaQuan Jones.","(10:05) Alex Smith pass to the left to Travis Kelce for 9 yards to the KC43. Tackled by Avery Williamson.","(10:25) Spencer Ware rush up the middle for a loss of 1 yard to the KC34. Tackled by Jurrell Casey.","(11:07) Tennessee Titans timeout.","(11:07) Alex Smith pass to the left to Spencer Ware for 2 yards to the KC35. Tackled by Derrick Morgan.","(11:49) Spencer Ware rush to the left for 8 yards to the KC33. Tackled by Wesley Woodyard.","(11:54) Alex Smith incomplete pass to the left intended for Tyreek Hill.","(11:54) Ryan Succop kicks off to the endzone. Touchback.","(11:59) Ryan Succop 39 yard field goal attempt is GOOD. Holder: Brett Kern.","(12:05) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(12:52) DeMarco Murray rush to the right for 3 yards to the KC21. Tackled by Steven Nelson.","(12:59) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe defensed by Terrance Mitchell.","(13:23) DeMarco Murray rush up the middle for 10 yards to the KC24. Tackled by Eric Berry.","(13:46) Marcus Mariota pass to the left to Tajae Sharpe for 4 yards to the KC34. Tackled by Terrance Mitchell.","(14:01) Marcus Mariota pass to the right to Rishard Matthews for 5 yards to the KC38. Tackled by Marcus Peters.","(14:56) DeMarco Murray rush up the middle for 7 yards to the KC43. Tackled by Ron Parker.","(14:56) DeMarco Murray rush to the right for 9 yards to the Ten50. Tackled by Ramik Wilson.","(15:00) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(0:20) Marcus Mariota pass to the middle to Kendall Wright for 13 yards to the Ten41. Tackled by Steven Nelson.","(0:27) Dustin Colquitt punts for 41 yards to Ten28. No return.","(0:33) Penalty: False Start on Kansas City (De'Anthony Thomas) -5 yards.","(0:33) Alex Smith incomplete pass to the left intended for De'Anthony Thomas.","(1:12) Charcandrick West rush to the right for no gain to the KC36. Tackled by Valentino Blake.","(1:54) Spencer Ware rush to the right for 1 yard to the KC36. Tackled by Austin Johnson.","(2:35) Spencer Ware rush to the right for 7 yards to the KC35. Tackled by Aaron Wallace.","(3:15) Spencer Ware rush to the left for 5 yards to the KC28. Tackled by Al Woods.","(3:22) Brett Kern punts for 35 yards to KC23. No return.","(4:03) DeMarco Murray rush to the left for no gain to the Ten42. Tackled by Chris Jones.","(4:44) Derrick Henry rush to the left for 3 yards to the Ten42. Tackled by D.J. Alexander.","(4:51) Marcus Mariota incomplete pass to the right intended for Rishard Matthews.","(5:13) Penalty: Encroachment on Kansas City (Chris Jones) 5 yards.","(5:52) Derrick Henry rush up the middle for 14 yards to the Ten34. Tackled by Eric Berry.","(6:02) Marcus Mariota incomplete pass to the right.","(6:08) Alex Smith pass intended for Jeremy Maclin INTERCEPTED by LeShaun Sims. No return. Touchback.","(6:13) Alex Smith incomplete pass to the left intended for Albert Wilson defensed by Brice McCain.","(6:56) Spencer Ware rush to the right for 3 yards to the Ten7. Tackled by Brice McCain.","(7:35) Alex Smith pass to the left to Jeremy Maclin for 4 yards to the Ten10. Tackled by Brian Orakpo.","(8:18) Spencer Ware rush to the left for 7 yards to the Ten14. Tackled by Mehdi Abdesmad.","(8:25) Tennessee Titans timeout.","(8:25) Alex Smith pass to the right to Jeremy Maclin for 17 yards to the Ten21. Tackled by Valentino Blake.","(9:13) Alex Smith sacked at Ten38 for a loss of 4 yards by Brian Orakpo.","(9:16) Alex Smith incomplete pass to the left intended for Chris Conley.","(9:38) Spencer Ware rush to the left for 4 yards to the Ten49. Tackled by Kevin Byard. Penalty: Unnecessary Roughness on Tennessee (Al Woods) 15 yards.","(9:46) Marcus Mariota pass intended for Delanie Walker INTERCEPTED by Ron Parker and returned for 1 yard.","(10:31) DeMarco Murray rush up the middle for 11 yards to the Ten35. Tackled by Ron Parker.","(11:11) DeMarco Murray rush up the middle for 4 yards to the Ten24. Tackled by D.J. Alexander.","(11:21) Dustin Colquitt punts for 37 yards to Ten0. Touchback.","(12:01) Alex Smith pass to the middle to Spencer Ware for 12 yards to the Ten37. Tackled by Wesley Woodyard.","(12:01) Penalty: False Start on Kansas City (Demetrius Harris) -5 yards.","(12:07) Alex Smith incomplete pass to the right intended for Tyreek Hill.","(12:50) Spencer Ware rush to the right for no gain to the Ten44. Tackled by Al Woods and Austin Johnson.","(13:32) Alex Smith pass to the right to Spencer Ware for 11 yards to the Ten44. Tackled by Daimion Stafford.","(14:14) Spencer Ware rush to the left for 9 yards to the KC45. Tackled by Daimion Stafford.","(14:55) Spencer Ware rush to the left for 6 yards to the KC36. Tackled by Brian Orakpo.","(15:00) Ryan Succop kicks off to the KC21. De'Anthony Thomas return for 9 yards to KC30. Tackled by Justin Staples.","(0:13) Marcus Mariota rush up the middle for a loss of 2 yards to the Ten29.","(0:13) Cairo Santos kicks off to the Ten6. Marc Mariani return for 25 yards to Ten31. Tackled by Anthony Sherman.","(0:17) Cairo Santos 34 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(0:24) Alex Smith incomplete pass to the right intended for Chris Conley.","(0:24) Kansas City Chiefs timeout.","(0:40) Alex Smith pass to the left to Jeremy Maclin for 4 yards to the Ten16. Tackled by Avery Williamson.","(0:45) Alex Smith incomplete pass to the middle intended for Travis Kelce defensed by Brice McCain.","(1:12) Alex Smith pass to the right to Travis Kelce for 16 yards to the Ten20. Tackled by Kevin Byard.","(1:17) Alex Smith incomplete pass to the right intended for Travis Kelce.","(1:21) Alex Smith incomplete pass to the left intended for Tyreek Hill.","(1:42) Alex Smith pass to the right to Chris Conley for 9 yards to the Ten36. Tackled by Valentino Blake.","(1:52) Brett Kern punts for 38 yards to Ten48. Tyreek Hill return for 3 yards to Ten45. Tackled by Nate Palmer and Antonio Andrews.","(1:52) Kansas City Chiefs timeout.","(2:00) DeMarco Murray rush up the middle for no gain to the Ten10. Tackled by Ron Parker.","(2:00) Two Minute Warning.","(2:18) DeMarco Murray rush to the left for 6 yards to the Ten10. Tackled by Ron Parker.","(3:01) Jalston Fowler rush up the middle for 3 yards to the Ten4. Tackled by Ramik Wilson.","(3:07) Spencer Ware rush up the middle for no gain to the Ten1. Tackled by Kevin Byard.","(3:48) Spencer Ware rush up the middle for no gain to the Ten1. Tackled by Wesley Woodyard.","(4:32) De'Anthony Thomas rush to the right for 4 yards to the Ten1. Tackled by Avery Williamson.","(5:12) Charcandrick West rush up the middle for 3 yards to the Ten5. Tackled by Karl Klug and Austin Johnson.","(5:12) Kansas City Chiefs timeout.","(5:52) Alex Smith pass to the right to Jeremy Maclin for 13 yards to the Ten8. Tackled by Valentino Blake.","(5:57) Alex Smith incomplete pass to the right intended for Anthony Sherman.","(6:40) Alex Smith pass to the right to De'Anthony Thomas for 4 yards to the Ten21. Tackled by Brice McCain.","(7:15) Alex Smith pass to the right to Travis Kelce for 16 yards to the Ten25. Tackled by Da'Norris Searcy.","(7:53) Charcandrick West rush to the right for a loss of 1 yard to the Ten41. Tackled by Wesley Woodyard.","(8:05) Marcus Mariota sacked at Ten36 for no gain by Dontari Poe. FUMBLE, recovered by KC (Ramik Wilson).","(8:50) Marcus Mariota pass to the right to Delanie Walker for 4 yards to the Ten36. Tackled by Daniel Sorensen.","(9:33) DeMarco Murray rush to the left for no gain to the Ten32. Tackled by Ramik Wilson.","(9:45) Dustin Colquitt punts for 47 yards to Ten16. Marc Mariani return for 16 yards to Ten32. Tackled by Frank Zombo.","(10:25) Alex Smith pass to the right to Jeremy Maclin for no gain to the KC37. Tackled by Brice McCain.","(11:12) Alex Smith pass to the right to Chris Conley for 2 yards to the KC37. Tackled by Rashad Johnson.","(11:52) Spencer Ware rush to the left for 5 yards to the KC35. Tackled by Al Woods.","(11:58) Ryan Succop kicks off to the KC17. Albert Wilson return for 13 yards to KC30. Tackled by Phillip Supernaw.","(11:58) Ryan Succop extra point is good.","(12:05) Derrick Henry rush up the middle for 4 yards for a TOUCHDOWN.","(12:49) Derrick Henry rush to the left for 4 yards to the KC4. Tackled by D.J. Alexander.","(13:31) Derrick Henry rush to the left for 7 yards to the KC8. Tackled by D.J. Alexander.","(14:18) Marcus Mariota pass to the right to Rishard Matthews for 46 yards to the KC15. Tackled by Eric Berry.","(15:00) Derrick Henry rush to the left for 15 yards to the Ten39. Tackled by Eric Berry.","(0:31) Derrick Henry rush to the left for 11 yards to the Ten24. Tackled by Tamba Hali and Steven Nelson.","(0:44) Dustin Colquitt punts for 57 yards to Ten7. Marc Mariani return for 6 yards to Ten13. Tackled by Daniel Sorensen.","(0:50) Alex Smith incomplete pass to the middle intended for Jeremy Maclin defensed by Brian Orakpo.","(1:28) Alex Smith rush to the left for 1 yard to the KC36. Tackled by Brian Orakpo.","(1:34) Alex Smith incomplete pass to the left intended for James O'Shaughnessy.","(1:45) Brett Kern punts for 37 yards to KC35. Tyreek Hill - no return. Tackled by Antonio Andrews.","(2:23) Marcus Mariota pass to the right to Tajae Sharpe for 6 yards to the Ten28. Tackled by Marcus Peters.","(3:09) Marcus Mariota pass to the left to DeMarco Murray for 7 yards to the Ten22. Tackled by Eric Berry and Terrance Mitchell.","(3:42) Penalty: Holding on Tennessee (Quinton Spain) -10 yards.","(4:24) DeMarco Murray rush to the left for no gain to the Ten25. Tackled by Ron Parker.","(4:24) Cairo Santos kicks off to the endzone. Touchback.","(4:24) Cairo Santos extra point is good.","(4:32) Alex Smith rush to the left for 10 yards for a TOUCHDOWN.","(5:12) Alex Smith rush up the middle for no gain to the Ten5. FUMBLE, recovered by KC (Spencer Ware).","(5:57) Spencer Ware rush to the right for 4 yards to the Ten5. Tackled by Al Woods.","(6:44) Alex Smith pass to the right to Jeremy Maclin for 44 yards to the Ten9. Tackled by Brice McCain.","(7:07) Marcus Mariota pass to the right to Rishard Matthews for 35 yards to the KC5. Tackled by Eric Berry. FUMBLE, recovered by KC (Daniel Sorensen) and returned for 55 yards. Tackled by Josh Kline.","(7:54) Marcus Mariota pass to the left to Delanie Walker for no gain to the KC40. Tackled by Ramik Wilson.","(8:34) DeMarco Murray rush up the middle for 5 yards to the KC40. Tackled by Ramik Wilson.","(9:18) DeMarco Murray rush up the middle for 12 yards to the KC45. Tackled by Ron Parker.","(9:26) Marcus Mariota incomplete pass to the left.","(10:09) DeMarco Murray rush up the middle for 8 yards to the Ten43. Tackled by Steven Nelson.","(10:55) DeMarco Murray rush to the left for 2 yards to the Ten35. Tackled by Steven Nelson.","(11:36) DeMarco Murray rush to the left for 7 yards to the Ten33. Tackled by Steven Nelson.","(11:43) Cairo Santos kicks off to the Ten3. Marc Mariani return for 23 yards to Ten26. Tackled by Anthony Sherman.","(11:43) Cairo Santos extra point is good.","(11:55) Tyreek Hill rush to the left for 68 yards for a TOUCHDOWN.","(12:34) Spencer Ware rush to the left for 6 yards to the KC32.","(12:44) Brett Kern punts for 33 yards to KC21. Tyreek Hill - no return. FUMBLE, recovered by KC (Tyreek Hill).","(12:51) Marcus Mariota incomplete pass to the left intended for Rishard Matthews defensed by Terrance Mitchell.","(13:36) DeMarco Murray rush to the left for no gain to the Ten46. Tackled by Eric Berry.","(14:17) Marcus Mariota pass to the left to DeMarco Murray for a loss of 1 yard to the Ten46. Tackled by Steven Nelson.","(14:57) Marcus Mariota pass to the left to DeMarco Murray for 19 yards to the Ten47. Tackled by Eric Berry.","(15:00) Cairo Santos kicks off to the Ten13. Marc Mariani return for 15 yards to Ten28. Tackled by Eric Murray."]