["(0:12) Ryan Fitzpatrick rush up the middle for no gain to the NYJ44.","(0:12) Cody Parkey onside kickoff to the NYJ47. Onside kick recovered by receiving team by Brandon Marshall.","(0:12) Josh McCown 2 pt conversion pass to Terrelle Pryor Sr. is GOOD.","(0:15) Josh McCown pass to the right to Andrew Hawkins for 1 yard for a TOUCHDOWN.","(0:19) Josh McCown incomplete pass to the right intended for Gary Barnidge.","(0:19) Cleveland Browns timeout.","(0:29) Isaiah Crowell rush to the right for 1 yard to the NYJ1. Tackled by David Harris and Muhammad Wilkerson.","(1:00) Josh McCown pass to the right to Isaiah Crowell for 16 yards to the NYJ2. Tackled by David Harris and Rontez Miles.","(1:07) Josh McCown incomplete pass to the right intended for Gary Barnidge defensed by Darrelle Revis.","(1:34) Josh McCown pass to the middle to Duke Johnson Jr. for 26 yards to the NYJ18. Tackled by Calvin Pryor.","(2:00) Josh McCown pass to the right to Duke Johnson Jr. for 6 yards to the NYJ44. Tackled by Jarvis Jenkins.","(2:00) Two Minute Warning.","(2:06) Josh McCown pass to the left to Ricardo Louis for 7 yards to the Cle50. Tackled by Darrelle Revis.","(2:11) Josh McCown incomplete pass to the left intended for Andrew Hawkins.","(2:45) Josh McCown pass to the left to Duke Johnson Jr. for 17 yards to the Cle43. Tackled by Darrelle Revis.","(3:19) Duke Johnson Jr. rush to the left for no gain to the Cle26. Tackled by Darrelle Revis.","(3:25) Josh McCown incomplete pass to the middle intended for Ricardo Louis.","(3:53) Josh McCown pass to the middle to Gary Barnidge for 10 yards to the Cle26. Tackled by Marcus Williams.","(4:00) Josh McCown incomplete pass to the right intended for Duke Johnson Jr..","(4:04) Nick Folk kicks off to the Cle1. George Atkinson III return for 15 yards to Cle16. Tackled by Josh Martin.","(4:08) Nick Folk 24 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(4:08) Cleveland Browns timeout.","(4:18) Ryan Fitzpatrick pass to the right to Quincy Enunwa for a loss of 1 yard to the Cle6. Tackled by Joe Schobert.","(4:18) Cleveland Browns timeout.","(4:29) Matt Forte rush to the left for 3 yards to the Cle5. Tackled by Danny Shelton.","(5:13) Matt Forte rush to the right for no gain to the Cle8. Tackled by Christian Kirksey.","(5:19) Josh McCown pass intended for Duke Johnson Jr. INTERCEPTED by Lorenzo Mauldin defensed by Calvin Pryor. No return. Tackled by Cameron Erving.","(5:22) Josh McCown incomplete pass to the left intended for Gary Barnidge defensed by Calvin Pryor.","(5:27) Josh McCown incomplete pass to the right intended for Randall Telfer.","(5:27) Penalty: Offside on New York (Sheldon Richardson) 5 yards.","(5:36) Lachlan Edwards punts for 48 yards to Cle1. No return.","(6:18) Matt Forte rush to the left for 4 yards to the Cle49. Tackled by Tyrone Holmes and Emmanuel Ogbah.","(6:47) Bilal Powell rush to the left for 8 yards to the Cle43. Tackled by Derrick Kindred. Penalty: Holding on New York (James Carpenter) -10 yards.","(6:47) Penalty: False Start on New York (Ryan Clady) -5 yards.","(6:47) New York Jets timeout.","(6:52) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall defensed by Joe Haden.","(7:35) Matt Forte rush to the left for a loss of 1 yard to the Cle46. Tackled by Christian Kirksey and Xavier Cooper.","(8:21) Ryan Fitzpatrick pass to the middle to Brandon Marshall for 31 yards to the Cle45.","(9:03) Matt Forte rush to the right for no gain to the NYJ24. Tackled by Danny Shelton.","(9:09) Josh McCown pass intended for Terrelle Pryor Sr. INTERCEPTED by Marcus Gilchrist. No return. Tackled by Terrelle Pryor Sr..","(9:38) Isaiah Crowell rush to the right for 5 yards to the Cle30. Tackled by Julian Stanford and Marcus Gilchrist.","(9:38) Nick Folk kicks off to the endzone. Touchback.","(9:38) Nick Folk extra point is good.","(9:42) Matt Forte rush to the right for 2 yards for a TOUCHDOWN.","(10:28) Matt Forte rush to the right for no gain to the Cle2. Tackled by Jamie Meder.","(11:14) Ryan Fitzpatrick pass to the right to Matt Forte for 15 yards to the Cle2. Tackled by Joe Haden.","(11:53) Matt Forte rush to the right for 5 yards to the Cle17. Tackled by Tyrone Holmes and Derrick Kindred.","(12:34) Bilal Powell rush to the left for 20 yards to the Cle22. Tackled by Derrick Kindred.","(13:14) Ryan Fitzpatrick pass to the right to Robby Anderson for 6 yards to the Cle42. Tackled by Jamar Taylor.","(13:55) Matt Forte rush to the right for 6 yards to the Cle48. Tackled by Jamie Meder.","(14:56) Ryan Fitzpatrick rush up the middle for 1 yard to the NYJ46. Tackled by Christian Kirksey.","(14:56) Bilal Powell rush to the right for 9 yards to the NYJ45. Tackled by Christian Kirksey.","(15:00) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa.","(0:33) Ryan Fitzpatrick pass to the right to Brandon Marshall for 11 yards to the NYJ36. Tackled by Joe Haden.","(1:00) Matt Forte rush to the right for 6 yards to the NYJ25. Tackled by Tracy Howard.","(1:05) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(1:12) Britton Colquitt punts for 59 yards to NYJ19. No return.","(1:21) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(1:58) Isaiah Crowell rush to the right for 3 yards to the Cle22. Tackled by Marcus Williams.","(2:05) Josh McCown incomplete pass to the left intended for Andrew Hawkins.","(2:11) Nick Folk kicks off to the Cle-5. Ricardo Louis return for 24 yards to Cle19. Tackled by Josh Martin and Nick Marshall.","(2:11) Nick Folk extra point is good.","(2:15) Matt Forte rush to the left for 4 yards for a TOUCHDOWN.","(2:15) New York Jets timeout.","(2:59) Ryan Fitzpatrick pass to the middle to Robby Anderson for 9 yards to the Cle4. Tackled by Tramon Williams.","(3:03) Ryan Fitzpatrick incomplete pass to the middle intended for Quincy Enunwa.","(3:07) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(3:49) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 57 yards to the Cle13. Tackled by Jamar Taylor.","(4:31) Ryan Fitzpatrick pass to the left to Robby Anderson for 16 yards to the NYJ30. Tackled by Jamar Taylor.","(4:35) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(5:14) Matt Forte rush to the right for a loss of 2 yards to the NYJ14. Tackled by Emmanuel Ogbah.","(5:21) Britton Colquitt punts for 21 yards to NYJ16. No return.","(5:24) Josh McCown incomplete pass to the right intended for Ricardo Louis defensed by Darryl Roberts.","(5:29) Josh McCown incomplete pass to the right intended for Randall Telfer.","(5:43) Josh McCown rush up the middle for no gain to the NYJ34. FUMBLE, recovered by Cle.","(6:14) Isaiah Crowell rush to the right for 11 yards to the NYJ34. Tackled by Marcus Gilchrist.","(6:51) Josh McCown pass to the right to Ricardo Louis for 25 yards to the NYJ45. Tackled by Marcus Gilchrist.","(7:33) Josh McCown pass to the left to Seth DeValve for 5 yards to the Cle30. Tackled by Jordan Jenkins.","(8:15) Isaiah Crowell rush to the right for no gain to the Cle25. Tackled by Lorenzo Mauldin and Leonard Williams.","(8:15) Nick Folk kicks off to the endzone. Touchback.","(8:15) Nick Folk extra point is good.","(8:24) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 24 yards for a TOUCHDOWN.","(9:44) Matt Forte rush to the left for 1 yard to the Cle24. Tackled by Jamie Meder and Emmanuel Ogbah.","(9:44) Ryan Fitzpatrick pass to the middle to Brandon Marshall for 6 yards to the Cle25. Tackled by Christian Kirksey.","(10:23) Matt Forte rush to the right for 6 yards to the Cle31. Tackled by Christian Kirksey and Demario Davis.","(10:55) Ryan Fitzpatrick pass to the right to Bilal Powell for 3 yards to the Cle37. Tackled by Christian Kirksey.","(11:28) Ryan Fitzpatrick rush up the middle for 8 yards to the Cle40. Tackled by Tramon Williams.","(12:11) Ryan Fitzpatrick pass to the right to Matt Forte for 1 yard to the Cle48. Tackled by Joe Schobert.","(12:48) Ryan Fitzpatrick pass to the left to Brandon Marshall for 20 yards to the Cle49. Tackled by Ibraheim Campbell.","(13:27) Bilal Powell rush to the right for a loss of 1 yard to the NYJ31. Tackled by Demario Davis and Emmanuel Ogbah.","(14:11) Bilal Powell rush to the right for 5 yards to the NYJ32. Tackled by Xavier Cooper.","(14:17) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa defensed by Jamar Taylor.","(14:55) Matt Forte rush to the left for 5 yards to the NYJ27. Tackled by Tracy Howard.","(15:00) Cody Parkey kicks off to the NYJ-2. Nick Marshall return for 24 yards to NYJ22. Tackled by Ricardo Louis.","(0:38) Cody Parkey 27 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(0:38) Josh McCown rush up the middle for 7 yards to the NYJ9. Tackled by Leonard Williams.","(0:38) Cleveland Browns timeout.","(0:43) Josh McCown sacked at NYJ16 for a loss of 6 yards by Muhammad Wilkerson.","(0:47) Josh McCown incomplete pass to the left intended for Andrew Hawkins.","(0:47) Cleveland Browns timeout.","(0:55) Duke Johnson Jr. rush to the right for 16 yards to the NYJ10. Tackled by Marcus Gilchrist.","(1:25) Josh McCown pass to the left to Duke Johnson Jr. for 32 yards to the NYJ26. Tackled by David Harris.","(1:34) Lachlan Edwards punts for 33 yards to Cle42. No return.","(1:39) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa.","(1:43) Ryan Fitzpatrick incomplete pass to the middle intended for Quincy Enunwa defensed by Derrick Kindred.","(1:43) Cleveland Browns timeout.","(1:51) Ryan Fitzpatrick sacked at NYJ25 for no gain by Tyrone Holmes.","(1:51) Cody Parkey kicks off to the endzone. Touchback.","(1:51) Cody Parkey extra point is good.","(1:55) Isaiah Crowell rush to the right for 1 yard for a TOUCHDOWN.","(2:00) Penalty: Pass Interference on New York (Calvin Pryor) 12 yards.","(2:00) Two Minute Warning.","(2:46) Kevin Hogan pass to the right to Andrew Hawkins for 1 yard to the NYJ13. Tackled by Darryl Roberts.","(3:24) Josh McCown rush to the left for 3 yards to the NYJ14.","(4:01) Josh McCown pass to the left to Terrelle Pryor Sr. for 10 yards to the NYJ17. Tackled by Darrelle Revis.","(4:41) Josh McCown pass to the left to Isaiah Crowell for 18 yards to the NYJ27. Tackled by Calvin Pryor.","(4:46) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(5:25) Duke Johnson Jr. rush to the left for 16 yards to the NYJ45. Tackled by Marcus Gilchrist.","(6:01) Josh McCown pass to the right to Terrelle Pryor Sr. for 9 yards to the Cle39. Tackled by Darrelle Revis.","(6:31) Isaiah Crowell rush to the left for no gain to the Cle30. Tackled by Jarvis Jenkins.","(6:36) Lachlan Edwards punts for 34 yards to Cle30. No return.","(6:42) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa defensed by Carl Nassib.","(7:26) Matt Forte rush to the left for 4 yards to the NYJ36. Tackled by Christian Kirksey and Tramon Williams.","(8:03) Matt Forte rush to the right for 2 yards to the NYJ32. Tackled by Jamie Meder and Demario Davis.","(8:43) Matt Forte rush to the right for 15 yards to the NYJ30. Tackled by Christian Kirksey.","(8:50) Britton Colquitt punts for 34 yards to NYJ15. No return.","(8:55) Josh McCown incomplete pass to the left intended for Terrelle Pryor Sr..","(9:21) Josh McCown pass to the left to Gary Barnidge for no gain to the NYJ49. Tackled by David Harris.","(9:26) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(9:53) Josh McCown pass to the right to Terrelle Pryor Sr. for 15 yards to the NYJ49. Tackled by Darrelle Revis.","(10:34) Josh McCown pass to the right to Terrelle Pryor Sr. for 8 yards to the Cle36. Tackled by Darrelle Revis.","(10:39) Josh McCown incomplete pass to the left intended for Terrelle Pryor Sr..","(10:50) Lachlan Edwards punts for 57 yards to Cle13. Duke Johnson Jr. return for 15 yards to Cle28. Tackled by Taiwan Jones.","(10:55) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa.","(10:59) Ryan Fitzpatrick incomplete pass to the right intended for Matt Forte defensed by Carl Nassib.","(11:40) Matt Forte rush to the left for a loss of 4 yards to the NYJ30. Tackled by Christian Kirksey.","(11:53) Britton Colquitt punts for 52 yards to NYJ19. Jalin Marshall return for 15 yards to NYJ34. Tackled by George Atkinson III.","(12:38) Josh McCown pass to the right to Duke Johnson Jr. for 4 yards to the Cle29. Tackled by Mike Catapano.","(12:38) Josh McCown incomplete pass to the right intended for Ricardo Louis.","(12:44) Josh McCown incomplete pass to the right intended for Ricardo Louis.","(12:44) Nick Folk kicks off to the endzone. Touchback.","(12:44) Nick Folk extra point is good.","(12:51) Bilal Powell rush to the left for 35 yards for a TOUCHDOWN.","(12:55) Ryan Fitzpatrick incomplete pass to the middle intended for Bilal Powell.","(12:58) Ryan Fitzpatrick incomplete pass to the right intended for Bilal Powell defensed by Carl Nassib.","(13:42) Matt Forte rush to the right for 18 yards to the Cle35. Tackled by Demario Davis.","(14:22) Matt Forte rush to the left for 2 yards to the NYJ47. Tackled by Christian Kirksey.","(15:00) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 13 yards to the NYJ45. Tackled by Ibraheim Campbell.","(0:40) Matt Forte rush to the left for 3 yards to the NYJ32. Tackled by Demario Davis.","(0:44) Penalty: Illegal Contact on Cleveland (Joe Haden) 5 yards.","(0:50) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall defensed by Joe Haden.","(1:35) Penalty: Too Many Men on Field on Cleveland 5 yards.","(1:35) Ryan Fitzpatrick sacked at NYJ19 for a loss of 6 yards by Joe Schobert and Danny Shelton.","(2:25) Ryan Fitzpatrick pass to the right to Charone Peake for 13 yards to the NYJ25. Tackled by Tramon Williams.","(2:32) Penalty: False Start on New York (Ryan Clady) -5 yards.","(2:32) Ryan Fitzpatrick incomplete pass to the right intended for Robby Anderson defensed by Jamar Taylor.","(3:11) Ryan Fitzpatrick pass to the left to Brandon Bostick for 4 yards to the NYJ17. Tackled by Christian Kirksey.","(3:11) Cody Parkey kicks off to the NYJ-5. Jalin Marshall return for 18 yards to NYJ13. Tackled by Ed Reynolds.","(3:15) Cody Parkey 41 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(3:20) Josh McCown incomplete pass to the right intended for Andrew Hawkins.","(3:53) Isaiah Crowell rush to the right for 5 yards to the NYJ23. Tackled by Rontez Miles.","(4:27) Kevin Hogan pass to the right to Jordan Payton for 3 yards to the NYJ28. Tackled by Rontez Miles and Darrelle Revis.","(4:58) Josh McCown pass to the middle to Andrew Hawkins for 17 yards to the NYJ31. Tackled by Marcus Gilchrist.","(5:39) Josh McCown pass to the right to Duke Johnson Jr. for 2 yards to the NYJ48. Tackled by Julian Stanford.","(6:17) Duke Johnson Jr. rush to the right for a loss of 3 yards to the Cle50. Tackled by Leonard Williams.","(6:53) Josh McCown pass to the right to Terrelle Pryor Sr. for 35 yards to the NYJ47. Tackled by Darrelle Revis.","(7:05) Lachlan Edwards punts for 57 yards to Cle5. Duke Johnson Jr. return for 13 yards to Cle18. Tackled by Julian Stanford and Charone Peake.","(7:10) Ryan Fitzpatrick incomplete pass to the right intended for Robby Anderson defensed by Jamar Taylor.","(7:56) Matt Forte rush to the right for a loss of 2 yards to the NYJ38. Tackled by Demario Davis and Emmanuel Ogbah.","(8:02) Ryan Fitzpatrick incomplete pass to the right intended for Robby Anderson defensed by Jamar Taylor.","(8:13) Britton Colquitt punts for 41 yards to NYJ40. Jalin Marshall - no return. Tackled by Christian Kirksey.","(8:46) Josh McCown pass to the right to Andrew Hawkins for 7 yards to the Cle19. Tackled by Calvin Pryor.","(9:29) Isaiah Crowell rush to the left for a loss of 1 yard to the Cle12. Tackled by Julian Stanford.","(9:31) Josh McCown incomplete pass to the left intended for Gary Barnidge.","(9:43) Lachlan Edwards punts for 53 yards to Cle13. No return.","(10:21) Ryan Fitzpatrick rush to the right for 4 yards to the NYJ34. Tackled by Briean Boddy-Calhoun.","(11:05) Matt Forte rush to the right for 1 yard to the NYJ30. Tackled by Jamie Meder.","(11:45) Matt Forte rush to the left for 4 yards to the NYJ29. Tackled by Emmanuel Ogbah.","(11:45) Cody Parkey kicks off to the endzone. Touchback.","(11:45) Cody Parkey extra point is good.","(11:52) Josh McCown pass to the right to Andrew Hawkins for 5 yards for a TOUCHDOWN.","(12:31) Isaiah Crowell rush to the left for 4 yards to the NYJ5. Tackled by Leonard Williams.","(13:08) Josh McCown pass to the left to Rashard Higgins for 10 yards to the NYJ9. Tackled by Darryl Roberts.","(13:12) Josh McCown incomplete pass to the left intended for Ricardo Louis.","(13:46) Josh McCown pass to the left to Terrelle Pryor Sr. for 24 yards to the NYJ19. Tackled by Marcus Gilchrist.","(14:26) Isaiah Crowell rush to the right for no gain to the NYJ43. Tackled by Lorenzo Mauldin and Julian Stanford.","(14:30) Josh McCown incomplete pass to the left intended for Randall Telfer.","(15:00) Josh McCown pass to the left to Gary Barnidge for 32 yards to the NYJ43. Tackled by Julian Stanford.","(15:00) Nick Folk kicks off to the endzone. Touchback."]