["(0:02) Josh McCown incomplete pass to the right intended for Duke Johnson Jr. defensed by Artie Burns.","(0:02) Cleveland Browns timeout.","(0:08) Josh McCown pass to the right to Seth DeValve for 8 yards to the Pit14. Tackled by Jarvis Jones.","(0:13) Josh McCown incomplete pass to the right intended for Ricardo Louis.","(0:22) Josh McCown rush to the right for 5 yards to the Pit22.","(0:24) Josh McCown incomplete pass to the right intended for Corey Coleman defensed by Mike Mitchell.","(0:27) Cleveland Browns timeout.","(0:31) Isaiah Crowell rush to the right for 2 yards to the Pit27. Tackled by Ryan Shazier and Ricardo Mathews.","(0:35) Josh McCown incomplete pass to the right intended for Corey Coleman defensed by Artie Burns.","(0:43) Josh McCown incomplete pass to the left intended for Terrelle Pryor Sr..","(1:06) Josh McCown pass to the right to Isaiah Crowell for 9 yards to the Pit29. Tackled by Mike Mitchell.","(1:23) Penalty: Roughing Passer on Pittsburgh (Daniel McCullers) 15 yards.","(1:28) Josh McCown incomplete pass to the left intended for Corey Coleman.","(1:32) Josh McCown incomplete pass to the left intended for Gary Barnidge defensed by Mike Mitchell.","(1:36) Josh McCown incomplete pass to the left intended for Corey Coleman defensed by Daniel McCullers.","(2:00) Josh McCown pass to the middle to Terrelle Pryor Sr. for 12 yards to the Cle47. Tackled by Ross Cockrell.","(2:00) Two Minute Warning.","(2:16) Josh McCown pass to the middle to Terrelle Pryor Sr. for 8 yards to the Cle35. Tackled by Lawrence Timmons.","(2:22) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(2:55) Josh McCown pass to the right to Isaiah Crowell for 1 yard to the Cle27. Tackled by Artie Burns.","(3:36) Josh McCown rush to the right for 6 yards to the Cle26. Tackled by Stephon Tuitt.","(3:36) Penalty: Delay of Game on Cleveland (Josh McCown) -5 yards.","(3:36) Chris Boswell kicks off to the endzone. Touchback.","(3:36) Chris Boswell extra point is good.","(3:44) Josh McCown sacked at Cle0 for a loss of 13 yards by Ryan Shazier. FUMBLE, recovered by Pit (Javon Hargrave) for a TOUCHDOWN.","(3:49) Josh McCown incomplete pass to the middle intended for Terrelle Pryor Sr..","(4:02) Jordan Berry punts for 57 yards to Cle23. Duke Johnson Jr. - no return. Tackled by Anthony Chickillo and Robert Golden. Penalty: Illegal Block on Cleveland (Briean Boddy-Calhoun) -10 yards.","(4:07) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(4:51) Le'Veon Bell rush to the left for no gain to the Pit20. Tackled by Derrick Kindred and Jamie Collins.","(5:36) Le'Veon Bell rush to the left for 5 yards to the Pit20. Tackled by Cam Johnson.","(5:43) Britton Colquitt punts for 44 yards to Pit15. No return.","(5:49) Josh McCown incomplete pass to the left intended for Rashard Higgins.","(6:18) Josh McCown pass to the left to Corey Coleman for 16 yards to the Cle41. Tackled by Mike Mitchell.","(6:58) Josh McCown sacked at Cle25 for a loss of 11 yards by Lawrence Timmons.","(7:28) Penalty: Illegal Use of Hands on Pittsburgh (Lawrence Timmons) 5 yards.","(7:32) Josh McCown incomplete pass to the right intended for Gary Barnidge defensed by Sean Davis.","(8:08) Josh McCown sacked at Cle31 for a loss of 7 yards by Stephon Tuitt.","(8:19) Jordan Berry punts for 50 yards to Cle20. Duke Johnson Jr. return for 18 yards to Cle38. Tackled by Sammie Coates.","(8:25) Ben Roethlisberger incomplete pass to the right intended for Jesse James.","(9:10) Le'Veon Bell rush to the right for 2 yards to the Pit30. Tackled by Christian Kirksey and Carl Nassib.","(9:45) Ben Roethlisberger pass to the left to Antonio Brown for 3 yards to the Pit28. Tackled by Jamar Taylor.","(9:45) Cody Parkey kicks off to the endzone. Touchback.","(9:45) Cody Parkey extra point is NO GOOD.","(9:50) Josh McCown pass to the middle to Gary Barnidge for 14 yards for a TOUCHDOWN.","(10:38) Josh McCown pass to the left to Isaiah Crowell for a loss of 4 yards to the Pit14. Tackled by Ryan Shazier.","(11:23) Josh McCown pass to the left to Isaiah Crowell for 4 yards to the Pit10. Tackled by Ryan Shazier.","(12:11) Josh McCown pass to the right to Duke Johnson Jr. for 20 yards to the Pit14. Tackled by Artie Burns.","(12:45) Josh McCown pass to the middle to Terrelle Pryor Sr. for 15 yards to the Pit34. Tackled by Ross Cockrell.","(12:52) Penalty: False Start on Cleveland (Cameron Erving) -5 yards.","(12:56) Penalty: Holding on Cleveland (Cameron Erving) -10 yards.","(13:02) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(13:30) Josh McCown pass to the middle to Gary Barnidge for 9 yards to the Pit34. Tackled by Lawrence Timmons.","(14:16) Josh McCown sacked at Pit43 for a loss of 5 yards by Arthur Moats.","(15:00) Josh McCown pass to the left to Isaiah Crowell for 3 yards to the Pit38. Tackled by Artie Burns.","(0:00) Josh McCown pass to the left to Corey Coleman for 3 yards to the Pit41. Tackled by Sean Davis.","(0:03) Cody Kessler pass to the right to Corey Coleman for 16 yards to the Cle41. Tackled by Mike Mitchell. Penalty: Unnecessary Roughness on Pittsburgh (Lawrence Timmons) 15 yards.","(0:03) Chris Boswell kicks off to the endzone. Touchback.","(0:04) Chris Boswell 22 yard field goal attempt is GOOD. Holder: Jordan Berry.","(0:10) Ben Roethlisberger incomplete pass to the left intended for Ladarius Green defensed by Derrick Kindred.","(0:10) Pittsburgh Steelers timeout.","(0:58) Le'Veon Bell rush to the right for 3 yards to the Cle4. Tackled by Christian Kirksey.","(1:07) Ben Roethlisberger incomplete pass to the right intended for Jesse James.","(2:08) Le'Veon Bell rush to the right for 11 yards to the Cle7. Tackled by Ed Reynolds.","(2:08) Le'Veon Bell rush to the right for 12 yards to the Cle8. Tackled by Marcus Burley and Derrick Kindred. Penalty: Holding on Pittsburgh (Cobi Hamilton) -10 yards.","(2:13) Penalty: Holding on Cleveland (Christian Kirksey) 5 yards.","(2:57) Le'Veon Bell rush to the right for 2 yards to the Cle25. Tackled by Danny Shelton.","(3:37) Ben Roethlisberger pass to the left to Antonio Brown for 13 yards to the Cle27.","(4:18) Ben Roethlisberger pass to the right to Antonio Brown for 11 yards to the Cle40. Tackled by Marcus Burley.","(5:04) Le'Veon Bell rush to the left for 2 yards to the Pit49. Tackled by Joe Schobert.","(5:48) Le'Veon Bell rush to the right for 6 yards to the Pit47. Tackled by Christian Kirksey.","(6:34) Le'Veon Bell rush to the left for 4 yards to the Pit41. Tackled by Jamie Meder.","(7:10) Ben Roethlisberger pass to the right to Le'Veon Bell for 5 yards to the Pit37.","(8:00) Le'Veon Bell rush to the left for 7 yards to the Pit32. Tackled by Ed Reynolds and Demario Davis.","(8:05) Ben Roethlisberger incomplete pass to the right intended for Le'Veon Bell.","(8:05) Cody Parkey kicks off to the endzone. Touchback.","(8:05) Cody Parkey 24 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(8:54) Cody Kessler rush to the right for 2 yards to the Pit6. Tackled by Stephon Tuitt.","(8:54) Cleveland Browns timeout.","(9:39) Cody Kessler sacked at Pit8 for a loss of 5 yards by James Harrison.","(10:14) Isaiah Crowell rush to the right for a loss of 2 yards to the Pit3. Tackled by Daniel McCullers and Stephon Tuitt.","(10:43) Cody Kessler pass to the left to Terrelle Pryor Sr. for 26 yards to the Pit1. Tackled by Ross Cockrell.","(10:48) Cody Kessler incomplete pass to the middle intended for Gary Barnidge defensed by Ryan Shazier.","(11:30) Isaiah Crowell rush to the left for 1 yard to the Pit27. Tackled by Anthony Chickillo.","(11:37) Cody Kessler incomplete pass to the left intended for Corey Coleman.","(12:20) Cody Kessler pass to the middle to Duke Johnson Jr. for 22 yards to the Pit28. Tackled by Lawrence Timmons and Mike Mitchell.","(12:56) Cody Kessler pass to the right to Duke Johnson Jr. for 4 yards to the Cle50. Tackled by Ryan Shazier.","(13:05) Cody Kessler incomplete pass to the left.","(13:15) Jordan Berry punts for 43 yards to Cle32. Duke Johnson Jr. return for 14 yards to Cle46. Tackled by Sammie Coates.","(13:47) Le'Veon Bell rush to the right for 7 yards to the Pit25. Tackled by Briean Boddy-Calhoun.","(13:51) Ben Roethlisberger incomplete pass to the right intended for Cobi Hamilton defensed by Briean Boddy-Calhoun.","(14:34) Ben Roethlisberger pass to the right to Antonio Brown for 3 yards to the Pit18. Tackled by Christian Kirksey.","(15:00) Penalty: Holding on Pittsburgh (Jesse James) -10 yards.","(15:00) Cody Parkey kicks off to the endzone. Touchback.","(15:00) Ben Roethlisberger 2 pt conversion pass to David Johnson is GOOD.","(0:00) Le'Veon Bell rush to the left for 1 yard for a TOUCHDOWN.","(0:00) Penalty: Pass Interference on Cleveland (Joe Haden) 0 yards.","(0:05) Penalty: Holding on Cleveland (Briean Boddy-Calhoun) 2 yards.","(0:10) Ben Roethlisberger incomplete pass to the left intended for Cobi Hamilton.","(0:10) Pittsburgh Steelers timeout.","(0:17) Ben Roethlisberger pass to the left to Eli Rogers for 8 yards to the Cle3. Tackled by Joe Haden.","(0:20) Ben Roethlisberger incomplete pass to the left intended for Cobi Hamilton defensed by Briean Boddy-Calhoun.","(0:26) Ben Roethlisberger pass to the right to Le'Veon Bell for 2 yards to the Cle11. Tackled by Jamie Collins.","(0:34) Ben Roethlisberger pass to the right to Le'Veon Bell for 5 yards to the Cle13. Tackled by Jamar Taylor.","(0:34) Pittsburgh Steelers timeout.","(0:41) Ben Roethlisberger pass to the left to Eli Rogers for 4 yards to the Cle18. Tackled by Jamar Taylor.","(1:12) Ben Roethlisberger pass to the right to Le'Veon Bell for 4 yards to the Cle22. Tackled by Emmanuel Ogbah.","(1:19) Ben Roethlisberger pass to the right to Antonio Brown for 21 yards to the Cle26. Tackled by Joe Haden.","(1:19) Pittsburgh Steelers timeout.","(1:26) Le'Veon Bell rush to the left for 7 yards to the Cle47. Tackled by Jamie Meder.","(1:51) Ben Roethlisberger pass to the right to Le'Veon Bell for 5 yards to the Pit46. Tackled by Jamie Collins.","(1:51) Two Minute Warning.","(2:03) Britton Colquitt punts for 48 yards to Pit34. Antonio Brown return for 7 yards to Pit41. Tackled by Joe Schobert.","(2:16) Penalty: Holding on Cleveland (Dominique Alexander) -10 yards.","(2:54) Duke Johnson Jr. rush to the right for a loss of 2 yards to the Cle28. Tackled by Sean Davis.","(3:40) Cody Kessler sacked at Cle30 for a loss of 11 yards by Arthur Moats.","(3:44) Cody Kessler incomplete pass to the left intended for Corey Coleman.","(4:13) Duke Johnson Jr. rush to the right for 12 yards to the Cle41. Tackled by Lawrence Timmons and Mike Mitchell.","(4:43) Cody Kessler pass to the left to Corey Coleman for 4 yards to the Cle29. Tackled by Lawrence Timmons and Sean Davis.","(4:43) Chris Boswell kicks off to the endzone. Touchback.","(4:46) Chris Boswell 33 yard field goal attempt is GOOD. Holder: Jordan Berry.","(4:53) Ben Roethlisberger incomplete pass to the right intended for Eli Rogers defensed by Christian Kirksey.","(5:00) Ben Roethlisberger incomplete pass to the right intended for Ladarius Green.","(5:44) Le'Veon Bell rush to the left for 3 yards to the Cle15. Tackled by Stephen Paea.","(6:29) Le'Veon Bell rush to the left for 10 yards to the Cle18. Tackled by Ed Reynolds.","(7:13) Ben Roethlisberger pass to the right to Antonio Brown for 4 yards to the Cle28. Tackled by Joe Haden and Jamie Collins.","(7:58) Ben Roethlisberger pass to the left to Cobi Hamilton for 2 yards to the Cle32. Tackled by Christian Kirksey.","(8:43) Ben Roethlisberger pass to the right to Jesse James for 5 yards to the Cle34. Tackled by Jamie Collins and Xavier Cooper.","(9:07) Penalty: False Start on Pittsburgh (David DeCastro) -5 yards.","(9:51) Le'Veon Bell rush to the right for 5 yards to the Cle34. Tackled by Demario Davis.","(10:31) Ben Roethlisberger pass to the right to Cobi Hamilton for 9 yards to the Cle39. Tackled by Jamar Taylor.","(11:16) Ben Roethlisberger pass to the right to Eli Rogers for 3 yards to the Cle48. Tackled by Demario Davis.","(12:02) Le'Veon Bell rush to the left for 1 yard to the Pit49. Tackled by Jamie Collins and Christian Kirksey.","(12:38) Le'Veon Bell rush to the left for 11 yards to the Pit48. Tackled by Ed Reynolds.","(12:45) Ben Roethlisberger incomplete pass to the left intended for Eli Rogers defensed by Derrick Kindred.","(13:25) Ben Roethlisberger pass to the left to Antonio Brown for 18 yards to the Pit37. Tackled by Derrick Kindred.","(14:11) Le'Veon Bell rush to the left for 2 yards to the Pit19. Tackled by Demario Davis and Cam Johnson.","(14:22) Britton Colquitt punts for 47 yards to Pit17. No return.","(15:00) Cody Kessler sacked at Cle36 for a loss of 11 yards by Javon Hargrave.","(0:28) Isaiah Crowell rush to the right for 2 yards to the Cle47. Tackled by Lawrence Timmons.","(0:32) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr..","(0:56) Cody Kessler pass to the left to Andrew Hawkins for 20 yards to the Cle45. Tackled by Mike Mitchell.","(1:03) Penalty: Illegal Use of Hands on Pittsburgh (Artie Burns) 5 yards.","(1:47) Isaiah Crowell rush to the left for 5 yards to the Cle20. Tackled by Ryan Shazier.","(2:22) Cody Kessler sacked at Cle15 for a loss of 7 yards by Stephon Tuitt.","(2:28) Chris Boswell kicks off to the Cle8. George Atkinson III return for 14 yards to Cle22. Tackled by Sammie Coates.","(2:32) Chris Boswell 32 yard field goal attempt is GOOD. Holder: Jordan Berry.","(2:36) Ben Roethlisberger incomplete pass to the right intended for Jesse James defensed by Briean Boddy-Calhoun.","(3:21) Le'Veon Bell rush to the left for no gain to the Cle14. Tackled by Danny Shelton and Christian Kirksey.","(3:48) Penalty: False Start on Pittsburgh (Le'Veon Bell) -5 yards.","(4:30) Le'Veon Bell rush to the left for 9 yards to the Cle9. Tackled by Ed Reynolds.","(5:02) Ben Roethlisberger pass to the left to Le'Veon Bell for 7 yards to the Cle18. Tackled by Jamie Collins.","(5:45) Le'Veon Bell rush to the right for 3 yards to the Cle25. Tackled by Demario Davis.","(6:17) Ben Roethlisberger pass to the left to Le'Veon Bell for 8 yards to the Cle28. Tackled by Jamie Collins. FUMBLE, recovered by Pit.","(6:48) Ben Roethlisberger pass to the left to Antonio Brown for 3 yards to the Cle36. Tackled by Joe Haden.","(6:58) Le'Veon Bell rush to the left for 12 yards to the Cle39. Tackled by Derrick Kindred.","(8:26) Ben Roethlisberger pass to the right to Le'Veon Bell for 19 yards to the Pit49. Tackled by Christian Kirksey.","(8:32) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(9:17) Le'Veon Bell rush to the right for 6 yards to the Pit30. Tackled by Derrick Kindred and Briean Boddy-Calhoun.","(9:53) Le'Veon Bell rush to the right for 4 yards to the Pit24. Tackled by Demario Davis and Derrick Kindred.","(10:25) Ben Roethlisberger pass to the right to Eli Rogers for 5 yards to the Pit20. Tackled by Demario Davis.","(11:08) Le'Veon Bell rush to the left for 8 yards to the Pit15. Tackled by Christian Kirksey.","(11:46) Le'Veon Bell rush to the right for 3 yards to the Pit7. Tackled by Joe Haden and Cam Johnson.","(11:54) Cody Kessler pass intended for Corey Coleman INTERCEPTED by Artie Burns. No return. Tackled by Corey Coleman.","(12:20) Penalty: False Start on Cleveland (Terrelle Pryor Sr.) -5 yards.","(12:58) Isaiah Crowell rush to the right for a loss of 2 yards to the Pit40. Tackled by Ryan Shazier.","(13:07) Cody Kessler incomplete pass to the left intended for Corey Coleman.","(13:40) Cody Kessler pass to the right to Terrelle Pryor Sr. for 36 yards to the Pit38. Tackled by Ross Cockrell.","(14:20) Isaiah Crowell rush to the left for 6 yards to the Cle26. Tackled by Lawrence Timmons.","(14:53) Isaiah Crowell rush to the right for a loss of 2 yards to the Cle20. Tackled by Ricardo Mathews.","(15:00) Chris Boswell kicks off to the Cle3. George Atkinson III return for 19 yards to Cle22. Tackled by Roosevelt Nix and Tyler Matakevich."]