["(0:02) Matthew Stafford rush up the middle for a loss of 1 yard to the Jax36.","(0:08) Blake Bortles pass intended for Marqise Lee INTERCEPTED by Tavon Wilson and returned for 5 yards.","(0:16) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(0:22) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(0:22) Sam Martin kicks off to the endzone. Touchback.","(0:26) Matt Prater 43 yard field goal attempt is GOOD. Holder: Sam Martin.","(0:26) Detroit Lions timeout.","(1:13) Theo Riddick rush up the middle for 6 yards to the Jax25. Tackled by Johnathan Cyprien and Myles Jack.","(1:13) Detroit Lions timeout.","(2:00) Dwayne Washington rush to the right for a loss of 1 yard to the Jax31. Tackled by Myles Jack.","(2:00) Two Minute Warning.","(2:18) Dwayne Washington rush to the left for a loss of 1 yard to the Jax30. Tackled by Johnathan Cyprien.","(2:25) Matthew Stafford pass to the right to Theo Riddick for 7 yards to the Jax29. Tackled by Telvin Smith.","(2:25) Jacksonville Jaguars timeout.","(2:30) Dwayne Washington rush up the middle for 2 yards to the Jax36. Tackled by Abry Jones.","(2:30) Jacksonville Jaguars timeout.","(2:34) Dwayne Washington rush up the middle for 3 yards to the Jax38. Tackled by Abry Jones.","(2:34) Penalty: Encroachment on Jacksonville (Sen'Derrick Marks) 5 yards.","(3:05) Matthew Stafford pass to the middle to Anquan Boldin for 4 yards to the Jax46. Tackled by Jalen Ramsey.","(3:53) Matthew Stafford pass to the left to Theo Riddick for 7 yards to the Det50. Tackled by Abry Jones.","(4:37) Dwayne Washington rush to the left for a loss of 3 yards to the Det43. Tackled by Paul Posluszny.","(5:23) Matthew Stafford pass to the middle to Anquan Boldin for 8 yards to the Det46. Tackled by Peyton Thompson.","(6:09) Matthew Stafford pass to the right to Theo Riddick for a loss of 1 yard to the Det38. Tackled by Telvin Smith.","(6:54) Matthew Stafford pass to the right to Eric Ebron for 7 yards to the Det39. Tackled by Tashaun Gipson.","(7:38) Matthew Stafford pass to the right to Theo Riddick for 20 yards to the Det32. Tackled by Telvin Smith.","(8:19) Dwayne Washington rush to the right for a loss of 3 yards to the Det12. Tackled by Johnathan Cyprien.","(8:27) Brad Nortman punts for 42 yards to Det15. No return.","(9:08) Blake Bortles pass to the left to Allen Robinson for 4 yards to the Jax43. Tackled by Darius Slay.","(9:13) Blake Bortles incomplete pass to the left intended for Julius Thomas.","(9:54) Chris Ivory rush to the right for a loss of 5 yards to the Jax39. Tackled by Stefan Charles.","(10:03) Sam Martin kicks off to the Jax2. Marqise Lee return for 42 yards to Jax44. Tackled by Rafael Bush.","(10:03) Matt Prater extra point is good.","(10:08) Eric Ebron rush to the right for 1 yard for a TOUCHDOWN.","(10:49) Theo Riddick rush up the middle for 7 yards to the Jax1. Tackled by Jared Odrick.","(10:49) Jacksonville Jaguars timeout.","(11:23) Matthew Stafford pass to the left to Eric Ebron for 61 yards to the Jax8. Tackled by Johnathan Cyprien.","(12:05) Matthew Stafford sacked at Det31 for a loss of 5 yards by Yannick Ngakoue.","(12:44) Theo Riddick rush up the middle for 2 yards to the Det36. Tackled by Tyson Alualu and Johnathan Cyprien.","(13:20) Matthew Stafford pass to the left to Golden Tate for 13 yards to the Det34. Tackled by Jalen Ramsey.","(13:24) Matthew Stafford incomplete pass to the left intended for Theo Riddick defensed by Abry Jones.","(13:32) Brad Nortman punts for 36 yards to Det21. No return.","(14:18) Blake Bortles pass to the right to Julius Thomas for 4 yards to the Jax43. Tackled by Miles Killebrew.","(15:00) Chris Ivory rush to the right for a loss of 1 yard to the Jax39. Tackled by Kerry Hyder.","(0:35) Chris Ivory rush to the right for 6 yards to the Jax40. Tackled by A'Shawn Robinson.","(0:44) Golden Tate rush to the left for a loss of 6 yards to the Jax34. Tackled by Jared Odrick. FUMBLE, recovered by Jax (Telvin Smith). Tackled by Taylor Decker.","(1:30) Matthew Stafford pass to the left to Andre Roberts for 44 yards to the Jax28. Tackled by Paul Posluszny.","(2:10) Dwayne Washington rush to the left for 3 yards to the Det28. Tackled by Myles Jack.","(2:10) Jason Myers kicks off to the endzone. Touchback.","(2:10) Jason Myers extra point is good.","(2:16) Blake Bortles pass to the left to Marqise Lee for 3 yards for a TOUCHDOWN.","(2:57) Chris Ivory rush up the middle for 1 yard to the Det3. Tackled by Haloti Ngata.","(3:18) Blake Bortles pass to the left to Marqise Lee for 29 yards to the Det4.","(3:54) Denard Robinson rush to the left for 9 yards to the Det33. Tackled by Tahir Whitehead and Kerry Hyder.","(4:31) Denard Robinson rush up the middle for 5 yards to the Det42. Tackled by Antwione Williams.","(5:12) Blake Bortles pass to the right to Chris Ivory for 22 yards to the Det47. Tackled by Johnthan Banks.","(5:52) Chris Ivory rush to the right for 6 yards to the Jax31. Tackled by Johnthan Banks.","(6:32) Blake Bortles pass to the left to Chris Ivory for 9 yards to the Jax25. Tackled by Tavon Wilson.","(7:06) Chris Ivory rush to the right for 3 yards to the Jax16. Tackled by Tavon Wilson.","(7:15) Sam Martin punts for 46 yards to Jax13. No return.","(7:20) Matthew Stafford incomplete pass to the right intended for Anquan Boldin.","(8:00) Matthew Stafford pass to the middle to Anquan Boldin for 6 yards to the Det41. Tackled by Telvin Smith and Paul Posluszny.","(8:25) Dwayne Washington rush up the middle for a loss of 2 yards to the Det35. Tackled by Peyton Thompson and Abry Jones.","(8:53) Matthew Stafford pass to the left to Dwayne Washington for 8 yards to the Det37. Tackled by Telvin Smith.","(9:20) Dwayne Washington rush to the left for 4 yards to the Det29. Tackled by Telvin Smith.","(9:20) Jason Myers kicks off to the endzone. Touchback.","(9:25) Jason Myers 52 yard field goal attempt is GOOD. Holder: Brad Nortman.","(10:06) Blake Bortles pass to the middle to Julius Thomas for a loss of 1 yard to the Det34. Tackled by Rafael Bush.","(10:46) Denard Robinson rush up the middle for 7 yards to the Det33. Tackled by Ezekiel Ansah.","(11:26) Chris Ivory rush to the right for 1 yard to the Det40. Tackled by Quandre Diggs.","(11:59) Blake Bortles pass to the left to Julius Thomas for 9 yards to the Det41. Tackled by Nevin Lawson.","(12:39) Blake Bortles pass to the middle to Allen Hurns for 9 yards to the Jax50. Tackled by Tavon Wilson.","(13:19) Blake Bortles pass to the right to Denard Robinson for 4 yards to the Jax41. Tackled by Darius Slay and Rafael Bush.","(13:40) Penalty: Holding on Jacksonville (A.J. Cann) -10 yards.","(13:56) Penalty: Offside on Detroit (Stefan Charles) 5 yards.","(14:02) Penalty: Pass Interference on Detroit (Darius Slay) 17 yards.","(14:02) Sam Martin kicks off to the endzone. Touchback.","(14:02) Matt Prater extra point is good.","(14:16) Blake Bortles pass intended for Marqise Lee INTERCEPTED by Rafael Bush defensed by Nevin Lawson and returned for 39 yards for a TOUCHDOWN.","(14:21) Blake Bortles incomplete pass to the left intended for Allen Hurns.","(15:00) Chris Ivory rush up the middle for 3 yards to the Jax28. Tackled by Ezekiel Ansah.","(15:00) Sam Martin kicks off to the endzone. Touchback.","(0:19) Chad Henne rush up the middle for a loss of 2 yards to the Jax23.","(0:19) Sam Martin kicks off to the endzone. Touchback.","(0:23) Matt Prater 27 yard field goal attempt is GOOD. Holder: Sam Martin.","(0:23) Detroit Lions timeout.","(0:31) Matthew Stafford rush up the middle for 1 yard to the Jax8. Tackled by Sen'Derrick Marks.","(0:36) Matthew Stafford incomplete pass to the left intended for Theo Riddick.","(0:36) Detroit Lions timeout.","(0:44) Matthew Stafford pass to the left to Theo Riddick for 5 yards to the Jax9. Tackled by Paul Posluszny.","(1:23) Matthew Stafford pass to the middle to Marvin Jones Jr. for 15 yards to the Jax14. Tackled by Prince Amukamara.","(1:48) Matthew Stafford pass to the middle to Anquan Boldin for 8 yards to the Jax29. Tackled by Paul Posluszny.","(1:53) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(2:00) Matthew Stafford pass to the right to Theo Riddick for 12 yards to the Jax37. Tackled by Johnathan Cyprien.","(2:00) Two Minute Warning.","(2:16) Matthew Stafford pass to the right to Golden Tate for 12 yards to the Jax49. Tackled by Jalen Ramsey.","(2:45) Matthew Stafford pass to the left to Theo Riddick for 14 yards to the Det39. Tackled by Johnathan Cyprien.","(2:45) Jason Myers kicks off to the endzone. Touchback.","(2:45) Jason Myers extra point is NO GOOD.","(2:49) Blake Bortles pass to the middle to Allen Robinson for 3 yards for a TOUCHDOWN.","(2:55) Penalty: Holding on Detroit (Darius Slay) 4 yards.","(3:35) Chris Ivory rush up the middle for 7 yards to the Det7. Tackled by Tahir Whitehead.","(4:13) Blake Bortles pass to the left to Chris Ivory for 14 yards to the Det14. Tackled by Quandre Diggs.","(4:59) Chris Ivory rush to the left for 2 yards to the Det28. Tackled by Ezekiel Ansah.","(5:04) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(5:37) Blake Bortles pass to the left to Chris Ivory for 22 yards to the Det30. Tackled by Darius Slay.","(6:04) Chris Ivory rush to the right for 2 yards to the Jax48. Tackled by Devin Taylor.","(6:17) Sam Martin punts for 52 yards to Jax43. Rashad Greene Sr. return for 3 yards to Jax46. Tackled by Don Carey.","(7:01) Matthew Stafford sacked at Det5 for a loss of 4 yards by Malik Jackson.","(7:47) Dwayne Washington rush to the left for 3 yards to the Det9. Tackled by Paul Posluszny.","(8:21) Matthew Stafford pass to the left to Anquan Boldin for 4 yards to the Det6. Tackled by Jalen Ramsey.","(8:21) Penalty: False Start on Detroit (Graham Glasgow) -1 yards.","(8:33) Brad Nortman punts for 54 yards to Det3. No return.","(9:13) Blake Bortles pass to the right to Chris Ivory for 8 yards to the Jax43. Tackled by Miles Killebrew.","(9:21) Blake Bortles incomplete pass to the right intended for Allen Robinson.","(10:02) Blake Bortles pass to the right to Chris Ivory for no gain to the Jax35. Tackled by Nevin Lawson.","(10:41) Blake Bortles pass to the right to Marqise Lee for 8 yards to the Jax35. Tackled by Tavon Wilson.","(11:13) Chris Ivory rush up the middle for 2 yards to the Jax27. Tackled by Antwione Williams.","(11:13) Sam Martin kicks off to the endzone. Touchback.","(11:13) Matt Prater extra point is BLOCKED.","(11:31) Brad Nortman punts for 47 yards to Det45. Andre Roberts return for 55 yards for a TOUCHDOWN.","(11:37) Blake Bortles incomplete pass to the left intended for Marqise Lee defensed by Nevin Lawson.","(11:42) Blake Bortles incomplete pass to the middle intended for Ben Koyack.","(12:23) Chris Ivory rush up the middle for 2 yards to the Jax8. Tackled by Anthony Zettel.","(12:34) Sam Martin punts for 61 yards to Jax6. No return.","(12:38) Matthew Stafford incomplete pass to the middle intended for Golden Tate.","(12:43) Matthew Stafford incomplete pass to the middle intended for Eric Ebron.","(13:25) Dwayne Washington rush to the right for a loss of 3 yards to the Det33. Tackled by Dante Fowler Jr..","(13:34) Chris Ivory rush up the middle for 8 yards to the Det40. Tackled by Glover Quin. FUMBLE, recovered by Det (Antwione Williams). Tackled by Julius Thomas. FUMBLE, recovered by Det (Tavon Wilson) and advanced for a loss of 2 yards.","(14:10) Blake Bortles pass to the middle to Marqise Lee for 12 yards to the Det48. Tackled by Miles Killebrew.","(14:43) Marqise Lee rush to the right for 6 yards to the Jax40. Tackled by Antwione Williams.","(14:52) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Darius Slay.","(15:00) Sam Martin punts for 39 yards to Jax33. Rashad Greene Sr. - no return. FUMBLE, recovered by Jax.","(0:11) Matthew Stafford pass to the left to Dwayne Washington for 7 yards to the Det28. Tackled by Malik Jackson and Jalen Ramsey.","(0:55) Matthew Stafford sacked at Det21 for a loss of 6 yards by Tyson Alualu.","(1:36) Dwayne Washington rush to the left for 2 yards to the Det27. Tackled by Telvin Smith.","(1:36) Jason Myers kicks off to the endzone. Touchback.","(1:39) Jason Myers 27 yard field goal attempt is GOOD. Holder: Brad Nortman.","(1:47) Blake Bortles incomplete pass to the middle intended for T.J. Yeldon.","(2:25) T.J. Yeldon rush up the middle for 2 yards to the Det9. Tackled by Anthony Zettel and Stefan Charles.","(2:30) Blake Bortles incomplete pass to the right intended for Julius Thomas.","(2:45) Brad Nortman punts for 36 yards to Det12. Andre Roberts - no return. FUMBLE, recovered by Jax (Ben Koyack). Tackled by Antwione Williams.","(3:28) Blake Bortles rush to the left for 3 yards to the Det48. Tackled by Ezekiel Ansah and Miles Killebrew.","(3:42) Penalty: False Start on Jacksonville (Jermey Parnell) -5 yards.","(4:21) Chris Ivory rush to the right for a loss of 3 yards to the Det46. Tackled by A'Shawn Robinson.","(5:03) Chris Ivory rush up the middle for 4 yards to the Det43. Tackled by Tavon Wilson.","(5:32) Blake Bortles pass to the left to Allen Robinson for 11 yards to the Det47. Tackled by Quandre Diggs.","(5:40) Sam Martin punts for 45 yards to Jax42. No return.","(5:48) Matthew Stafford incomplete pass to the right intended for Eric Ebron.","(6:16) Theo Riddick rush to the right for a loss of 2 yards to the Det13. Tackled by Abry Jones.","(6:20) Matthew Stafford incomplete pass to the right intended for Anquan Boldin defensed by Jared Odrick.","(6:29) Brad Nortman punts for 30 yards to Det15. No return.","(7:09) Blake Bortles pass to the left to T.J. Yeldon for 2 yards to the Det45. Tackled by Miles Killebrew and Haloti Ngata.","(7:53) Blake Bortles pass to the left to Marcedes Lewis for 1 yard to the Det47. Tackled by Nevin Lawson.","(8:05) Chris Ivory rush to the left for 1 yard to the Det48. Tackled by Kerry Hyder.","(8:18) Penalty: False Start on Jacksonville (Blake Bortles) -5 yards.","(9:05) Blake Bortles pass to the right to T.J. Yeldon for 14 yards to the Det44. Tackled by Tahir Whitehead.","(9:50) T.J. Yeldon rush to the right for 7 yards to the Jax42. Tackled by Rafael Bush.","(10:23) T.J. Yeldon rush to the left for no gain to the Jax35. Tackled by Haloti Ngata.","(10:51) Blake Bortles pass to the left to Marcedes Lewis for 15 yards to the Jax35. Tackled by Glover Quin.","(11:21) T.J. Yeldon rush to the left for 7 yards to the Jax20. Tackled by Devin Taylor.","(11:29) Sam Martin punts for 48 yards to Jax13. No return.","(11:34) Matthew Stafford incomplete pass to the left intended for Anquan Boldin.","(12:21) Matthew Stafford pass to the left to Eric Ebron for 2 yards to the Det39. Tackled by Telvin Smith.","(13:01) Dwayne Washington rush up the middle for 2 yards to the Det37. Tackled by Jared Odrick.","(13:47) Matthew Stafford pass to the right to Golden Tate for 2 yards to the Det35. Tackled by Aaron Colvin.","(14:33) Matthew Stafford pass to the left to Theo Riddick for 6 yards to the Det33. Tackled by Aaron Colvin.","(14:33) Penalty: False Start on Detroit (Taylor Decker) -5 yards.","(15:00) Jacksonville Jaguars timeout.","(15:00) Matthew Stafford pass to the right to Anquan Boldin for 7 yards to the Det32. Tackled by Jalen Ramsey.","(15:00) Jason Myers kicks off to the endzone. Touchback."]