["(0:37) Sam Bradford rush up the middle for a loss of 1 yard to the Ari20.","(0:44) Carson Palmer sacked at Ari19 for a loss of 15 yards by Danielle Hunter.","(0:50) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(0:56) Carson Palmer pass to the right to David Johnson for 4 yards to the Ari34. Tackled by Trae Waynes.","(1:00) Carson Palmer incomplete pass to the right intended for J.J. Nelson defensed by Anthony Barr.","(1:07) Carson Palmer rush to the right for 11 yards to the Ari30. Tackled by Everson Griffen.","(1:12) Penalty: Roughing Passer on Minnesota (Tom Johnson) 15 yards.","(1:53) Carson Palmer sacked at Ari4 for a loss of 9 yards by Harrison Smith.","(2:00) Carson Palmer incomplete pass to the middle intended for John Brown defensed by Andrew Sendejo.","(2:00) Two Minute Warning.","(2:20) Carson Palmer pass to the left to J.J. Nelson for no gain to the Ari13. Tackled by Linval Joseph.","(2:33) Jeff Locke punts for 72 yards to Ari13. No return.","(3:18) Sam Bradford pass to the left to Adam Thielen for 10 yards to the Min15. Tackled by D.J. Swearinger.","(3:18) Minnesota Vikings timeout.","(3:18) Penalty: False Start on Minnesota (Jeremiah Sirles) -5 yards.","(3:26) Sam Bradford incomplete pass to the right intended for Rhett Ellison.","(4:07) Matt Asiata rush up the middle for 1 yard to the Min10. Tackled by Kevin Minter.","(4:24) Drew Butler punts for 51 yards to Min16. Marcus Sherels return for 1 yard to Min17. Tackled by Brittan Golden. Penalty: Illegal Block on Minnesota (Jayron Kearse) -8 yards.","(4:31) Carson Palmer incomplete pass to the right. Penalty: Intentional Grounding on Arizona (Carson Palmer) -12 yards.","(5:16) Carson Palmer sacked at Ari45 for a loss of 8 yards by Danielle Hunter.","(5:56) David Johnson rush to the right for no gain to the Min47. Tackled by Linval Joseph and Trae Waynes.","(6:10) Jeff Locke punts for 50 yards to Ari21. John Brown return for 32 yards to Min47. Tackled by Jeff Locke.","(6:15) Sam Bradford incomplete pass to the left intended for Cordarrelle Patterson defensed by Calais Campbell.","(6:56) Jerick McKinnon rush up the middle for a loss of 4 yards to the Min29. Tackled by Markus Golden.","(7:24) Sam Bradford pass to the left to Stefon Diggs for 8 yards to the Min33. Tackled by Patrick Peterson.","(7:24) Chandler Catanzaro kicks off to the endzone. Touchback.","(7:24) Chandler Catanzaro extra point is good.","(7:28) Carson Palmer pass to the right to David Johnson for 4 yards for a TOUCHDOWN.","(7:32) Carson Palmer incomplete pass to the left intended for Michael Floyd.","(8:01) Carson Palmer pass to the middle to Larry Fitzgerald for 7 yards to the Min4. Tackled by Captain Munnerlyn.","(8:34) Carson Palmer pass to the right to David Johnson for 14 yards to the Min11. Tackled by Harrison Smith and Andrew Sendejo.","(8:34) Arizona Cardinals timeout.","(8:40) Carson Palmer incomplete pass to the middle intended for J.J. Nelson.","(9:10) Carson Palmer pass to the right to Andre Ellington for 2 yards to the Min25. Tackled by Trae Waynes.","(9:16) Sam Bradford sacked at Min27 for a loss of 10 yards by Chandler Jones. FUMBLE, recovered by Ari (Deone Bucannon). Tackled by Matt Asiata.","(9:16) Penalty: False Start on Minnesota (Stefon Diggs) -5 yards.","(9:19) Arizona Cardinals timeout.","(9:19) Sam Bradford incomplete pass to the left intended for Rhett Ellison.","(10:03) Ronnie Hillman rush to the right for 3 yards to the Min42. Tackled by Kevin Minter.","(10:45) Jerick McKinnon rush to the right for 4 yards to the Min39. Tackled by Calais Campbell and Deone Bucannon.","(11:24) Sam Bradford pass to the right to Cordarrelle Patterson for 7 yards to the Min35. Tackled by Justin Bethel.","(12:07) Matt Asiata rush up the middle for 3 yards to the Min28. Tackled by Frostee Rucker and Rodney Gunter.","(12:50) Sam Bradford pass to the right to Cordarrelle Patterson for 10 yards to the Min25. Tackled by Deone Bucannon and Tony Jefferson.","(13:26) Jerick McKinnon rush up the middle for a loss of 1 yard to the Min15. Tackled by Justin Bethel.","(13:34) Drew Butler punts for 40 yards to Min16. No return.","(14:04) Carson Palmer pass to the left to Larry Fitzgerald for 3 yards to the Ari44. Tackled by Xavier Rhodes and Captain Munnerlyn.","(14:35) David Johnson rush to the right for 5 yards to the Ari41. Tackled by Anthony Barr and Eric Kendricks.","(14:39) Carson Palmer incomplete pass to the right intended for David Johnson.","(15:00) Carson Palmer pass to the middle to David Johnson for 5 yards to the Ari36. Tackled by Anthony Barr.","(0:04) Carson Palmer pass to the right to David Johnson for 6 yards to the Ari31. Tackled by Eric Kendricks.","(0:04) Kai Forbath kicks off to the endzone. Touchback.","(0:07) Kai Forbath 27 yard field goal attempt is GOOD. Holder: Jeff Locke.","(0:13) Sam Bradford incomplete pass to the left intended for Cordarrelle Patterson.","(0:55) Jerick McKinnon rush to the right for 1 yard to the Ari9. Tackled by Deone Bucannon and Calais Campbell.","(1:34) Sam Bradford pass to the middle to Rhett Ellison for a loss of 2 yards to the Ari10. Tackled by Kevin Minter.","(1:59) Sam Bradford pass to the left to Stefon Diggs for 13 yards to the Ari17. Tackled by Patrick Peterson. Penalty: Unnecessary Roughness on Arizona (Tony Jefferson) 9 yards.","(2:32) Jerick McKinnon rush up the middle for 2 yards to the Ari30. Tackled by Deone Bucannon.","(3:12) Sam Bradford pass to the right to Stefon Diggs for 2 yards to the Ari32. Tackled by Chandler Jones.","(3:40) Matt Asiata rush to the left for 9 yards to the Ari49. Tackled by Ed Stinson. Penalty: Unnecessary Roughness on Arizona (Patrick Peterson) 15 yards.","(3:55) Sam Bradford pass to the left to Cordarrelle Patterson for 6 yards to the Min27. Tackled by Justin Bethel. Penalty: Roughing Passer on Arizona (Markus Golden) 15 yards.","(4:33) Sam Bradford pass to the left to Stefon Diggs for a loss of 3 yards to the Min21. Tackled by Chandler Jones.","(5:10) Sam Bradford pass to the right to Stefon Diggs for 8 yards to the Min24. Tackled by Markus Golden.","(5:20) Carson Palmer pass intended for Michael Floyd INTERCEPTED by Xavier Rhodes. No return. Tackled by Michael Floyd.","(5:30) Jeff Locke punts for 50 yards to Ari27. John Brown return for 4 yards to Ari31. Tackled by Kentrell Brothers.","(6:14) Matt Asiata rush to the left for 5 yards to the Min23. Tackled by Markus Golden and Alex Okafor.","(6:15) Penalty: Delay of Game on Minnesota (Sam Bradford) -5 yards.","(6:48) Penalty: Pass Interference on Minnesota (Adam Thielen) -10 yards.","(7:31) Sam Bradford pass to the right to Kyle Rudolph for 4 yards to the Min33. Tackled by Deone Bucannon.","(7:36) Sam Bradford incomplete pass to the right intended for Cordarrelle Patterson defensed by Patrick Peterson.","(7:47) Drew Butler punts for 49 yards to Min18. Marcus Sherels return for 11 yards to Min29. Tackled by Zaviar Gooden.","(8:26) Carson Palmer sacked at Ari33 for a loss of 11 yards by Brian Robison.","(9:10) David Johnson rush up the middle for 1 yard to the Ari44. Tackled by Trae Waynes and Anthony Barr.","(9:48) David Johnson rush up the middle for 5 yards to the Ari43. Tackled by Trae Waynes.","(9:53) Sam Bradford incomplete pass to the middle intended for Cordarrelle Patterson defensed by Marcus Cooper.","(9:53) Minnesota Vikings timeout.","(10:33) Sam Bradford pass to the right to Adam Thielen for 10 yards to the Ari38. Tackled by Marcus Cooper.","(11:12) Jerick McKinnon rush to the left for no gain to the Ari48. Tackled by Calais Campbell.","(11:49) Jerick McKinnon rush up the middle for a loss of 3 yards to the Ari48. Tackled by Frostee Rucker.","(12:19) Penalty: Holding on Arizona (Markus Golden) 5 yards.","(12:58) Jerick McKinnon rush up the middle for 5 yards to the Min50. Tackled by Kevin Minter.","(13:20) Jerick McKinnon rush to the right for 12 yards to the Min45. Tackled by D.J. Swearinger and Chandler Jones.","(13:54) Sam Bradford pass to the middle to Stefon Diggs for 9 yards to the Min33. Tackled by Patrick Peterson.","(13:59) Drew Butler punts for 48 yards to Min24. No return.","(14:06) Carson Palmer incomplete pass to the middle intended for David Johnson.","(14:12) Carson Palmer incomplete pass to the left intended for David Johnson defensed by Eric Kendricks.","(14:47) David Johnson rush to the right for 3 yards to the Ari28. Tackled by Trae Waynes.","(14:47) Kai Forbath kicks off to the endzone. Touchback.","(14:47) Kai Forbath extra point is good.","(15:00) Chandler Catanzaro kicks off to the Min-4. Cordarrelle Patterson return for 104 yards for a TOUCHDOWN.","(0:20) Sam Bradford sacked at Min24 for a loss of 14 yards by Alex Okafor.","(0:20) Minnesota Vikings timeout.","(0:27) Sam Bradford pass to the right to Matt Asiata for 7 yards to the Min38. Tackled by Tony Jefferson.","(0:31) Sam Bradford incomplete pass to the middle intended for Kyle Rudolph defensed by Calais Campbell.","(0:50) Ronnie Hillman rush up the middle for 6 yards to the Min31. Tackled by Tony Jefferson.","(0:50) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:50) Chandler Catanzaro extra point is good.","(0:58) Carson Palmer pass to the middle to Jermaine Gresham for 29 yards for a TOUCHDOWN.","(1:20) Carson Palmer pass to the middle to David Johnson for 9 yards to the Min29. Tackled by Harrison Smith.","(1:20) Arizona Cardinals timeout.","(1:53) Carson Palmer pass to the left to Jermaine Gresham for 4 yards to the Min38. Tackled by Captain Munnerlyn. FUMBLE, recovered by Ari.","(1:57) Carson Palmer incomplete pass to the right intended for David Johnson.","(1:57) Two Minute Warning.","(2:03) David Johnson rush to the right for 10 yards to the Min42. Tackled by Anthony Barr.","(2:30) David Johnson rush to the right for 8 yards to the Ari48. Tackled by Andrew Sendejo.","(3:07) Carson Palmer pass to the middle to David Johnson for 15 yards to the Ari40. Tackled by Anthony Barr.","(3:07) Kai Forbath kicks off to the endzone. Touchback.","(3:07) Kai Forbath extra point is good.","(3:23) Carson Palmer pass intended for John Brown INTERCEPTED by Xavier Rhodes and returned for 100 yards for a TOUCHDOWN.","(3:28) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald defensed by Trae Waynes.","(4:06) Andre Ellington rush to the left for a loss of 1 yard to the Min9. Tackled by Eric Kendricks.","(4:50) Carson Palmer pass to the right to Larry Fitzgerald for 15 yards to the Min8. Tackled by Trae Waynes.","(4:54) Penalty: Holding on Minnesota (Trae Waynes) 5 yards.","(5:38) Andre Ellington rush to the right for 2 yards to the Min28. Tackled by Harrison Smith.","(6:15) Andre Ellington rush up the middle for 5 yards to the Min30. Tackled by Linval Joseph and Andrew Sendejo.","(6:51) Andre Ellington rush to the left for 8 yards to the Min35. Tackled by Anthony Barr.","(6:56) Penalty: Illegal Contact on Minnesota (Trae Waynes) 5 yards.","(7:03) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(7:07) Carson Palmer incomplete pass to the right intended for Andre Ellington.","(7:07) Arizona Cardinals timeout.","(7:16) Kai Forbath kicks off to the Ari3. Brittan Golden return for 49 yards to Min48. Tackled by Kai Forbath.","(7:16) Kai Forbath extra point is BLOCKED.","(7:19) Matt Asiata rush up the middle for 2 yards for a TOUCHDOWN.","(7:27) Penalty: Pass Interference on Arizona (Tony Jefferson) 29 yards.","(8:08) Jerick McKinnon rush up the middle for 5 yards to the Ari31. Tackled by Kevin Minter and Rodney Gunter.","(8:48) Sam Bradford pass to the left to Cordarrelle Patterson for 30 yards to the Ari36. Tackled by Deone Bucannon.","(9:29) Jerick McKinnon rush to the left for 1 yard to the Min34. Tackled by Frostee Rucker.","(10:04) Sam Bradford pass to the right to Kyle Rudolph for 8 yards to the Min33. Tackled by D.J. Swearinger.","(10:04) Chandler Catanzaro kicks off to the endzone. Touchback.","(10:08) Chandler Catanzaro 34 yard field goal attempt is GOOD. Holder: Drew Butler.","(10:13) Carson Palmer incomplete pass to the right intended for Michael Floyd.","(10:57) David Johnson rush up the middle for 1 yard to the Min16. Tackled by Eric Kendricks.","(11:38) David Johnson rush to the right for 7 yards to the Min17. Tackled by Trae Waynes.","(12:16) Carson Palmer pass to the right to Michael Floyd for 11 yards to the Min24. Tackled by Captain Munnerlyn.","(13:04) David Johnson rush to the left for 3 yards to the Min35. Tackled by Everson Griffen and Linval Joseph.","(13:47) Carson Palmer pass to the right to Larry Fitzgerald for 13 yards to the Min38. Tackled by Terence Newman.","(14:24) David Johnson rush to the left for 10 yards to the Ari49. Tackled by Linval Joseph.","(15:00) David Johnson rush up the middle for 3 yards to the Ari39. Tackled by Shamar Stephen.","(0:09) David Johnson rush to the left for 11 yards to the Ari36. Tackled by Harrison Smith.","(0:50) David Johnson rush to the right for 10 yards to the Ari25. Tackled by Terence Newman and Anthony Barr.","(1:30) David Johnson rush to the left for 9 yards to the Ari15. Tackled by Harrison Smith.","(1:42) Jeff Locke punts for 53 yards to Ari12. John Brown - no return. Tackled by Kentrell Brothers. Penalty: Holding on Arizona (Patrick Peterson) -6 yards.","(1:47) Sam Bradford incomplete pass to the left intended for Stefon Diggs.","(2:28) Sam Bradford pass to the left to Jerick McKinnon for a loss of 3 yards to the Min35. Tackled by Frostee Rucker.","(3:04) Jerick McKinnon rush up the middle for 2 yards to the Min38. Tackled by Ed Stinson.","(3:38) Sam Bradford pass to the left to Adam Thielen for 7 yards to the Min36. Tackled by Justin Bethel.","(4:07) Jerick McKinnon rush to the right for 4 yards to the Min29. Tackled by Kevin Minter.","(4:07) Chandler Catanzaro kicks off to the endzone. Touchback.","(4:07) Chandler Catanzaro extra point is good.","(4:10) David Johnson rush up the middle for 1 yard for a TOUCHDOWN.","(4:49) David Johnson rush up the middle for 2 yards to the Min1. Tackled by Harrison Smith and Andrew Sendejo.","(5:30) Carson Palmer pass to the middle to Michael Floyd for 10 yards to the Min3. Tackled by Harrison Smith.","(6:12) David Johnson rush up the middle for a loss of 1 yard to the Min13. Tackled by Tom Johnson.","(6:46) Andre Ellington rush to the left for 7 yards to the Min12. Tackled by Xavier Rhodes.","(7:35) Carson Palmer pass to the middle to Darren Fells for 22 yards to the Min19. Tackled by Harrison Smith and Trae Waynes.","(8:20) Carson Palmer pass to the left to Larry Fitzgerald for 16 yards to the Min41. Tackled by Xavier Rhodes.","(8:59) David Johnson rush to the left for 6 yards to the Ari43. Tackled by Linval Joseph.","(9:38) David Johnson rush up the middle for 4 yards to the Ari37. Tackled by Chad Greenway and Eric Kendricks.","(9:42) Penalty: Holding on Minnesota (Captain Munnerlyn) 5 yards.","(9:46) Carson Palmer incomplete pass to the left intended for John Brown.","(10:25) David Johnson rush to the left for 3 yards to the Ari28. Tackled by Linval Joseph.","(10:25) Kai Forbath kicks off to the endzone. Touchback.","(10:25) Kai Forbath extra point is good.","(10:30) Sam Bradford pass to the right to Adam Thielen for 16 yards for a TOUCHDOWN.","(11:13) Jerick McKinnon rush to the right for 6 yards to the Ari16. Tackled by D.J. Swearinger.","(11:18) Penalty: Illegal Use of Hands on Minnesota (Jeremiah Sirles) -10 yards.","(11:58) Jerick McKinnon rush up the middle for 8 yards to the Ari12. Tackled by Justin Bethel.","(12:40) Sam Bradford pass to the right to Adam Thielen for 22 yards to the Ari20. Tackled by Marcus Cooper.","(13:19) Jerick McKinnon rush to the left for 2 yards to the Ari42. Tackled by Chandler Jones.","(13:33) Drew Butler punts for 36 yards to Min33. Marcus Sherels return for 23 yards to Ari44. Tackled by Drew Butler.","(13:36) Carson Palmer incomplete pass to the middle intended for John Brown.","(14:18) David Johnson rush up the middle for 2 yards to the Ari31. Tackled by Shamar Stephen and Brian Robison.","(15:00) Carson Palmer pass to the right to Larry Fitzgerald for 9 yards to the Ari29. Tackled by Harrison Smith.","(15:00) Penalty: False Start on Arizona (A.Q. Shipley) -5 yards.","(15:00) Kai Forbath kicks off to the endzone. Touchback."]