["(0:19) Sam Bradford sacked at Ind27 for a loss of 14 yards by Zach Kerr.","(0:23) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(0:23) Minnesota Vikings timeout.","(0:33) Sam Bradford pass to the right to Kyle Rudolph for 24 yards to the Ind13. Tackled by Mike Adams and Edwin Jackson.","(0:58) Sam Bradford pass to the right to Cordarrelle Patterson for 19 yards to the Ind37. Tackled by Chris Milton.","(1:03) Sam Bradford incomplete pass to the left intended for Jarius Wright.","(1:03) Indianapolis Colts timeout.","(1:17) Sam Bradford pass to the left to Jerick McKinnon for 15 yards to the Min44. Tackled by Matthias Farley.","(1:37) Sam Bradford pass to the right to Jerick McKinnon for 2 yards to the Min29. Tackled by Edwin Jackson.","(2:00) Sam Bradford pass to the middle to Jerick McKinnon for 13 yards to the Min27. Tackled by T.J. Green.","(2:09) Two Minute Warning.","(2:09) Josh Ferguson rush to the right for 1 yard to the Min14. Tackled by Captain Munnerlyn and Andrew Sendejo.","(2:56) Josh Ferguson rush to the right for no gain to the Min15. Tackled by Linval Joseph.","(3:39) Jordan Todman rush to the left for 2 yards to the Min15. Tackled by Linval Joseph.","(4:23) Jordan Todman rush to the right for 1 yard to the Min17. Tackled by Anthony Harris.","(5:09) Jordan Todman rush to the right for 12 yards to the Min18. Tackled by Xavier Rhodes.","(5:14) Sam Bradford incomplete pass to the right intended for Cordarrelle Patterson defensed by Chris Milton.","(5:50) Sam Bradford pass to the left to Cordarrelle Patterson for 5 yards to the Min30. Tackled by Erik Walden and Darryl Morris.","(6:19) Sam Bradford sacked at Min25 for a loss of 4 yards by Erik Walden.","(6:46) Sam Bradford pass to the right to Jerick McKinnon for 3 yards to the Min29. Tackled by Chris Milton and T.J. Green.","(7:02) Sam Bradford pass to the right to Jerick McKinnon for 2 yards to the Min26. Tackled by Chris Milton.","(7:25) Sam Bradford pass to the right to Jerick McKinnon for 6 yards to the Min24. Tackled by Akeem Ayers.","(7:46) Sam Bradford pass to the right to Cordarrelle Patterson for 2 yards to the Min18. Tackled by T.J. Green.","(7:54) Pat McAfee punts for 41 yards to Min16. No return.","(8:35) Robert Turbin rush up the middle for 2 yards to the Ind43. Tackled by Anthony Harris.","(9:18) Robert Turbin rush to the right for 5 yards to the Ind41. Tackled by Linval Joseph.","(10:04) Frank Gore rush to the right for 1 yard to the Ind36. Tackled by Shamar Stephen.","(10:29) Andrew Luck pass to the right to T.Y. Hilton for 2 yards to the Ind35.","(11:11) Frank Gore rush to the right for 2 yards to the Ind33. Tackled by Terence Newman and Shamar Stephen.","(11:57) Frank Gore rush up the middle for 6 yards to the Ind31. Tackled by Shamar Stephen.","(11:57) Kai Forbath kicks off to the endzone. Touchback.","(12:02) Kai Forbath 51 yard field goal attempt is GOOD. Holder: Jeff Locke.","(12:44) Sam Bradford sacked at Ind33 for a loss of 9 yards by T.Y. McGill.","(12:49) Sam Bradford incomplete pass to the right intended for Cordarrelle Patterson.","(13:17) Sam Bradford pass to the left to Jarius Wright for 2 yards to the Ind24. Tackled by Darryl Morris.","(13:42) Sam Bradford pass to the right to Kyle Rudolph for 23 yards to the Ind26. Tackled by T.J. Green.","(14:04) Sam Bradford pass to the right to Stefon Diggs for 11 yards to the Ind49. Tackled by Darryl Morris.","(14:08) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(14:27) Sam Bradford pass to the right to Jerick McKinnon for 5 yards to the Min40.","(14:48) Sam Bradford pass to the middle to Kyle Rudolph for 7 yards to the Min35. Tackled by Edwin Jackson.","(14:55) Pat McAfee kicks off to the Min-7. Cordarrelle Patterson return for 35 yards to Min28. Tackled by Deon King.","(14:55) Adam Vinatieri extra point is good.","(15:00) Andrew Luck pass to the left to Phillip Dorsett for 50 yards for a TOUCHDOWN.","(0:47) Robert Turbin rush to the right for 12 yards to the Ind50. Tackled by Andrew Sendejo.","(1:31) Frank Gore rush up the middle for 5 yards to the Ind38. Tackled by Eric Kendricks.","(2:10) Frank Gore rush to the right for 5 yards to the Ind33. Tackled by Anthony Harris and Shamar Stephen.","(2:32) Andrew Luck pass to the left to Chester Rogers for 8 yards to the Ind28. Tackled by Captain Munnerlyn.","(3:12) Frank Gore rush to the left for 4 yards to the Ind20. Tackled by Linval Joseph.","(3:47) Andrew Luck pass to the middle to Frank Gore for 4 yards to the Ind16. Tackled by Chad Greenway.","(3:51) Kai Forbath kicks off to the Ind1. Jordan Todman return for 11 yards to Ind12. Tackled by Andrew Sendejo.","(3:55) Kai Forbath 32 yard field goal attempt is GOOD. Holder: Jeff Locke.","(3:59) Sam Bradford incomplete pass to the right intended for Cordarrelle Patterson.","(4:42) Sam Bradford sacked at Ind14 for a loss of 8 yards by Erik Walden.","(5:08) Sam Bradford pass to the left to Charles Johnson for 5 yards to the Ind6. Tackled by Vontae Davis.","(5:32) Sam Bradford pass to the left to Matt Asiata for 20 yards to the Ind11. Tackled by Mike Adams.","(6:04) Sam Bradford pass to the left to Jerick McKinnon for 5 yards to the Ind31. Tackled by Edwin Jackson.","(6:17) Sam Bradford pass to the left to Kyle Rudolph for 2 yards to the Ind36. Tackled by Mike Adams.","(6:22) Sam Bradford incomplete pass to the right intended for Stefon Diggs defensed by Darryl Morris.","(6:50) Sam Bradford pass to the middle to Jerick McKinnon for 8 yards to the Ind38. Tackled by Darryl Morris.","(7:05) Sam Bradford pass to the right to Kyle Rudolph for 7 yards to the Ind46. Tackled by Mike Adams.","(7:31) Jerick McKinnon rush to the right for 6 yards to the Min47. Tackled by Antonio Morrison.","(7:36) Penalty: Roughing Passer on Indianapolis (Henry Anderson) 15 yards.","(8:01) Sam Bradford pass to the right to Cordarrelle Patterson for 11 yards to the Min26. Tackled by T.J. Green and Darryl Morris.","(8:09) Pat McAfee punts for 44 yards to Min15. No return.","(8:51) Andrew Luck pass to the right to Jack Doyle for 3 yards to the Ind41. Tackled by Andrew Sendejo.","(9:34) Frank Gore rush up the middle for 3 yards to the Ind38. Tackled by Linval Joseph.","(10:15) Frank Gore rush to the right for 2 yards to the Ind35. Tackled by Chad Greenway.","(10:22) Sam Bradford sacked at Ind32 for a loss of 8 yards by Robert Mathis. FUMBLE, recovered by Ind (Henry Anderson). Tackled by Jeremiah Sirles.","(10:50) Sam Bradford pass to the right to Charles Johnson for 7 yards to the Ind24. Tackled by Darryl Morris.","(11:18) Jerick McKinnon rush up the middle for 5 yards to the Ind31. Tackled by Edwin Jackson.","(11:53) Sam Bradford pass to the right to Charles Johnson for 11 yards to the Ind36. Tackled by Antonio Morrison.","(12:00) Penalty: Unnecessary Roughness on Indianapolis (Darius Butler) 15 yards.","(12:27) Sam Bradford pass to the left to Charles Johnson for 10 yards to the Min38. Tackled by Rashaan Melvin.","(12:48) Penalty: False Start on Minnesota (Charles Johnson) -5 yards.","(13:20) Sam Bradford pass to the left to Stefon Diggs for 2 yards to the Min33. Tackled by Edwin Jackson.","(13:50) Adrian Peterson rush to the right for 4 yards to the Min31. Tackled by Rashaan Melvin.","(14:30) Sam Bradford pass to the left to Cordarrelle Patterson for 12 yards to the Min27. Tackled by Mike Adams.","(14:56) Adrian Peterson rush to the right for 2 yards to the Min15. Tackled by Trent Cole.","(15:00) Pat McAfee kicks off to the Min-8. Cordarrelle Patterson return for 21 yards to Min13. Tackled by Akeem Ayers.","(0:03) Adam Vinatieri 50 yard field goal attempt is GOOD. Holder: Pat McAfee.","(0:03) Indianapolis Colts timeout.","(0:19) Frank Gore rush up the middle for 4 yards to the Min32. Tackled by Linval Joseph and Everson Griffen.","(0:28) Sam Bradford pass intended for Stefon Diggs INTERCEPTED by Mike Adams. No return. Tackled by Stefon Diggs.","(0:33) Pat McAfee kicks off to the Min-5. Cordarrelle Patterson return for 28 yards to Min23. Tackled by Jordan Todman.","(0:33) Adam Vinatieri extra point is good.","(0:41) Robert Turbin rush to the right for 6 yards for a TOUCHDOWN.","(0:41) Indianapolis Colts timeout.","(0:49) Robert Turbin rush to the left for 4 yards to the Min6. Tackled by Danielle Hunter.","(0:56) Andrew Luck pass to the left to Robert Turbin for 17 yards to the Min10. Tackled by Anthony Harris.","(1:02) Penalty: Illegal Use of Hands on Minnesota (Danielle Hunter) 5 yards.","(1:06) Andrew Luck incomplete pass to the right intended for Chester Rogers defensed by Terence Newman.","(1:39) Frank Gore rush up the middle for 4 yards to the Min32. Tackled by Linval Joseph.","(2:00) Frank Gore rush to the left for 9 yards to the Min36. Tackled by Anthony Harris and Linval Joseph.","(2:00) Penalty: Offside on Minnesota (Everson Griffen) 5 yards.","(2:00) Two Minute Warning.","(2:12) Andrew Luck pass to the left to Robert Turbin for 5 yards to the Ind50. Tackled by Xavier Rhodes.","(2:17) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(2:54) Andrew Luck pass to the right to Dwayne Allen for 13 yards to the Ind45. Tackled by Anthony Harris.","(3:19) Penalty: False Start on Indianapolis (Le'Raven Clark) -5 yards.","(4:00) Frank Gore rush to the right for 3 yards to the Ind37. Tackled by Brian Robison and Linval Joseph.","(4:44) Andrew Luck pass to the middle to Jack Doyle for 13 yards to the Ind34. Tackled by Eric Kendricks.","(5:26) Frank Gore rush to the left for 4 yards to the Ind21. Tackled by Andrew Sendejo.","(6:08) Frank Gore rush to the left for 8 yards to the Ind17. Tackled by Anthony Harris and Anthony Barr.","(6:22) Adrian Peterson rush up the middle for 13 yards to the Ind9. Tackled by Mike Adams. FUMBLE, recovered by Ind (Mike Adams). Tackled by Adrian Peterson.","(7:10) Sam Bradford pass to the left to Kyle Rudolph for 28 yards to the Ind22. Tackled by Edwin Jackson.","(7:16) Pat McAfee kicks off to the Min-5. Cordarrelle Patterson return for 40 yards to Min35. Tackled by Chris Milton. Penalty: Unnecessary Roughness on Indianapolis (Jordan Todman) 15 yards.","(7:16) Adam Vinatieri extra point is good.","(7:23) Andrew Luck pass to the left to Erik Swoope for 27 yards for a TOUCHDOWN.","(8:04) Andrew Luck pass to the left to Erik Swoope for 16 yards to the Min27. Tackled by Xavier Rhodes.","(8:47) Frank Gore rush up the middle for 5 yards to the Min43. Tackled by Anthony Harris and Eric Kendricks.","(9:29) Frank Gore rush to the left for 6 yards to the Min48. Tackled by Tom Johnson.","(9:34) Penalty: Holding on Minnesota (Terence Newman) 5 yards.","(10:14) Andrew Luck pass to the left to Chester Rogers for 9 yards to the Ind41. Tackled by Xavier Rhodes.","(10:57) Andrew Luck pass to the right to Frank Gore for 9 yards to the Ind32. Tackled by Eric Kendricks.","(11:31) Andrew Luck pass to the right to Erik Swoope for 7 yards to the Ind23. Tackled by Terence Newman.","(12:13) Andrew Luck pass to the middle to Jack Doyle for 5 yards to the Ind16. Tackled by Eric Kendricks.","(12:55) Frank Gore rush to the right for 3 yards to the Ind11. Tackled by Eric Kendricks and Linval Joseph.","(13:04) Jeff Locke punts for 50 yards to Ind8. No return.","(13:08) Sam Bradford incomplete pass to the left intended for Stefon Diggs.","(13:44) Adrian Peterson rush up the middle for no gain to the Min42. Tackled by T.J. Green and Zach Kerr.","(14:07) Sam Bradford pass to the right to Kyle Rudolph for 4 yards to the Min42. Tackled by Rashaan Melvin.","(14:15) Pat McAfee punts for 42 yards to Min38. No return.","(14:20) Andrew Luck incomplete pass to the left intended for Chester Rogers.","(15:00) Frank Gore rush up the middle for 3 yards to the Ind20. Tackled by Eric Kendricks.","(15:00) Penalty: False Start on Indianapolis (Joe Haeg) -5 yards.","(0:10) Frank Gore rush to the right for 5 yards to the Ind22. Tackled by Xavier Rhodes.","(0:22) Jeff Locke punts for 44 yards to Ind17. No return.","(0:27) Sam Bradford incomplete pass to the right intended for Adam Thielen.","(0:44) Penalty: False Start on Minnesota (Stefon Diggs) -5 yards.","(1:09) Jerick McKinnon rush to the right for 1 yard to the Min44. Tackled by Akeem Ayers.","(1:51) Adrian Peterson rush up the middle for 1 yard to the Min43. Tackled by Antonio Morrison.","(2:22) Sam Bradford pass to the right to Charles Johnson for 17 yards to the Min42. Tackled by Rashaan Melvin.","(2:22) Pat McAfee kicks off to the endzone. Touchback.","(2:22) Adam Vinatieri extra point is good.","(2:25) Robert Turbin rush up the middle for 1 yard for a TOUCHDOWN.","(3:02) Frank Gore rush to the left for no gain to the Min1. Tackled by Emmanuel Lamur and Linval Joseph.","(3:07) Penalty: Leverage on Minnesota (Linval Joseph) 2 yards.","(3:10) Andrew Luck incomplete pass to the right intended for T.Y. Hilton defensed by Captain Munnerlyn.","(3:13) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(3:20) Andrew Luck incomplete pass to the left intended for Dwayne Allen defensed by Anthony Harris.","(3:57) Andrew Luck pass to the left to Chester Rogers for 7 yards to the Min3. Tackled by Xavier Rhodes.","(4:39) Jordan Todman rush to the left for 4 yards to the Min10. Tackled by Anthony Harris.","(5:10) Frank Gore rush to the left for 4 yards to the Min14. Tackled by Chad Greenway and Eric Kendricks.","(5:58) Andrew Luck pass to the left to T.Y. Hilton for 31 yards to the Min18. Tackled by Anthony Harris.","(6:42) Frank Gore rush up the middle for 2 yards to the Min49. Tackled by Linval Joseph and Anthony Harris.","(7:19) Andrew Luck pass to the right to Frank Gore for 1 yard to the Ind49. Tackled by Terence Newman.","(7:34) Jeff Locke punts for 52 yards to Ind18. Chester Rogers return for 30 yards to Ind48. Tackled by Jeff Locke.","(8:06) Sam Bradford pass to the left to Kyle Rudolph for 2 yards to the Min30. Tackled by T.J. Green.","(8:34) Sam Bradford pass to the right to Adrian Peterson for 1 yard to the Min28. Tackled by Darius Butler.","(9:01) Adrian Peterson rush up the middle for 2 yards to the Min27. Tackled by Antonio Morrison.","(9:01) Pat McAfee kicks off to the endzone. Touchback.","(9:06) Adam Vinatieri 48 yard field goal attempt is GOOD. Holder: Pat McAfee.","(9:47) Andrew Luck rush to the left for 8 yards to the Min30. Tackled by Emmanuel Lamur.","(9:53) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(10:32) Frank Gore rush to the right for no gain to the Min38. Tackled by Anthony Harris.","(11:12) Andrew Luck pass to the left to Jack Doyle for 11 yards to the Min38. Tackled by Anthony Harris.","(11:56) Andrew Luck pass to the right to T.Y. Hilton for 12 yards to the Min49. Tackled by Andrew Sendejo.","(12:36) Robert Turbin rush to the left for 2 yards to the Ind39. Tackled by Andrew Sendejo.","(13:12) Andrew Luck pass to the left to Frank Gore for no gain to the Ind37. Tackled by Chad Greenway.","(13:45) Frank Gore rush up the middle for 4 yards to the Ind37. Tackled by Eric Kendricks and Anthony Harris.","(14:19) Frank Gore rush up the middle for 8 yards to the Ind33. Tackled by Anthony Harris.","(14:56) Frank Gore rush to the left for 1 yard to the Ind25. Tackled by Linval Joseph.","(15:00) Kai Forbath kicks off to the Ind-2. Jordan Todman return for 26 yards to Ind24. Tackled by Kentrell Brothers."]