["(0:20) Tom Savage rush up the middle for a loss of 2 yards to the Jax28.","(1:01) Tom Savage rush up the middle for a loss of 1 yard to the Jax26.","(1:10) Blake Bortles pass intended for Allen Robinson INTERCEPTED by Quintin Demps and returned for 12 yards. Tackled by Bryan Walters.","(1:20) Shane Lechler punts for 32 yards to Jax7. No return.","(1:20) Houston Texans timeout.","(1:40) Lamar Miller rush to the left for a loss of 2 yards to the Jax39. Tackled by Malik Jackson and Telvin Smith.","(1:40) Jacksonville Jaguars timeout.","(1:45) Lamar Miller rush to the right for 1 yard to the Jax37. Tackled by Paul Posluszny and Sen'Derrick Marks.","(1:45) Jacksonville Jaguars timeout.","(1:48) Lamar Miller rush up the middle for 2 yards to the Jax38. Tackled by Dan Skuta.","(1:58) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(1:58) Two Minute Warning.","(2:05) Blake Bortles incomplete pass to the right intended for T.J. Yeldon defensed by Eddie Pleasant.","(2:05) Penalty: False Start on Jacksonville (Kelvin Beachum) -5 yards.","(2:05) Jacksonville Jaguars timeout.","(2:09) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(2:15) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(2:46) Blake Bortles pass to the left to Bryan Walters for 15 yards to the Jax45. Tackled by Andre Hal.","(2:51) Penalty: Holding on Houston (A.J. Bouye) 5 yards.","(2:51) Nick Novak kicks off to the endzone. Touchback.","(2:51) Nick Novak extra point is good. Penalty: Running into Kicker on Jacksonville (Johnathan Cyprien) 5 yards.","(2:54) Lamar Miller rush to the left for 1 yard for a TOUCHDOWN.","(2:58) Penalty: Pass Interference on Jacksonville (Johnathan Cyprien) 6 yards.","(3:03) Tom Savage incomplete pass to the left intended for DeAndre Hopkins.","(3:10) Tom Savage pass to the left to Lamar Miller for 10 yards to the Jax7. Tackled by Johnathan Cyprien.","(3:46) Tom Savage pass to the left to Ryan Griffin for 8 yards to the Jax17. Tackled by Paul Posluszny.","(3:50) Penalty: Pass Interference on Jacksonville (Jalen Ramsey) 10 yards.","(3:55) Tom Savage incomplete pass to the left intended for DeAndre Hopkins.","(4:31) Tom Savage rush up the middle for 3 yards to the Jax35. Tackled by Telvin Smith.","(5:12) Tom Savage pass to the right to Will Fuller V for 10 yards to the Jax38. Tackled by Prince Amukamara.","(5:47) Tom Savage pass to the right to Ryan Griffin for 4 yards to the Jax48. Tackled by Johnathan Cyprien.","(5:57) Brad Nortman punts for 41 yards to Hou44. Will Fuller V return for 4 yards to Hou48. Tackled by Arrelious Benn.","(6:02) Blake Bortles incomplete pass to the left intended for Ben Koyack.","(6:48) Blake Bortles pass to the left to Ben Koyack for 2 yards to the Jax15. Tackled by Kareem Jackson.","(7:32) T.J. Yeldon rush to the right for a loss of 2 yards to the Jax13. Tackled by Jadeveon Clowney.","(7:54) Penalty: Holding on Jacksonville (Kelvin Beachum) -10 yards.","(7:54) Nick Novak kicks off to the endzone. Touchback.","(7:57) Nick Novak 27 yard field goal attempt is GOOD. Holder: Shane Lechler.","(7:57) Lamar Miller rush to the right for a loss of 2 yards to the Jax10. Tackled by Sen'Derrick Marks.","(8:02) Tom Savage incomplete pass to the right intended for Will Fuller V defensed by Jalen Ramsey.","(8:44) Tom Savage pass to the right to Ryan Griffin for 8 yards to the Jax8. Tackled by Johnathan Cyprien.","(9:31) Tom Savage pass to the left to DeAndre Hopkins for 7 yards to the Jax16. Tackled by Jalen Ramsey.","(10:15) Tom Savage pass to the left to DeAndre Hopkins for 12 yards to the Jax23. Tackled by Peyton Thompson.","(10:41) Penalty: Pass Interference on Houston (Ryan Griffin) -10 yards.","(11:24) Tom Savage pass to the middle to Alfred Blue for 4 yards to the Jax25. Tackled by Paul Posluszny.","(12:06) Tom Savage pass to the middle to DeAndre Hopkins for 16 yards to the Jax29. Tackled by Paul Posluszny.","(12:17) Tom Savage incomplete pass to the right intended for Will Fuller V.","(12:53) Tom Savage pass to the left to DeAndre Hopkins for 12 yards to the Jax45. Tackled by Jalen Ramsey.","(12:58) Tom Savage incomplete pass to the left intended for Wendall Williams.","(13:05) Tom Savage incomplete pass to the right intended for Will Fuller V.","(13:35) Lamar Miller rush up the middle for 3 yards to the Hou43. Tackled by Johnathan Cyprien.","(13:59) Tom Savage pass to the middle to Ryan Griffin for 8 yards to the Hou40. Tackled by Johnathan Cyprien and Paul Posluszny.","(14:14) Brad Nortman punts for 55 yards to Hou7. Will Fuller V return for 25 yards to Hou32. Tackled by Corey Grant.","(14:17) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(15:00) T.J. Yeldon rush to the left for 2 yards to the Jax38. Tackled by Ufomba Kamalu.","(0:03) Chris Ivory rush to the left for 6 yards to the Jax36. Tackled by Quintin Demps.","(0:11) Nick Novak kicks off to the Jax-3. Marqise Lee return for 33 yards to Jax30. Tackled by Akeem Dent.","(0:15) Nick Novak 43 yard field goal attempt is GOOD. Holder: Shane Lechler.","(0:20) Tom Savage incomplete pass to the left intended for DeAndre Hopkins defensed by Jalen Ramsey.","(0:28) Tom Savage incomplete pass to the left intended for DeAndre Hopkins defensed by Jalen Ramsey.","(1:08) Tom Savage pass to the left to Stephen Anderson for 7 yards to the Jax25. Tackled by Johnathan Cyprien.","(1:49) Tom Savage pass to the left to Will Fuller V for 22 yards to the Jax32. Tackled by Tashaun Gipson and Johnathan Cyprien.","(1:57) Tom Savage incomplete pass to the left intended for DeAndre Hopkins.","(2:31) Tom Savage pass to the left to Jonathan Grimes for 4 yards to the Hou46. Tackled by Peyton Thompson and Paul Posluszny.","(3:03) Jonathan Grimes rush up the middle for 3 yards to the Hou42. Tackled by Johnathan Cyprien.","(3:26) Tom Savage pass to the left to DeAndre Hopkins for 9 yards to the Hou39. Tackled by Telvin Smith.","(3:36) Brad Nortman punts for 49 yards to Hou30. No return.","(4:16) Blake Bortles pass to the right to T.J. Yeldon for 10 yards to the Jax21. Tackled by Kareem Jackson and Brian Cushing.","(4:21) Blake Bortles incomplete pass to the left intended for Marqise Lee defensed by Jadeveon Clowney.","(4:41) Chris Ivory rush up the middle for no gain to the Jax22. Tackled by Ufomba Kamalu and Quintin Demps. Penalty: Unnecessary Roughness on Jacksonville (Chris Ivory) -11 yards.","(5:07) T.J. Yeldon rush to the right for 12 yards to the Jax22. Tackled by Andre Hal.","(5:15) Shane Lechler punts for 59 yards to Jax11. Bryan Walters return for a loss of 1 yard to Jax10. Tackled by Akeem Hunt.","(5:22) Tom Savage incomplete pass to the left intended for Keith Mumphery defensed by Malik Jackson.","(6:04) Lamar Miller rush to the left for 1 yard to the Hou30. Tackled by Johnathan Cyprien and Tyson Alualu.","(6:41) Lamar Miller rush to the left for 5 yards to the Hou29. Tackled by Telvin Smith.","(6:50) Jason Myers kicks off to the Hou10. Akeem Hunt return for 24 yards to Hou34. Tackled by Jason Myers. Penalty: Holding on Houston (Corey Moore) -10 yards.","(6:50) Jason Myers extra point is good.","(7:02) Nick Novak kicks off to the Jax0. Marqise Lee return for 100 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Jacksonville (Marqise Lee) -15 yards.","(7:07) Nick Novak 45 yard field goal attempt is GOOD. Holder: Shane Lechler.","(7:51) Tom Savage pass to the left to Keith Mumphery for 11 yards to the Jax27. Tackled by Peyton Thompson.","(7:51) Houston Texans timeout.","(7:58) Tom Savage incomplete pass to the left intended for DeAndre Hopkins.","(8:21) Penalty: False Start on Houston (Will Fuller V) -5 yards.","(9:00) Lamar Miller rush to the right for a loss of 1 yard to the Jax33. Tackled by Abry Jones.","(9:42) Tom Savage pass to the left to DeAndre Hopkins for 13 yards to the Jax32. Tackled by Johnathan Cyprien.","(10:24) Lamar Miller rush up the middle for 2 yards to the Jax45. Tackled by Johnathan Cyprien.","(11:03) Tom Savage pass to the left to Ryan Griffin for 23 yards to the Jax47. Tackled by Johnathan Cyprien and Tashaun Gipson.","(11:43) Lamar Miller rush to the right for 11 yards to the Hou30. Tackled by Johnathan Cyprien.","(12:16) Lamar Miller rush to the left for 3 yards to the Hou19. Tackled by Abry Jones.","(12:24) Brad Nortman punts for 39 yards to Hou16. No return.","(12:38) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(13:19) Chris Ivory rush to the left for 2 yards to the Jax45. Tackled by Brian Cushing and Brennan Scarlett.","(13:52) Blake Bortles pass to the right to T.J. Yeldon for 4 yards to the Jax43. Tackled by Benardrick McKinney.","(14:23) Blake Bortles pass to the right to Allen Robinson for 9 yards to the Jax39. Tackled by Robert Nelson Jr..","(14:30) Blake Bortles incomplete pass to the right intended for Bryan Walters.","(15:00) Chris Ivory rush to the right for 5 yards to the Jax30. Tackled by Jadeveon Clowney and Andre Hal.","(15:00) Nick Novak kicks off to the endzone. Touchback.","(0:26) Blake Bortles pass to the middle to T.J. Yeldon for 7 yards to the Jax34. Tackled by Benardrick McKinney and Andre Hal.","(0:49) T.J. Yeldon rush up the middle for 2 yards to the Jax27. Tackled by Brennan Scarlett and D.J. Reader.","(0:49) Nick Novak kicks off to the endzone. Touchback.","(0:53) Nick Novak 39 yard field goal attempt is GOOD. Holder: Shane Lechler.","(0:53) Houston Texans timeout.","(1:06) Tom Savage pass to the right to DeAndre Hopkins for 5 yards to the Jax22. Tackled by Jalen Ramsey.","(1:06) Houston Texans timeout.","(1:12) Tom Savage pass to the right to Will Fuller V for 4 yards to the Jax27. Tackled by Paul Posluszny.","(1:18) Tom Savage incomplete pass to the left intended for Jonathan Grimes.","(1:23) Tom Savage pass to the left to DeAndre Hopkins for 13 yards to the Jax31.","(1:30) Tom Savage pass to the right to Ryan Griffin for 18 yards to the Jax44.","(1:35) Brad Nortman kicks off to the Hou26. Will Fuller V return for 12 yards to Hou38. Tackled by Peyton Thompson and Corey Grant.","(1:49) Penalty: Holding on Jacksonville (Neal Sterling) -4 yards. Safety.","(1:54) Blake Bortles incomplete pass to the left intended for T.J. Yeldon.","(2:00) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(2:00) Two Minute Warning.","(2:36) T.J. Yeldon rush up the middle for 3 yards to the Jax4. Tackled by Quintin Demps.","(2:41) Tom Savage incomplete pass to the right intended for DeAndre Hopkins defensed by Jalen Ramsey.","(3:24) Lamar Miller rush up the middle for no gain to the Jax1. Tackled by Jarrod Wilson.","(3:35) Akeem Hunt rush up the middle for 1 yard to the Jax1. Tackled by Tyson Alualu. FUMBLE, recovered by Hou.","(4:16) Akeem Hunt rush up the middle for 7 yards to the Jax2. Tackled by Tashaun Gipson and Dan Skuta.","(4:24) Penalty: Holding on Jacksonville (Johnathan Cyprien) 5 yards.","(5:10) Lamar Miller rush to the right for 5 yards to the Jax14. Tackled by Telvin Smith and Paul Posluszny.","(5:51) Will Fuller V rush to the right for a loss of 3 yards to the Jax19. Tackled by Johnathan Cyprien and Paul Posluszny.","(6:29) Tom Savage pass to the right to Wendall Williams for 32 yards to the Jax16. Tackled by Tashaun Gipson.","(7:07) Lamar Miller rush to the right for 4 yards to the Jax48. Tackled by Tyson Alualu.","(7:15) Penalty: Holding on Jacksonville (Prince Amukamara) 5 yards.","(7:54) Lamar Miller rush to the right for 9 yards to the Hou43. Tackled by Telvin Smith.","(8:31) Lamar Miller rush to the left for 9 yards to the Hou34. Tackled by Tyson Alualu.","(8:32) Jason Myers kicks off to the endzone. Touchback.","(8:32) Jason Myers extra point is good.","(8:39) Blake Bortles rush to the left for 1 yard for a TOUCHDOWN.","(9:15) Chris Ivory rush to the left for 2 yards to the Hou1. Tackled by Benardrick McKinney and Vince Wilfork.","(9:22) Penalty: Pass Interference on Houston (A.J. Bouye) 31 yards.","(9:56) T.J. Yeldon rush to the right for 3 yards to the Hou34. Tackled by Kareem Jackson and Brennan Scarlett.","(10:02) Blake Bortles incomplete pass to the left intended for Chris Ivory.","(10:09) Brock Osweiler pass intended for DeAndre Hopkins INTERCEPTED by Telvin Smith. No return. Tackled by Jonathan Grimes.","(10:34) Penalty: Holding on Houston (Ryan Griffin) -10 yards.","(11:16) Akeem Hunt rush to the left for 7 yards to the Hou32. Tackled by Jalen Ramsey. FUMBLE, recovered by Hou (Akeem Hunt).","(11:16) Jason Myers kicks off to the endzone. Touchback.","(11:21) Jason Myers 50 yard field goal attempt is GOOD. Holder: Brad Nortman.","(11:24) Penalty: Holding on Jacksonville (Josh Wells) -10 yards.","(12:11) Blake Bortles sacked at Hou22 for a loss of 1 yard by Benardrick McKinney.","(12:16) Blake Bortles incomplete pass to the left intended for Bryan Walters.","(12:54) Chris Ivory rush to the right for 4 yards to the Hou21. Tackled by Brennan Scarlett.","(13:10) Brock Osweiler pass intended for Will Fuller V INTERCEPTED by Jalen Ramsey and returned for 35 yards. Tackled by Will Fuller V.","(13:36) Brock Osweiler pass to the middle to Lamar Miller for 16 yards to the Hou41. Tackled by Telvin Smith.","(13:36) Jason Myers kicks off to the endzone. Touchback.","(13:41) Jason Myers 26 yard field goal attempt is GOOD. Holder: Brad Nortman.","(14:10) Blake Bortles pass to the left to T.J. Yeldon for 10 yards to the Hou8. Tackled by Brian Cushing.","(14:20) Penalty: False Start on Jacksonville (Neal Sterling) -5 yards.","(15:00) Blake Bortles pass to the left to Allen Robinson for 6 yards to the Hou13. Tackled by A.J. Bouye and Benardrick McKinney.","(0:31) Blake Bortles rush to the left for a loss of 6 yards to the Hou19. Tackled by Jadeveon Clowney.","(1:10) Blake Bortles pass to the left to Bryan Walters for 11 yards to the Hou13. Tackled by A.J. Bouye.","(1:16) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(1:50) Chris Ivory rush to the left for 1 yard to the Hou24. Tackled by Jadeveon Clowney.","(2:24) Chris Ivory rush to the left for 17 yards to the Hou25. Tackled by Quintin Demps.","(3:00) Blake Bortles pass to the middle to Neal Sterling for 14 yards to the Hou42. Tackled by Quintin Demps.","(3:45) T.J. Yeldon rush to the right for 5 yards to the Jax44. Tackled by Max Bullough and D.J. Reader.","(4:12) Blake Bortles pass to the right to T.J. Yeldon for 3 yards to the Jax39. Tackled by Benardrick McKinney.","(4:24) Shane Lechler punts for 47 yards to Jax26. Bryan Walters return for 10 yards to Jax36. Tackled by Akeem Dent.","(5:04) Brock Osweiler pass to the right to Jonathan Grimes for 8 yards to the Hou27. Tackled by Telvin Smith.","(5:08) Brock Osweiler incomplete pass to the right intended for Stephen Anderson.","(5:33) Alfred Blue rush to the right for 1 yard to the Hou19. Tackled by Prince Amukamara.","(5:47) Brad Nortman punts for 67 yards to Hou24. Will Fuller V - no return. FUMBLE, recovered by Hou (Wendall Williams) and advanced for a loss of 6 yards.","(6:20) Blake Bortles sacked at Jax9 for a loss of 8 yards by Jadeveon Clowney.","(7:04) Chris Ivory rush to the right for 3 yards to the Jax17. Tackled by Joel Heath.","(7:36) Chris Ivory rush to the right for 4 yards to the Jax14. Tackled by Akeem Dent.","(7:45) Shane Lechler punts for 41 yards to Jax10. No return.","(7:50) Brock Osweiler incomplete pass to the right intended for Stephen Anderson.","(8:29) Lamar Miller rush to the left for 2 yards to the Hou49. Tackled by Johnathan Cyprien and Abry Jones.","(9:01) Lamar Miller rush to the right for 3 yards to the Hou47. Tackled by Sheldon Day.","(9:33) Brock Osweiler pass to the right to Will Fuller V for 6 yards to the Hou44.","(9:41) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(10:15) Lamar Miller rush to the right for 5 yards to the Hou38. Tackled by Myles Jack.","(10:28) Brad Nortman punts for 64 yards to Hou24. Will Fuller V return for 9 yards to Hou33. Tackled by Corey Grant.","(10:32) Blake Bortles incomplete pass to the left intended for Bryan Walters defensed by Quintin Demps.","(11:16) Blake Bortles pass to the right to Alex Ellis for 1 yard to the Jax12. Tackled by Corey Moore.","(11:48) T.J. Yeldon rush up the middle for 3 yards to the Jax11. Tackled by Brian Cushing and Benardrick McKinney.","(11:58) Shane Lechler punts for 47 yards to Jax8. No return.","(12:33) Brock Osweiler pass to the right to Ryan Griffin for 7 yards to the Hou45. Tackled by Johnathan Cyprien.","(13:05) Brock Osweiler pass to the middle to Wendall Williams for 2 yards to the Hou38. Tackled by Paul Posluszny.","(13:57) Lamar Miller rush to the right for a loss of 1 yard to the Hou36. Tackled by Malik Jackson and Paul Posluszny.","(14:30) Lamar Miller rush up the middle for 3 yards to the Hou37. Tackled by Johnathan Cyprien.","(15:00) Brock Osweiler pass to the right to Ryan Griffin for 9 yards to the Hou34. Tackled by Yannick Ngakoue.","(15:00) Jason Myers kicks off to the endzone. Touchback."]