["(0:34) Shaun Draughn rush to the right for 9 yards to the SF35. Tackled by Sharrod Neasman and Paul Worrilow.","(1:02) Shaun Draughn rush to the right for 4 yards to the SF26. Tackled by LaRoy Reynolds.","(1:09) Matt Bosher kicks off to the SF7. JaCorey Shepherd return for 15 yards to SF22. Tackled by Brooks Reed.","(1:13) Matt Bryant 41 yard field goal attempt is GOOD. Holder: Matt Bosher.","(1:13) Atlanta Falcons timeout.","(2:00) Terron Ward rush to the left for 2 yards to the SF23. Tackled by Ahmad Brooks.","(2:00) Two Minute Warning.","(2:38) Terron Ward rush to the left for 3 yards to the SF25. Tackled by Tank Carradine and Chris Jones.","(3:22) Terron Ward rush to the left for a loss of 1 yard to the SF28. Tackled by Chris Jones.","(4:08) Matt Schaub pass to the middle to Justin Hardy for 16 yards to the SF27. Tackled by Marcus Ball.","(4:49) Terron Ward rush to the right for 1 yard to the SF43. Tackled by Ahmad Brooks.","(5:32) Terron Ward rush to the left for 2 yards to the SF44. Tackled by Michael Wilhoite.","(6:15) Terron Ward rush to the left for 45 yards to the SF46. Tackled by Marcus Cromartie.","(6:23) Bradley Pinion punts for 40 yards to Atl9. No return.","(6:58) Colin Kaepernick pass to the right to Rod Streater for 6 yards to the Atl49. Tackled by Robert Alford.","(7:44) Colin Kaepernick rush to the right for no gain to the SF45. Tackled by Brian Poole.","(7:50) Colin Kaepernick incomplete pass to the right intended for Je'Ron Hamm.","(8:24) Colin Kaepernick pass to the middle to Aaron Burbridge for 15 yards to the SF45. Tackled by Brian Poole.","(9:01) Colin Kaepernick pass to the left to Jeremy Kerley for 7 yards to the SF30. Tackled by Deion Jones.","(9:43) Carlos Hyde rush to the left for a loss of 1 yard to the SF23. Tackled by Deion Jones and Brian Poole.","(10:11) Carlos Hyde rush to the right for 12 yards to the SF24. Tackled by Keanu Neal and Ricardo Allen.","(10:22) Penalty: False Start on San Francisco (Trenton Brown) -5 yards.","(10:51) Colin Kaepernick pass to the left to Jeremy Kerley for 4 yards to the SF17. Tackled by Deion Jones.","(11:00) Matt Bosher punts for 26 yards to SF13. No return.","(11:06) Matt Ryan incomplete pass to the left intended for Taylor Gabriel.","(11:48) Tevin Coleman rush to the right for no gain to the SF39. Tackled by Michael Wilhoite.","(12:26) Tevin Coleman rush to the right for a loss of 2 yards to the SF39. Tackled by Jaquiski Tartt.","(13:16) Matt Ryan pass to the left to Levine Toilolo for 30 yards to the SF37. Tackled by Antoine Bethea.","(13:52) Devonta Freeman rush to the left for no gain to the Atl33. Tackled by Quinton Dial and Tank Carradine.","(14:35) Matt Ryan pass to the right to Tevin Coleman for 4 yards to the Atl33. Tackled by Michael Wilhoite.","(15:00) Tevin Coleman rush to the left for 1 yard to the Atl29. Tackled by Michael Wilhoite.","(0:45) Tevin Coleman rush to the left for 6 yards to the Atl28. Tackled by Marcus Cromartie.","(0:54) Bradley Pinion punts for 46 yards to Atl22. No return.","(1:01) Colin Kaepernick incomplete pass to the right intended for Carlos Hyde defensed by Keanu Neal.","(1:31) Colin Kaepernick pass to the right to Jeremy Kerley for 8 yards to the SF32. Tackled by Ricardo Allen.","(1:34) Colin Kaepernick incomplete pass to the left intended for Garrett Celek defensed by Paul Worrilow.","(1:42) Matt Bosher kicks off to the SF1. JaCorey Shepherd return for 23 yards to SF24. Tackled by LaRoy Reynolds.","(1:42) Matt Bryant extra point is good.","(1:49) Devonta Freeman rush to the left for 34 yards for a TOUCHDOWN.","(2:12) Devonta Freeman rush to the left for 6 yards to the SF39. Tackled by Antoine Bethea. Penalty: Illegal Use of Hands on San Francisco (Rashard Robinson) 5 yards.","(2:58) Matt Ryan pass to the left to Taylor Gabriel for 31 yards to the SF45. Tackled by Antoine Bethea.","(3:38) Tevin Coleman rush to the right for 6 yards to the Atl24. Tackled by Jaquiski Tartt.","(3:58) Penalty: Illegal Shift on Atlanta (Taylor Gabriel) -5 yards.","(4:06) Bradley Pinion punts for 34 yards to Atl23. No return.","(4:09) Colin Kaepernick incomplete pass to the right intended for Jeremy Kerley defensed by Keanu Neal.","(4:34) Colin Kaepernick rush to the right for 17 yards to the SF43. Tackled by Ricardo Allen.","(5:14) Colin Kaepernick sacked at SF26 for a loss of 13 yards by Ra'Shede Hageman.","(5:53) Carlos Hyde rush to the left for 6 yards to the SF39. Tackled by Robert Alford.","(6:25) Carlos Hyde rush to the left for 8 yards to the SF33. Tackled by Deion Jones and Keanu Neal.","(6:29) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley defensed by Brooks Reed.","(6:29) Matt Bosher kicks off to the endzone. Touchback.","(6:34) Matt Bryant 50 yard field goal attempt is GOOD. Holder: Matt Bosher.","(6:38) Matt Ryan incomplete pass to the right intended for Taylor Gabriel defensed by Tramaine Brock.","(7:20) Devonta Freeman rush to the left for 1 yard to the SF32. Tackled by Aaron Lynch.","(7:57) Devonta Freeman rush to the right for 5 yards to the SF33. Tackled by Antoine Bethea.","(8:44) Matt Ryan pass to the right to Aldrick Robinson for 21 yards to the SF38. Tackled by Marcus Cromartie.","(9:19) Devonta Freeman rush to the right for a loss of 2 yards to the Atl41. Tackled by Aaron Lynch.","(9:28) Bradley Pinion punts for 47 yards to Atl43. No return.","(9:33) Colin Kaepernick incomplete pass to the right intended for Carlos Hyde defensed by Paul Worrilow.","(10:09) Carlos Hyde rush to the right for 3 yards to the SF10. Tackled by Paul Worrilow and Grady Jarrett.","(10:15) Colin Kaepernick incomplete pass to the right intended for Garrett Celek defensed by Robert Alford.","(10:22) Matt Bosher punts for 41 yards to SF7. No return.","(11:09) Tevin Coleman rush to the right for a loss of 12 yards to the SF48. Tackled by Ahmad Brooks. FUMBLE, recovered by Atl (Ryan Schraeder).","(11:54) Tevin Coleman rush to the right for 1 yard to the SF36. Tackled by Quinton Dial and Jaquiski Tartt.","(11:58) Matt Ryan incomplete pass to the left intended for Aldrick Robinson.","(12:05) Penalty: Offside on San Francisco (DeForest Buckner) 5 yards.","(12:40) Tevin Coleman rush to the left for 7 yards to the SF42. Tackled by Glenn Dorsey.","(12:46) Matt Ryan incomplete pass to the left intended for Taylor Gabriel.","(13:14) Devonta Freeman rush to the right for 6 yards to the SF49. Tackled by Antoine Bethea.","(13:47) Devonta Freeman rush to the right for 9 yards to the Atl45. Tackled by DeForest Buckner.","(14:21) Matt Ryan pass to the right to Devonta Freeman for 8 yards to the Atl36. Tackled by Antoine Bethea.","(15:00) Devonta Freeman rush to the right for 3 yards to the Atl28. Tackled by Antoine Bethea.","(15:00) Bradley Pinion kicks off to the endzone. Touchback.","(0:13) Matt Ryan rush up the middle for a loss of 1 yard to the Atl24.","(0:13) Bradley Pinion kicks off to the endzone. Touchback.","(0:13) Phil Dawson extra point is NO GOOD.","(0:17) Colin Kaepernick pass to the left to Rod Streater for 5 yards for a TOUCHDOWN.","(0:17) San Francisco 49ers timeout.","(0:24) Colin Kaepernick pass to the left to Carlos Hyde for 6 yards to the Atl5. Tackled by Keanu Neal and Deion Jones.","(0:28) Colin Kaepernick incomplete pass to the left intended for Je'Ron Hamm.","(0:36) Colin Kaepernick pass to the left to Je'Ron Hamm for 6 yards to the Atl22. Tackled by Robert Alford. Penalty: Unnecessary Roughness on Atlanta (Paul Worrilow) 11 yards.","(0:55) Colin Kaepernick pass to the left to Je'Ron Hamm for 7 yards to the Atl28. Tackled by Keanu Neal and Robert Alford.","(0:55) San Francisco 49ers timeout.","(1:06) Carlos Hyde rush to the right for 9 yards to the Atl35. Tackled by Brian Poole and Robert Alford.","(1:32) Colin Kaepernick pass to the right to Jeremy Kerley for 4 yards to the Atl44. Tackled by Keanu Neal.","(2:00) Colin Kaepernick pass to the right to Chris Harper for 12 yards to the Atl48. Tackled by C.J. Goodwin and Deion Jones.","(2:00) Two Minute Warning.","(2:33) Shaun Draughn rush to the left for no gain to the SF40. Tackled by Grady Jarrett and Courtney Upshaw.","(3:08) Shaun Draughn rush to the left for 2 yards to the SF40. Tackled by Philip Wheeler and Courtney Upshaw.","(3:48) Colin Kaepernick pass to the right to Aaron Burbridge for 14 yards to the SF38. Tackled by Keanu Neal.","(4:24) Carlos Hyde rush to the right for a loss of 1 yard to the SF24. Tackled by Paul Worrilow and Grady Jarrett.","(4:28) Colin Kaepernick incomplete pass to the left intended for Garrett Celek.","(4:28) Matt Bosher kicks off to the endzone. Touchback.","(4:28) Matt Bryant extra point is good.","(4:36) Devonta Freeman rush to the right for 9 yards for a TOUCHDOWN.","(5:17) Devonta Freeman rush to the right for 20 yards to the SF9. Tackled by Jaquiski Tartt.","(5:53) Tevin Coleman rush to the left for 29 yards to the SF29. Tackled by Jaquiski Tartt.","(6:31) Matt Ryan pass to the left to Aldrick Robinson for 20 yards to the Atl42. Tackled by Jaquiski Tartt.","(7:06) Matt Ryan pass to the left to Mohamed Sanu for 10 yards to the Atl22. Tackled by Michael Wilhoite and Tramaine Brock.","(7:17) Penalty: Encroachment on San Francisco (Ahmad Brooks) 5 yards.","(8:00) Tevin Coleman rush to the right for 1 yard to the Atl7. Tackled by Tank Carradine.","(8:15) Bradley Pinion punts for 51 yards to Atl12. Eric Weems - no return. Tackled by Je'Ron Hamm and Marcus Ball. Penalty: Holding on Atlanta (Justin Hardy) -6 yards.","(8:42) Colin Kaepernick sacked at SF37 for a loss of 5 yards by Vic Beasley Jr..","(8:45) Colin Kaepernick incomplete pass to the right intended for Rod Streater.","(9:22) Carlos Hyde rush to the left for 4 yards to the SF42. Tackled by Courtney Upshaw.","(9:55) Carlos Hyde rush to the right for 12 yards to the SF38. Tackled by Ricardo Allen.","(10:31) Carlos Hyde rush to the right for 17 yards to the SF26. Tackled by Brian Poole.","(11:06) Colin Kaepernick pass to the left to Chris Harper for 8 yards to the SF9. Tackled by Keanu Neal.","(11:21) Devonta Freeman rush to the right for no gain to the SF1. Tackled by Michael Wilhoite. FUMBLE, recovered by SF (Michael Wilhoite).","(11:45) Devonta Freeman rush to the right for 9 yards to the SF1. Tackled by Dontae Johnson.","(12:15) Devonta Freeman rush to the right for 6 yards to the SF10. Tackled by Eli Harold.","(12:45) Matt Ryan pass to the middle to Aldrick Robinson for 59 yards to the SF16. Tackled by Jimmie Ward.","(12:45) Bradley Pinion kicks off to the endzone. Touchback.","(12:45) Phil Dawson extra point is good.","(12:50) Colin Kaepernick pass to the left to Garrett Celek for 16 yards for a TOUCHDOWN.","(13:19) Colin Kaepernick pass to the left to Chris Harper for 6 yards to the Atl16. Tackled by Deji Olatoye.","(13:45) Colin Kaepernick pass to the middle to Blake Bell for 45 yards to the Atl22. Tackled by Keanu Neal and Ricardo Allen.","(14:22) Colin Kaepernick pass to the left to Jeremy Kerley for 5 yards to the SF33. Tackled by Keanu Neal.","(14:22) San Francisco 49ers timeout.","(15:00) Colin Kaepernick pass to the middle to Quinton Patton for a loss of 9 yards to the SF28. Tackled by Robert Alford.","(0:40) Colin Kaepernick pass to the middle to Quinton Patton for 12 yards to the SF37. Tackled by Brian Poole.","(0:40) Matt Bosher kicks off to the endzone. Touchback.","(0:40) Matt Bryant extra point is good.","(0:47) Matt Ryan pass to the right to Austin Hooper for 9 yards for a TOUCHDOWN.","(0:54) Matt Ryan incomplete pass to the right.","(1:31) Tevin Coleman rush to the left for a loss of 3 yards to the SF9. Tackled by DeForest Buckner.","(1:50) Penalty: False Start on Atlanta (Tom Compton) -5 yards.","(2:21) Matt Ryan pass to the right to Devonta Freeman for 8 yards to the SF1. Tackled by Vinnie Sunseri.","(2:21) Atlanta Falcons timeout.","(3:08) Matt Ryan pass to the right to Tevin Coleman for 4 yards to the SF9. Tackled by Aaron Lynch.","(3:40) Tevin Coleman rush to the right for 3 yards to the SF13. Tackled by Aaron Lynch and DeForest Buckner.","(4:09) Matt Ryan pass to the right to Aldrick Robinson for 11 yards to the SF16. Tackled by Tramaine Brock.","(4:39) Matt Ryan pass to the left to Mohamed Sanu for 16 yards to the SF27. Tackled by Jaquiski Tartt.","(5:21) Devonta Freeman rush to the left for a loss of 2 yards to the SF43. Tackled by Tramaine Brock.","(5:55) Devonta Freeman rush to the right for 9 yards to the SF41. Tackled by Jaquiski Tartt.","(6:31) Devonta Freeman rush to the right for 5 yards to the Atl50. Tackled by Ahmad Brooks.","(6:40) Bradley Pinion punts for 43 yards to Atl45. No return.","(6:44) Colin Kaepernick incomplete pass to the middle intended for Aaron Burbridge.","(7:30) Carlos Hyde rush to the left for a loss of 1 yard to the SF12. Tackled by Brooks Reed.","(7:34) Colin Kaepernick incomplete pass to the right intended for Garrett Celek.","(7:40) Matt Bosher kicks off to the SF-3. JaCorey Shepherd return for 16 yards to SF13. Tackled by Joshua Perkins.","(7:40) Matt Bryant extra point is good.","(7:48) Matt Ryan pass to the left to Taylor Gabriel for 9 yards for a TOUCHDOWN.","(7:54) Matt Ryan incomplete pass to the left intended for Justin Hardy.","(8:33) Tevin Coleman rush to the right for 21 yards to the SF9. Tackled by Mike Purcell.","(9:03) Matt Ryan pass to the right to Taylor Gabriel for 20 yards to the SF30. Tackled by Antoine Bethea.","(9:38) Tevin Coleman rush to the left for no gain to the Atl50. Tackled by Glenn Dorsey.","(9:45) Carlos Hyde rush to the left for no gain to the SF49. Tackled by Deion Jones. FUMBLE, recovered by Atl (Keanu Neal). Tackled by Zane Beadles.","(10:22) Colin Kaepernick rush to the right for 4 yards to the SF49. Tackled by Brian Poole.","(10:31) Matt Bosher kicks off to the SF4. JaCorey Shepherd return for 41 yards to SF45. Tackled by Robert Alford and Keanu Neal.","(10:31) Matt Bryant extra point is good.","(10:35) Devonta Freeman rush to the right for 5 yards for a TOUCHDOWN.","(11:06) Matt Ryan pass to the right to Joshua Perkins for 8 yards to the SF5. Tackled by Vinnie Sunseri.","(11:46) Matt Ryan sacked at SF13 for no gain by Eli Harold.","(12:16) Devonta Freeman rush to the left for 8 yards to the SF13. Tackled by Nick Bellore and Antoine Bethea.","(12:51) Matt Ryan pass to the right to Mohamed Sanu for 18 yards to the SF21. Tackled by Jimmie Ward.","(13:28) Devonta Freeman rush to the left for 8 yards to the SF39. Tackled by DeForest Buckner.","(13:45) Bradley Pinion punts for 57 yards to Atl11. Eric Weems return for 42 yards to SF47. Tackled by Bradley Pinion.","(13:51) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(14:22) Carlos Hyde rush to the left for 3 yards to the SF32. Tackled by Deion Jones and Brooks Reed.","(14:52) Colin Kaepernick pass to the right to Garrett Celek for 6 yards to the SF29. Tackled by Keanu Neal and De'Vondre Campbell.","(15:00) Matt Bosher kicks off to the SF6. JaCorey Shepherd return for 17 yards to SF23. Tackled by Eric Weems."]