["(0:39) Cam Newton rush up the middle for a loss of 1 yard to the Car49.","(0:49) Kirk Cousins pass to the left to Jamison Crowder for 5 yards to the Was49. Tackled by Kyle Love. FUMBLE, recovered by Car (Kyle Love).","(0:52) Penalty: Holding on Washington (Shawn Lauvao) -10 yards.","(1:00) Kirk Cousins pass to the right to Vernon Davis for 8 yards to the Car46. Tackled by Leonard Johnson.","(1:07) Kirk Cousins pass to the left to Chris Thompson for 6 yards to the Was31. Tackled by Thomas Davis. Penalty: Unnecessary Roughness on Carolina (Thomas Davis) 15 yards.","(1:07) Graham Gano kicks off to the endzone. Touchback.","(1:12) Graham Gano 41 yard field goal attempt is GOOD. Holder: Michael Palardy.","(1:12) Carolina Panthers timeout.","(2:00) Cam Newton rush to the right for no gain to the Was22. Tackled by Trent Murphy and Mason Foster.","(2:00) Two Minute Warning.","(2:24) Jonathan Stewart rush to the right for 1 yard to the Was22. Tackled by Bashaud Breeland and Ziggy Hood.","(2:24) Washington Redskins timeout.","(2:29) Jonathan Stewart rush to the left for no gain to the Was23. Tackled by Mason Foster.","(2:29) Washington Redskins timeout.","(2:50) Mike Tolbert rush to the right for 10 yards to the Was23. Tackled by Josh Norman and Ricky Jean Francois.","(2:50) Washington Redskins timeout.","(2:54) Jonathan Stewart rush up the middle for 3 yards to the Was33. Tackled by Mason Foster.","(3:42) Jonathan Stewart rush to the right for 34 yards to the Was36. Tackled by Mason Foster.","(3:44) Dustin Hopkins kicks off to the endzone. Touchback. Penalty: Illegal Formation on Washington 5 yards.","(3:48) Dustin Hopkins 34 yard field goal attempt is GOOD. Holder: Tress Way.","(3:56) Kirk Cousins incomplete pass to the right intended for Chris Thompson.","(4:05) Penalty: Illegal Use of Hands on Washington (Morgan Moses) -10 yards.","(4:36) Kirk Cousins pass to the left to Pierre Garcon for 1 yard to the Car6. Tackled by Daryl Worley.","(4:42) Kirk Cousins incomplete pass to the right intended for Vernon Davis.","(4:51) Kirk Cousins rush to the right for 12 yards to the Car14. Tackled by Kawann Short. Penalty: Unnecessary Roughness on Carolina (Kawann Short) 7 yards.","(4:56) Kirk Cousins pass to the right to Chris Thompson for 3 yards to the Car26. Tackled by Thomas Davis.","(5:03) Kirk Cousins pass to the right to DeSean Jackson for 22 yards to the Car29.","(5:16) Kirk Cousins pass to the right to DeSean Jackson for 14 yards to the Was49.","(5:37) Kirk Cousins pass to the middle to Chris Thompson for 7 yards to the Was35. Tackled by Mario Addison and Leonard Johnson.","(5:41) 38 yard field goal attempt by Graham Gano is NO GOOD. Holder: Michael Palardy.","(5:48) Cam Newton incomplete pass to the left intended for Devin Funchess.","(6:30) Jonathan Stewart rush to the left for 6 yards to the Was20. Tackled by Kendall Fuller and Mason Foster.","(6:36) Cam Newton incomplete pass to the right intended for Jonathan Stewart.","(7:23) Cam Newton pass to the right to Mike Tolbert for 15 yards to the Was26. Tackled by Martrell Spaight.","(8:10) Fozzy Whittaker rush to the left for 1 yard to the Was41. Tackled by Martrell Spaight and Trent Murphy.","(8:36) Cam Newton pass to the left to Ted Ginn Jr. for 8 yards to the Was42.","(9:16) Jonathan Stewart rush to the left for 1 yard to the Car50. Tackled by Preston Smith.","(9:48) Jonathan Stewart rush up the middle for 4 yards to the Car49. Tackled by Martrell Spaight and Preston Smith.","(10:00) Tress Way punts for 50 yards to Car33. Ted Ginn Jr. return for 12 yards to Car45. Tackled by Martrell Spaight.","(10:08) Kirk Cousins incomplete pass to the right intended for Vernon Davis.","(10:12) Kirk Cousins incomplete pass to the left intended for Vernon Davis defensed by Kawann Short.","(10:20) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(10:32) Kirk Cousins pass to the right to DeSean Jackson for 10 yards to the Was17. Tackled by Kurt Coleman.","(10:40) Michael Palardy punts for 31 yards to Was7. No return.","(10:45) Cam Newton incomplete pass to the left intended for Greg Olsen.","(11:25) Jonathan Stewart rush to the left for 2 yards to the Was38. Tackled by Martrell Spaight and Ryan Kerrigan.","(11:25) Carolina Panthers timeout.","(12:07) Fozzy Whittaker rush to the right for no gain to the Was40. Tackled by Chris Baker.","(12:35) Cam Newton pass to the left to Fozzy Whittaker for 25 yards to the Was40. Tackled by Duke Ihenacho.","(12:44) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(13:27) Cam Newton pass to the right to Greg Olsen for 6 yards to the Car35. Tackled by Martrell Spaight.","(14:03) Cam Newton pass to the left to Greg Olsen for 14 yards to the Car29. Tackled by Greg Toler and Martrell Spaight.","(14:08) Dustin Hopkins kicks off to the Car-1. Joe Webb return for 16 yards to Car15. Tackled by Deshazor Everett and Mack Brown.","(14:13) Dustin Hopkins 26 yard field goal attempt is GOOD. Holder: Tress Way.","(15:00) Kirk Cousins pass to the right to Pierre Garcon for 18 yards to the Car8. Tackled by James Bradberry and Tre Boston.","(0:19) Kirk Cousins pass to the left to Chris Thompson for 1 yard to the Car26. Tackled by Kawann Short.","(0:36) Rob Kelley rush to the left for a loss of 2 yards to the Car12. Tackled by A.J. Klein and Kawann Short. Penalty: Unnecessary Roughness on Washington (Jordan Reed) -15 yards.","(1:13) Kirk Cousins pass to the right to Jamison Crowder for 8 yards to the Car10. Tackled by Tre Boston.","(1:20) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(2:07) Kirk Cousins pass to the right to Jordan Reed for 6 yards to the Car18. Tackled by Thomas Davis.","(2:39) Kirk Cousins pass to the right to Vernon Davis for 2 yards to the Car24. Tackled by Thomas Davis.","(3:08) Kirk Cousins pass to the left to Pierre Garcon for 9 yards to the Car26. Tackled by Daryl Worley and Leonard Johnson.","(3:50) Rob Kelley rush to the right for 2 yards to the Car35. Tackled by Star Lotulelei.","(4:25) Kirk Cousins pass to the left to Pierre Garcon for 15 yards to the Car37. Tackled by Kurt Coleman.","(4:38) Kirk Cousins pass to the right to DeSean Jackson for 17 yards to the Was48.","(5:07) Kirk Cousins pass to the left to Rob Kelley for 6 yards to the Was31. Tackled by A.J. Klein and Daryl Worley.","(5:07) Graham Gano kicks off to the endzone. Touchback.","(5:11) Graham Gano 23 yard field goal attempt is GOOD. Holder: Michael Palardy.","(5:58) Cam Newton pass to the left to Jonathan Stewart for 8 yards to the Was6. Tackled by Mason Foster.","(6:01) Cam Newton incomplete pass to the left intended for Devin Funchess.","(6:44) Jonathan Stewart rush to the right for a loss of 3 yards to the Was14. Tackled by Ryan Kerrigan.","(7:10) Jonathan Stewart rush to the left for 13 yards to the Was21. Tackled by Greg Toler and Duke Ihenacho. Penalty: Face Mask on Washington (Greg Toler) 10 yards.","(7:45) Cam Newton pass to the middle to Ed Dickson for 28 yards to the Was34. Tackled by Bashaud Breeland.","(8:28) Jonathan Stewart rush to the right for 7 yards to the Car38. Tackled by Donte Whitner.","(9:04) Jonathan Stewart rush up the middle for 2 yards to the Car31. Tackled by Mason Foster.","(9:12) Tress Way punts for 41 yards to Car29. No return.","(9:35) Rob Kelley rush up the middle for no gain to the Was30. Tackled by Mario Addison and Ryan Delaire.","(10:16) Kirk Cousins pass to the middle to Pierre Garcon for 7 yards to the Was30. Tackled by A.J. Klein and Thomas Davis.","(10:53) Rob Kelley rush to the left for 1 yard to the Was23. Tackled by Shaq Thompson.","(11:03) Michael Palardy punts for 33 yards to Was17. Jamison Crowder return for 5 yards to Was22. Tackled by Lou Young.","(11:11) Cam Newton incomplete pass to the right intended for Ted Ginn Jr. defensed by Josh Norman.","(11:48) Cam Newton pass to the right to Ted Ginn Jr. for 8 yards to the Car50. Tackled by Josh Norman.","(11:55) Cam Newton incomplete pass to the left. Penalty: Intentional Grounding on Carolina (Cam Newton) -10 yards.","(12:27) Cam Newton pass to the left to Kelvin Benjamin for 10 yards to the Was48. Tackled by Bashaud Breeland.","(12:41) Tress Way punts for 51 yards to Car23. Ted Ginn Jr. return for 19 yards to Car42. Tackled by Terence Garvin.","(12:48) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(13:17) Kirk Cousins pass to the left to Jamison Crowder for 6 yards to the Was26. Tackled by Daryl Worley.","(13:51) Rob Kelley rush up the middle for no gain to the Was20. Tackled by Kawann Short and Tre Boston.","(13:58) Graham Gano kicks off to the Was1. Chris Thompson return for 16 yards to Was20. Tackled by Michael Griffin and Jared Norris.","(13:58) Graham Gano extra point is good.","(14:08) Cam Newton pass to the right to Mike Tolbert for 1 yard for a TOUCHDOWN.","(14:47) Jonathan Stewart rush up the middle for no gain to the Was1. Tackled by Martrell Spaight.","(14:56) Kirk Cousins sacked at Was5 for a loss of 9 yards by Wes Horton. FUMBLE, recovered by Car (Wes Horton) and returned for 4 yards. Tackled by Vernon Davis.","(15:00) Graham Gano kicks off to the Was-3. Will Blackmon return for 17 yards to Was14. Tackled by Colin Jones.","(0:16) Kirk Cousins rush up the middle for a loss of 1 yard to the Was14.","(0:27) Michael Palardy punts for 24 yards to Was15. No return.","(0:32) Cam Newton incomplete pass to the left intended for Greg Olsen defensed by Preston Smith.","(0:41) Cam Newton incomplete pass to the right intended for Corey Brown.","(0:47) Cam Newton pass to the right to Greg Olsen for 9 yards to the Was39. Tackled by Josh Norman.","(0:53) Penalty: Illegal Use of Hands on Carolina (Trai Turner) -10 yards.","(0:53) Carolina Panthers timeout.","(1:00) Cam Newton pass to the left to Corey Brown for 19 yards to the Was38. Tackled by Greg Toler.","(1:22) Cam Newton pass to the middle to Corey Brown for 9 yards to the Car43. Tackled by Donte Whitner and Martrell Spaight.","(1:31) Tress Way punts for 43 yards to Car26. Ted Ginn Jr. return for 8 yards to Car34. Tackled by Duke Ihenacho.","(1:37) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(1:42) Kirk Cousins pass to the left to DeSean Jackson for 8 yards to the Was31. Tackled by Daryl Worley.","(1:47) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(2:00) Michael Palardy punts for 46 yards to Was28. Jamison Crowder return for 5 yards to Was33. Tackled by Joe Webb. Penalty: Illegal Block on Washington (Mack Brown) -10 yards.","(1:47) Two Minute Warning.","(2:16) Cam Newton sacked at Car26 for a loss of 10 yards by Chris Baker and Trent Murphy.","(2:23) Cam Newton incomplete pass to the left intended for Ted Ginn Jr. defensed by Bashaud Breeland.","(3:02) Jonathan Stewart rush to the right for a loss of 1 yard to the Car36. Tackled by Cullen Jenkins and Martrell Spaight.","(3:43) Cam Newton pass to the left to Mike Tolbert for 12 yards to the Car37. Tackled by Josh Norman and Mason Foster.","(3:43) Dustin Hopkins kicks off to the endzone. Touchback.","(3:43) Dustin Hopkins extra point is NO GOOD.","(3:54) Rob Kelley rush to the left for 5 yards for a TOUCHDOWN.","(4:30) Kirk Cousins pass to the left to DeSean Jackson for 17 yards to the Car5. Tackled by Tre Boston.","(5:14) Kirk Cousins pass to the middle to Chris Thompson for 9 yards to the Car22. Tackled by Thomas Davis.","(5:51) Chris Thompson rush to the right for 4 yards to the Car31. Tackled by Kurt Coleman.","(6:14) Penalty: Holding on Washington (Brandon Scherff) -10 yards.","(6:55) Kirk Cousins pass to the right to Rob Kelley for 22 yards to the Car25. Tackled by Star Lotulelei.","(7:56) Penalty: Offside on Carolina (Mario Addison) 5 yards.","(7:56) Kirk Cousins pass to the left to Rob Kelley for 17 yards to the Was48. Tackled by A.J. Klein and Kurt Coleman.","(8:37) Kirk Cousins pass to the right to Pierre Garcon for 20 yards to the Was31. Tackled by Kurt Coleman and James Bradberry.","(8:46) Michael Palardy punts for 30 yards to Was11. No return.","(8:57) Cam Newton rush to the right for 1 yard to the Was26. Tackled by Trent Murphy. Penalty: Unsports. Conduct on Carolina (Cam Newton) -15 yards.","(9:03) Cam Newton incomplete pass to the left intended for Kelvin Benjamin defensed by Quinton Dunbar.","(9:41) Jonathan Stewart rush to the right for 1 yard to the Was27. Tackled by Matt Ioannidis and Ziggy Hood.","(10:28) Jonathan Stewart rush to the right for 11 yards to the Was28. Tackled by Mason Foster and Duke Ihenacho.","(10:36) Cam Newton incomplete pass to the right.","(11:22) Cam Newton pass to the right to Greg Olsen for 27 yards to the Was39. Tackled by Trent Murphy.","(11:33) Tress Way punts for 56 yards to Car17. Ted Ginn Jr. return for 17 yards to Car34. Tackled by Nick Moody.","(11:39) Kirk Cousins incomplete pass to the left intended for Chris Thompson.","(11:43) Kirk Cousins incomplete pass to the left intended for Jamison Crowder defensed by Ryan Delaire.","(12:21) Rob Kelley rush to the right for 2 yards to the Was27. Tackled by Kurt Coleman and Thomas Davis.","(12:21) Graham Gano kicks off to the endzone. Touchback.","(12:26) Graham Gano 23 yard field goal attempt is GOOD. Holder: Michael Palardy.","(13:11) Cam Newton pass to the right to Greg Olsen for a loss of 2 yards to the Was5. Tackled by Bashaud Breeland.","(13:53) Mike Tolbert rush to the left for 3 yards to the Was3. Tackled by Mason Foster.","(14:32) Fozzy Whittaker rush up the middle for 2 yards to the Was6. Tackled by Chris Baker.","(15:00) Jonathan Stewart rush up the middle for 8 yards to the Was8. Tackled by Donte Whitner.","(0:28) Jonathan Stewart rush to the right for 8 yards to the Was16. Tackled by Deshazor Everett and Donte Whitner.","(0:39) Kirk Cousins pass intended for Vernon Davis INTERCEPTED by Kurt Coleman and returned for 37 yards. Tackled by Shawn Lauvao.","(1:11) Kirk Cousins pass to the middle to Vernon Davis for 11 yards to the Was38. Tackled by Kurt Coleman.","(1:50) Kirk Cousins pass to the right to Vernon Davis for 2 yards to the Was27. Tackled by Shaq Thompson.","(1:50) Graham Gano kicks off to the endzone. Touchback.","(1:50) Graham Gano extra point is good.","(1:57) Cam Newton pass to the right to Ted Ginn Jr. for 30 yards for a TOUCHDOWN.","(2:38) Jonathan Stewart rush to the right for 6 yards to the Was30. Tackled by Preston Smith and Mason Foster.","(2:45) Cam Newton incomplete pass to the right intended for Ted Ginn Jr. defensed by Bashaud Breeland.","(3:29) Cam Newton pass to the left to Corey Brown for 14 yards to the Was36. Tackled by Martrell Spaight.","(4:11) Cam Newton pass to the right to Kelvin Benjamin for 10 yards to the Car50. Tackled by Josh Norman.","(4:53) Jonathan Stewart rush to the right for 2 yards to the Car40. Tackled by Chris Baker.","(5:34) Jonathan Stewart rush to the left for 15 yards to the Car38. Tackled by Martrell Spaight and Mason Foster.","(6:12) Jonathan Stewart rush to the left for 7 yards to the Car23. Tackled by Martrell Spaight and Mason Foster.","(6:18) Dustin Hopkins kicks off to the Car1. Fozzy Whittaker return for 15 yards to Car16. Tackled by Ryan Grant.","(6:23) Dustin Hopkins 43 yard field goal attempt is GOOD. Holder: Tress Way.","(6:29) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(7:13) Kirk Cousins pass to the right to Rob Kelley for 2 yards to the Car25. Tackled by James Bradberry.","(7:54) Rob Kelley rush up the middle for a loss of 1 yard to the Car27. Tackled by Thomas Davis and A.J. Klein.","(8:34) Kirk Cousins pass to the left to DeSean Jackson for 23 yards to the Car26. Tackled by Kurt Coleman.","(8:59) Kirk Cousins pass to the right to Pierre Garcon for 8 yards to the Car49. Tackled by Leonard Johnson.","(9:30) Kirk Cousins pass to the left to Jamison Crowder for 5 yards to the Was43.","(10:10) Rob Kelley rush up the middle for 1 yard to the Was38. Tackled by Kurt Coleman and Vernon Butler.","(10:20) Michael Palardy punts for 44 yards to Was33. Jamison Crowder return for 4 yards to Was37. Tackled by Corey Brown.","(10:55) Jonathan Stewart rush up the middle for a loss of 4 yards to the Car23. Tackled by Chris Baker.","(10:55) Carolina Panthers timeout.","(11:03) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(11:44) Cam Newton sacked at Car27 for no gain by Quinton Dunbar.","(11:55) Tress Way punts for 45 yards to Car24. Ted Ginn Jr. return for 3 yards to Car27. Tackled by Martrell Spaight.","(11:59) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(12:36) Chris Thompson rush to the right for 6 yards to the Was31. Tackled by Tre Boston.","(12:40) Kirk Cousins incomplete pass to the right intended for Vernon Davis.","(12:40) Graham Gano kicks off to the endzone. Touchback.","(12:45) Graham Gano 35 yard field goal attempt is GOOD. Holder: Michael Palardy.","(12:51) Cam Newton incomplete pass to the right intended for Greg Olsen defensed by Bashaud Breeland.","(12:56) Cam Newton incomplete pass to the left intended for Devin Funchess defensed by Quinton Dunbar.","(13:35) Jonathan Stewart rush to the left for 4 yards to the Was17. Tackled by Donte Whitner. FUMBLE, recovered by Car (Jonathan Stewart).","(14:02) Cam Newton pass to the right to Ted Ginn Jr. for 18 yards to the Was21. Tackled by Josh Norman.","(14:33) Cam Newton pass to the right to Greg Olsen for 31 yards to the Was39. Tackled by Josh Norman.","(15:00) Jonathan Stewart rush to the right for 5 yards to the Car30. Tackled by Martrell Spaight.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback."]