["(0:05) Matthew Stafford pass to the left to Zach Zenner for 33 yards to the NYG23. Tackled by Dominique Rodgers-Cromartie.","(0:12) Penalty: Roughing Passer on New York (Kerry Wynn) 15 yards.","(0:25) Brad Wing punts for 51 yards to Det27. Andre Roberts return for 2 yards to Det29. Tackled by Jonathan Casillas.","(0:25) New York Giants timeout.","(1:11) Rashad Jennings rush to the right for no gain to the NYG22. Tackled by DeAndre Levy and Josh Bynes.","(1:54) Rashad Jennings rush to the left for 1 yard to the NYG22. Tackled by DeAndre Levy and Josh Bynes.","(1:54) Detroit Lions timeout.","(1:58) Rashad Jennings rush up the middle for 1 yard to the NYG21. Tackled by Rafael Bush and Ezekiel Ansah.","(1:58) Two Minute Warning.","(2:09) Matthew Stafford pass intended for Anquan Boldin INTERCEPTED by Dominique Rodgers-Cromartie. No return. Touchback.","(2:15) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(2:19) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(2:40) Matthew Stafford pass to the right to Marvin Jones Jr. for 14 yards to the NYG17. Tackled by Trevin Wade.","(3:02) Matthew Stafford pass to the middle to Zach Zenner for 8 yards to the NYG31. Tackled by Landon Collins.","(3:24) Matthew Stafford pass to the left to Golden Tate for 24 yards to the NYG39. Tackled by Landon Collins.","(3:45) Matthew Stafford pass to the left to Golden Tate for 12 yards to the Det37. Tackled by Dominique Rodgers-Cromartie.","(3:49) Matthew Stafford incomplete pass to the right intended for Zach Zenner defensed by Owamagbe Odighizuwa.","(4:00) Brad Wing punts for 45 yards to Det19. Andre Roberts return for 6 yards to Det25. Tackled by B.J. Goodson.","(4:44) Rashad Jennings rush to the right for 2 yards to the NYG36. Tackled by Ezekiel Ansah.","(4:44) Detroit Lions timeout.","(4:50) Rashad Jennings rush to the right for 3 yards to the NYG34. Tackled by Tahir Whitehead and Kerry Hyder.","(4:50) Detroit Lions timeout.","(4:56) Rashad Jennings rush to the right for no gain to the NYG31. Tackled by Tahir Whitehead.","(5:20) Sam Martin punts for 44 yards to NYG37. Odell Beckham Jr. return for 4 yards to NYG41. Penalty: Illegal Block on New York (Eric Pinkins) -10 yards.","(5:27) Matthew Stafford incomplete pass to the right intended for Eric Ebron.","(5:36) Matthew Stafford incomplete pass to the left intended for Dwayne Washington.","(5:42) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr. defensed by Dominique Rodgers-Cromartie.","(5:47) Robbie Gould kicks off to the Det7. Andre Roberts return for 12 yards to Det19. Tackled by Kerry Wynn.","(5:47) Robbie Gould extra point is good.","(5:51) Eli Manning pass to the right to Odell Beckham Jr. for 4 yards for a TOUCHDOWN.","(5:51) New York Giants timeout.","(6:40) Paul Perkins rush up the middle for 4 yards to the Det4. Tackled by DeAndre Levy and Josh Bynes.","(7:16) Paul Perkins rush up the middle for 5 yards to the Det8. Tackled by Josh Bynes and Asa Jackson.","(7:44) Eli Manning pass to the right to Sterling Shepard for 23 yards to the Det13. Tackled by Nevin Lawson.","(8:12) Eli Manning pass to the left to Odell Beckham Jr. for 25 yards to the Det36. Tackled by Asa Jackson.","(8:16) Eli Manning incomplete pass to the middle intended for Sterling Shepard defensed by Asa Jackson.","(8:20) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by A'Shawn Robinson.","(9:10) Paul Perkins rush to the right for 10 yards to the NYG39. Tackled by Tavon Wilson and Kerry Hyder.","(9:21) Sam Martin punts for 37 yards to NYG24. Odell Beckham Jr. return for 5 yards to NYG29. Tackled by Antwione Williams.","(9:51) Matthew Stafford pass to the right to Golden Tate for a loss of 1 yard to the Det39. Tackled by Eli Apple.","(9:56) Matthew Stafford incomplete pass to the left intended for Golden Tate defensed by Dominique Rodgers-Cromartie.","(10:39) Dwayne Washington rush to the right for 2 yards to the Det40. Tackled by Romeo Okwara and B.J. Goodson.","(11:22) Matthew Stafford pass to the left to Golden Tate for 14 yards to the Det38. Tackled by Trevin Wade.","(11:58) Dwayne Washington rush to the left for no gain to the Det24. Tackled by Dominique Rodgers-Cromartie.","(12:42) Matthew Stafford rush to the left for 5 yards to the Det24. Tackled by Devon Kennard.","(13:20) Matthew Stafford pass to the left to Anquan Boldin for 9 yards to the Det19. Tackled by Coty Sensabaugh.","(14:04) Dwayne Washington rush to the right for 1 yard to the Det10. Tackled by Johnathan Hankins and Eli Apple.","(14:37) Matthew Stafford pass to the right to Marvin Jones Jr. for 6 yards to the Det9. Tackled by Eli Apple.","(14:49) Brad Wing punts for 57 yards to Det3. No return.","(14:54) Eli Manning incomplete pass to the right intended for Shane Vereen.","(15:00) Eli Manning incomplete pass to the right intended for Paul Perkins.","(0:16) Eli Manning sacked at NYG40 for a loss of 8 yards by Ezekiel Ansah.","(0:29) Sam Martin punts for 47 yards to NYG40. Dwayne Harris return for 8 yards to NYG48. Tackled by Don Carey.","(1:05) Matthew Stafford pass to the left to Eric Ebron for 1 yard to the Det13. Tackled by Landon Collins.","(1:34) Matthew Stafford pass to the right to Zach Zenner for 7 yards to the Det12. Tackled by Landon Collins and Dominique Rodgers-Cromartie.","(2:13) Zach Zenner rush to the right for 1 yard to the Det5. Tackled by Johnathan Hankins and Olivier Vernon.","(2:22) Brad Wing punts for 33 yards to Det4. No return.","(2:28) Eli Manning incomplete pass to the right intended for Victor Cruz defensed by Johnson Bademosi.","(3:15) Rashad Jennings rush up the middle for a loss of 3 yards to the Det37. Tackled by Tyrunn Walker.","(3:52) Rashad Jennings rush to the left for 5 yards to the Det34. Tackled by Tahir Whitehead.","(4:30) Rashad Jennings rush to the left for 4 yards to the Det39. Tackled by Tavon Wilson and Tahir Whitehead.","(5:05) Odell Beckham Jr. rush to the left for 9 yards to the Det43. Tackled by Glover Quin.","(5:23) Eli Manning pass to the right to Sterling Shepard for 14 yards to the NYG48. Tackled by Asa Jackson.","(5:29) Eli Manning incomplete pass to the right intended for Jerell Adams.","(6:00) Shane Vereen rush to the right for 3 yards to the NYG34. Tackled by Tavon Wilson and Ezekiel Ansah.","(6:29) Eli Manning pass to the right to Odell Beckham Jr. for 4 yards to the NYG31. Tackled by Nevin Lawson.","(7:04) Eli Manning pass to the right to Will Tye for 4 yards to the NYG27. Tackled by Tahir Whitehead.","(7:33) Rashad Jennings rush to the right for 2 yards to the NYG23. Tackled by DeAndre Levy and Haloti Ngata.","(7:40) Sam Martin kicks off to the NYG-2. Dwayne Harris return for 23 yards to NYG21. Tackled by Brandon Copeland and Rafael Bush.","(7:44) Matt Prater 33 yard field goal attempt is GOOD. Holder: Sam Martin.","(8:30) Matthew Stafford sacked at NYG15 for a loss of 5 yards by Olivier Vernon and Johnathan Hankins.","(9:10) Matthew Stafford pass to the left to Dwayne Washington for 7 yards to the NYG10. Tackled by Andrew Adams.","(9:55) Matthew Stafford pass to the right to Golden Tate for a loss of 5 yards to the NYG17. Tackled by Jonathan Casillas.","(10:01) Penalty: Pass Interference on New York (Landon Collins) 6 yards.","(10:42) Matthew Stafford pass to the middle to Golden Tate for 7 yards to the NYG18. Tackled by Olivier Vernon and Coty Sensabaugh.","(11:23) Dwayne Washington rush to the right for no gain to the NYG25. Tackled by Landon Collins and Damon Harrison.","(12:04) Matthew Stafford pass to the left to Marvin Jones Jr. for 21 yards to the NYG25. Tackled by Eli Apple.","(12:47) Dwayne Washington rush to the right for 3 yards to the NYG46. Tackled by Jay Bromley.","(12:52) Matthew Stafford incomplete pass to the right intended for Eric Ebron.","(13:35) Matthew Stafford pass to the left to Anquan Boldin for 5 yards to the NYG49. Tackled by Coty Sensabaugh.","(14:20) Matthew Stafford pass to the left to Dwayne Washington for 2 yards to the Det46. Tackled by B.J. Goodson.","(15:00) Dwayne Washington rush to the right for 4 yards to the Det44. Tackled by Landon Collins and Romeo Okwara.","(15:00) Robbie Gould kicks off to the Det7, out of bounds. No return.","(0:05) Eli Manning pass to the left to Sterling Shepard for 13 yards to the Det47. Tackled by Haloti Ngata.","(0:10) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(0:16) Eli Manning pass to the left to Will Tye for 6 yards to the NYG40. Tackled by Rafael Bush.","(0:16) New York Giants timeout.","(0:21) Eli Manning pass to the middle to Shane Vereen for 6 yards to the NYG34. Tackled by Tavon Wilson and Kerry Hyder.","(0:41) Shane Vereen rush up the middle for 8 yards to the NYG28. Tackled by Kerry Hyder and Devin Taylor.","(0:50) Sam Martin punts for 40 yards to NYG0. Touchback.","(0:56) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(1:22) Matthew Stafford pass to the right to Zach Zenner for 4 yards to the NYG40. Tackled by Jonathan Casillas.","(1:26) Matthew Stafford incomplete pass to the left intended for Golden Tate.","(1:47) Zach Zenner rush to the right for 4 yards to the NYG44. Tackled by Jonathan Casillas and Olivier Vernon.","(1:53) Matthew Stafford pass to the right to Eric Ebron for 9 yards to the NYG48. Tackled by Dominique Rodgers-Cromartie.","(1:53) Two Minute Warning.","(2:03) Brad Wing punts for 18 yards to Det43. No return.","(2:10) Eli Manning incomplete pass to the middle intended for Shane Vereen.","(2:53) Eli Manning pass to the right to Jerell Adams for 3 yards to the NYG39. Tackled by Josh Bynes.","(3:20) Rashad Jennings rush to the left for 2 yards to the NYG36. Tackled by Tavon Wilson.","(3:33) Sam Martin punts for 44 yards to NYG23. Dwayne Harris return for 11 yards to NYG34. Tackled by Miles Killebrew.","(4:11) Matthew Stafford rush up the middle for 8 yards to the Det33. Tackled by Keenan Robinson and Coty Sensabaugh.","(4:53) Dwayne Washington rush to the right for no gain to the Det25. Tackled by Kerry Wynn and Dominique Rodgers-Cromartie.","(5:00) Matthew Stafford incomplete pass to the left intended for Dwayne Washington.","(5:00) Robbie Gould kicks off to the endzone. Touchback.","(5:06) Robbie Gould 47 yard field goal attempt is GOOD. Holder: Brad Wing.","(5:55) Eli Manning pass to the left to Will Tye for 11 yards to the Det29. Tackled by Rafael Bush and Miles Killebrew.","(6:08) Penalty: Illegal Use of Hands on New York (Bobby Hart) -10 yards.","(6:47) Eli Manning sacked at Det30 for a loss of 7 yards by Anthony Zettel.","(7:14) Eli Manning pass to the right to Odell Beckham Jr. for 5 yards to the Det23. Tackled by Darius Slay.","(7:45) Paul Perkins rush to the left for 3 yards to the Det28. Tackled by Anthony Zettel and Khyri Thornton.","(8:04) Paul Perkins rush up the middle for 8 yards to the Det31. Tackled by DeAndre Levy.","(8:45) Paul Perkins rush up the middle for 1 yard to the Det39. Tackled by Khyri Thornton and Josh Bynes.","(9:11) Eli Manning pass to the right to Jerell Adams for 11 yards to the Det40. Tackled by DeAndre Levy.","(9:47) Paul Perkins rush to the left for 3 yards to the NYG49. Tackled by DeAndre Levy.","(10:24) Eli Manning pass to the right to Odell Beckham Jr. for 22 yards to the NYG46. Tackled by Asa Jackson.","(10:53) Eli Manning pass to the right to Jerell Adams for 4 yards to the NYG24. Tackled by DeAndre Levy.","(11:03) Zach Zenner rush up the middle for 7 yards to the NYG4. Tackled by Leon Hall. FUMBLE, recovered by NYG (Olivier Vernon). Touchback.","(11:50) Matthew Stafford pass to the right to Golden Tate for 67 yards to the NYG11. Tackled by Dominique Rodgers-Cromartie.","(12:07) Brad Wing punts for 51 yards to Det19. Andre Roberts return for 3 yards to Det22. Tackled by B.J. Goodson. FUMBLE, recovered by Det.","(12:48) Rashad Jennings rush to the right for a loss of 3 yards to the NYG30. Tackled by Tahir Whitehead and Haloti Ngata.","(13:25) Rashad Jennings rush to the right for 5 yards to the NYG33. Tackled by Tahir Whitehead and Tavon Wilson.","(14:02) Rashad Jennings rush up the middle for 3 yards to the NYG28. Tackled by Khyri Thornton and Ezekiel Ansah.","(14:02) Sam Martin kicks off to the endzone. Touchback.","(14:07) Matt Prater 48 yard field goal attempt is GOOD. Holder: Sam Martin.","(14:12) Matthew Stafford incomplete pass to the left intended for Eric Ebron.","(14:20) Matthew Stafford incomplete pass to the right intended for Golden Tate defensed by Eli Apple.","(15:00) Dwayne Washington rush to the left for 1 yard to the NYG29. Tackled by Kelvin Sheppard and Landon Collins.","(0:11) New York Giants timeout.","(0:11) Matthew Stafford pass to the right to Eric Ebron for 5 yards to the NYG30.","(0:53) Matthew Stafford pass to the left to Golden Tate for 4 yards to the NYG35. Tackled by Andrew Adams and Eli Apple.","(1:31) Dwayne Washington rush to the right for 2 yards to the NYG39. Tackled by Devon Kennard and Eli Apple.","(1:40) Penalty: Holding on New York (Eli Apple) 5 yards.","(2:23) Dwayne Washington rush to the left for no gain to the NYG46. Tackled by Damon Harrison.","(3:06) Dwayne Washington rush to the right for 1 yard to the NYG46. Tackled by Johnathan Hankins.","(3:49) Matthew Stafford pass to the left to Eric Ebron for 21 yards to the NYG47. Tackled by Andrew Adams.","(4:29) Dwayne Washington rush to the right for 1 yard to the Det32. Tackled by Olivier Vernon and Damon Harrison.","(4:40) Brad Wing punts for 43 yards to Det41. Andre Roberts - no return. Tackled by Dwayne Harris. Penalty: Holding on Detroit (Johnson Bademosi) -10 yards.","(5:23) Eli Manning pass to the left to Shane Vereen for 3 yards to the NYG16. Tackled by Tahir Whitehead.","(6:01) Paul Perkins rush to the right for no gain to the NYG13. Tackled by Rafael Bush.","(6:33) Paul Perkins rush to the right for 6 yards to the NYG13. Tackled by Tahir Whitehead and Kerry Hyder.","(6:45) Sam Martin punts for 63 yards to NYG7. No return.","(6:54) Matthew Stafford incomplete pass to the right.","(7:19) Penalty: Delay of Game on Detroit (Matthew Stafford) -5 yards.","(8:06) Matthew Stafford pass to the right to Anquan Boldin for a loss of 1 yard to the Det35. Tackled by Eli Apple and Janoris Jenkins.","(8:44) Dwayne Washington rush to the left for 4 yards to the Det36. Tackled by Damon Harrison and Johnathan Hankins.","(9:19) Dwayne Washington rush to the right for 12 yards to the Det32. Tackled by Landon Collins and Kelvin Sheppard.","(9:23) Robbie Gould kicks off to the Det0. Andre Roberts return for 20 yards to Det20. Tackled by Owamagbe Odighizuwa.","(9:23) Robbie Gould extra point is good.","(9:30) Eli Manning pass to the right to Sterling Shepard for 6 yards for a TOUCHDOWN.","(10:18) Paul Perkins rush up the middle for 11 yards to the Det6. Tackled by Tavon Wilson and Tahir Whitehead.","(10:47) Paul Perkins rush up the middle for 5 yards to the Det17. Tackled by Khyri Thornton.","(11:34) Eli Manning pass to the right to Victor Cruz for 29 yards to the Det22. Tackled by Tavon Wilson.","(12:09) Rashad Jennings rush to the left for no gain to the NYG49. Tackled by Tahir Whitehead and Asa Jackson.","(12:42) Eli Manning pass to the right to Will Tye for 4 yards to the NYG49. Tackled by Tahir Whitehead.","(13:22) Rashad Jennings rush to the right for 4 yards to the NYG45. Tackled by Tyrunn Walker.","(14:00) Eli Manning pass to the right to Odell Beckham Jr. for 4 yards to the NYG41. Tackled by Glover Quin.","(14:32) Rashad Jennings rush to the left for 6 yards to the NYG37. Tackled by A'Shawn Robinson.","(15:00) Rashad Jennings rush to the left for 6 yards to the NYG31. Tackled by Rafael Bush and Tavon Wilson.","(15:00) Sam Martin kicks off to the endzone. Touchback."]