["(0:34) Ben Roethlisberger rush up the middle for a loss of 1 yard to the Cin9.","(1:05) Ben Roethlisberger rush up the middle for a loss of 2 yards to the Cin8.","(1:44) Ben Roethlisberger rush up the middle for a loss of 2 yards to the Cin6.","(1:51) Penalty: Pass Interference on Cincinnati (Dre Kirkpatrick) 16 yards.","(1:51) Cincinnati Bengals timeout.","(1:57) Le'Veon Bell rush to the left for a loss of 1 yard to the Cin20. Tackled by Domata Peko.","(1:57) Two Minute Warning.","(2:02) Le'Veon Bell rush to the right for 3 yards to the Cin19. Tackled by Domata Peko.","(2:02) Cincinnati Bengals timeout.","(2:13) Ben Roethlisberger pass to the left to Le'Veon Bell for 9 yards to the Cin22. Tackled by Rey Maualuga.","(2:13) Cincinnati Bengals timeout.","(2:20) Le'Veon Bell rush up the middle for 3 yards to the Cin31. Tackled by Vontaze Burfict and Nick Vigil.","(3:03) Ben Roethlisberger pass to the right to Eli Rogers for 9 yards to the Cin34. Tackled by George Iloka.","(3:37) Ben Roethlisberger pass to the middle to Ladarius Green for 28 yards to the Cin43. Tackled by Darqueze Dennard and George Iloka.","(4:20) Le'Veon Bell rush to the left for 2 yards to the Pit29. Tackled by Karlos Dansby and Shawn Williams.","(4:25) Ben Roethlisberger incomplete pass to the left intended for Le'Veon Bell.","(5:09) Le'Veon Bell rush to the left for 3 yards to the Pit27. Tackled by Karlos Dansby and Vontaze Burfict.","(5:53) Ben Roethlisberger pass to the middle to Le'Veon Bell for 8 yards to the Pit24. Tackled by Adam Jones and Vontaze Burfict.","(6:05) Kevin Huber punts for 54 yards to Pit11. Antonio Brown return for 5 yards to Pit16. Tackled by Darqueze Dennard.","(6:11) Andy Dalton incomplete pass to the left intended for Brandon LaFell defensed by Artie Burns.","(6:18) Andy Dalton incomplete pass to the right.","(7:02) Jeremy Hill rush to the right for a loss of 4 yards to the Cin35. Tackled by Bud Dupree.","(7:29) Andy Dalton pass to the right to Brandon LaFell for 14 yards to the Cin39. Tackled by Ross Cockrell.","(7:29) Chris Boswell kicks off to the endzone. Touchback.","(7:29) Ben Roethlisberger 2 pt conversion pass is NO GOOD - intended for Antonio Brown.","(7:36) Ben Roethlisberger pass to the middle to Eli Rogers for 24 yards for a TOUCHDOWN.","(7:36) Pittsburgh Steelers timeout.","(8:26) Sammie Coates rush to the left for a loss of 6 yards to the Cin24. Tackled by Pat Sims and Karlos Dansby.","(8:49) Penalty: Unnecessary Roughness on Cincinnati (Pat Sims) 15 yards.","(8:55) Penalty: Holding on Cincinnati (Dre Kirkpatrick) 5 yards.","(9:01) Penalty: Holding on Cincinnati (Dre Kirkpatrick) 5 yards.","(9:08) Penalty: Offside on Cincinnati (Pat Sims) 5 yards.","(9:33) Ben Roethlisberger pass to the right to Ladarius Green for 10 yards to the Cin48. Tackled by Shawn Williams.","(10:11) Ben Roethlisberger rush up the middle for no gain to the Pit43. FUMBLE, recovered by Pit (Ben Roethlisberger).","(10:51) Le'Veon Bell rush to the right for 12 yards to the Pit43. Tackled by Vontaze Burfict and Shawn Williams.","(11:00) Kevin Huber punts for 45 yards to Pit31. No return.","(11:05) Andy Dalton incomplete pass to the right intended for Brandon LaFell defensed by Ross Cockrell.","(11:47) Jeremy Hill rush to the left for a loss of 1 yard to the Cin24. Tackled by Ryan Shazier.","(12:25) Andy Dalton pass to the right to Rex Burkhead for no gain to the Cin25. Tackled by Ryan Shazier and Ross Cockrell.","(12:25) Chris Boswell kicks off to the endzone. Touchback.","(12:29) Chris Boswell 30 yard field goal attempt is GOOD. Holder: Jordan Berry.","(12:34) Ben Roethlisberger incomplete pass to the right intended for Cobi Hamilton.","(13:19) Le'Veon Bell rush to the right for no gain to the Cin12. Tackled by Domata Peko and Vincent Rey.","(13:57) Ben Roethlisberger pass to the right to Eli Rogers for 17 yards to the Cin12. Tackled by George Iloka.","(14:17) Penalty: Holding on Pittsburgh (David DeCastro) -10 yards.","(15:00) Le'Veon Bell rush up the middle for 6 yards to the Cin19. Tackled by Shawn Williams.","(0:01) Le'Veon Bell rush to the right for 9 yards to the Cin25. Tackled by Shawn Williams and Carlos Dunlap.","(0:10) Andy Dalton pass intended for Tyler Boyd INTERCEPTED by Lawrence Timmons and returned for 16 yards. Tackled by Andrew Whitworth.","(0:52) Jeremy Hill rush to the right for 2 yards to the Cin41. Tackled by James Harrison and Ross Cockrell.","(1:33) Jeremy Hill rush to the left for 1 yard to the Cin39. Tackled by Lawrence Timmons.","(1:58) Andy Dalton pass to the left to Tyler Boyd for 8 yards to the Cin38. Tackled by James Harrison.","(2:05) Chris Boswell kicks off to the Cin4. Alex Erickson return for 26 yards to Cin30. Tackled by Fitzgerald Toussaint and Sammie Coates.","(2:09) Chris Boswell 49 yard field goal attempt is GOOD. Holder: Jordan Berry.","(2:15) Ben Roethlisberger incomplete pass to the right intended for Ladarius Green defensed by Josh Shaw.","(2:19) Ben Roethlisberger incomplete pass to the left intended for Jesse James.","(3:05) Ben Roethlisberger sacked at Cin31 for a loss of 1 yard by Geno Atkins.","(4:08) Ben Roethlisberger pass to the left to Ladarius Green for 5 yards to the Cin30. Tackled by Vontaze Burfict.","(4:16) Ben Roethlisberger incomplete pass to the middle intended for Sammie Coates defensed by Dre Kirkpatrick.","(5:01) Le'Veon Bell rush to the left for 5 yards to the Cin35. Tackled by Vontaze Burfict and Josh Shaw.","(5:42) Ben Roethlisberger pass to the middle to Eli Rogers for 28 yards to the Cin40. Tackled by Shawn Williams.","(6:23) Le'Veon Bell rush to the right for 2 yards to the Pit32. Tackled by Pat Sims and Carlos Dunlap.","(6:30) Kevin Huber punts for 42 yards to Pit30. No return.","(7:08) Andy Dalton sacked at Cin28 for a loss of 11 yards by Ryan Shazier.","(7:36) Andy Dalton pass to the right to James Wright for 5 yards to the Cin39. Tackled by James Harrison.","(8:03) Jeremy Hill rush to the left for a loss of 3 yards to the Cin34. Tackled by James Harrison.","(8:52) Andy Dalton pass to the left to Tyler Eifert for 9 yards to the Cin37. Tackled by Sean Davis.","(8:56) Andy Dalton incomplete pass to the right.","(9:27) Andy Dalton pass to the right to Tyler Boyd for 5 yards to the Cin28. Tackled by William Gay.","(9:59) Rex Burkhead rush to the left for 9 yards to the Cin23. Tackled by Ryan Shazier and Mike Mitchell.","(10:32) Jeremy Hill rush to the left for 4 yards to the Cin14. Tackled by Sean Davis and Bud Dupree.","(10:38) Chris Boswell kicks off to the Cin0. Alex Erickson return for 20 yards to Cin20. Tackled by Vince Williams. Penalty: Holding on Cincinnati (Tyler Kroft) -10 yards.","(10:43) Chris Boswell 40 yard field goal attempt is GOOD. Holder: Jordan Berry.","(10:49) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown defensed by Adam Jones.","(11:09) Penalty: False Start on Pittsburgh (David DeCastro) -5 yards.","(11:51) Le'Veon Bell rush to the right for a loss of 1 yard to the Cin17. Tackled by Dre Kirkpatrick and Karlos Dansby.","(12:36) Le'Veon Bell rush to the right for 5 yards to the Cin16. Tackled by Vontaze Burfict.","(13:05) Sammie Coates rush to the right for 15 yards to the Cin36. Tackled by Josh Shaw. Penalty: Unnecessary Roughness on Cincinnati (Vontaze Burfict) 15 yards.","(13:38) Le'Veon Bell rush to the right for 8 yards to the Pit49. Tackled by Carlos Dunlap.","(13:56) Ben Roethlisberger pass to the right to Ladarius Green for 23 yards to the Pit41. Tackled by Shawn Williams.","(14:15) Le'Veon Bell rush up the middle for 3 yards to the Pit33. Tackled by Rey Maualuga and Pat Sims. Penalty: Unnecessary Roughness on Pittsburgh (Marcus Gilbert) -15 yards.","(15:00) Le'Veon Bell rush up the middle for 5 yards to the Pit30. Tackled by Margus Hunt and Pat Sims.","(15:00) Randy Bullock kicks off to the endzone. Touchback.","(0:06) Chris Boswell kicks off to the Cin5. Alex Erickson return for 24 yards to Cin29. Tackled by Jordan Dangerfield.","(0:11) Chris Boswell 49 yard field goal attempt is GOOD. Holder: Jordan Berry.","(0:15) Ben Roethlisberger incomplete pass to the right intended for Le'Veon Bell.","(0:16) Ben Roethlisberger incomplete pass to the middle.","(0:33) Ben Roethlisberger pass to the middle to Le'Veon Bell for 8 yards to the Cin31. Tackled by Nick Vigil.","(0:33) Pittsburgh Steelers timeout.","(0:44) Ben Roethlisberger pass to the left to Cobi Hamilton for 21 yards to the Cin39. Tackled by Josh Shaw.","(0:51) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates.","(1:22) Ben Roethlisberger pass to the left to Le'Veon Bell for 3 yards to the Pit40. Tackled by Carlos Dunlap.","(1:22) Pittsburgh Steelers timeout.","(1:29) Ben Roethlisberger pass to the left to Sammie Coates for 10 yards to the Pit37. Tackled by Adam Jones.","(1:33) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown defensed by Carlos Dunlap.","(2:00) Ben Roethlisberger pass to the right to Antonio Brown for 13 yards to the Pit27. Tackled by Nick Vigil.","(2:00) Two Minute Warning.","(2:32) Le'Veon Bell rush to the right for 4 yards to the Pit14. Tackled by Michael Johnson.","(2:46) Penalty: Illegal Plyr Downfld on Pittsburgh (Maurkice Pouncey) -5 yards.","(2:51) Randy Bullock kicks off to the Pit3. Fitzgerald Toussaint return for 12 yards to Pit15. Tackled by KeiVarae Russell.","(2:55) Randy Bullock 22 yard field goal attempt is GOOD. Holder: Kevin Huber.","(2:59) Andy Dalton incomplete pass to the left intended for Rex Burkhead defensed by Artie Burns.","(3:41) Rex Burkhead rush to the right for a loss of 1 yard to the Pit4. Tackled by Sean Davis and Lawrence Timmons.","(4:15) Rex Burkhead rush up the middle for 4 yards to the Pit3. Tackled by Mike Mitchell and James Harrison.","(4:40) Rex Burkhead rush to the left for 10 yards to the Pit7. Tackled by Sean Davis.","(5:10) Rex Burkhead rush to the right for 9 yards to the Pit17. Tackled by Mike Mitchell.","(5:14) Andy Dalton incomplete pass to the middle intended for Tyler Eifert defensed by Ryan Shazier.","(5:25) Chris Boswell kicks off to the Cin2. Alex Erickson return for 72 yards to Pit26. Tackled by Chris Boswell.","(5:31) Chris Boswell 49 yard field goal attempt is GOOD. Holder: Jordan Berry.","(6:15) Ben Roethlisberger pass to the left to Eli Rogers for a loss of 3 yards to the Cin31. Tackled by Josh Shaw and Geno Atkins.","(6:19) Penalty: Illegal Block on Pittsburgh (Le'Veon Bell) -15 yards.","(6:50) Le'Veon Bell rush to the left for 3 yards to the Cin13. Tackled by Geno Atkins and Vincent Rey.","(6:56) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates defensed by Adam Jones.","(7:31) Le'Veon Bell rush to the right for 10 yards to the Cin31. Tackled by Dre Kirkpatrick. Penalty: Taunting on Cincinnati (Adam Jones) 15 yards.","(8:05) Ben Roethlisberger pass to the right to Antonio Brown for 32 yards to the Cin41. Tackled by Josh Shaw.","(8:11) Ben Roethlisberger incomplete pass to the middle intended for Ladarius Green.","(8:55) Le'Veon Bell rush to the right for 8 yards to the Pit27. Tackled by Pat Sims and Carlos Dunlap.","(9:02) Randy Bullock kicks off to the Pit-1. Fitzgerald Toussaint return for 20 yards to Pit19. Tackled by Tyler Kroft.","(9:02) Randy Bullock extra point is good.","(9:06) Jeremy Hill rush to the right for 4 yards for a TOUCHDOWN.","(9:45) Rex Burkhead rush to the right for no gain to the Pit4. Tackled by Sean Davis.","(10:12) Andy Dalton pass to the right to Brandon LaFell for 9 yards to the Pit4. Tackled by Bud Dupree.","(10:46) Andy Dalton pass to the right to Rex Burkhead for 18 yards to the Pit13. Tackled by Lawrence Timmons.","(11:16) Andy Dalton pass to the right to Brandon LaFell for 25 yards to the Pit31.","(11:41) Andy Dalton pass to the left to Cody Core for 3 yards to the Cin44. Tackled by William Gay and Artie Burns.","(12:13) Andy Dalton pass to the left to Cody Core for 10 yards to the Cin41. Tackled by Mike Mitchell.","(12:20) Andy Dalton incomplete pass to the right.","(12:51) Andy Dalton pass to the right to Brandon LaFell for 9 yards to the Cin31.","(13:18) Jeremy Hill rush to the left for 4 yards to the Cin22. Tackled by Ricardo Mathews.","(13:26) Jordan Berry punts for 40 yards to Cin18. No return.","(13:34) Ben Roethlisberger incomplete pass to the right intended for Eli Rogers defensed by Vontaze Burfict.","(14:20) Le'Veon Bell rush to the right for 5 yards to the Pit42. Tackled by Carlos Dunlap and Vontaze Burfict.","(14:25) Ben Roethlisberger incomplete pass to the right intended for Le'Veon Bell.","(15:00) Ben Roethlisberger pass to the middle to David Johnson for 12 yards to the Pit37. Tackled by Shawn Williams.","(15:00) Randy Bullock kicks off to the endzone. Touchback.","(15:00) Randy Bullock extra point is good.","(0:04) Andy Dalton rush to the right for 1 yard for a TOUCHDOWN.","(0:45) Cincinnati Bengals timeout.","(0:45) Jeremy Hill rush to the right for no gain to the Pit1. Tackled by Lawrence Timmons.","(1:28) Jeremy Hill rush to the right for no gain to the Pit1. Tackled by Daniel McCullers.","(1:58) Jeremy Hill rush to the right for no gain to the Pit1. Tackled by Lawrence Timmons.","(2:06) Penalty: Pass Interference on Pittsburgh (Artie Burns) 39 yards.","(2:35) Andy Dalton pass to the left to Brandon LaFell for 5 yards to the Pit40. Tackled by Artie Burns.","(2:38) Andy Dalton incomplete pass to the left intended for Cody Core.","(3:06) Jeremy Hill rush to the left for 7 yards to the Pit45. Tackled by James Harrison and Lawrence Timmons.","(3:34) Jeremy Hill rush to the right for 12 yards to the Cin48. Tackled by James Harrison.","(3:42) Chris Boswell kicks off to the Cin5. Alex Erickson return for 24 yards to Cin36. Tackled by Justin Gilbert and Roosevelt Nix.","(3:47) Chris Boswell 45 yard field goal attempt is GOOD. Holder: Jordan Berry.","(3:50) Ben Roethlisberger incomplete pass to the right intended for Ladarius Green.","(4:36) Le'Veon Bell rush to the left for a loss of 2 yards to the Cin27. Tackled by Margus Hunt and Rey Maualuga.","(5:21) Le'Veon Bell rush to the right for 1 yard to the Cin25. Tackled by Domata Peko and Margus Hunt.","(6:08) Ben Roethlisberger pass to the right to Antonio Brown for 13 yards to the Cin26. Tackled by George Iloka and Vontaze Burfict.","(6:49) Ben Roethlisberger pass to the left to Ladarius Green for 6 yards to the Cin39. Tackled by Adam Jones.","(7:30) Ben Roethlisberger pass to the middle to Le'Veon Bell for 10 yards to the Cin45. Tackled by Vincent Rey.","(7:39) Randy Bullock kicks off to the Pit1. Sammie Coates return for 44 yards to Pit45. Tackled by Randy Bullock.","(7:42) Randy Bullock 23 yard field goal attempt is GOOD. Holder: Kevin Huber.","(7:46) Andy Dalton incomplete pass to the right intended for Tyler Eifert.","(8:31) Jeremy Hill rush to the left for 1 yard to the Pit5. Tackled by Ricardo Mathews and Daniel McCullers.","(9:14) Jeremy Hill rush to the right for 1 yard to the Pit6. Tackled by Daniel McCullers.","(9:50) Rex Burkhead rush to the right for 1 yard to the Pit7. Tackled by Lawrence Timmons.","(10:33) Andy Dalton pass to the left to Jeremy Hill for 8 yards to the Pit8. Tackled by Ryan Shazier.","(11:11) Jeremy Hill rush to the right for 1 yard to the Pit16. Tackled by Mike Mitchell.","(11:37) Andy Dalton pass to the left to Brandon LaFell for 18 yards to the Pit17. Tackled by Artie Burns.","(11:43) Andy Dalton incomplete pass to the right.","(12:20) Jeremy Hill rush to the right for 7 yards to the Pit35. Tackled by Sean Davis.","(12:48) Jeremy Hill rush to the left for 4 yards to the Pit42. Tackled by Mike Mitchell.","(13:18) Andy Dalton pass to the left to Brandon LaFell for 11 yards to the Pit46. Tackled by James Harrison and Lawrence Timmons.","(13:39) Penalty: Face Mask on Pittsburgh (Stephon Tuitt) 15 yards.","(14:19) Jeremy Hill rush to the right for 1 yard to the Cin28. Tackled by Stephon Tuitt.","(15:00) Jeremy Hill rush to the right for 2 yards to the Cin27. Tackled by James Harrison and Javon Hargrave.","(15:00) Chris Boswell kicks off to the endzone. Touchback."]