["(0:04) Joe Flacco rush up the middle for a loss of 1 yard to the Phi48.","(0:04) Caleb Sturgis onside kickoff to the Phi47. Onside kick recovered by receiving team by Anthony Levine Sr..","(0:04) Baltimore Ravens timeout.","(0:04) Carson Wentz 2 pt conversion pass is NO GOOD - intended for Jordan Matthews.","(0:04) Philadelphia Eagles timeout.","(0:12) Carson Wentz rush to the left for 4 yards for a TOUCHDOWN.","(0:17) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(0:22) Penalty: Pass Interference on Baltimore (Tavon Young) 13 yards.","(0:26) Carson Wentz incomplete pass to the right intended for Zach Ertz.","(0:33) Carson Wentz pass to the right to Zach Ertz for 24 yards to the Bal17.","(0:33) Carson Wentz incomplete pass to the left intended for Nelson Agholor defensed by Shareece Wright.","(0:42) Penalty: Illegal Contact on Baltimore (C.J. Mosley) 5 yards.","(0:43) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(0:49) Carson Wentz pass to the right to Jordan Matthews for 5 yards to the Bal46. Tackled by Jerraud Powers.","(1:15) Carson Wentz incomplete pass to the left intended for Nelson Agholor.","(1:39) Carson Wentz pass to the middle to Jordan Matthews for 8 yards to the Phi49. Tackled by C.J. Mosley and Elvis Dumervil.","(1:50) Sam Koch punts for 47 yards to Phi41. No return.","(1:50) Baltimore Ravens timeout.","(1:54) Kenneth Dixon rush up the middle for 1 yard to the Bal12. Tackled by Fletcher Cox and Brandon Graham.","(1:54) Philadelphia Eagles timeout.","(2:00) Terrance West rush to the right for 1 yard to the Bal11. Tackled by Bennie Logan and Brandon Graham.","(2:00) Two Minute Warning.","(2:18) Terrance West rush to the right for a loss of 2 yards to the Bal10. Tackled by Bennie Logan.","(2:22) Caleb Sturgis kicks off to the Bal4. Lardarius Webb return for 8 yards to Bal12. Tackled by Kamu Grugier-Hill.","(2:26) Caleb Sturgis 29 yard field goal attempt is GOOD. Holder: Donnie Jones.","(2:30) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham defensed by Tavon Young.","(3:00) Byron Marshall rush to the left for a loss of 4 yards to the Bal11. Tackled by Terrell Suggs.","(3:04) Carson Wentz incomplete pass to the right intended for Zach Ertz.","(3:30) Carson Wentz pass to the right to Zach Ertz for 9 yards to the Bal7. Tackled by C.J. Mosley and Lardarius Webb.","(3:52) Byron Marshall rush to the left for 3 yards to the Bal16. Tackled by C.J. Mosley.","(4:21) Carson Wentz pass to the right to Zach Ertz for 5 yards to the Bal19. Tackled by C.J. Mosley.","(4:47) Carson Wentz pass to the middle to Jordan Matthews for 6 yards to the Bal24. Tackled by C.J. Mosley.","(5:08) Carson Wentz pass to the right to Jordan Matthews for 1 yard to the Bal30. Tackled by Jerraud Powers.","(5:46) Ryan Mathews rush to the left for 18 yards to the Bal31. Tackled by Eric Weddle and Zachary Orr.","(6:12) Ryan Mathews rush up the middle for 11 yards to the Bal49. Tackled by C.J. Mosley.","(6:21) Joe Flacco pass intended for Darren Waller INTERCEPTED by Jordan Hicks and returned for 34 yards. Tackled by Joe Flacco.","(6:21) Baltimore Ravens timeout.","(6:59) Joe Flacco pass to the right to Mike Wallace for 54 yards to the Phi11. Tackled by Rodney McLeod.","(7:02) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(7:43) Terrance West rush to the right for 2 yards to the Bal35. Tackled by Jalen Mills.","(7:49) Nelson Agholor rush to the left for 1 yard to the Bal33. Tackled by Eric Weddle.","(8:27) Carson Wentz pass to the right to Byron Marshall for 7 yards to the Bal34. Tackled by Tavon Young.","(8:32) Carson Wentz incomplete pass to the left intended for Trey Burton.","(9:12) Carson Wentz pass to the right to Trey Burton for 1 yard to the Bal41. Tackled by Tavon Young.","(9:54) Ryan Mathews rush to the left for 19 yards to the Bal42. Tackled by Albert McClellan.","(10:27) Carson Wentz pass to the right to Dorial Green-Beckham for 11 yards to the Phi39. Tackled by Tavon Young.","(11:06) Ryan Mathews rush to the right for 3 yards to the Phi28. Tackled by Brandon Williams.","(11:06) Justin Tucker kicks off to the endzone. Touchback.","(11:06) Justin Tucker extra point is good.","(11:14) Kenneth Dixon rush to the left for 16 yards for a TOUCHDOWN.","(11:40) Kenneth Dixon rush to the right for 5 yards to the Phi31. Tackled by Brandon Graham. Penalty: Face Mask on Philadelphia (Bennie Logan) 15 yards.","(12:23) Joe Flacco pass to the right to Darren Waller for 11 yards to the Phi36. Tackled by Connor Barwin.","(12:57) Joe Flacco pass to the left to Terrance West for 10 yards to the Phi47. Tackled by Jaylen Watkins.","(13:20) Kenneth Dixon rush to the left for 12 yards to the Phi47. Penalty: Holding on Baltimore (Vladimir Ducasse) -10 yards.","(13:57) Joe Flacco pass to the right to Steve Smith Sr. for 6 yards to the Bal41. Tackled by Malcolm Jenkins.","(14:38) Kenneth Dixon rush to the right for 4 yards to the Bal35. Tackled by Vinny Curry.","(14:42) Joe Flacco incomplete pass to the right intended for Michael Campanaro.","(14:48) Caleb Sturgis kicks off to the Bal2. Chris Moore return for 29 yards to Bal31. Tackled by Najee Goode.","(14:51) Caleb Sturgis 27 yard field goal attempt is GOOD. Holder: Donnie Jones.","(14:56) Carson Wentz incomplete pass to the middle intended for Trey Burton.","(15:00) Carson Wentz incomplete pass to the middle intended for Byron Marshall.","(0:40) Ryan Mathews rush to the left for 3 yards to the Bal9. Tackled by Michael Pierce.","(1:14) Ryan Mathews rush to the left for 12 yards to the Bal12. Tackled by C.J. Mosley.","(1:54) Bryce Treggs rush to the left for 4 yards to the Bal24. Tackled by Eric Weddle and Zachary Orr.","(2:38) Ryan Mathews rush up the middle for 3 yards to the Bal28. Tackled by Michael Pierce.","(3:17) Byron Marshall rush to the right for 4 yards to the Bal31. Tackled by Brandon Williams.","(3:58) Carson Wentz pass to the left to Zach Ertz for 24 yards to the Bal35. Tackled by Eric Weddle and Shareece Wright.","(4:41) Byron Marshall rush up the middle for 10 yards to the Phi41. Tackled by Brandon Williams.","(5:20) Byron Marshall rush to the right for 12 yards to the Phi31. Tackled by Eric Weddle.","(6:04) Carson Wentz pass to the middle to Zach Ertz for 7 yards to the Phi19. Tackled by C.J. Mosley.","(6:47) Ryan Mathews rush to the left for no gain to the Phi12. Tackled by Terrell Suggs.","(7:00) Sam Koch punts for 51 yards to Phi12. No return.","(7:06) Joe Flacco incomplete pass to the right intended for Kyle Juszczyk.","(7:42) Terrance West rush to the right for a loss of 4 yards to the Bal37. Tackled by Vinny Curry.","(8:01) Joe Flacco pass to the right to Terrance West for 2 yards to the Bal41. Tackled by Nigel Bradham and Jordan Hicks.","(8:05) Carson Wentz incomplete pass to the left intended for Trey Burton.","(8:12) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(8:52) Carson Wentz pass to the right to Nelson Agholor for 9 yards to the Bal39. Tackled by Lardarius Webb.","(10:00) Byron Marshall rush to the left for a loss of 2 yards to the Bal48. Tackled by Jerraud Powers.","(10:08) Byron Marshall rush to the right for no gain to the Phi39. Tackled by Lardarius Webb. Penalty: Unnecessary Roughness on Baltimore (Zachary Orr) 15 yards.","(10:18) Penalty: Illegal Contact on Baltimore (Zachary Orr) 5 yards.","(11:01) Carson Wentz pass to the left to Ryan Mathews for 5 yards to the Phi34. Tackled by Albert McClellan and Eric Weddle.","(11:45) Carson Wentz pass to the right to Brent Celek for 5 yards to the Phi29. Tackled by Lardarius Webb.","(12:24) Ryan Mathews rush to the left for 4 yards to the Phi24. Tackled by Brandon Williams.","(12:32) Sam Koch punts for 39 yards to Phi0. Touchback.","(13:05) Joe Flacco sacked at Phi39 for a loss of 5 yards by Fletcher Cox.","(13:44) Kenneth Dixon rush to the left for a loss of 3 yards to the Phi34. Tackled by Bennie Logan.","(14:20) Terrance West rush to the left for 3 yards to the Phi31. Tackled by Beau Allen and Mychal Kendricks.","(15:00) Terrance West rush to the right for 41 yards to the Phi34. Tackled by Rodney McLeod.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback.","(0:09) Carson Wentz rush up the middle for a loss of 1 yard to the Phi24.","(0:09) Justin Tucker kicks off to the endzone. Touchback.","(0:09) Justin Tucker extra point is good.","(0:16) Joe Flacco pass to the right to Steve Smith Sr. for 34 yards for a TOUCHDOWN.","(0:18) Joe Flacco incomplete pass to the middle.","(0:31) Joe Flacco pass to the left to Kyle Juszczyk for 10 yards to the Phi34. Tackled by Nigel Bradham.","(0:36) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(0:55) Joe Flacco pass to the right to Dennis Pitta for 10 yards to the Phi44. Tackled by Beau Allen.","(0:55) Baltimore Ravens timeout.","(1:01) Joe Flacco incomplete pass to the middle intended for Steve Smith Sr..","(1:05) Penalty: Pass Interference on Philadelphia (Jalen Mills) 5 yards.","(1:23) Joe Flacco pass to the right to Dennis Pitta for 6 yards to the Bal41. Tackled by Jaylen Watkins.","(1:27) Joe Flacco incomplete pass to the left intended for Breshad Perriman.","(1:39) Caleb Sturgis kicks off to the Bal1. Chris Moore return for 34 yards to Bal35. Tackled by Trey Burton. FUMBLE, recovered by Bal (Marqueston Huff).","(1:43) Caleb Sturgis 34 yard field goal attempt is GOOD. Holder: Donnie Jones.","(1:49) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(1:49) Baltimore Ravens timeout.","(1:57) Carson Wentz pass to the right to Byron Marshall for a loss of 1 yard to the Bal16. Tackled by Terrell Suggs.","(1:57) Two Minute Warning.","(2:03) Byron Marshall rush to the right for a loss of 4 yards to the Bal15. Tackled by Albert McClellan.","(2:03) Baltimore Ravens timeout.","(2:45) Ryan Mathews rush to the left for 6 yards to the Bal11. Tackled by Lawrence Guy.","(3:19) Ryan Mathews rush to the left for 13 yards to the Bal17. Tackled by C.J. Mosley. FUMBLE, recovered by Phi.","(3:45) Penalty: Holding on Philadelphia (Jason Kelce) -10 yards.","(4:20) Byron Marshall rush to the right for 3 yards to the Bal20. Tackled by Lawrence Guy and C.J. Mosley.","(4:54) Carson Wentz pass to the right to Zach Ertz for 11 yards to the Bal23. Tackled by Albert McClellan and Lardarius Webb.","(4:58) Carson Wentz incomplete pass to the right intended for Nelson Agholor.","(5:41) Ryan Mathews rush to the left for 5 yards to the Bal34. Tackled by Terrell Suggs and C.J. Mosley.","(6:17) Ryan Mathews rush to the right for 4 yards to the Bal39. Tackled by Elvis Dumervil.","(6:53) Carson Wentz pass to the left to Kenjon Barner for 10 yards to the Bal43. Tackled by Eric Weddle.","(6:57) Carson Wentz incomplete pass to the left intended for Kenjon Barner.","(7:20) Kenjon Barner rush to the left for 2 yards to the Phi47. Tackled by Brandon Williams.","(8:02) Ryan Mathews rush to the left for 10 yards to the Phi45. Tackled by Albert McClellan.","(8:42) Kenjon Barner rush to the right for 2 yards to the Phi35. Tackled by Matt Judon.","(9:21) Ryan Mathews rush to the right for 8 yards to the Phi33. Tackled by Brandon Williams.","(9:21) Justin Tucker kicks off to the endzone. Touchback.","(9:27) Justin Tucker 47 yard field goal attempt is GOOD. Holder: Sam Koch.","(10:09) Joe Flacco pass to the left to Kyle Juszczyk for 8 yards to the Phi28. Tackled by Malcolm Jenkins and Nolan Carroll.","(10:14) Joe Flacco incomplete pass to the right intended for Kenneth Dixon.","(10:48) Kenneth Dixon rush to the left for a loss of 2 yards to the Phi36. Tackled by Nigel Bradham.","(11:25) Joe Flacco pass to the right to Terrance West for 16 yards to the Phi34. Tackled by Leodis McKelvin and Rodney McLeod.","(12:07) Terrance West rush to the right for 2 yards to the Bal50. Tackled by Brandon Graham.","(12:37) Terrance West rush to the left for 4 yards to the Bal48. Tackled by Jordan Hicks.","(13:13) Joe Flacco pass to the left to Kamar Aiken for 14 yards to the Bal44. Tackled by Rodney McLeod.","(13:55) Joe Flacco pass to the left to Kyle Juszczyk for a loss of 3 yards to the Bal30. Tackled by Jordan Hicks.","(14:32) Terrance West rush to the right for 8 yards to the Bal33. Tackled by Beau Allen.","(14:38) Caleb Sturgis kicks off to the Bal7. Chris Moore return for 18 yards to Bal25. Tackled by Mychal Kendricks.","(14:38) Ryan Mathews 2 pt rush attempt. Successful.","(14:44) Ryan Mathews rush to the right for 4 yards for a TOUCHDOWN.","(14:44) Penalty: Offside on Baltimore (Terrell Suggs) 4 yards.","(14:55) Joe Flacco sacked at Bal8 for a loss of 5 yards by Nigel Bradham. FUMBLE, recovered by Phi (Fletcher Cox). Tackled by Marshal Yanda.","(15:00) Joe Flacco incomplete pass to the left intended for Mike Wallace defensed by Jalen Mills.","(0:14) Kenneth Dixon rush to the left for 3 yards to the Bal13. Tackled by Brandon Graham.","(0:17) Donnie Jones punts for 51 yards to Bal20. No return. Penalty: Holding on Baltimore (Shareece Wright) -10 yards.","(0:29) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(1:12) Carson Wentz rush up the middle for no gain to the Phi30. FUMBLE, recovered by Phi (Carson Wentz).","(1:49) Ryan Mathews rush up the middle for a loss of 2 yards to the Phi30. Tackled by Terrell Suggs.","(1:55) Justin Tucker kicks off to the Phi6. Kenjon Barner return for 26 yards to Phi32. Tackled by Marqueston Huff.","(2:00) Justin Tucker 53 yard field goal attempt is GOOD. Holder: Sam Koch.","(2:05) Joe Flacco incomplete pass to the middle intended for Steve Smith Sr..","(2:38) Terrance West rush up the middle for 4 yards to the Phi35. Tackled by Jordan Hicks and Nigel Bradham.","(2:45) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(3:17) Michael Campanaro rush to the left for 39 yards to the Phi39. Tackled by Malcolm Jenkins.","(4:01) Joe Flacco pass to the right to Mike Wallace for 6 yards to the Bal22. Tackled by Jalen Mills.","(4:38) Terrance West rush to the left for 4 yards to the Bal16. Tackled by Nigel Bradham.","(4:42) Caleb Sturgis kicks off to the Bal-5. Chris Moore return for 17 yards to Bal12. Tackled by Chris Maragos.","(4:47) Caleb Sturgis 45 yard field goal attempt is GOOD. Holder: Donnie Jones.","(4:52) Carson Wentz incomplete pass to the left intended for Kenjon Barner.","(5:34) Carson Wentz pass to the left to Jordan Matthews for 4 yards to the Bal27. Tackled by Jerraud Powers and Terrell Suggs.","(6:14) Ryan Mathews rush to the right for no gain to the Bal31. Tackled by Eric Weddle and Matt Judon.","(6:56) Ryan Mathews rush to the right for 7 yards to the Bal31. Tackled by C.J. Mosley and Eric Weddle.","(7:29) Carson Wentz rush up the middle for 5 yards to the Bal38. Tackled by C.J. Mosley.","(7:42) Sam Koch punts for 60 yards to Phi35. Kenjon Barner return for 22 yards to Bal43. Tackled by Matt Elam.","(7:47) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(8:22) Kenneth Dixon rush to the right for no gain to the Bal5. Tackled by Leodis McKelvin.","(9:03) Joe Flacco sacked at Bal5 for a loss of 7 yards by Brandon Graham and Beau Allen.","(9:07) Donnie Jones punts for 43 yards to Bal12. No return.","(9:31) Carson Wentz sacked at Phi45 for a loss of 11 yards by Elvis Dumervil. FUMBLE, recovered by Phi.","(9:35) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(9:40) Carson Wentz incomplete pass to the left intended for Kenjon Barner.","(10:13) Carson Wentz pass to the middle to Kenjon Barner for 15 yards to the Bal44. Tackled by Jerraud Powers.","(10:55) Carson Wentz pass to the right to Jordan Matthews for 3 yards to the Phi41. Tackled by Lardarius Webb.","(11:31) Carson Wentz pass to the left to Trey Burton for 1 yard to the Phi38. Tackled by Shareece Wright.","(11:38) Justin Tucker kicks off to the Phi10. Nelson Agholor return for 27 yards to Phi37. Tackled by Matt Elam.","(11:38) Justin Tucker extra point is good.","(11:41) Joe Flacco pass to the right to Kamar Aiken for 5 yards for a TOUCHDOWN.","(12:16) Terrance West rush to the right for 13 yards to the Phi5. Tackled by Rodney McLeod.","(12:20) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(13:01) Joe Flacco pass to the right to Terrance West for 17 yards to the Phi18. Tackled by Jordan Hicks.","(13:32) Terrance West rush up the middle for 1 yard to the Phi35. Tackled by Bennie Logan.","(13:38) Carson Wentz pass intended for Trey Burton INTERCEPTED by Zachary Orr and returned for 1 yard. Tackled by Trey Burton.","(14:21) Kenjon Barner rush to the right for 2 yards to the Phi27. Tackled by Elvis Dumervil.","(15:00) Ryan Mathews rush to the right for no gain to the Phi25. Tackled by Lawrence Guy.","(15:00) Justin Tucker kicks off to the endzone. Touchback."]