["(0:24) Dak Prescott rush up the middle for a loss of 2 yards to the Dal46.","(0:35) Jameis Winston pass intended for Russell Shepard INTERCEPTED by Orlando Scandrick. No return. Tackled by Charles Sims.","(0:39) Jameis Winston incomplete pass to the right intended for Mike Evans.","(1:14) Jameis Winston sacked at TB20 for a loss of 2 yards by Maliek Collins. FUMBLE, recovered by TB (Leonard Wester).","(1:19) Jameis Winston incomplete pass to the right intended for Cameron Brate.","(1:36) Jameis Winston pass to the middle to Cameron Brate for 11 yards to the TB22. Tackled by Sean Lee.","(1:43) Chris Jones punts for 40 yards to TB11. No return.","(1:43) Tampa Bay Buccaneers timeout.","(1:50) Dak Prescott sacked at Dal49 for a loss of 3 yards by Sealver Siliga.","(1:50) Tampa Bay Buccaneers timeout.","(1:56) Ezekiel Elliott rush to the left for 3 yards to the TB48. Tackled by Keith Tandy and Robert Ayers Jr..","(1:56) Tampa Bay Buccaneers timeout.","(2:00) Ezekiel Elliott rush to the right for 4 yards to the Dal49. Tackled by Lavonte David.","(2:00) Two Minute Warning.","(2:08) Ezekiel Elliott rush to the left for 15 yards to the Dal45. Tackled by Bradley McDougald.","(2:16) Bryan Anger punts for 53 yards to Dal30. No return.","(2:24) Jameis Winston incomplete pass to the left intended for Mike Evans.","(2:29) Jameis Winston incomplete pass to the right intended for Cameron Brate.","(2:58) Jameis Winston sacked at TB17 for a loss of 8 yards by David Irving.","(2:58) Dan Bailey kicks off to the endzone. Touchback.","(3:03) Dan Bailey 33 yard field goal attempt is GOOD. Holder: Chris Jones.","(3:41) Ezekiel Elliott rush to the right for 1 yard to the TB15. Tackled by Kwon Alexander and Brent Grimes.","(3:45) Dak Prescott pass to the right to Cole Beasley for 8 yards to the TB16. Tackled by Keith Tandy.","(4:26) Darren McFadden rush to the left for no gain to the TB24. Tackled by Keith Tandy.","(5:13) Ezekiel Elliott rush to the left for 10 yards to the TB24. Tackled by Keith Tandy and Javien Elliott.","(5:49) Ezekiel Elliott rush to the right for 42 yards to the TB34. Tackled by Keith Tandy.","(6:30) Dak Prescott pass to the right to Dez Bryant for 19 yards to the Dal24. Tackled by Bradley McDougald.","(6:55) Ezekiel Elliott rush up the middle for 1 yard to the Dal5. Tackled by Kwon Alexander and Lavonte David.","(7:05) Bryan Anger punts for 36 yards to Dal4. No return.","(7:11) Jameis Winston incomplete pass to the right intended for Russell Shepard.","(7:54) Jameis Winston pass to the right to Charles Sims for 6 yards to the Dal40. Tackled by Byron Jones.","(8:32) Doug Martin rush to the right for a loss of 1 yard to the Dal46. Tackled by Benson Mayowa.","(8:45) Dak Prescott pass to the left to Jason Witten for 3 yards to the Dal44. Tackled by Kwon Alexander. FUMBLE, recovered by TB (Lavonte David). Tackled by Jason Witten.","(8:54) Bryan Anger punts for 44 yards to Dal33. Lucky Whitehead - no return. Tackled by Josh Robinson. Penalty: Holding on Tampa Bay (Peyton Barber) 10 yards.","(8:57) Jameis Winston incomplete pass to the right intended for Charles Sims defensed by Justin Durant.","(9:00) Jameis Winston incomplete pass to the middle defensed by David Irving.","(9:26) Doug Martin rush up the middle for 3 yards to the TB23. Tackled by Sean Lee.","(9:35) Penalty: Too Many Men on Field on Dallas 5 yards.","(9:35) Dan Bailey kicks off to the TB-2. Josh Huff return for 17 yards to TB15. Tackled by Leon McFadden.","(9:40) Dan Bailey 38 yard field goal attempt is GOOD. Holder: Chris Jones.","(10:21) Dak Prescott pass to the middle to Ezekiel Elliott for 6 yards to the TB20. Tackled by Lavonte David and Kwon Alexander.","(11:01) Dak Prescott pass to the middle to Dez Bryant for 4 yards to the TB26. Tackled by Kwon Alexander and Keith Tandy.","(11:08) Penalty: Holding on Dallas (Tyron Smith) -10 yards.","(11:49) Ezekiel Elliott rush to the right for 2 yards to the TB20. Tackled by William Gholston.","(11:59) Jameis Winston pass intended for Adam Humphries INTERCEPTED by Jeff Heath and returned for 19 yards. Tackled by Kevin Pamphile.","(12:42) Jameis Winston pass to the middle to Charles Sims for 2 yards to the TB21. Tackled by Justin Durant.","(13:26) Jameis Winston sacked at TB19 for a loss of 6 yards by David Irving.","(13:31) Dan Bailey kicks off to the TB-1. Josh Huff return for 26 yards to TB25. Tackled by Lance Dunbar and Anthony Brown.","(13:37) Dan Bailey 40 yard field goal attempt is GOOD. Holder: Chris Jones.","(14:18) Dak Prescott pass to the left to Jason Witten for 1 yard to the TB22. Tackled by Kwon Alexander.","(15:00) Dak Prescott rush to the right for 5 yards to the TB23. Tackled by Robert Ayers Jr..","(0:32) Lucky Whitehead rush to the left for a loss of 7 yards to the TB28. Tackled by Robert Ayers Jr..","(1:07) Dak Prescott pass to the left to Cole Beasley for 17 yards to the TB21.","(1:44) Ezekiel Elliott rush up the middle for 4 yards to the TB38. Tackled by Keith Tandy.","(2:21) Dak Prescott pass to the left to Dez Bryant for 3 yards to the TB42. Tackled by Brent Grimes.","(2:56) Dak Prescott pass to the right to Terrance Williams for 9 yards to the TB45. Tackled by Brent Grimes.","(3:28) Ezekiel Elliott rush to the left for 20 yards to the Dal46. Tackled by Keith Tandy.","(4:08) Ezekiel Elliott rush to the left for 6 yards to the Dal26. Tackled by Kwon Alexander.","(4:12) Roberto Aguayo kicks off to the Dal-5. Lucky Whitehead return for 25 yards to Dal20. Tackled by Chris Conte.","(4:12) Roberto Aguayo extra point is good.","(4:18) Jameis Winston pass to the middle to Cameron Brate for 10 yards for a TOUCHDOWN.","(4:57) Charles Sims rush to the right for no gain to the Dal10. Tackled by Anthony Brown and Tyrone Crawford.","(5:30) Jameis Winston pass to the left to Mike Evans for 17 yards to the Dal10. Tackled by Jeff Heath.","(6:13) Charles Sims rush to the left for a loss of 4 yards to the Dal27. Tackled by Benson Mayowa.","(6:43) Jameis Winston pass to the middle to Cameron Brate for 22 yards to the Dal23. Tackled by Byron Jones.","(7:01) Charles Sims rush up the middle for 8 yards to the Dal45. Tackled by Byron Jones and Terrell McClain.","(7:06) Jameis Winston incomplete pass to the left intended for Adam Humphries defensed by Orlando Scandrick.","(7:34) Jameis Winston pass to the right to Cameron Brate for 17 yards to the TB47. Tackled by Sean Lee.","(8:00) Jameis Winston pass to the left to Russell Shepard for 19 yards to the TB30. Tackled by Byron Jones and Anthony Hitchens.","(8:30) Penalty: Holding on Tampa Bay (Ali Marpet) -10 yards.","(9:01) Doug Martin rush to the right for 2 yards to the TB21. Tackled by Sean Lee and Anthony Hitchens.","(9:49) Chris Jones punts for 42 yards to TB19. No return.","(9:49) Ezekiel Elliott rush up the middle for no gain to the Dal46. FUMBLE, recovered by Dal (Ronald Leary).","(10:31) Dak Prescott pass to the right to Lance Dunbar for 5 yards to the Dal46. Tackled by Daryl Smith.","(11:09) Ezekiel Elliott rush to the left for 3 yards to the Dal41. Tackled by Kwon Alexander and Bradley McDougald.","(11:44) Dak Prescott pass to the right to Terrance Williams for 13 yards to the Dal38. Tackled by Kwon Alexander.","(11:44) Roberto Aguayo kicks off to the endzone. Touchback.","(11:44) Roberto Aguayo extra point is good.","(11:52) Jameis Winston pass to the left to Adam Humphries for 42 yards for a TOUCHDOWN.","(12:31) Jameis Winston pass to the right to Alan Cross for 7 yards to the Dal42. Tackled by Anthony Brown.","(13:03) Doug Martin rush to the left for 2 yards to the Dal49. Tackled by Barry Church.","(13:36) Jameis Winston pass to the right to Mike Evans for 13 yards to the TB49. Tackled by Brandon Carr.","(13:42) Jameis Winston incomplete pass to the right.","(13:48) Jameis Winston incomplete pass to the middle intended for Josh Huff.","(14:25) Doug Martin rush to the right for 6 yards to the TB36. Tackled by Tyrone Crawford and Byron Jones.","(15:00) Doug Martin rush to the left for 5 yards to the TB30. Tackled by Damien Wilson and Anthony Brown.","(15:00) Dan Bailey kicks off to the endzone. Touchback.","(0:03) Jameis Winston pass intended for Mike Evans INTERCEPTED by Byron Jones and returned for 7 yards.","(0:03) Tampa Bay Buccaneers timeout.","(0:08) Jameis Winston pass to the left to Cameron Brate for 13 yards to the Dal44. Tackled by Sean Lee.","(0:13) 52 yard field goal attempt by Dan Bailey is NO GOOD. Holder: Chris Jones.","(0:17) Dak Prescott pass to the left to Jason Witten for 2 yards to the TB34.","(0:23) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(0:23) Dallas Cowboys timeout.","(0:28) Dak Prescott sacked at TB36 for a loss of 6 yards by Lavonte David.","(0:28) Dallas Cowboys timeout.","(0:34) Dak Prescott pass to the right to Dez Bryant for 23 yards to the TB30. Tackled by Kwon Alexander.","(0:41) Penalty: Holding on Dallas (Ronald Leary) -10 yards.","(0:41) Dallas Cowboys timeout.","(0:47) Dak Prescott pass to the right to Jason Witten for 8 yards to the TB43. Tackled by Bradley McDougald and Kwon Alexander.","(1:09) Dak Prescott pass to the middle to Jason Witten for 5 yards to the Dal49. Tackled by Kwon Alexander.","(1:31) Dak Prescott pass to the left to Dez Bryant for 14 yards to the Dal44. Tackled by Vernon Hargreaves III.","(1:52) Dak Prescott pass to the left to Dez Bryant for 5 yards to the Dal30. Tackled by Vernon Hargreaves III.","(1:52) Roberto Aguayo kicks off to the endzone. Touchback.","(1:55) Roberto Aguayo 34 yard field goal attempt is GOOD. Holder: Bryan Anger.","(2:00) Jameis Winston incomplete pass to the middle intended for Adam Humphries defensed by Orlando Scandrick.","(2:00) Two Minute Warning.","(2:23) Jameis Winston pass to the left to Charles Sims for 7 yards to the Dal16. Tackled by Justin Durant.","(2:31) Penalty: Offside on Dallas (Benson Mayowa) 5 yards.","(3:02) Doug Martin rush up the middle for a loss of 5 yards to the Dal13. Tackled by Benson Mayowa and Justin Durant. Penalty: Unnecessary Roughness on Tampa Bay (Jameis Winston) -15 yards.","(3:40) Jameis Winston pass to the right to Freddie Martino for 25 yards to the Dal8.","(4:05) Jameis Winston rush to the right for 6 yards to the Dal33. Tackled by Barry Church.","(4:27) Doug Martin rush up the middle for 6 yards to the Dal39. Tackled by Anthony Hitchens and Ryan Davis.","(4:53) Jameis Winston pass to the right to Mike Evans for 11 yards to the Dal45. Tackled by Barry Church.","(5:31) Doug Martin rush to the right for 2 yards to the TB44. Tackled by Sean Lee.","(5:52) Jameis Winston pass to the right to Mike Evans for 18 yards to the TB42. Tackled by Orlando Scandrick.","(6:24) Doug Martin rush to the left for a loss of 1 yard to the TB24. Tackled by Sean Lee.","(6:24) Dan Bailey kicks off to the endzone. Touchback.","(6:24) Dan Bailey extra point is good.","(6:27) Dak Prescott rush up the middle for 2 yards for a TOUCHDOWN.","(6:56) Dak Prescott pass to the right to Brice Butler for 21 yards to the TB2. Tackled by Brent Grimes.","(7:38) Dak Prescott pass to the right to Jason Witten for 7 yards to the TB23. Tackled by Lavonte David.","(8:15) Dak Prescott pass to the middle to Jason Witten for 5 yards to the TB30. Tackled by Keith Tandy.","(8:23) Dak Prescott incomplete pass to the right intended for Terrance Williams defensed by Brent Grimes.","(9:03) Dak Prescott rush to the left for 15 yards to the TB35.","(9:44) Dak Prescott pass to the left to Jason Witten for 6 yards to the Dal50. Tackled by Keith Tandy and William Gholston.","(10:25) Dak Prescott pass to the right to Darren McFadden for a loss of 2 yards to the Dal44. Tackled by Kwon Alexander.","(11:07) Darren McFadden rush to the left for 7 yards to the Dal46. Tackled by Keith Tandy and Kwon Alexander.","(11:37) Lucky Whitehead rush to the right for 3 yards to the Dal39. Tackled by Keith Tandy.","(11:45) Bryan Anger punts for 38 yards to Dal36. No return.","(11:55) Jameis Winston incomplete pass to the left intended for Charles Sims.","(12:01) Jameis Winston incomplete pass to the right intended for Mike Evans.","(12:27) Doug Martin rush to the right for 4 yards to the TB26. Tackled by Benson Mayowa and Sean Lee.","(12:34) Dan Bailey kicks off to the TB10. Josh Huff return for 12 yards to TB22. Tackled by Kavon Frazier.","(12:34) Dan Bailey extra point is good.","(12:38) Ezekiel Elliott rush to the left for 2 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Dallas (Ezekiel Elliott) -15 yards.","(12:43) Dak Prescott incomplete pass to the right intended for Dez Bryant defensed by Brent Grimes.","(12:43) Tampa Bay Buccaneers timeout.","(13:26) Darren McFadden rush to the right for 3 yards to the TB2. Tackled by Kwon Alexander.","(14:45) Ezekiel Elliott rush up the middle for 2 yards to the TB5. Tackled by Sealver Siliga.","(14:45) Ezekiel Elliott rush to the left for 7 yards to the TB7. Tackled by Bradley McDougald.","(14:56) Jameis Winston sacked at TB18 for a loss of 7 yards by Terrell McClain. FUMBLE, recovered by Dal (Maliek Collins). Tackled by Luke Stocker.","(14:56) Dan Bailey kicks off to the endzone. Touchback.","(15:00) Dan Bailey 27 yard field goal attempt is GOOD. Holder: Chris Jones.","(0:25) Dak Prescott pass to the middle to Ezekiel Elliott for 12 yards to the TB9. Tackled by Lavonte David and Javien Elliott.","(1:09) Ezekiel Elliott rush up the middle for 10 yards to the TB21. Tackled by Bradley McDougald.","(1:19) Penalty: Face Mask on Dallas (Doug Free) -15 yards.","(1:27) Dak Prescott incomplete pass to the left intended for Cole Beasley.","(1:55) Dak Prescott pass to the right to Lance Dunbar for 15 yards to the TB16. Tackled by Lavonte David.","(2:29) Dak Prescott pass to the right to Cole Beasley for 1 yard to the TB31. Tackled by Javien Elliott.","(3:11) Ezekiel Elliott rush to the left for 3 yards to the TB32. Tackled by Kwon Alexander and William Gholston.","(3:54) Dak Prescott pass to the middle to Ezekiel Elliott for 11 yards to the TB35. Tackled by Keith Tandy.","(4:36) Dak Prescott pass to the left to Cole Beasley for 22 yards to the TB46. Tackled by Vernon Hargreaves III.","(5:12) Ezekiel Elliott rush to the left for a loss of 2 yards to the Dal32. Tackled by Javien Elliott.","(5:48) Dak Prescott pass to the right to Jason Witten for 8 yards to the Dal34. Tackled by Bradley McDougald and Kwon Alexander.","(5:54) Roberto Aguayo kicks off to the Dal2. Lucky Whitehead return for 24 yards to Dal26. Tackled by Adarius Glanton and Peyton Barber.","(5:58) Roberto Aguayo 25 yard field goal attempt is GOOD. Holder: Bryan Anger.","(6:06) Jameis Winston incomplete pass to the left intended for Cameron Brate defensed by Byron Jones.","(6:45) Jameis Winston pass to the middle to Adam Humphries for 7 yards to the Dal7. Tackled by Byron Jones.","(7:23) Doug Martin rush to the left for no gain to the Dal14. Tackled by Benson Mayowa.","(7:54) Doug Martin rush up the middle for 2 yards to the Dal14. Tackled by Sean Lee.","(8:26) Doug Martin rush to the left for 6 yards to the Dal16. Tackled by Barry Church.","(9:00) Doug Martin rush to the left for 3 yards to the Dal22. Tackled by Barry Church and Sean Lee.","(9:06) Penalty: Pass Interference on Dallas (Brandon Carr) 21 yards.","(9:40) Doug Martin rush to the right for 8 yards to the Dal46. Tackled by Barry Church.","(9:46) Jameis Winston incomplete pass to the right intended for Luke Stocker.","(9:51) 56 yard field goal attempt by Dan Bailey is NO GOOD. Holder: Chris Jones.","(9:51) Tampa Bay Buccaneers timeout.","(10:25) Dak Prescott pass to the middle to Jason Witten for 6 yards to the TB38. Tackled by Lavonte David and Kwon Alexander.","(11:05) Dak Prescott sacked at TB44 for a loss of 6 yards by William Gholston.","(11:26) Ezekiel Elliott rush to the right for 1 yard to the TB28. Tackled by Kwon Alexander. Penalty: Holding on Dallas (Vince Mayle) -10 yards.","(12:03) Dak Prescott pass to the right to Dez Bryant for 8 yards to the TB29. Tackled by Brent Grimes.","(12:42) Ezekiel Elliott rush up the middle for 13 yards to the TB37. Tackled by Keith Tandy.","(13:13) Dak Prescott pass to the right to Terrance Williams for 8 yards to the Dal50. Tackled by Brent Grimes.","(13:48) Ezekiel Elliott rush to the right for 7 yards to the Dal42. Tackled by Bradley McDougald.","(14:21) Dak Prescott pass to the middle to Dez Bryant for 6 yards to the Dal35. Tackled by Kwon Alexander.","(14:54) Ezekiel Elliott rush up the middle for 5 yards to the Dal29. Tackled by Lavonte David.","(15:00) Roberto Aguayo kicks off to the Dal1. Lucky Whitehead return for 23 yards to Dal24. Tackled by Chris Conte."]