["(0:04) Trevor Siemian rush up the middle for a loss of 1 yard to the Den39.","(0:09) 50 yard field goal attempt by Graham Gano is NO GOOD. Holder: Andy Lee.","(0:09) Denver Broncos timeout.","(0:14) Cam Newton pass to the left to Ted Ginn Jr. for 5 yards to the Den32.","(0:14) Cam Newton incomplete pass to the middle.","(0:29) Cam Newton pass to the right to Kelvin Benjamin for 16 yards to the Den37. Tackled by Kayvon Webster.","(0:36) Cam Newton incomplete pass to the left intended for Greg Olsen.","(0:51) Cam Newton incomplete pass to the left intended for Kelvin Benjamin defensed by Chris Harris Jr..","(1:19) Cam Newton pass to the middle to Greg Olsen for 8 yards to the Car47. Tackled by T.J. Ward.","(1:19) Carolina Panthers timeout.","(1:24) Cam Newton incomplete pass to the left intended for Devin Funchess defensed by Shaquil Barrett.","(1:54) Mike Tolbert rush up the middle for 5 yards to the Car39. Tackled by T.J. Ward.","(2:00) Penalty: Illegal Use of Hands on Denver (Chris Harris Jr.) 5 yards.","(2:00) Two Minute Warning.","(2:15) Cam Newton sacked at Car29 for a loss of 6 yards by Von Miller.","(2:23) Cam Newton rush to the left for 5 yards to the Car35. Tackled by Bradley Roby.","(3:06) Cam Newton sacked at Car30 for a loss of 5 yards by Todd Davis and DeMarcus Ware.","(3:06) Penalty: False Start on Carolina (Ryan Kalil) -5 yards.","(3:17) Riley Dixon punts for 42 yards to Car40. No return.","(3:17) Carolina Panthers timeout.","(3:36) Trevor Siemian sacked at Den18 for a loss of 10 yards by Tre Boston.","(4:17) C.J. Anderson rush to the right for 3 yards to the Den28. Tackled by Luke Kuechly.","(4:21) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas.","(4:21) Graham Gano kicks off to the endzone. Touchback.","(4:25) Graham Gano 36 yard field goal attempt is GOOD. Holder: Andy Lee.","(4:28) Cam Newton incomplete pass to the right intended for Devin Funchess defensed by Aqib Talib.","(5:13) Jonathan Stewart rush up the middle for 1 yard to the Den18. Tackled by Todd Davis.","(5:53) Cam Newton rush to the left for 4 yards to the Den19. Tackled by Bradley Roby.","(6:36) Cam Newton pass to the left to Greg Olsen for 12 yards to the Den23. Tackled by T.J. Ward.","(7:04) Cam Newton pass to the left to Greg Olsen for 18 yards to the Den35. Tackled by Bradley Roby.","(7:41) Jonathan Stewart rush to the right for 3 yards to the Car47. Tackled by Von Miller.","(8:08) Cam Newton pass to the right to Corey Brown for 11 yards to the Car44.","(8:52) Jonathan Stewart rush to the left for 3 yards to the Car33. Tackled by Corey Nelson.","(9:26) Cam Newton rush to the left for 5 yards to the Car30. Tackled by Todd Davis.","(9:26) Brandon McManus kicks off to the endzone. Touchback.","(9:26) Brandon McManus extra point is good.","(9:30) C.J. Anderson rush up the middle for 1 yard for a TOUCHDOWN.","(9:30) Denver Broncos timeout.","(10:16) C.J. Anderson rush to the left for no gain to the Car1. Tackled by A.J. Klein.","(10:20) Trevor Siemian incomplete pass to the middle intended for Virgil Green defensed by Kony Ealy.","(10:46) C.J. Anderson rush up the middle for 1 yard to the Car1. Tackled by Luke Kuechly.","(10:46) Carolina Panthers timeout.","(11:29) Trevor Siemian pass to the left to Emmanuel Sanders for 6 yards to the Car2. Tackled by Bene Benwikere.","(11:34) Trevor Siemian incomplete pass to the middle intended for Demaryius Thomas defensed by Tre Boston.","(12:09) C.J. Anderson rush up the middle for 3 yards to the Car8. Tackled by Charles Johnson.","(12:41) Trevor Siemian rush to the right for 3 yards to the Car11. Tackled by Robert McClain.","(13:25) C.J. Anderson rush to the right for no gain to the Car14. Tackled by Kawann Short.","(14:07) C.J. Anderson rush to the left for 9 yards to the Car14. Tackled by Kurt Coleman.","(14:15) Cam Newton pass intended for Kelvin Benjamin INTERCEPTED by Chris Harris Jr. defensed by Chris Harris Jr.. No return. Tackled by Andrew Norwell. Penalty: Unnecessary Roughness on Carolina (Andrew Norwell) 15 yards.","(14:50) Jonathan Stewart rush to the left for 6 yards to the Car31. Tackled by Corey Nelson.","(14:50) Brandon McManus kicks off to the endzone. Touchback.","(14:50) Brandon McManus extra point is good.","(15:00) Trevor Siemian pass to the left to C.J. Anderson for 25 yards for a TOUCHDOWN.","(0:21) Trevor Siemian pass to the left to Emmanuel Sanders for 9 yards to the Car25. Tackled by James Bradberry.","(0:57) Trevor Siemian pass to the left to Kapri Bibbs for 6 yards to the Car34. Tackled by Robert McClain.","(1:38) C.J. Anderson rush to the right for 10 yards to the Car40. Tackled by Luke Kuechly.","(2:13) Trevor Siemian pass to the left to Virgil Green for 13 yards to the Den50. Tackled by Tre Boston.","(2:44) Trevor Siemian pass to the left to Virgil Green for a loss of 2 yards to the Den37. Tackled by Shaq Thompson.","(3:19) Trevor Siemian rush to the right for 11 yards to the Den39. Tackled by Kurt Coleman.","(3:58) Trevor Siemian pass to the right to C.J. Anderson for 6 yards to the Den28. Tackled by Thomas Davis.","(4:10) Andy Lee punts for 61 yards to Den7. Jordan Norwood return for 15 yards to Den22. Tackled by David Mayo.","(4:52) Cam Newton pass to the left to Kelvin Benjamin for 13 yards to the Car32. Tackled by Bradley Roby.","(4:56) Penalty: False Start on Carolina (Devin Funchess) -5 yards.","(5:27) Penalty: Face Mask on Carolina (Ryan Kalil) -15 yards.","(5:31) Cam Newton incomplete pass to the right intended for Corey Brown.","(5:39) Cam Newton incomplete pass to the right intended for Jonathan Stewart.","(5:51) Riley Dixon punts for 54 yards to Car31. Ted Ginn Jr. return for 8 yards to Car39. Tackled by Kayvon Webster.","(6:24) Trevor Siemian pass to the middle to Virgil Green for 5 yards to the Den15. Tackled by Luke Kuechly.","(7:01) Trevor Siemian pass to the right to C.J. Anderson for a loss of 5 yards to the Den10. Tackled by Thomas Davis.","(7:30) C.J. Anderson rush to the left for 1 yard to the Den15. Tackled by Ryan Delaire.","(7:46) Andy Lee punts for 76 yards to Den13. Jordan Norwood return for 11 yards to Den24. Penalty: Holding on Denver (Corey Nelson) -10 yards.","(8:27) Cam Newton sacked at Car11 for a loss of 7 yards by DeMarcus Ware.","(8:34) Cam Newton incomplete pass to the right intended for Devin Funchess.","(9:10) Jonathan Stewart rush up the middle for 7 yards to the Car18. Tackled by Shaquil Barrett.","(9:17) Trevor Siemian pass intended for Emmanuel Sanders INTERCEPTED by Bene Benwikere and returned for 1 yard. Tackled by Emmanuel Sanders.","(10:05) C.J. Anderson rush to the right for 10 yards to the Car30. Tackled by Luke Kuechly.","(10:09) Penalty: Pass Interference on Carolina (James Bradberry) 15 yards.","(10:47) C.J. Anderson rush to the right for 2 yards to the Den45. Tackled by Luke Kuechly.","(11:24) Trevor Siemian pass to the left to Demaryius Thomas for 23 yards to the Den43. Tackled by James Bradberry.","(11:33) Andy Lee punts for 56 yards to Den0. Touchback.","(12:16) Cam Newton rush to the left for no gain to the Car44. Tackled by Shane Ray and Aqib Talib.","(13:02) Jonathan Stewart rush to the right for 5 yards to the Car44. Tackled by Todd Davis.","(13:40) Cam Newton rush to the right for 4 yards to the Car39. Tackled by Brandon Marshall.","(14:22) Jonathan Stewart rush up the middle for 7 yards to the Car35. Tackled by Darian Stewart.","(15:00) Jonathan Stewart rush to the right for 3 yards to the Car28. Tackled by Derek Wolfe.","(15:00) Brandon McManus kicks off to the endzone. Touchback.","(0:03) Trevor Siemian rush up the middle for a loss of 1 yard to the Den24.","(0:03) Graham Gano kicks off to the endzone. Touchback.","(0:07) Graham Gano 44 yard field goal attempt is GOOD. Holder: Andy Lee.","(0:12) Cam Newton pass to the right to Greg Olsen for 7 yards to the Den26.","(0:12) Cam Newton incomplete pass to the middle.","(0:33) Cam Newton rush up the middle for 12 yards to the Den33. Tackled by Brandon Marshall.","(0:35) Penalty: Too Many Men on Field on Denver (Shane Ray) 5 yards.","(0:56) Cam Newton pass to the left to Kelvin Benjamin for 16 yards to the Car50. Tackled by Chris Harris Jr..","(1:22) Fozzy Whittaker rush up the middle for 3 yards to the Car34. Tackled by Sylvester Williams.","(1:45) Cam Newton rush up the middle for 9 yards to the Car31. Tackled by Darian Stewart.","(1:55) Riley Dixon punts for 44 yards to Car28. Ted Ginn Jr. return for 4 yards to Car32. Tackled by Cody Latimer. Penalty: Holding on Carolina (Daryl Worley) -10 yards.","(2:00) Trevor Siemian incomplete pass to the right intended for Jordan Norwood defensed by James Bradberry.","(2:00) Two Minute Warning.","(2:24) C.J. Anderson rush to the left for 1 yard to the Den28. Tackled by Tre Boston.","(3:01) C.J. Anderson rush to the left for 2 yards to the Den27. Tackled by Shaq Thompson.","(3:01) Graham Gano kicks off to the endzone. Touchback.","(3:01) Graham Gano extra point is good.","(3:07) Cam Newton rush to the right for 2 yards for a TOUCHDOWN.","(3:29) Penalty: Too Many Men on Field on Denver 2 yards.","(4:00) Cam Newton pass to the right to Greg Olsen for 15 yards to the Den4. Tackled by T.J. Ward.","(4:41) Cam Newton pass to the left to Greg Olsen for no gain to the Den19. Tackled by Chris Harris Jr..","(5:17) Cam Newton rush to the left for 3 yards to the Den19. Tackled by Todd Davis.","(5:55) Cam Newton pass to the left to Greg Olsen for 13 yards to the Den22. Tackled by Bradley Roby.","(5:59) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(6:37) Jonathan Stewart rush to the right for no gain to the Den35. Tackled by Jared Crick.","(6:50) Cam Newton pass to the right to Devin Funchess for 9 yards to the Den35.","(6:50) Denver Broncos timeout.","(6:53) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(7:34) Fozzy Whittaker rush to the left for 4 yards to the Den44. Tackled by Todd Davis.","(8:12) Fozzy Whittaker rush to the right for 6 yards to the Den48. Tackled by T.J. Ward.","(8:48) Cam Newton pass to the left to Fozzy Whittaker for 4 yards to the Car46. Tackled by Brandon Marshall.","(9:25) Jonathan Stewart rush up the middle for 3 yards to the Car42. Tackled by Brandon Marshall.","(10:06) Jonathan Stewart rush up the middle for 3 yards to the Car39. Tackled by Darius Kilgo.","(10:42) Cam Newton rush to the left for 6 yards to the Car36. Tackled by Brandon Marshall.","(10:42) Denver Broncos timeout.","(11:20) Cam Newton pass to the left to Kelvin Benjamin for 15 yards to the Car30. Tackled by Darian Stewart.","(11:20) Carolina Panthers timeout.","(11:28) Cam Newton incomplete pass to the right intended for Kelvin Benjamin.","(12:09) Cam Newton rush to the left for 4 yards to the Car15. Tackled by Von Miller.","(12:16) Brandon McManus kicks off to the Car2. Ted Ginn Jr. return for 9 yards to Car11. Tackled by Cody Latimer.","(12:16) Brandon McManus extra point is good. Penalty: Offside on Carolina 5 yards.","(12:23) Andy Janovich rush to the right for 28 yards for a TOUCHDOWN.","(13:02) C.J. Anderson rush to the left for 1 yard to the Car28. Tackled by Shaq Thompson.","(13:46) Trevor Siemian rush to the right for 8 yards to the Car29. Tackled by Luke Kuechly.","(14:14) C.J. Anderson rush to the left for 28 yards to the Car37. Tackled by Tre Boston.","(14:52) Trevor Siemian pass to the left to Emmanuel Sanders for 15 yards to the Den35. Tackled by Bene Benwikere.","(15:00) Andy Lee punts for 59 yards to Den0. Touchback.","(0:12) Cam Newton pass to the middle to Mike Tolbert for 1 yard to the Car41. Tackled by Darian Stewart.","(0:55) Jonathan Stewart rush to the left for 4 yards to the Car40. Tackled by Derek Wolfe.","(1:03) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(1:09) Trevor Siemian pass intended for Emmanuel Sanders INTERCEPTED by Thomas Davis defensed by Star Lotulelei and returned for 4 yards. Tackled by Trevor Siemian.","(1:48) Trevor Siemian sacked at Car25 for a loss of 9 yards by Vernon Butler.","(2:22) C.J. Anderson rush to the left for no gain to the Car16. Tackled by Luke Kuechly.","(3:00) Trevor Siemian pass to the right to Demaryius Thomas for 6 yards to the Car16. Tackled by James Bradberry.","(3:40) Devontae Booker rush to the right for 2 yards to the Car22. Tackled by Thomas Davis.","(4:20) Devontae Booker rush to the right for 6 yards to the Car24. Tackled by James Bradberry and Kurt Coleman.","(4:58) Trevor Siemian pass to the right to C.J. Anderson for 21 yards to the Car30. Tackled by Thomas Davis.","(5:38) C.J. Anderson rush to the right for a loss of 1 yard to the Den49. Tackled by Luke Kuechly.","(6:19) Trevor Siemian pass to the right to Demaryius Thomas for 8 yards to the Den50. Tackled by James Bradberry.","(6:48) C.J. Anderson rush up the middle for 3 yards to the Den42. Tackled by Kawann Short.","(7:13) Trevor Siemian pass to the right to Emmanuel Sanders for 14 yards to the Den39.","(7:13) Graham Gano kicks off to the endzone. Touchback.","(7:13) Graham Gano extra point is good.","(7:13) Cam Newton pass to the right to Kelvin Benjamin for 14 yards for a TOUCHDOWN. Penalty: Taunting on Carolina (Trai Turner) -15 yards.","(7:20) Carolina Panthers timeout.","(8:07) Jonathan Stewart rush up the middle for 2 yards to the Den14. Tackled by Shane Ray.","(8:55) Ted Ginn Jr. rush to the left for 20 yards to the Den16. Tackled by Darian Stewart.","(9:35) Cam Newton pass to the left to Kelvin Benjamin for 17 yards to the Den36. Tackled by Justin Simmons.","(9:35) Carolina Panthers timeout.","(9:39) Cam Newton incomplete pass to the middle intended for Greg Olsen defensed by T.J. Ward.","(10:21) Mike Tolbert rush to the right for 1 yard to the Car47. Tackled by DeMarcus Ware.","(11:01) Jonathan Stewart rush to the left for 11 yards to the Car46. Tackled by Todd Davis.","(11:37) Jonathan Stewart rush up the middle for 6 yards to the Car35. Tackled by Brandon Marshall.","(11:47) Devontae Booker rush to the right for no gain to the Car29. Tackled by Charles Johnson. FUMBLE, recovered by Car (Shaq Thompson). Tackled by Devontae Booker.","(12:23) C.J. Anderson rush to the right for 5 yards to the Car29. Tackled by Robert McClain.","(13:01) C.J. Anderson rush up the middle for 13 yards to the Car34. Tackled by James Bradberry.","(13:42) Trevor Siemian pass to the right to Emmanuel Sanders for 5 yards to the Car47. Tackled by Robert McClain.","(14:08) Trevor Siemian pass to the left to Virgil Green for 12 yards to the Den48.","(14:13) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(14:17) Trevor Siemian incomplete pass to the right intended for C.J. Anderson.","(15:00) Trevor Siemian pass to the left to Demaryius Thomas for 11 yards to the Den36. Tackled by Luke Kuechly.","(15:00) Graham Gano kicks off to the endzone. Touchback."]