["(0:12) Dak Prescott pass to the right to Terrance Williams for 14 yards to the NYG40. Tackled by Dominique Rodgers-Cromartie.","(0:17) Dak Prescott incomplete pass to the middle intended for Jason Witten.","(0:18) Dak Prescott incomplete pass to the middle.","(0:35) Dak Prescott pass to the left to Cole Beasley for 15 yards to the Dal46. Tackled by Janoris Jenkins.","(0:40) Dak Prescott incomplete pass to the right intended for Jason Witten.","(0:40) Penalty: False Start on Dallas (Zack Martin) -5 yards.","(0:43) Dak Prescott incomplete pass to the middle.","(1:01) Dak Prescott pass to the left to Lance Dunbar for 16 yards to the Dal36. Tackled by Keenan Robinson.","(1:05) Dak Prescott incomplete pass to the right intended for Jason Witten.","(1:12) Brad Wing punts for 37 yards to Dal0. Touchback.","(1:12) New York Giants timeout.","(2:00) Rashad Jennings rush up the middle for 11 yards to the Dal37. Tackled by J.J. Wilcox.","(2:00) Two Minute Warning.","(2:11) Rashad Jennings rush up the middle for a loss of 3 yards to the Dal48. Tackled by David Irving.","(2:54) Rashad Jennings rush to the left for 1 yard to the Dal45. Tackled by Sean Lee.","(2:54) Dallas Cowboys timeout.","(3:00) Rashad Jennings rush to the left for 9 yards to the Dal46. Tackled by Barry Church.","(3:00) Dallas Cowboys timeout.","(3:05) Rashad Jennings rush to the left for 3 yards to the NYG45. Tackled by Terrell McClain and Anthony Hitchens.","(3:05) Dallas Cowboys timeout.","(3:12) Rashad Jennings rush to the left for 12 yards to the NYG42. Tackled by Barry Church and Anthony Hitchens.","(3:57) Rashad Jennings rush up the middle for 7 yards to the NYG30. Tackled by Tyrone Crawford and Sean Lee.","(4:06) Chris Jones punts for 44 yards to NYG23. No return.","(4:36) Dak Prescott pass to the right to Jason Witten for 7 yards to the Dal33. Tackled by Jonathan Casillas.","(4:45) Dak Prescott incomplete pass to the right intended for Cole Beasley defensed by Jonathan Casillas.","(4:48) Dak Prescott incomplete pass to the left intended for Brice Butler.","(4:57) Penalty: Holding on Dallas (La'el Collins) -10 yards.","(5:25) Dak Prescott pass to the right to Terrance Williams for 11 yards to the Dal36. Tackled by Dominique Rodgers-Cromartie.","(5:33) Dak Prescott incomplete pass to the right intended for Dez Bryant defensed by Dominique Rodgers-Cromartie.","(6:13) Ezekiel Elliott rush to the left for no gain to the Dal25. Tackled by Devon Kennard and Olivier Vernon.","(6:13) Randy Bullock kicks off to the endzone. Touchback.","(6:13) Randy Bullock extra point is good.","(6:19) Eli Manning pass to the middle to Victor Cruz for 3 yards for a TOUCHDOWN.","(6:24) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(6:29) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(7:10) Shane Vereen rush to the left for 9 yards to the Dal3. Tackled by Barry Church and Jack Crawford.","(7:46) Shane Vereen rush to the right for 2 yards to the Dal12. Tackled by Sean Lee and Cedric Thornton.","(8:18) Shane Vereen rush up the middle for 10 yards to the Dal14. Tackled by Barry Church.","(9:01) Eli Manning pass to the left to Will Tye for 5 yards to the Dal24. Tackled by Justin Durant.","(9:39) Eli Manning pass to the middle to Sterling Shepard for 20 yards to the Dal29. Tackled by Byron Jones.","(10:12) Eli Manning pass to the left to Shane Vereen for 10 yards to the Dal49. Tackled by Justin Durant.","(10:12) Penalty: False Start on New York (Larry Donnell) -5 yards.","(10:25) Chris Jones punts for 56 yards to NYG29. Dwayne Harris return for 17 yards to NYG46. Tackled by Gavin Escobar.","(11:10) Dak Prescott pass to the left to Jason Witten for 3 yards to the Dal15. Tackled by Eli Apple.","(11:16) Dak Prescott incomplete pass to the middle intended for Cole Beasley.","(11:51) Ezekiel Elliott rush to the right for 2 yards to the Dal12. Tackled by Damon Harrison and Jonathan Casillas.","(11:59) Penalty: Holding on Dallas (La'el Collins) -10 yards.","(12:06) Brad Wing punts for 55 yards to Dal0. Touchback.","(12:11) Eli Manning incomplete pass to the middle intended for Larry Donnell defensed by Byron Jones.","(12:52) Rashad Jennings rush to the left for a loss of 2 yards to the NYG45. Tackled by Cedric Thornton.","(13:34) Eli Manning pass to the right to Odell Beckham Jr. for 7 yards to the NYG47. Tackled by Orlando Scandrick.","(13:59) Eli Manning pass to the right to Odell Beckham Jr. for 15 yards to the NYG40. Tackled by J.J. Wilcox.","(13:59) Dan Bailey kicks off to the endzone. Touchback.","(14:04) Dan Bailey 54 yard field goal attempt is GOOD. Holder: Chris Jones.","(14:10) Dak Prescott incomplete pass to the right intended for Alfred Morris.","(14:52) Alfred Morris rush to the right for 4 yards to the NYG36. Tackled by Devon Kennard and Jason Pierre-Paul.","(15:00) Dak Prescott incomplete pass to the right intended for Dez Bryant.","(0:44) Alfred Morris rush to the left for 13 yards to the NYG40. Tackled by Landon Collins.","(0:52) Dak Prescott incomplete pass to the right intended for Cole Beasley.","(1:23) Keith Smith rush up the middle for 3 yards to the Dal47. Tackled by Janoris Jenkins.","(2:03) Alfred Morris rush to the left for no gain to the Dal44. Tackled by Landon Collins.","(2:45) Dak Prescott pass to the right to Terrance Williams for 9 yards to the Dal44. Tackled by Dominique Rodgers-Cromartie.","(3:29) Alfred Morris rush to the right for 1 yard to the Dal35. Tackled by Devon Kennard.","(4:00) Alfred Morris rush to the right for 9 yards to the Dal34. Tackled by Jason Pierre-Paul.","(4:12) Brad Wing punts for 50 yards to Dal18. Lucky Whitehead return for 7 yards to Dal25. Tackled by Nat Berhe.","(4:16) Eli Manning incomplete pass to the left intended for Shane Vereen.","(5:01) Shane Vereen rush up the middle for 6 yards to the NYG32. Tackled by Sean Lee and Barry Church.","(5:44) Rashad Jennings rush up the middle for 1 yard to the NYG26. Tackled by Terrell McClain and Justin Durant.","(6:15) Rashad Jennings rush up the middle for 5 yards to the NYG25. Tackled by Jack Crawford and Justin Durant.","(6:50) Eli Manning sacked at NYG16 for no gain by Orlando Scandrick. FUMBLE, recovered by NYG (Rashad Jennings) and advanced for 4 yards.","(7:33) Rashad Jennings rush to the right for 4 yards to the NYG16. Tackled by Benson Mayowa and Justin Durant.","(7:41) Chris Jones punts for 47 yards to NYG12. No return.","(7:46) Dak Prescott incomplete pass to the right intended for Ezekiel Elliott.","(8:31) Dak Prescott pass to the left to Jason Witten for 1 yard to the Dal41. Tackled by Darian Thompson.","(8:36) Dak Prescott incomplete pass to the left intended for Terrance Williams.","(8:48) Brad Wing punts for 55 yards to Dal31. Lucky Whitehead return for 9 yards to Dal40. Tackled by Zak DeOssie.","(9:24) Eli Manning sacked at NYG14 for a loss of 4 yards by Benson Mayowa.","(9:32) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(10:05) Rashad Jennings rush up the middle for a loss of 1 yard to the NYG18. Tackled by Terrell McClain.","(10:11) Penalty: Holding on Dallas (Morris Claiborne) 5 yards.","(10:41) Rashad Jennings rush up the middle for no gain to the NYG14. Tackled by Tyrone Crawford and Sean Lee.","(10:47) Dan Bailey kicks off to the NYG-3. Dwayne Harris return for 17 yards to NYG14. Tackled by Jeff Heath.","(10:47) Dan Bailey extra point is good.","(10:53) Ezekiel Elliott rush to the right for 8 yards for a TOUCHDOWN.","(11:32) Dak Prescott pass to the left to Cole Beasley for 7 yards to the NYG8. Tackled by Landon Collins.","(12:10) Ezekiel Elliott rush to the right for 8 yards to the NYG15. Tackled by Jonathan Casillas and Kelvin Sheppard.","(12:16) Dak Prescott incomplete pass to the left intended for Jason Witten.","(12:54) Dak Prescott pass to the left to Cole Beasley for 4 yards to the NYG23. Tackled by Eli Apple.","(13:34) Dak Prescott pass to the right to Cole Beasley for 6 yards to the NYG27. Tackled by Dominique Rodgers-Cromartie.","(14:14) Ezekiel Elliott rush to the right for 2 yards to the NYG33. Tackled by Nat Berhe and Johnathan Hankins.","(14:22) Eli Manning pass intended for Sterling Shepard INTERCEPTED by Brandon Carr. No return. Tackled by Sterling Shepard.","(14:53) Rashad Jennings rush to the left for 1 yard to the NYG25. Tackled by Sean Lee and Terrell McClain.","(15:00) Dan Bailey kicks off to the NYG-5. Dwayne Harris return for 29 yards to NYG24. Tackled by Keith Smith.","(0:07) Randy Bullock kicks off to the Dal5. Lucky Whitehead return for 21 yards to Dal26. Tackled by Jonathan Casillas.","(0:07) Randy Bullock extra point is NO GOOD.","(0:13) Eli Manning pass to the right to Sterling Shepard for 9 yards for a TOUCHDOWN.","(0:13) New York Giants timeout.","(0:20) Eli Manning pass to the left to Will Tye for 4 yards to the Dal9. Tackled by Sean Lee.","(0:47) Eli Manning pass to the middle to Victor Cruz for 3 yards to the Dal13. Tackled by Sean Lee.","(1:05) Eli Manning pass to the left to Victor Cruz for 23 yards to the Dal16. Tackled by Brandon Carr.","(1:29) Eli Manning pass to the left to Shane Vereen for 6 yards to the Dal39. Tackled by Jack Crawford.","(1:35) Penalty: Holding on New York (Justin Pugh) -10 yards.","(2:00) Eli Manning pass to the middle to Will Tye for 7 yards to the Dal35. Tackled by Sean Lee and Anthony Hitchens.","(2:00) Two Minute Warning.","(2:12) Eli Manning pass to the left to Victor Cruz for 5 yards to the Dal42. Tackled by Brandon Carr.","(2:31) Shane Vereen rush up the middle for 8 yards to the Dal37. Tackled by Anthony Brown and Anthony Hitchens. Penalty: Holding on New York (John Jerry) -10 yards.","(2:54) Eli Manning pass to the right to Odell Beckham Jr. for 6 yards to the Dal45. Tackled by Barry Church.","(2:57) Eli Manning incomplete pass to the middle intended for Rashad Jennings.","(3:32) Rashad Jennings rush to the right for 7 yards to the NYG49. Tackled by Cedric Thornton and Anthony Hitchens.","(4:02) Rashad Jennings rush up the middle for 17 yards to the NYG42. Tackled by J.J. Wilcox.","(4:02) Dan Bailey kicks off to the endzone. Touchback.","(4:08) Dan Bailey 25 yard field goal attempt is GOOD. Holder: Chris Jones.","(4:46) Dak Prescott pass to the middle to Jason Witten for 8 yards to the NYG7. Tackled by Keenan Robinson and Darian Thompson.","(4:53) Dak Prescott incomplete pass to the left intended for Jason Witten.","(5:38) Ezekiel Elliott rush to the left for a loss of 2 yards to the NYG15. Tackled by Damon Harrison.","(6:07) Dak Prescott rush to the left for 11 yards to the NYG13. Tackled by Janoris Jenkins.","(6:16) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Landon Collins.","(6:58) Ezekiel Elliott rush to the left for 2 yards to the NYG24. Tackled by Damon Harrison.","(6:58) Dallas Cowboys timeout.","(7:39) Dak Prescott pass to the middle to Jason Witten for 9 yards to the NYG26. Tackled by Keenan Robinson and Kelvin Sheppard.","(7:45) Penalty: Face Mask on New York (Janoris Jenkins) 15 yards.","(8:33) Ezekiel Elliott rush to the right for no gain to the Dal50. Tackled by Darian Thompson and Kerry Wynn.","(9:06) Ezekiel Elliott rush up the middle for 4 yards to the Dal50. Tackled by Jason Pierre-Paul and Jay Bromley.","(9:36) Dak Prescott pass to the left to Geoff Swaim for 21 yards to the Dal46. Tackled by Landon Collins.","(9:36) Randy Bullock kicks off to the endzone. Touchback.","(9:36) Randy Bullock extra point is good.","(9:41) Eli Manning pass to the left to Larry Donnell for 15 yards for a TOUCHDOWN.","(10:15) Eli Manning pass to the left to Odell Beckham Jr. for 45 yards to the Dal15.","(10:43) Eli Manning pass to the right to Sterling Shepard for 14 yards to the NYG40. Tackled by Orlando Scandrick.","(11:09) Rashad Jennings rush to the left for 1 yard to the NYG26. Tackled by Terrell McClain.","(11:09) Dan Bailey kicks off to the endzone. Touchback.","(11:14) Dan Bailey 56 yard field goal attempt is GOOD. Holder: Chris Jones.","(11:18) Penalty: Holding on Dallas (Jason Witten) -10 yards.","(11:27) Dak Prescott incomplete pass to the right intended for Lance Dunbar.","(12:09) Ezekiel Elliott rush up the middle for a loss of 1 yard to the NYG28. Tackled by Olivier Vernon.","(12:17) Dak Prescott incomplete pass to the right intended for Dez Bryant defensed by Dominique Rodgers-Cromartie.","(12:58) Alfred Morris rush to the left for 2 yards to the NYG27. Tackled by Jay Bromley.","(13:34) Dak Prescott pass to the left to Cole Beasley for 9 yards to the NYG29. Tackled by Nat Berhe and Jonathan Casillas.","(14:18) Dak Prescott pass to the right to Jason Witten for 5 yards to the NYG38. Tackled by Jonathan Casillas.","(15:00) Alfred Morris rush to the left for 6 yards to the NYG43. Tackled by Nat Berhe.","(0:17) Dak Prescott pass to the left to Brice Butler for 16 yards to the NYG49. Tackled by Eli Apple.","(0:58) Dak Prescott pass to the left to Jason Witten for 8 yards to the Dal35. Tackled by Jonathan Casillas.","(1:38) Dak Prescott rush to the right for 1 yard to the Dal27. Tackled by Jonathan Casillas.","(2:24) Ezekiel Elliott rush to the left for 2 yards to the Dal26. Tackled by Johnathan Hankins.","(2:49) Dak Prescott pass to the right to Cole Beasley for 9 yards to the Dal24. Tackled by Eli Apple.","(3:29) Ezekiel Elliott rush to the left for 3 yards to the Dal15. Tackled by Johnathan Hankins and Jonathan Casillas.","(4:07) Ezekiel Elliott rush to the left for 2 yards to the Dal12. Tackled by Olivier Vernon.","(4:17) Brad Wing punts for 60 yards to Dal0. Touchback. Penalty: Holding on Dallas (Morris Claiborne) -10 yards.","(4:24) Eli Manning incomplete pass to the middle intended for Odell Beckham Jr..","(4:30) Eli Manning incomplete pass to the right intended for Shane Vereen.","(5:01) Shane Vereen rush up the middle for 3 yards to the NYG40. Tackled by Anthony Hitchens.","(5:16) Eli Manning pass to the left to Shane Vereen for 7 yards to the NYG37. Tackled by Kyle Wilber.","(6:01) Eli Manning pass to the left to Rashad Jennings for 3 yards to the NYG30. Tackled by Barry Church.","(6:35) Rashad Jennings rush up the middle for 2 yards to the NYG27. Tackled by Sean Lee.","(6:35) Dan Bailey kicks off to the endzone. Touchback.","(6:37) Dan Bailey 23 yard field goal attempt is GOOD. Holder: Chris Jones.","(7:18) Dak Prescott pass to the left to Ezekiel Elliott for 1 yard to the NYG5. Tackled by Jonathan Casillas.","(7:57) Ezekiel Elliott rush to the right for 4 yards to the NYG6. Tackled by Damon Harrison and Johnathan Hankins.","(8:01) Dak Prescott incomplete pass to the middle intended for Cole Beasley.","(8:40) Ezekiel Elliott rush up the middle for 2 yards to the NYG10. Tackled by Jason Pierre-Paul.","(9:21) Dak Prescott pass to the right to Jason Witten for 8 yards to the NYG12. Tackled by Nat Berhe.","(9:59) Ezekiel Elliott rush up the middle for 5 yards to the NYG20. Tackled by Johnathan Hankins and Damon Harrison.","(10:38) Dak Prescott pass to the left to Cole Beasley for 9 yards to the NYG25. Tackled by Jonathan Casillas.","(11:21) Dak Prescott pass to the left to Cole Beasley for 6 yards to the NYG34. Tackled by Landon Collins.","(12:05) Ezekiel Elliott rush to the left for 1 yard to the NYG40. Tackled by Olivier Vernon.","(12:39) Ezekiel Elliott rush to the right for 5 yards to the NYG41. Tackled by Jason Pierre-Paul.","(13:17) Dak Prescott pass to the right to Jason Witten for 17 yards to the NYG46. Tackled by Landon Collins.","(13:56) Ezekiel Elliott rush to the right for 3 yards to the Dal37. Tackled by Jason Pierre-Paul.","(14:27) Dak Prescott pass to the right to Dez Bryant for 8 yards to the Dal34.","(15:00) Ezekiel Elliott rush to the right for 1 yard to the Dal26. Tackled by Nat Berhe.","(15:00) Randy Bullock kicks off to the endzone. Touchback."]