["(0:39) Joe Flacco rush up the middle for a loss of 1 yard to the Buf45.","(1:08) Joe Flacco rush up the middle for a loss of 1 yard to the Buf44.","(1:46) Joe Flacco rush up the middle for a loss of 1 yard to the Buf43.","(1:48) Buffalo Bills timeout.","(2:00) Terrance West rush up the middle for 3 yards to the Buf42. Tackled by Preston Brown.","(2:00) Two Minute Warning.","(2:26) Baltimore Ravens timeout.","(2:26) Justin Forsett rush to the right for 7 yards to the Buf45. Tackled by Zach Brown.","(3:09) Terrance West rush to the left for 2 yards to the Bal48. Tackled by Corbin Bryant and Kyle Williams.","(3:09) Baltimore Ravens timeout.","(3:55) Mike Wallace rush to the right for 11 yards to the Bal46. Tackled by Aaron Williams.","(4:29) Terrance West rush to the left for a loss of 1 yard to the Bal35. Tackled by Lorenzo Alexander.","(4:43) Colton Schmidt punts for 43 yards to Bal43. Devin Hester return for a loss of 7 yards to Bal36. Tackled by Corey Graham.","(4:53) Tyrod Taylor sacked at Buf14 for a loss of 12 yards by Terrell Suggs.","(5:27) Tyrod Taylor pass to the left to Robert Woods for 9 yards to the Buf26. Tackled by Shareece Wright.","(5:27) Penalty: Delay of Game on Buffalo (Tyrod Taylor) -5 yards.","(5:35) Tyrod Taylor incomplete pass to the left intended for Sammy Watkins defensed by Jimmy Smith.","(5:39) Justin Tucker kicks off to the Buf9. Nick O'Leary return for 13 yards to Buf22. Tackled by Kendrick Lewis.","(5:42) Justin Tucker 37 yard field goal attempt is GOOD. Holder: Sam Koch.","(6:25) Joe Flacco sacked at Buf19 for a loss of 9 yards by Lorenzo Alexander and Leger Douzable.","(7:00) Terrance West rush to the right for 3 yards to the Buf10. Tackled by Zach Brown.","(7:38) Joe Flacco pass to the left to Steve Smith Sr. for no gain to the Buf13. Tackled by Stephon Gilmore and Jonathan Meeks.","(7:43) Penalty: Leverage on Buffalo (Jerel Worthy) 14 yards.","(8:16) Joe Flacco sacked at Buf27 for a loss of 6 yards by Leger Douzable.","(8:22) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(9:02) Terrance West rush to the right for 2 yards to the Buf21. Tackled by Kyle Williams.","(9:30) Joe Flacco pass to the middle to Dennis Pitta for 27 yards to the Buf23. Tackled by Zach Brown.","(9:59) Terrance West rush to the left for 2 yards to the Bal50. Tackled by Jerel Worthy and Zach Brown.","(10:32) Joe Flacco pass to the right to Mike Wallace for 9 yards to the Bal48. Tackled by Ronald Darby.","(11:03) Justin Forsett rush to the right for 4 yards to the Bal39. Tackled by Ronald Darby.","(11:32) Joe Flacco pass to the right to Chris Moore for 13 yards to the Bal35. Tackled by Ronald Darby.","(11:38) Joe Flacco incomplete pass to the middle intended for Steve Smith Sr..","(11:46) Colton Schmidt punts for 37 yards to Bal22. No return.","(12:06) Tyrod Taylor rush to the right for 3 yards to the Buf41. Tackled by Zachary Orr.","(12:06) Buffalo Bills timeout.","(12:15) Tyrod Taylor incomplete pass to the left intended for Sammy Watkins.","(12:51) LeSean McCoy rush to the right for 3 yards to the Buf38. Tackled by Brandon Williams.","(12:59) Sam Koch punts for 43 yards to Buf35. No return.","(13:26) Joe Flacco sacked at Bal22 for a loss of 8 yards by Jerry Hughes.","(14:06) Terrance West rush to the right for no gain to the Bal30. Tackled by Preston Brown.","(14:12) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(14:19) Colton Schmidt punts for 49 yards to Bal0. Touchback. Penalty: Holding on Buffalo (Garrison Sanborn) 10 yards.","(15:00) Tyrod Taylor pass to the left to Charles Clay for 7 yards to the Bal49. Tackled by Shareece Wright.","(0:31) LeSean McCoy rush to the right for 2 yards to the Buf44. Tackled by Eric Weddle.","(0:36) Tyrod Taylor incomplete pass to the right intended for Nick O'Leary.","(0:46) Joe Flacco pass to the right to Terrance West for no gain to the Buf42. Tackled by Jerry Hughes.","(1:10) Joe Flacco pass to the left to Dennis Pitta for 5 yards to the Buf42.","(1:53) Joe Flacco pass to the right to Kamar Aiken for a loss of 2 yards to the Buf47. Tackled by Aaron Williams.","(2:39) Joe Flacco pass to the middle to Terrance West for 6 yards to the Buf45.","(2:45) Penalty: Roughing Passer on Buffalo (Jerry Hughes) 15 yards.","(3:25) Joe Flacco pass to the middle to Kyle Juszczyk for 12 yards to the Bal34. Tackled by Preston Brown.","(3:41) Penalty: Face Mask on Buffalo (Nickell Robey-Coleman) 15 yards.","(4:09) Justin Forsett rush to the left for a loss of 2 yards to the Bal7. Tackled by Kyle Williams.","(4:18) Colton Schmidt punts for 46 yards to Bal9. No return.","(4:53) Tyrod Taylor rush to the left for a loss of 2 yards to the Buf45. Tackled by Shareece Wright.","(5:39) Tyrod Taylor rush up the middle for 4 yards to the Buf47. Tackled by C.J. Mosley and Matt Judon.","(6:19) LeSean McCoy rush to the right for 4 yards to the Buf43. Tackled by Eric Weddle.","(6:53) Tyrod Taylor pass to the left to Sammy Watkins for 11 yards to the Buf39. Tackled by Jimmy Smith.","(7:32) LeSean McCoy rush to the right for no gain to the Buf28. Tackled by Michael Pierce.","(7:43) Sam Koch punts for 46 yards to Buf7. Brandon Tate return for 21 yards to Buf28. Tackled by Morgan Cox.","(7:49) Joe Flacco incomplete pass to the left intended for Chris Moore.","(8:33) Justin Forsett rush to the left for 8 yards to the Bal47. Tackled by Jonathan Meeks and Zach Brown.","(8:37) Joe Flacco incomplete pass to the right intended for Steve Smith Sr. defensed by Ronald Darby.","(8:43) 49 yard field goal attempt by Dan Carpenter is NO GOOD. Holder: Colton Schmidt.","(9:26) Tyrod Taylor pass to the left to Robert Woods for 1 yard to the Bal31. Tackled by Tavon Young.","(9:26) Buffalo Bills timeout.","(10:13) Reggie Bush rush to the right for a loss of 6 yards to the Bal32. Tackled by Albert McClellan.","(10:19) Tyrod Taylor incomplete pass to the right intended for Robert Woods.","(10:53) Tyrod Taylor rush to the left for 6 yards to the Bal31. Penalty: Holding on Baltimore (Jimmy Smith) 5 yards.","(11:36) LeSean McCoy rush to the right for no gain to the Bal37. Tackled by Zachary Orr.","(12:21) Reggie Bush rush to the left for 5 yards to the Bal37. Tackled by Za'Darius Smith.","(13:01) Tyrod Taylor pass to the right to Robert Woods for 4 yards to the Bal42.","(13:45) Tyrod Taylor pass to the left to Sammy Watkins for 19 yards to the Bal46. Tackled by C.J. Mosley.","(14:24) LeSean McCoy rush to the right for 6 yards to the Buf35. Tackled by Zachary Orr.","(15:00) LeSean McCoy rush to the left for 4 yards to the Buf29. Tackled by Shareece Wright.","(15:00) Justin Tucker kicks off to the endzone. Touchback.","(0:42) Joe Flacco sacked at Bal44 for a loss of 10 yards by Jerry Hughes.","(0:46) Joe Flacco incomplete pass to the right intended for Mike Wallace defensed by Ronald Darby.","(0:51) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(0:51) Baltimore Ravens timeout.","(0:57) Joe Flacco pass to the right to Dennis Pitta for 7 yards to the Buf46. Tackled by Preston Brown.","(1:33) Justin Forsett rush to the right for 3 yards to the Bal47. Tackled by Jerry Hughes.","(1:58) Joe Flacco pass to the right to Steve Smith Sr. for 6 yards to the Bal44. Tackled by Aaron Williams.","(1:58) Two Minute Warning.","(2:07) Joe Flacco pass to the middle to Justin Forsett for 10 yards to the Bal38. Tackled by Stephon Gilmore.","(2:52) Justin Forsett rush to the right for 5 yards to the Bal28. Tackled by Zach Brown.","(2:56) Joe Flacco incomplete pass to the middle intended for Mike Wallace.","(3:02) Jordan Gay kicks off to the Bal0. Devin Hester return for 23 yards to Bal23. Tackled by Ramon Humber.","(3:02) Dan Carpenter extra point is good.","(3:06) LeSean McCoy rush to the left for 1 yard for a TOUCHDOWN.","(3:06) Buffalo Bills timeout.","(3:57) Tyrod Taylor rush up the middle for no gain to the Bal1. Tackled by Brent Urban and Michael Pierce.","(4:33) Buffalo Bills timeout.","(4:33) LeSean McCoy rush to the left for no gain to the Bal1. Tackled by Albert McClellan.","(5:06) LeSean McCoy rush to the left for 3 yards to the Bal1. Tackled by Terrell Suggs.","(5:57) Tyrod Taylor pass to the left to Charles Clay for 33 yards to the Bal4. Tackled by Shareece Wright.","(6:44) Reggie Bush rush to the left for a loss of 3 yards to the Bal37. Tackled by Lawrence Guy.","(6:50) Tyrod Taylor incomplete pass to the right intended for Reggie Bush.","(7:32) LeSean McCoy rush to the left for 13 yards to the Bal34. Tackled by Eric Weddle.","(8:03) Tyrod Taylor pass to the left to Robert Woods for 6 yards to the Bal47.","(8:50) Tyrod Taylor pass to the middle to Sammy Watkins for 8 yards to the Buf47. Tackled by Shareece Wright.","(8:57) Penalty: Holding on Buffalo (Glenn Gronkowski) -10 yards.","(9:39) LeSean McCoy rush to the left for 8 yards to the Buf49. Tackled by Shareece Wright.","(10:11) LeSean McCoy rush to the right for 16 yards to the Buf41. Tackled by Shareece Wright.","(10:11) Justin Tucker kicks off to the endzone. Touchback.","(10:11) Justin Tucker extra point is good. Penalty: Unnecessary Roughness on Buffalo (Ronald Darby) 15 yards.","(10:22) Joe Flacco pass to the middle to Mike Wallace for 66 yards for a TOUCHDOWN.","(10:57) Joe Flacco pass to the left to Steve Smith Sr. for 4 yards to the Bal34. Tackled by Preston Brown.","(11:32) Terrance West rush to the right for 10 yards to the Bal30. Tackled by Lerentee McCray.","(11:32) Penalty: False Start on Baltimore (Marshal Yanda) -5 yards.","(11:32) Baltimore Ravens timeout.","(12:19) Justin Forsett rush up the middle for 1 yard to the Bal25. Tackled by Jerel Worthy and Lorenzo Alexander.","(12:54) Justin Forsett rush to the right for 9 yards to the Bal24. Tackled by Kyle Williams.","(12:59) Joe Flacco incomplete pass to the middle intended for Kyle Juszczyk.","(13:07) Colton Schmidt punts for 49 yards to Bal15. No return.","(13:42) Tyrod Taylor sacked at Buf36 for a loss of 4 yards by Timmy Jernigan.","(14:27) Tyrod Taylor pass to the right to LeSean McCoy for 4 yards to the Buf40. Tackled by Anthony Levine Sr..","(14:32) Tyrod Taylor incomplete pass to the right intended for Greg Salas.","(15:00) Tyrod Taylor pass to the left to Sammy Watkins for 5 yards to the Buf36.","(0:04) LeSean McCoy rush to the left for 5 yards to the Buf31. Tackled by Zachary Orr.","(0:35) Tyrod Taylor pass to the right to LeSean McCoy for 1 yard to the Buf26. Tackled by Shareece Wright.","(0:35) Justin Tucker kicks off to the endzone. Touchback.","(0:41) Justin Tucker 50 yard field goal attempt is GOOD. Holder: Sam Koch.","(1:18) Kyle Juszczyk rush to the right for 2 yards to the Buf32. Tackled by Jerry Hughes and Zach Brown.","(1:22) Joe Flacco incomplete pass to the left intended for Breshad Perriman defensed by Stephon Gilmore.","(1:48) Penalty: Holding on Baltimore (Marshal Yanda) -10 yards.","(2:25) Terrance West rush to the left for 3 yards to the Buf24. Tackled by Corey Graham.","(2:58) Joe Flacco pass to the right to Kamar Aiken for 16 yards to the Buf27. Tackled by Ronald Darby.","(3:38) Terrance West rush to the left for 6 yards to the Buf43. Tackled by Zach Brown and Lerentee McCray.","(4:15) Joe Flacco pass to the right to Crockett Gillmore for 5 yards to the Buf49. Tackled by Preston Brown.","(4:54) Joe Flacco pass to the left to Breshad Perriman for 35 yards to the Bal46. Tackled by Stephon Gilmore.","(5:22) Terrance West rush to the left for 2 yards to the Bal11. Tackled by Preston Brown and Stephon Gilmore.","(5:30) Colton Schmidt punts for 39 yards to Bal9. No return.","(5:30) Penalty: False Start on Buffalo (Garrison Sanborn) -5 yards.","(5:35) Tyrod Taylor incomplete pass to the left intended for Charles Clay defensed by Eric Weddle.","(6:19) LeSean McCoy rush to the right for a loss of 1 yard to the Bal43. Tackled by Timmy Jernigan.","(7:00) Tyrod Taylor pass to the right to LeSean McCoy for 5 yards to the Bal42. Tackled by Zachary Orr.","(7:05) Joe Flacco rush up the middle for no gain to the Bal49. FUMBLE, recovered by Buf (Preston Brown). Tackled by Joe Flacco.","(7:11) Joe Flacco incomplete pass to the left.","(7:45) Joe Flacco pass to the left to Mike Wallace for 16 yards to the Bal49. Tackled by Stephon Gilmore.","(8:07) Penalty: False Start on Baltimore (Steve Smith Sr.) -5 yards.","(8:31) Penalty: False Start on Baltimore (Ronnie Stanley) -5 yards.","(9:05) Joe Flacco pass to the right to Steve Smith Sr. for 6 yards to the Bal43. Tackled by Ronald Darby.","(9:33) Joe Flacco pass to the right to Steve Smith Sr. for 3 yards to the Bal37. Tackled by Ronald Darby.","(9:42) Colton Schmidt punts for 50 yards to Bal26. Devin Hester return for 8 yards to Bal34. Tackled by Corey Graham.","(10:15) Tyrod Taylor pass to the left to Mike Gillislee for a loss of 4 yards to the Buf24. Tackled by Shareece Wright.","(11:02) LeSean McCoy rush to the right for a loss of 6 yards to the Buf28. Tackled by Shareece Wright.","(11:44) Tyrod Taylor pass to the middle to LeSean McCoy for 2 yards to the Buf34. Tackled by Zachary Orr and Eric Weddle.","(11:52) Sam Koch punts for 39 yards to Buf32. No return.","(12:05) Penalty: Delay of Game on Baltimore (Joe Flacco) -5 yards.","(12:54) Terrance West rush to the right for no gain to the Bal34. Tackled by Corbin Bryant.","(13:35) Joe Flacco pass to the right to Kyle Juszczyk for 9 yards to the Bal34. Tackled by Ronald Darby.","(14:01) Justin Forsett rush to the left for no gain to the Bal25. Tackled by Corbin Bryant and Preston Brown.","(14:32) Joe Flacco pass to the right to Justin Forsett for 5 yards to the Bal25. Tackled by Jerry Hughes.","(14:57) Justin Forsett rush to the right for 6 yards to the Bal20. Tackled by Duke Williams.","(15:00) Jordan Gay kicks off to the Bal0. Devin Hester return for 14 yards to Bal14. Tackled by Jonathan Meeks."]