["(0:18) Ben Roethlisberger rush up the middle for a loss of 2 yards to the Pit18.","(0:23) Kirk Cousins pass intended for Jamison Crowder INTERCEPTED by James Harrison. No return. Touchback.","(0:26) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(0:50) Kirk Cousins pass to the left to Jamison Crowder for 6 yards to the Pit3. Tackled by Robert Golden and William Gay.","(0:59) Penalty: Pass Interference on Pittsburgh (Ross Cockrell) 46 yards.","(1:26) Kirk Cousins pass to the left to Josh Doctson for 9 yards to the Was45. Tackled by William Gay.","(1:49) Kirk Cousins pass to the right to Jordan Reed for 11 yards to the Was36. Tackled by Lawrence Timmons.","(1:54) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(1:54) Chris Boswell kicks off to the endzone. Touchback.","(1:54) Chris Boswell extra point is good.","(2:00) DeAngelo Williams rush to the left for 6 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:34) DeAngelo Williams rush up the middle for 5 yards to the Was6. Tackled by DeAngelo Hall.","(3:19) Ben Roethlisberger pass to the left to Antonio Brown for 16 yards to the Was11. Tackled by Bashaud Breeland.","(3:19) Washington Redskins timeout.","(3:25) DeAngelo Williams rush to the left for 4 yards to the Was27. Tackled by Mason Foster.","(3:25) Washington Redskins timeout.","(3:32) DeAngelo Williams rush to the left for 1 yard to the Was31. Tackled by Kedric Golston and Will Compton.","(4:17) DeAngelo Williams rush to the left for 13 yards to the Was32. Tackled by Bashaud Breeland.","(4:26) Kirk Cousins rush to the right for 8 yards to the Was45. Tackled by Arthur Moats.","(5:15) Kirk Cousins pass to the left to Jordan Reed for 5 yards to the Was37. Tackled by Jarvis Jones and William Gay.","(5:20) Kirk Cousins incomplete pass to the right intended for Jamison Crowder defensed by Mike Mitchell.","(5:32) Penalty: False Start on Washington (Shawn Lauvao) -5 yards.","(5:32) Kirk Cousins incomplete pass to the right intended for Jordan Reed.","(5:48) Kirk Cousins pass to the right to DeSean Jackson for 12 yards to the Was37.","(5:48) Chris Boswell kicks off to the endzone. Touchback.","(5:48) Chris Boswell extra point is good. Penalty: Offside on Washington (Josh Norman) 5 yards.","(5:55) DeAngelo Williams rush to the left for 15 yards for a TOUCHDOWN.","(6:39) Ben Roethlisberger pass to the left to Antonio Brown for 21 yards to the Was15. Tackled by Bashaud Breeland.","(7:24) Ben Roethlisberger pass to the left to DeAngelo Williams for a loss of 4 yards to the Was36. Tackled by Mason Foster.","(7:53) DeAngelo Williams rush to the right for 5 yards to the Was22. Tackled by DeAngelo Hall and Preston Smith. Penalty: Holding on Pittsburgh (Jesse James) -10 yards.","(8:28) Ben Roethlisberger pass to the right to Sammie Coates for 14 yards to the Was27. Tackled by Su'a Cravens and Josh Norman.","(8:33) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown defensed by Josh Norman.","(9:09) Fitzgerald Toussaint rush to the right for a loss of 3 yards to the Was41. Tackled by Mason Foster.","(9:46) DeAngelo Williams rush up the middle for 3 yards to the Was38. Tackled by Mason Foster and Ziggy Hood.","(10:21) DeAngelo Williams rush to the right for 8 yards to the Was41. Tackled by David Bruton Jr..","(10:57) Ben Roethlisberger pass to the middle to Jesse James for 6 yards to the Was49. Tackled by Dashaun Phillips and Mason Foster.","(11:33) DeAngelo Williams rush up the middle for 4 yards to the Pit45. Tackled by Mason Foster and Preston Smith.","(12:08) DeAngelo Williams rush to the right for 9 yards to the Pit41. Tackled by Mason Foster.","(12:53) Ben Roethlisberger pass to the middle to DeAngelo Williams for 5 yards to the Pit32. Tackled by Will Compton and David Bruton Jr..","(13:01) Dustin Hopkins kicks off to the Pit9. Fitzgerald Toussaint return for 18 yards to Pit27. Tackled by Terence Garvin and Houston Bates.","(13:01) Dustin Hopkins extra point is good.","(13:01) Penalty: Delay of Game on Washington (Dustin Hopkins) -5 yards.","(13:05) Chris Thompson rush to the right for 1 yard for a TOUCHDOWN.","(13:36) Kirk Cousins pass to the right to Vernon Davis for 20 yards to the Pit1. Tackled by L.J. Fort.","(14:03) Kirk Cousins pass to the left to Jamison Crowder for 16 yards to the Pit21. Tackled by Mike Mitchell.","(14:20) Kirk Cousins pass to the right to Pierre Garcon for 19 yards to the Pit37.","(14:41) Kirk Cousins pass to the middle to Jordan Reed for 5 yards to the Was44. Tackled by Ryan Shazier and Lawrence Timmons.","(15:00) Chris Thompson rush to the left for 7 yards to the Was39. Tackled by Mike Mitchell.","(0:19) Kirk Cousins pass to the middle to Matt Jones for 9 yards to the Was32. Tackled by Ryan Shazier.","(0:31) Jordan Berry punts for 61 yards to Was6. Jamison Crowder return for 17 yards to Was23. Tackled by Vince Williams and Jordan Dangerfield.","(0:36) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown.","(1:21) DeAngelo Williams rush up the middle for 4 yards to the Pit33. Tackled by Kendall Reyes.","(2:01) DeAngelo Williams rush to the left for 4 yards to the Pit29. Tackled by David Bruton Jr. and Kendall Reyes.","(2:01) Dustin Hopkins kicks off to the endzone. Touchback.","(2:04) Dustin Hopkins 34 yard field goal attempt is GOOD. Holder: Tress Way.","(2:12) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(2:53) Kirk Cousins pass to the left to Pierre Garcon for 8 yards to the Pit16. Tackled by Sean Davis and William Gay.","(3:30) Kirk Cousins pass to the right to Pierre Garcon for 6 yards to the Pit24. Tackled by Sean Davis.","(3:49) Penalty: Holding on Washington (Trent Williams) -10 yards.","(4:18) Kirk Cousins pass to the right to Pierre Garcon for 10 yards to the Pit20. Tackled by Ross Cockrell.","(4:56) Kirk Cousins pass to the middle to Chris Thompson for 11 yards to the Pit30. Tackled by Ryan Shazier.","(5:13) Penalty: False Start on Washington (Kory Lichtensteiger) -5 yards.","(5:39) Kirk Cousins pass to the left to DeSean Jackson for 11 yards to the Pit36. Tackled by William Gay.","(6:11) Kirk Cousins pass to the left to DeSean Jackson for 9 yards to the Pit47. Tackled by Jarvis Jones.","(6:53) Matt Jones rush to the left for 12 yards to the Was44. Tackled by Robert Golden and Lawrence Timmons.","(7:01) Chris Boswell kicks off to the Was3. Will Blackmon return for 29 yards to Was32. Tackled by Shamarko Thomas and Anthony Chickillo.","(7:01) Chris Boswell extra point is good.","(7:01) Ben Roethlisberger pass to the left to Antonio Brown for 26 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Pittsburgh (Antonio Brown) -15 yards.","(7:14) Ben Roethlisberger incomplete pass to the left intended for DeAngelo Williams.","(7:52) Ben Roethlisberger pass to the left to DeAngelo Williams for 7 yards to the Was26. Tackled by Mason Foster.","(8:26)  FUMBLE, recovered by Pit (Ben Roethlisberger). Ben Roethlisberger pass to the left to Sammie Coates for 42 yards to the Was33. Tackled by DeAngelo Hall.","(9:05) Ben Roethlisberger pass to the left to Antonio Brown for no gain to the Pit25. Tackled by Bashaud Breeland.","(9:22) Kirk Cousins pass intended for Jordan Reed INTERCEPTED by Ryan Shazier. No return. Tackled by Kory Lichtensteiger. Penalty: Illegal Block on Pittsburgh (Mike Mitchell) -10 yards.","(10:07) Kirk Cousins pass to the right to Jamison Crowder for 7 yards to the Was35. Tackled by Ryan Shazier. FUMBLE, recovered by Was (Pierre Garcon) and advanced for 7 yards.","(10:40) Kirk Cousins pass to the middle to Jamison Crowder for 9 yards to the Was28. Tackled by James Harrison and Lawrence Timmons.","(11:18) Matt Jones rush to the left for a loss of 1 yard to the Was19. Tackled by James Harrison and William Gay.","(11:18) Penalty: False Start on Washington (Matt Jones) -5 yards.","(11:18) Chris Boswell kicks off to the endzone. Touchback.","(11:23) Chris Boswell 46 yard field goal attempt is GOOD. Holder: Jordan Berry.","(11:29) Ben Roethlisberger incomplete pass to the left intended for Jesse James.","(12:17) Fitzgerald Toussaint rush to the right for 7 yards to the Was28. Tackled by Will Compton.","(13:01) DeAngelo Williams rush to the right for no gain to the Was35. Tackled by David Bruton Jr..","(13:40) DeAngelo Williams rush to the left for 17 yards to the Was35. Tackled by Will Compton.","(14:15) Ben Roethlisberger pass to the left to Antonio Brown for 16 yards to the Pit48. Tackled by Bashaud Breeland.","(14:22) Ben Roethlisberger incomplete pass to the middle intended for DeAngelo Williams.","(15:00) DeAngelo Williams rush to the left for 7 yards to the Pit32. Tackled by Bashaud Breeland and Will Compton.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback.","(0:27) Chris Thompson rush to the right for 9 yards to the Was34. Tackled by Robert Golden and Mike Mitchell.","(0:27) Chris Boswell kicks off to the endzone. Touchback.","(0:27) Chris Boswell extra point is good.","(0:31) Ben Roethlisberger pass to the left to Eli Rogers for 3 yards for a TOUCHDOWN.","(0:31) Pittsburgh Steelers timeout.","(0:37) Ben Roethlisberger pass to the middle to Jesse James for 6 yards to the Was3. Tackled by Will Compton and DeAngelo Hall.","(0:42) Ben Roethlisberger incomplete pass to the left intended for Jesse James defensed by David Bruton Jr..","(1:11) Ben Roethlisberger pass to the left to Eli Rogers for 6 yards to the Was9. Tackled by Su'a Cravens.","(1:11) Pittsburgh Steelers timeout.","(1:24) Ben Roethlisberger pass to the left to Eli Rogers for 19 yards to the Was15. Tackled by Bashaud Breeland.","(1:55) Ben Roethlisberger pass to the right to DeAngelo Williams for 4 yards to the Was34. Tackled by Su'a Cravens and Josh Norman.","(2:00) Ben Roethlisberger incomplete pass to the right intended for DeAngelo Williams.","(2:00) Two Minute Warning.","(2:30) Ben Roethlisberger pass to the middle to Eli Rogers for 5 yards to the Was38. Tackled by Will Compton.","(3:09) DeAngelo Williams rush to the right for 3 yards to the Was43. Tackled by David Bruton Jr..","(3:56) DeAngelo Williams rush to the right for no gain to the Was46. Tackled by Preston Smith and Mason Foster.","(4:31) DeAngelo Williams rush to the left for 9 yards to the Was46. Tackled by Ziggy Hood and Bashaud Breeland.","(5:08) DeAngelo Williams rush up the middle for 3 yards to the Pit45. Tackled by DeAngelo Hall and Mason Foster.","(5:49) Ben Roethlisberger pass to the middle to Jesse James for 4 yards to the Pit42. Tackled by DeAngelo Hall.","(6:19) DeAngelo Williams rush to the left for 5 yards to the Pit38. Tackled by Mason Foster.","(6:27) Kirk Cousins pass to the middle to Chris Thompson for 5 yards to the Pit33. Tackled by Robert Golden.","(7:16) Kirk Cousins pass to the left to Jordan Reed for 4 yards to the Pit38. Tackled by Lawrence Timmons.","(7:54) Chris Thompson rush to the right for 6 yards to the Pit42. Tackled by Ryan Shazier.","(8:32) Kirk Cousins pass to the right to Jamison Crowder for 9 yards to the Pit48. Tackled by Lawrence Timmons and Jarvis Jones.","(8:53) Penalty: False Start on Washington (Trent Williams) -5 yards.","(9:17) Penalty: Holding on Washington (Vernon Davis) -10 yards.","(9:17) Washington Redskins timeout.","(10:10) Kirk Cousins pass to the right to DeSean Jackson for 33 yards to the Pit42. Tackled by Mike Mitchell.","(10:10) Chris Boswell kicks off to the endzone. Touchback.","(10:10) Chris Boswell extra point is good.","(10:18) Ben Roethlisberger pass to the left to Antonio Brown for 29 yards for a TOUCHDOWN.","(10:56) Ben Roethlisberger pass to the middle to Jesse James for 7 yards to the Was29. Tackled by David Bruton Jr. and Will Compton.","(11:01) Washington Redskins timeout.","(11:01) Ben Roethlisberger incomplete pass to the right intended for Antonio Brown defensed by Josh Norman.","(11:39) Fitzgerald Toussaint rush to the right for 2 yards to the Was36. Tackled by Will Compton and David Bruton Jr..","(12:20) Ben Roethlisberger pass to the left to Jesse James for 8 yards to the Was38. Tackled by Josh Norman and Bashaud Breeland.","(13:01) DeAngelo Williams rush to the left for 3 yards to the Was46. Tackled by Will Compton and Chris Baker.","(13:40) DeAngelo Williams rush to the right for 3 yards to the Was49. Tackled by Kedric Golston and Chris Baker.","(14:18) DeAngelo Williams rush to the left for 8 yards to the Pit48. Tackled by Josh Norman and Mason Foster.","(15:00) Ben Roethlisberger pass to the right to Antonio Brown for 13 yards to the Pit40. Tackled by Dashaun Phillips.","(0:31) Ben Roethlisberger pass to the left to DeAngelo Williams for 14 yards to the Pit27. Tackled by Will Compton.","(1:08) Ben Roethlisberger sacked at Pit15 for a loss of 10 yards by Ryan Kerrigan. FUMBLE, recovered by Pit (David DeCastro) and advanced for a loss of 2 yards.","(1:08) Dustin Hopkins kicks off to the endzone. Touchback.","(1:13) Dustin Hopkins 40 yard field goal attempt is GOOD. Holder: Tress Way.","(2:01) Kirk Cousins pass to the left to Pierre Garcon for 2 yards to the Pit23. Tackled by Robert Golden.","(2:06) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(2:29) Penalty: False Start on Washington (Kory Lichtensteiger) -5 yards.","(3:08) Kirk Cousins pass to the right to Pierre Garcon for 6 yards to the Pit20. Tackled by Robert Golden and Ross Cockrell.","(3:46) Kirk Cousins pass to the left to Jamison Crowder for 11 yards to the Pit26. Tackled by Anthony Chickillo.","(3:56) Ben Roethlisberger pass intended for Eli Rogers INTERCEPTED by Bashaud Breeland and returned for 26 yards. Tackled by DeAngelo Williams.","(4:00) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates.","(4:43) Ben Roethlisberger pass to the left to Eli Rogers for 20 yards to the Was46. Tackled by Josh Norman.","(5:22) DeAngelo Williams rush up the middle for 4 yards to the Pit34. Tackled by Chris Baker and David Bruton Jr..","(5:56) Ben Roethlisberger pass to the left to Antonio Brown for 5 yards to the Pit30. Tackled by Mason Foster.","(5:56) Dustin Hopkins kicks off to the endzone. Touchback.","(6:01) Dustin Hopkins 31 yard field goal attempt is GOOD. Holder: Tress Way.","(6:05) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(6:11) Kirk Cousins incomplete pass to the left intended for Jordan Reed defensed by Ryan Shazier.","(6:52) Matt Jones rush to the left for 4 yards to the Pit13. Tackled by Lawrence Timmons.","(7:33) Kirk Cousins pass to the right to DeSean Jackson for 6 yards to the Pit17. Tackled by Ross Cockrell.","(7:36) Kirk Cousins incomplete pass to the right intended for DeSean Jackson defensed by Arthur Moats.","(8:18) Matt Jones rush to the right for 8 yards to the Pit23. Tackled by Jarvis Jones and Sean Davis.","(8:53) Kirk Cousins pass to the left to DeSean Jackson for 31 yards to the Pit31. Tackled by Mike Mitchell.","(9:20) Matt Jones rush to the right for 5 yards to the Was38. Tackled by Jarvis Jones.","(9:30) Jordan Berry punts for 46 yards to Was33. No return.","(10:09) Ben Roethlisberger pass to the right to DeAngelo Williams for 2 yards to the Pit21. Tackled by Su'a Cravens and Will Compton.","(10:44) Ben Roethlisberger pass to the right to Eli Rogers for 6 yards to the Pit19. Tackled by Josh Norman and Will Compton.","(11:16) DeAngelo Williams rush to the left for no gain to the Pit13. Tackled by Mason Foster.","(11:25) Tress Way punts for 27 yards to Pit13. No return.","(12:05) Kirk Cousins pass to the right to Jordan Reed for 13 yards to the Pit40. Tackled by Cameron Heyward.","(12:46) Matt Jones rush to the left for a loss of 4 yards to the Was47. Tackled by Stephon Tuitt and Cameron Heyward.","(12:54) Kirk Cousins incomplete pass to the right intended for Ryan Grant.","(13:40) Kirk Cousins pass to the right to Jordan Reed for 14 yards to the Pit49. Tackled by Sean Davis and Mike Mitchell.","(13:47) Kirk Cousins incomplete pass to the middle intended for Jordan Reed defensed by Lawrence Timmons.","(14:28) Matt Jones rush up the middle for no gain to the Was37. Tackled by Ryan Shazier and Jarvis Jones.","(15:00) Kirk Cousins pass to the right to Jordan Reed for 12 yards to the Was37. Tackled by Lawrence Timmons and Ross Cockrell.","(15:00) Chris Boswell kicks off to the endzone. Touchback."]