["(0:04) Sam Martin kicks off to the Ind0. T.Y. Hilton - no return. Penalty: Illegal Forward Pass on Indianapolis (T.Y. Hilton) 0 yards. Safety.","(0:08) Matt Prater 43 yard field goal attempt is GOOD. Holder: Sam Martin.","(0:12) Matthew Stafford incomplete pass to the left.","(0:12) Detroit Lions timeout.","(0:21) Matthew Stafford pass to the left to Marvin Jones Jr. for 22 yards to the Ind25. Tackled by Antonio Cromartie.","(0:21) Detroit Lions timeout.","(0:28) Matthew Stafford pass to the left to Eric Ebron for 9 yards to the Ind47. Tackled by Sio Moore.","(0:28) Detroit Lions timeout.","(0:37) Matthew Stafford pass to the middle to Theo Riddick for 19 yards to the Det44. Tackled by Sio Moore.","(0:37) Pat McAfee kicks off to the endzone. Touchback.","(0:37) Adam Vinatieri extra point is good. Penalty: Leaping on Detroit (Devin Taylor) 15 yards.","(0:43) Andrew Luck pass to the middle to Jack Doyle for 6 yards for a TOUCHDOWN.","(1:14) Andrew Luck pass to the right to Donte Moncrief for 6 yards to the Det6. Tackled by Nevin Lawson.","(1:15) Indianapolis Colts timeout.","(1:23) Andrew Luck pass to the left to T.Y. Hilton for no gain to the Det12. Tackled by Darius Slay.","(2:00) Frank Gore rush up the middle for 9 yards to the Det12. Tackled by Nevin Lawson and Tahir Whitehead.","(2:00) Two Minute Warning.","(2:18) Andrew Luck pass to the left to Phillip Dorsett for 5 yards to the Det21. Tackled by Darius Slay.","(3:04) Andrew Luck pass to the right to Phillip Dorsett for 33 yards to the Det26. Tackled by Quandre Diggs.","(3:43) Frank Gore rush to the right for 7 yards to the Ind41. Tackled by Devin Taylor.","(4:04) Andrew Luck pass to the right to T.Y. Hilton for 9 yards to the Ind34. Tackled by Quandre Diggs.","(4:04) Sam Martin kicks off to the endzone. Touchback.","(4:04) Matt Prater extra point is NO GOOD.","(4:11) Matthew Stafford pass to the right to Theo Riddick for 13 yards for a TOUCHDOWN.","(4:17) Matthew Stafford pass to the right to Eric Ebron for 13 yards to the Ind13. Tackled by Winston Guy.","(5:00) Matthew Stafford pass to the left to Anquan Boldin for 14 yards to the Ind26. Tackled by Mike Adams.","(5:05) Penalty: Holding on Detroit (Travis Swanson) -10 yards.","(5:49) Theo Riddick rush to the right for 7 yards to the Ind30. Tackled by Rashaan Melvin.","(6:36) Theo Riddick rush up the middle for 12 yards to the Ind37. Tackled by Mike Adams.","(7:20) Matthew Stafford pass to the left to Ameer Abdullah for 14 yards to the Ind49. Tackled by Sio Moore.","(7:46) Matthew Stafford pass to the right to Golden Tate for 10 yards to the Det37. Tackled by Rashaan Melvin.","(8:19) Ameer Abdullah rush up the middle for 2 yards to the Det27. Tackled by Zach Kerr and D'Qwell Jackson.","(8:19) Pat McAfee kicks off to the endzone. Touchback.","(8:19) Adam Vinatieri extra point is good.","(8:25) Andrew Luck pass to the right to Jack Doyle for 16 yards for a TOUCHDOWN.","(8:52) Andrew Luck rush to the right for 9 yards to the Det16. Tackled by Tahir Whitehead.","(9:34) Frank Gore rush to the right for 4 yards to the Det25. Tackled by Haloti Ngata and Kerry Hyder.","(10:21) Andrew Luck pass to the left to T.Y. Hilton for 32 yards to the Det29. Tackled by Tavon Wilson.","(11:07) Andrew Luck pass to the middle to Jack Doyle for 13 yards to the Ind39. Tackled by Quandre Diggs.","(11:11) Andrew Luck incomplete pass to the left intended for Frank Gore defensed by A'Shawn Robinson.","(11:53) Andrew Luck pass to the right to Josh Ferguson for 12 yards to the Ind26. Tackled by Tyrunn Walker.","(12:32) Frank Gore rush to the right for 8 yards to the Ind14. Tackled by Nevin Lawson.","(12:38) Andrew Luck incomplete pass to the right intended for T.Y. Hilton defensed by Kyle Van Noy.","(12:48) Sam Martin punts for 63 yards to Ind6. No return.","(12:54) Matthew Stafford incomplete pass to the middle intended for Marvin Jones Jr. defensed by Rashaan Melvin.","(13:33) Matthew Stafford pass to the right to Cole Wick for 5 yards to the Det31. Tackled by Sio Moore.","(14:17) Ameer Abdullah rush up the middle for 1 yard to the Det26. Tackled by Akeem Ayers.","(14:17) Pat McAfee kicks off to the endzone. Touchback.","(14:22) Adam Vinatieri 40 yard field goal attempt is GOOD. Holder: Pat McAfee.","(14:27) Andrew Luck incomplete pass to the middle intended for Dwayne Allen.","(14:27) Indianapolis Colts timeout.","(14:50) Andrew Luck pass to the left to Frank Gore for 4 yards to the Det22. Tackled by Tavon Wilson.","(14:55) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(15:00) Andrew Luck incomplete pass to the right. Penalty: Taunting on Detroit (DeAndre Levy) 15 yards.","(0:02) Frank Gore rush up the middle for 1 yard to the Det41. Tackled by Tavon Wilson.","(0:40) Andrew Luck pass to the left to Frank Gore for 8 yards to the Det42. Tackled by DeAndre Levy and Quandre Diggs.","(1:00) Andrew Luck rush to the right for 11 yards to the Ind45. Tackled by Tavon Wilson. Penalty: Holding on Detroit (Quandre Diggs) 5 yards.","(1:39) Andrew Luck pass to the right to Donte Moncrief for 5 yards to the Ind34. Tackled by Nevin Lawson.","(2:20) Frank Gore rush up the middle for 4 yards to the Ind29. Tackled by Tyrunn Walker.","(2:20) Sam Martin kicks off to the endzone. Touchback.","(2:20) Matt Prater extra point is good.","(2:26) Matthew Stafford pass to the left to Ameer Abdullah for 11 yards for a TOUCHDOWN.","(2:54) Matthew Stafford pass to the left to Golden Tate for 6 yards to the Ind11. Tackled by Darryl Morris.","(3:29) Matthew Stafford pass to the right to Ameer Abdullah for 13 yards to the Ind17. Tackled by Winston Guy.","(4:02) Matthew Stafford pass to the right to Golden Tate for 2 yards to the Ind30. Tackled by Sio Moore.","(4:47) Ameer Abdullah rush to the left for a loss of 1 yard to the Ind32. Tackled by Sio Moore.","(5:19) Matthew Stafford pass to the left to Ameer Abdullah for 18 yards to the Ind46. Tackled by Mike Adams. Penalty: Face Mask on Indianapolis (Erik Walden) 15 yards.","(5:56) Ameer Abdullah rush to the left for 7 yards to the Det36. Tackled by David Parry.","(6:05) Pat McAfee punts for 48 yards to Det14. No return. Penalty: Illegal Return OOB on Indianapolis (Matthias Farley) 15 yards.","(6:12) Andrew Luck incomplete pass to the left intended for Phillip Dorsett defensed by Glover Quin.","(6:17) Andrew Luck incomplete pass to the middle intended for T.Y. Hilton defensed by Haloti Ngata.","(6:24) Andrew Luck incomplete pass to the right intended for Donte Moncrief defensed by Tahir Whitehead.","(6:37) Sam Martin punts for 59 yards to Ind29. Quan Bray return for 9 yards to Ind38. Tackled by Antwione Williams.","(7:11) Matthew Stafford sacked at Det12 for a loss of 8 yards by Erik Walden.","(7:53) Theo Riddick rush up the middle for 5 yards to the Det20. Tackled by Erik Walden.","(8:35) Theo Riddick rush up the middle for a loss of 4 yards to the Det15. Tackled by Hassan Ridgeway and Sio Moore.","(8:41) Pat McAfee kicks off to the Det-3. Andre Roberts return for 22 yards to Det19. Tackled by Erik Swoope.","(8:41) Andrew Luck 2 pt conversion pass to Dwayne Allen is GOOD.","(8:41) Penalty: Encroachment on Detroit (Khyri Thornton) 1 yards.","(8:48) Andrew Luck pass to the right to Dwayne Allen for 19 yards for a TOUCHDOWN.","(9:33) Andrew Luck pass to the left to Robert Turbin for 12 yards to the Det19. Tackled by Wallace Gilberry.","(9:38) Andrew Luck incomplete pass to the right.","(9:44) Andrew Luck incomplete pass to the right intended for Jack Doyle.","(10:33) Andrew Luck pass to the right to Phillip Dorsett for 51 yards to the Det31. Tackled by Darius Slay.","(10:40) Andrew Luck incomplete pass to the left intended for Frank Gore.","(10:47) Penalty: Holding on Indianapolis (Anthony Castonzo) -10 yards.","(11:26) Robert Turbin rush up the middle for 4 yards to the Ind28. Tackled by Tahir Whitehead.","(12:07) Frank Gore rush up the middle for 3 yards to the Ind24. Tackled by Devin Taylor.","(12:41) Frank Gore rush up the middle for 6 yards to the Ind21. Tackled by Devin Taylor.","(12:48) Sam Martin punts for 56 yards to Ind15. No return.","(13:22) Matthew Stafford pass to the right to Golden Tate for 3 yards to the Det29. Tackled by Sio Moore.","(14:01) Matthew Stafford pass to the left to Marvin Jones Jr. for 4 yards to the Det26. Tackled by Sio Moore.","(14:24) Penalty: False Start on Detroit (Taylor Decker) -4 yards.","(15:00) Matthew Stafford pass to the left to Ameer Abdullah for 1 yard to the Det26. Tackled by Sio Moore.","(15:00) Pat McAfee kicks off to the endzone. Touchback.","(0:05) Matthew Stafford rush up the middle for a loss of 1 yard to the Det24.","(0:05) Pat McAfee kicks off to the endzone. Touchback.","(0:05) Adam Vinatieri extra point is good.","(0:05) Penalty: False Start on Indianapolis (Jonotthan Harrison) -5 yards.","(0:10) Andrew Luck pass to the right to Donte Moncrief for 2 yards for a TOUCHDOWN.","(0:15) Andrew Luck incomplete pass to the right intended for Phillip Dorsett.","(0:33) Andrew Luck pass to the left to T.Y. Hilton for 8 yards to the Det2. Tackled by Quandre Diggs.","(0:37) Andrew Luck pass to the right to Phillip Dorsett for 5 yards to the Det10.","(1:00) Josh Ferguson rush to the right for a loss of 2 yards to the Det15. Tackled by Ezekiel Ansah.","(1:21) Andrew Luck pass to the middle to Dwayne Allen for 16 yards to the Det13. Tackled by Rafael Bush and Tahir Whitehead.","(1:28) Andrew Luck pass to the left to Josh Ferguson for 14 yards to the Det29. Tackled by Tahir Whitehead.","(1:37) Andrew Luck pass to the right to Donte Moncrief for 32 yards to the Det43. Tackled by Glover Quin.","(1:37) Sam Martin kicks off to the endzone. Touchback.","(1:37) Matt Prater extra point is good.","(1:43) Matthew Stafford pass to the left to Eric Ebron for 6 yards for a TOUCHDOWN.","(1:46) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(1:46) Indianapolis Colts timeout.","(2:00) Ameer Abdullah rush to the left for 6 yards to the Ind6. Tackled by D'Qwell Jackson and Mike Adams.","(2:00) Two Minute Warning.","(2:43) Matthew Stafford pass to the right to Marvin Jones Jr. for 32 yards to the Ind12. Tackled by Patrick Robinson.","(3:20) Matthew Stafford pass to the right to Eric Ebron for 5 yards to the Ind44. Tackled by Patrick Robinson.","(4:01) Ameer Abdullah rush to the right for 10 yards to the Ind49. Tackled by Patrick Robinson.","(4:27) Ameer Abdullah rush to the right for 9 yards to the Det41. Tackled by Robert Mathis.","(4:50) Ameer Abdullah rush up the middle for 7 yards to the Det32. Tackled by Mike Adams.","(4:50) Pat McAfee kicks off to the endzone. Touchback.","(4:57) Adam Vinatieri 50 yard field goal attempt is GOOD. Holder: Pat McAfee.","(5:44) Andrew Luck pass to the right to T.Y. Hilton for 17 yards to the Det32. Tackled by Quandre Diggs.","(5:47) Andrew Luck incomplete pass to the middle intended for T.Y. Hilton.","(6:30) Andrew Luck sacked at Det49 for a loss of 11 yards by Kerry Hyder.","(7:09) Andrew Luck pass to the left to Dwayne Allen for 15 yards to the Det38. Tackled by Rafael Bush and Glover Quin.","(7:54) Andrew Luck pass to the left to Dwayne Allen for 3 yards to the Ind47. Tackled by Tyrunn Walker and Devin Taylor.","(8:32) Frank Gore rush to the left for 4 yards to the Ind44. Tackled by Ezekiel Ansah and Devin Taylor.","(9:06) Andrew Luck pass to the right to Donte Moncrief for 19 yards to the Ind40. Tackled by Darius Slay.","(9:11) Sam Martin kicks off to the Ind-4. Quan Bray return for 25 yards to Ind21. Tackled by Adairius Barnes.","(9:11) Matt Prater extra point is good.","(9:16) Dwayne Washington rush up the middle for 1 yard for a TOUCHDOWN.","(9:59) Dwayne Washington rush up the middle for no gain to the Ind1. Tackled by Zach Kerr and Winston Guy.","(9:59) Indianapolis Colts timeout.","(10:25) Matthew Stafford pass to the right to Theo Riddick for 10 yards to the Ind1. Tackled by T.J. Green.","(11:07) Golden Tate rush to the right for 2 yards to the Ind11. Tackled by Mike Adams and Trent Cole.","(11:36) Indianapolis Colts timeout.","(11:36) Matthew Stafford pass to the right to Eric Ebron for 13 yards to the Ind13. Tackled by Antonio Morrison.","(11:41) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(11:48) Matthew Stafford incomplete pass to the right.","(12:14) Matthew Stafford pass to the right to Anquan Boldin for 3 yards to the Ind26. Tackled by Darryl Morris.","(12:55) Matthew Stafford pass to the left to Andre Roberts for 8 yards to the Ind29. Tackled by Antonio Cromartie.","(13:03) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr. defensed by Antonio Cromartie.","(13:45) Matthew Stafford pass to the left to Marvin Jones Jr. for 27 yards to the Ind37. Tackled by Mike Adams.","(14:26) Theo Riddick rush up the middle for 5 yards to the Det36. Tackled by Josh McNary and T.J. Green.","(15:00) Matthew Stafford rush to the left for 6 yards to the Det31. Tackled by Darryl Morris.","(0:37) Matthew Stafford pass to the left to Theo Riddick for 8 yards to the Det25. Tackled by Josh McNary.","(1:11) Theo Riddick rush to the left for a loss of 1 yard to the Det17. Tackled by Trent Cole.","(1:19) Pat McAfee punts for 47 yards to Det28. No return. Penalty: Holding on Detroit (Johnson Bademosi) -10 yards.","(1:23) Andrew Luck incomplete pass to the left intended for T.Y. Hilton defensed by DeAndre Levy.","(1:27) Andrew Luck incomplete pass to the right intended for Dwayne Allen defensed by Tahir Whitehead.","(1:49) Frank Gore rush up the middle for 2 yards to the Ind25. Tackled by Tahir Whitehead.","(2:00) Sam Martin punts for 57 yards to Ind19. Quan Bray return for 4 yards to Ind23. Tackled by Don Carey and Johnson Bademosi.","(2:32) Matthew Stafford pass to the right to Golden Tate for 3 yards to the Det24. Tackled by Darryl Morris.","(2:38) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr. defensed by Patrick Robinson.","(3:05) Ameer Abdullah rush to the left for 1 yard to the Det21. Tackled by Kendall Langford and Sio Moore.","(3:18) Pat McAfee punts for 52 yards to Det21. Andre Roberts return for a loss of 1 yard to Det20. Tackled by Darryl Morris.","(3:22) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(4:04) Frank Gore rush up the middle for 2 yards to the Ind27. Tackled by Tahir Whitehead and Khyri Thornton.","(4:43) Andrew Luck pass to the right to Donte Moncrief for no gain to the Ind25. Tackled by DeAndre Levy.","(4:43) Sam Martin kicks off to the endzone. Touchback.","(4:43) Matt Prater extra point is good.","(4:51) Theo Riddick rush up the middle for 21 yards for a TOUCHDOWN.","(5:31) Matthew Stafford pass to the left to Theo Riddick for 13 yards to the Ind21. Tackled by Sio Moore.","(6:21) Ameer Abdullah rush to the right for 13 yards to the Ind34. Tackled by Darryl Morris.","(6:26) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(7:10) Matthew Stafford pass to the right to Golden Tate for 6 yards to the Ind47. Tackled by Patrick Robinson.","(7:43) Ameer Abdullah rush to the right for 4 yards to the Det47. Tackled by Erik Walden and Sio Moore.","(8:02) Matthew Stafford pass to the middle to Anquan Boldin for 18 yards to the Ind47. Tackled by Mike Adams. Penalty: Holding on Detroit (Golden Tate) -10 yards.","(8:28) Ameer Abdullah rush up the middle for 4 yards to the Det35. Tackled by Robert Mathis.","(9:06) Matthew Stafford pass to the right to Golden Tate for 11 yards to the Det31. Tackled by Patrick Robinson and T.J. Green.","(9:16) Pat McAfee punts for 48 yards to Det0. Touchback.","(9:55) Andrew Luck pass to the middle to Robert Turbin for 3 yards to the Det48. Tackled by Haloti Ngata.","(10:22) Andrew Luck pass to the left to Frank Gore for 1 yard to the Ind49. Tackled by Rafael Bush.","(11:07) Andrew Luck sacked at Ind48 for a loss of 6 yards by Kerry Hyder.","(11:51) Andrew Luck pass to the middle to T.Y. Hilton for 13 yards to the Det46. Tackled by Glover Quin.","(12:34) Frank Gore rush up the middle for 2 yards to the Ind41. Tackled by Tahir Whitehead.","(12:57) Frank Gore rush to the right for 4 yards to the Ind39. Tackled by DeAndre Levy and Tyrunn Walker.","(13:46) Andrew Luck rush to the left for 1 yard to the Ind35. Tackled by DeAndre Levy and Tahir Whitehead.","(14:29) Frank Gore rush to the right for 3 yards to the Ind34. Tackled by Devin Taylor.","(15:00) Andrew Luck pass to the middle to Frank Gore for 6 yards to the Ind31. Tackled by Tahir Whitehead.","(15:00) Sam Martin kicks off to the endzone. Touchback."]