["(0:27) Shaun Hill rush up the middle for a loss of 1 yard to the Min49.","(0:28) Ryan Succop onside kickoff to the Ten50. Onside kick recovered by receiving team by Kyle Rudolph.","(0:28) Marcus Mariota 2 pt conversion pass is NO GOOD - intended for DeMarco Murray.","(0:32) Marcus Mariota pass to the left to DeMarco Murray for 4 yards for a TOUCHDOWN.","(0:37) Marcus Mariota incomplete pass to the left intended for Harry Douglas.","(0:56) Marcus Mariota pass to the left to Tajae Sharpe for 3 yards to the Min4. Tackled by Trae Waynes.","(1:16) Marcus Mariota pass to the right to Rishard Matthews for 9 yards to the Min7. Tackled by Harrison Smith and Eric Kendricks.","(1:27) Penalty: Roughing Passer on Minnesota (Everson Griffen) 15 yards.","(1:49) Marcus Mariota pass to the right to Andre Johnson for 7 yards to the Min31. Tackled by Terence Newman.","(1:49) Tennessee Titans timeout.","(1:58) Marcus Mariota pass to the middle to Delanie Walker for 26 yards to the Min38. Tackled by Harrison Smith.","(1:58) Two Minute Warning.","(2:04) Marcus Mariota incomplete pass to the middle intended for Andre Johnson.","(2:09) Marcus Mariota incomplete pass to the right intended for Andre Johnson.","(2:30) Marcus Mariota pass to the right to Delanie Walker for 10 yards to the Ten36. Tackled by Terence Newman.","(2:36) Blair Walsh kicks off to the Ten-5. Marc Mariani return for 31 yards to Ten26. Tackled by Jayron Kearse.","(2:41) Blair Walsh 30 yard field goal attempt is GOOD. Holder: Jeff Locke.","(2:41) Minnesota Vikings timeout.","(3:27) Stefon Diggs rush to the right for a loss of 1 yard to the Ten12. Tackled by Da'Norris Searcy.","(4:08) Matt Asiata rush up the middle for a loss of 1 yard to the Ten11. Tackled by Al Woods.","(4:54) Matt Asiata rush up the middle for 6 yards to the Ten10. Tackled by Avery Williamson.","(5:41) Shaun Hill pass to the left to Stefon Diggs for 33 yards to the Ten16. Tackled by Jason McCourty.","(6:26) Matt Asiata rush to the right for 6 yards to the Ten49. Tackled by Da'Norris Searcy.","(7:09) Matt Asiata rush to the left for 2 yards to the Min45. Tackled by Wesley Woodyard.","(7:22) Brett Kern punts for 64 yards to Min31. Marcus Sherels return for 12 yards to Min43. Tackled by Valentino Blake and Nate Palmer.","(7:28) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(8:09) Marcus Mariota sacked at Ten5 for a loss of 10 yards by Danielle Hunter.","(8:14) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe.","(8:21) Jeff Locke punts for 26 yards to Ten15. No return.","(8:26) Shaun Hill incomplete pass to the left intended for Charles Johnson.","(9:12) Adrian Peterson rush to the right for 4 yards to the Ten41. Tackled by Austin Johnson and Avery Williamson.","(9:40) Adrian Peterson rush up the middle for 1 yard to the Ten45. Tackled by Daimion Stafford.","(9:48) DeMarco Murray rush up the middle for 1 yard to the Ten43. Tackled by Linval Joseph. FUMBLE, recovered by Min (Andrew Sendejo) and returned for 2 yards. Tackled by Taylor Lewan.","(10:26) DeMarco Murray rush to the left for 2 yards to the Ten42. Tackled by Danielle Hunter.","(11:03) Marcus Mariota pass to the left to Tajae Sharpe for 15 yards to the Ten40. Tackled by Trae Waynes.","(11:03) Blair Walsh kicks off to the endzone. Touchback.","(11:03) Blair Walsh extra point is good.","(11:03) Marcus Mariota rush up the middle for no gain to the Ten25. FUMBLE, recovered by Min (Danielle Hunter) and returned for 24 yards for a TOUCHDOWN.","(11:17) Blair Walsh kicks off to the Ten5. Marc Mariani return for 20 yards to Ten25. Tackled by Adam Thielen.","(11:22) Blair Walsh 45 yard field goal attempt is GOOD. Holder: Jeff Locke.","(11:27) Shaun Hill incomplete pass to the right intended for Kyle Rudolph.","(11:32) Shaun Hill incomplete pass to the right intended for Kyle Rudolph defensed by Da'Norris Searcy.","(12:18) Adrian Peterson rush up the middle for 4 yards to the Ten27. Tackled by Karl Klug.","(12:50) Shaun Hill pass to the left to Kyle Rudolph for 18 yards to the Ten31. Tackled by Da'Norris Searcy.","(13:31) Shaun Hill pass to the right to Cordarrelle Patterson for 6 yards to the Ten49. Tackled by Perrish Cox.","(14:19) Adrian Peterson rush to the right for 3 yards to the Min45. Tackled by Al Woods.","(15:00) Shaun Hill pass to the left to Adam Thielen for 16 yards to the Min42. Tackled by Brice McCain.","(0:16) Adrian Peterson rush to the right for a loss of 5 yards to the Min26. Tackled by Kevin Byard.","(0:22) Shaun Hill incomplete pass to the right intended for Adrian Peterson.","(0:35) Brett Kern punts for 52 yards to Min24. Marcus Sherels return for a loss of 2 yards to Min22. Lateral to Cordarrelle Patterson for 9 yards to the Min31. Tackled by Wesley Woodyard.","(0:40) Marcus Mariota incomplete pass to the left intended for Rishard Matthews.","(0:45) Marcus Mariota incomplete pass to the right intended for Harry Douglas.","(1:24) DeMarco Murray rush to the right for 4 yards to the Ten24. Tackled by Terence Newman and Anthony Barr.","(1:24) Penalty: False Start on Tennessee (Quinton Spain) -5 yards.","(1:24) Blair Walsh kicks off to the endzone. Touchback.","(1:24) Blair Walsh extra point is NO GOOD.","(1:38) Marcus Mariota pass intended for Harry Douglas INTERCEPTED by Eric Kendricks and returned for 77 yards for a TOUCHDOWN.","(2:02) Marcus Mariota pass to the right to Andre Johnson for 7 yards to the Min24. Tackled by Terence Newman.","(2:44) Marcus Mariota pass to the left to Harry Douglas for 5 yards to the Min31. Tackled by Eric Kendricks.","(3:24) Marcus Mariota rush up the middle for 10 yards to the Min36. Tackled by Andrew Sendejo.","(3:54) Derrick Henry rush to the left for a loss of 4 yards to the Min46. Tackled by Harrison Smith.","(4:33) Marcus Mariota pass to the left to Andre Johnson for 16 yards to the Min42. Tackled by Andrew Sendejo.","(5:11) Marcus Mariota pass to the left to Tajae Sharpe for 17 yards to the Ten42. Tackled by Trae Waynes.","(5:53) Marcus Mariota sacked at Ten25 for a loss of 9 yards by Linval Joseph.","(5:59) Blair Walsh kicks off to the Ten5. Marc Mariani return for 29 yards to Ten34. Tackled by Marcus Sherels.","(6:04) Blair Walsh 33 yard field goal attempt is GOOD. Holder: Jeff Locke.","(6:32) Shaun Hill rush to the right for 9 yards to the Ten15. Tackled by Daimion Stafford.","(7:12) Adrian Peterson rush up the middle for a loss of 1 yard to the Ten24. Tackled by Angelo Blackson.","(7:16) Shaun Hill incomplete pass to the right intended for Adrian Peterson.","(7:49) Cordarrelle Patterson rush to the right for 8 yards to the Ten23. Tackled by Kevin Byard.","(8:25) Adrian Peterson rush up the middle for 3 yards to the Ten31. Tackled by Derrick Morgan and Jurrell Casey.","(8:57) Shaun Hill pass to the right to Stefon Diggs for 10 yards to the Ten34. Tackled by Da'Norris Searcy.","(9:24) Shaun Hill pass to the left to Stefon Diggs for 14 yards to the Ten44. Tackled by Jason McCourty.","(10:03) Adrian Peterson rush to the right for 2 yards to the Min42. Tackled by Karl Klug.","(10:44) Shaun Hill pass to the right to Adam Thielen for 15 yards to the Min40. Tackled by Brice McCain.","(11:30) Adrian Peterson rush to the right for a loss of 2 yards to the Min25. Tackled by Da'Norris Searcy.","(11:39) Brett Kern punts for 44 yards to Min27. Marcus Sherels - no return. Tackled by Kevin Byard.","(12:33) Derrick Henry rush up the middle for no gain to the Ten29. Tackled by Harrison Smith.","(13:17) DeMarco Murray rush to the left for 3 yards to the Ten29. Tackled by Harrison Smith and Linval Joseph.","(13:51) Marcus Mariota pass to the left to Rishard Matthews for 6 yards to the Ten26. Tackled by Trae Waynes.","(13:56) Blair Walsh kicks off to the Ten1. Marc Mariani return for 19 yards to Ten20. Tackled by Jerick McKinnon.","(14:01) Blair Walsh 50 yard field goal attempt is GOOD. Holder: Jeff Locke.","(14:06) Shaun Hill incomplete pass to the left intended for Charles Johnson.","(14:43) Adrian Peterson rush to the left for 2 yards to the Ten32. Tackled by Jurrell Casey.","(14:49) Shaun Hill incomplete pass to the left intended for Charles Johnson.","(15:00) Ryan Succop kicks off to the Min5. Cordarrelle Patterson return for 61 yards to Ten34. Tackled by Brice McCain.","(0:03) 56 yard field goal attempt by Blair Walsh is NO GOOD. Holder: Jeff Locke.","(0:03) Tennessee Titans timeout.","(0:03) Minnesota Vikings timeout.","(0:09) Shaun Hill pass to the right to Jerick McKinnon for 3 yards to the Ten38. Tackled by Da'Norris Searcy.","(0:14) Shaun Hill incomplete pass to the middle intended for Adam Thielen defensed by Brice McCain.","(0:14) Minnesota Vikings timeout.","(0:20) Shaun Hill pass to the right to Kyle Rudolph for 21 yards to the Ten41. Tackled by Da'Norris Searcy.","(0:25) Shaun Hill incomplete pass to the left intended for Charles Johnson defensed by Jason McCourty.","(0:25) Minnesota Vikings timeout.","(0:32) Shaun Hill pass to the right to Stefon Diggs for 13 yards to the Min38. Tackled by Da'Norris Searcy.","(0:37) Shaun Hill incomplete pass to the left intended for Charles Johnson.","(0:41) Shaun Hill incomplete pass to the right intended for Jerick McKinnon.","(0:41) Ryan Succop kicks off to the endzone. Touchback.","(0:41) Ryan Succop extra point is good.","(0:47) Marcus Mariota pass to the right to DeMarco Murray for 6 yards for a TOUCHDOWN.","(0:53) Marcus Mariota incomplete pass to the right intended for DeMarco Murray.","(0:53) Tennessee Titans timeout.","(1:04) Marcus Mariota pass to the left to DeMarco Murray for 14 yards to the Min6. Tackled by Everson Griffen.","(1:09) Marcus Mariota incomplete pass to the right intended for DeMarco Murray.","(1:14) Marcus Mariota incomplete pass to the right intended for Andre Johnson.","(1:20) Marcus Mariota pass to the left to Tajae Sharpe for 8 yards to the Min20. Tackled by Trae Waynes.","(1:24) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe.","(2:00) DeMarco Murray rush up the middle for 2 yards to the Min28. Tackled by Andrew Sendejo.","(2:00) Two Minute Warning.","(2:29) Marcus Mariota pass to the left to Harry Douglas for 16 yards to the Min30. Tackled by Harrison Smith.","(3:13) DeMarco Murray rush up the middle for 4 yards to the Min46. Tackled by Eric Kendricks.","(3:48) Marcus Mariota pass to the right to DeMarco Murray for 5 yards to the Ten50. Tackled by Terence Newman.","(4:18) Marcus Mariota pass to the right to Tajae Sharpe for 12 yards to the Ten45. Tackled by Terence Newman.","(4:55) Marcus Mariota pass to the left to Delanie Walker for 6 yards to the Ten33. Tackled by Trae Waynes.","(5:03) Jeff Locke punts for 36 yards to Ten27. No return.","(5:49) Shaun Hill pass to the left to Adam Thielen for 21 yards to the Min37. Tackled by Rashad Johnson.","(6:18) Shaun Hill pass to the left to Adam Thielen for 2 yards to the Min16. Tackled by Brice McCain.","(6:37) Penalty: Face Mask on Minnesota (Rhett Ellison) -14 yards.","(6:43) Shaun Hill incomplete pass to the middle intended for Kyle Rudolph.","(7:16) Shaun Hill pass to the right to Kyle Rudolph for 16 yards to the Min28. Tackled by Daimion Stafford.","(7:53) Adrian Peterson rush to the right for 2 yards to the Min12. Tackled by Avery Williamson.","(8:01) Brett Kern punts for 35 yards to Min10. No return.","(8:39) Derrick Henry rush to the left for a loss of 1 yard to the Min45. Tackled by Trae Waynes.","(9:20) Marcus Mariota pass to the left to Tajae Sharpe for 9 yards to the Min44. Tackled by Eric Kendricks.","(9:39) Penalty: False Start on Tennessee (Taylor Lewan) -5 yards.","(10:15) Derrick Henry rush to the left for 5 yards to the Min48. Tackled by Everson Griffen.","(10:54) Marcus Mariota pass to the left to Derrick Henry for 12 yards to the Ten47. Tackled by Harrison Smith.","(11:35) Marcus Mariota pass to the left to DeMarco Murray for 6 yards to the Ten35. Tackled by Andrew Sendejo.","(12:13) DeMarco Murray rush up the middle for 2 yards to the Ten29. Tackled by Danielle Hunter.","(12:18) 37 yard field goal attempt by Blair Walsh is NO GOOD. Holder: Jeff Locke.","(12:53) Jerick McKinnon rush to the left for 6 yards to the Ten19. Tackled by Sean Spence.","(12:59) Penalty: Holding on Minnesota (Andre Smith) -10 yards.","(13:41) Adrian Peterson rush to the right for a loss of 2 yards to the Ten15. Tackled by Jurrell Casey.","(14:14) Adrian Peterson rush to the left for a loss of 2 yards to the Ten13. Tackled by Avery Williamson and Sean Spence.","(15:00) Adrian Peterson rush to the left for 2 yards to the Ten11. Tackled by Wesley Woodyard.","(0:15) Adrian Peterson rush up the middle for 9 yards to the Ten13. Tackled by Kevin Byard.","(0:20) Shaun Hill incomplete pass to the right intended for Stefon Diggs.","(0:42) Shaun Hill pass to the right to Stefon Diggs for 13 yards to the Ten22. Tackled by Kevin Byard.","(0:46) Shaun Hill incomplete pass to the right intended for Kyle Rudolph defensed by Sean Spence.","(1:27) Shaun Hill pass to the right to Kyle Rudolph for 10 yards to the Ten35. Tackled by Perrish Cox.","(2:09) Adrian Peterson rush to the left for 1 yard to the Ten45. Tackled by Angelo Blackson and Derrick Morgan.","(2:47) Adrian Peterson rush to the left for 7 yards to the Ten46. Tackled by Rashad Johnson and Avery Williamson.","(3:29) Shaun Hill pass to the right to Stefon Diggs for 12 yards to the Min47. Tackled by Perrish Cox.","(4:08) Adrian Peterson rush to the left for 2 yards to the Min35. Tackled by Avery Williamson.","(4:45) Shaun Hill pass to the middle to Stefon Diggs for 8 yards to the Min33. Tackled by Rashad Johnson.","(4:45) Ryan Succop kicks off to the endzone. Touchback.","(4:50) Ryan Succop 28 yard field goal attempt is GOOD. Holder: Brett Kern.","(4:54) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(5:37) DeMarco Murray rush to the left for a loss of 2 yards to the Min10. Tackled by Eric Kendricks.","(6:24) Marcus Mariota rush to the right for 6 yards to the Min8. Tackled by Eric Kendricks.","(7:07) Marcus Mariota pass to the right to Rishard Matthews for 11 yards to the Min14. Tackled by Terence Newman.","(7:41) DeMarco Murray rush up the middle for 5 yards to the Min25. Tackled by Linval Joseph.","(8:36) Marcus Mariota pass to the right to Derrick Henry for 29 yards to the Min30. Tackled by Trae Waynes.","(9:09) DeMarco Murray rush to the left for 4 yards to the Ten41. Tackled by Anthony Barr.","(9:22) Jeff Locke punts for 51 yards to Ten23. Marc Mariani return for 14 yards to Ten37. Tackled by Adam Thielen and Emmanuel Lamur.","(9:26) Shaun Hill incomplete pass to the left intended for Stefon Diggs.","(10:02) Shaun Hill pass to the left to Charles Johnson for 5 yards to the Min26. Tackled by Jason McCourty.","(10:26) Adrian Peterson rush to the left for 1 yard to the Min21. Tackled by Jurrell Casey.","(10:35) Brett Kern punts for 36 yards to Min0. Touchback.","(10:39) Marcus Mariota incomplete pass to the left intended for Andre Johnson.","(11:21) DeMarco Murray rush to the right for a loss of 1 yard to the Min36. Tackled by Brian Robison.","(11:25) Marcus Mariota incomplete pass to the right intended for Delanie Walker defensed by Brian Robison.","(12:07) DeMarco Murray rush to the left for 12 yards to the Min35. Tackled by Harrison Smith.","(12:44) Marcus Mariota pass to the left to Tajae Sharpe for 12 yards to the Min47. Tackled by Trae Waynes.","(12:50) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe.","(13:29) Marcus Mariota rush to the left for 3 yards to the Ten41. Tackled by Trae Waynes.","(14:09) Derrick Henry rush to the right for 3 yards to the Ten38. Tackled by Everson Griffen.","(14:54) DeMarco Murray rush up the middle for 6 yards to the Ten35. Tackled by Linval Joseph and Brian Robison.","(15:00) Blair Walsh kicks off to the Ten10. Marc Mariani return for 19 yards to Ten29. Tackled by Danielle Hunter."]