["(9:59) Alex Smith rush up the middle for 2 yards for a TOUCHDOWN.","(9:59) Kansas City Chiefs timeout.","(10:44) Spencer Ware rush to the right for 6 yards to the SD2. Tackled by Jahleel Addae.","(10:46) Alex Smith incomplete pass to the right intended for Travis Kelce.","(10:46) San Diego Chargers timeout.","(11:16) Alex Smith pass to the left to Travis Kelce for 15 yards to the SD8. Tackled by Kyle Emanuel.","(12:01) Alex Smith pass to the left to Albert Wilson for a loss of 1 yard to the SD23. Tackled by Brandon Flowers.","(12:34) Alex Smith pass to the left to Travis Kelce for 8 yards to the SD22. Tackled by Dwight Lowery.","(13:14) Spencer Ware rush up the middle for 2 yards to the SD30. Tackled by Manti Te'o.","(13:54) Alex Smith rush up the middle for 5 yards to the SD32. Tackled by Kyle Emanuel.","(14:31) Spencer Ware rush to the right for 13 yards to the SD37. Tackled by Denzel Perryman.","(15:00) Alex Smith pass to the right to Spencer Ware for 20 yards to the KC50. Tackled by Denzel Perryman.","(15:00) Josh Lambo kicks off to the endzone. Touchback. Penalty: Offside on San Diego (Dwight Lowery) 5 yards.","(0:08) Drew Kaser punts for 48 yards to KC17. Tyreek Hill return for 13 yards to KC30. Tackled by Darrell Stuckey.","(0:08) Kansas City Chiefs timeout.","(0:15) Danny Woodhead rush up the middle for 4 yards to the SD35. Tackled by Dee Ford.","(0:48) Danny Woodhead rush up the middle for 4 yards to the SD31. Tackled by Tamba Hali.","(0:53) Philip Rivers sacked at SD27 for a loss of 10 yards by Dee Ford.","(0:59) Philip Rivers pass to the middle to Danny Woodhead for 12 yards to the SD37. Tackled by Eric Berry.","(1:03) Philip Rivers incomplete pass to the right intended for Danny Woodhead.","(1:03) Cairo Santos kicks off to the endzone. Touchback.","(1:03) Cairo Santos extra point is good.","(1:11) Spencer Ware rush up the middle for 5 yards for a TOUCHDOWN.","(1:19) Alex Smith pass to the left to Jeremy Maclin for 22 yards to the SD10. Tackled by Brandon Flowers. Penalty: Unnecessary Roughness on San Diego (Jahleel Addae) 5 yards.","(1:24) Alex Smith pass to the right to Charcandrick West for 7 yards to the SD32.","(1:49) Alex Smith pass to the right to Charcandrick West for 3 yards to the SD39. Tackled by Melvin Ingram.","(1:59) Drew Kaser punts for 17 yards to SD42. D.J. Alexander - no return.","(1:59) Two Minute Warning.","(2:20) Philip Rivers pass to the left to Travis Benjamin for no gain to the SD25. Tackled by Frank Zombo.","(2:20) Kansas City Chiefs timeout.","(2:27) Philip Rivers pass to the right to Travis Benjamin for a loss of 2 yards to the SD25. Tackled by Steven Nelson.","(3:09) Melvin Gordon rush up the middle for 2 yards to the SD27. Tackled by Eric Berry.","(3:09) Cairo Santos kicks off to the endzone. Touchback.","(3:12) Cairo Santos 33 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(3:51) Alex Smith pass to the right to Charcandrick West for 4 yards to the SD15. Tackled by Jahleel Addae.","(3:56) Alex Smith incomplete pass to the right intended for Chris Conley.","(4:03) Alex Smith incomplete pass to the left.","(4:28) Alex Smith pass to the middle to Demetrius Harris for 13 yards to the SD19. Tackled by Brandon Flowers.","(4:56) Alex Smith pass to the middle to Spencer Ware for 9 yards to the SD32. Tackled by Manti Te'o.","(5:23) Alex Smith pass to the middle to Spencer Ware for 6 yards to the SD41. Tackled by Dwight Lowery.","(5:23) San Diego Chargers timeout.","(5:50) Alex Smith rush to the right for 7 yards to the SD47. Tackled by Brandon Flowers.","(5:54) Alex Smith incomplete pass to the left intended for Spencer Ware.","(6:22) Spencer Ware rush up the middle for 14 yards to the KC46. Tackled by Dexter McCoil.","(6:26) Alex Smith incomplete pass to the right intended for Albert Wilson defensed by Casey Hayward.","(6:49) Alex Smith pass to the left to Chris Conley for 9 yards to the KC32. Tackled by Manti Te'o.","(7:00) Drew Kaser punts for 47 yards to KC9. Tyreek Hill return for 14 yards to KC23. Tackled by Tourek Williams.","(7:05) Philip Rivers incomplete pass to the right intended for Dontrelle Inman defensed by Marcus Peters.","(7:48) Danny Woodhead rush up the middle for 3 yards to the SD44. Tackled by Dontari Poe.","(8:30) Danny Woodhead rush up the middle for 4 yards to the SD41. Tackled by Steven Nelson.","(9:14) Philip Rivers pass to the middle to Hunter Henry for 20 yards to the SD37. Tackled by Eric Berry.","(9:18) Cairo Santos kicks off to the SD-3. Craig Mager return for 20 yards to SD17. Tackled by Demetrius Harris.","(9:18) Cairo Santos extra point is good.","(9:18) Penalty: False Start on Kansas City (Mitch Morse) -5 yards.","(9:23) Alex Smith pass to the left to Jeremy Maclin for 19 yards for a TOUCHDOWN.","(9:44) Alex Smith pass to the left to Jeremy Maclin for 10 yards to the SD19. Tackled by Jason Verrett.","(10:06) Alex Smith pass to the middle to Spencer Ware for 12 yards to the SD29. Tackled by Manti Te'o and Jatavis Brown.","(10:25) Alex Smith pass to the right to Charcandrick West for 7 yards to the SD41. Tackled by Jatavis Brown.","(10:29) Alex Smith incomplete pass to the right intended for Chris Conley defensed by Casey Hayward.","(10:56) Alex Smith pass to the right to Albert Wilson for a loss of 1 yard to the SD48. Tackled by Manti Te'o.","(11:20) Alex Smith pass to the right to Chris Conley for 9 yards to the SD47. Tackled by Dwight Lowery.","(11:25) 54 yard field goal attempt by Josh Lambo is NO GOOD. Holder: Drew Kaser.","(11:28) Philip Rivers incomplete pass to the left intended for Dontrelle Inman defensed by Frank Zombo.","(12:12) Danny Woodhead rush up the middle for 6 yards to the KC36. Tackled by Justin March.","(12:53) Melvin Gordon rush up the middle for 2 yards to the KC42. Tackled by Derrick Johnson.","(12:56) Alex Smith pass intended for Jeremy Maclin INTERCEPTED by Jason Verrett. No return. Tackled by Jeremy Maclin.","(13:24) Alex Smith pass to the right to Chris Conley for 12 yards to the KC37. Tackled by Brandon Flowers.","(13:24) Josh Lambo kicks off to the endzone. Touchback.","(13:27) Josh Lambo 28 yard field goal attempt is GOOD. Holder: Drew Kaser.","(13:32) Philip Rivers incomplete pass to the left intended for Danny Woodhead.","(14:15) Danny Woodhead rush up the middle for 2 yards to the KC10. Tackled by Eric Berry.","(14:55) Melvin Gordon rush up the middle for 2 yards to the KC12. Tackled by Derrick Johnson.","(15:00) Penalty: Illegal Contact on Kansas City (Eric Berry) 5 yards.","(0:26) Philip Rivers pass to the right to Tyrell Williams for 38 yards to the KC19. Tackled by Phillip Gaines.","(1:10) Philip Rivers pass to the left to Travis Benjamin for 8 yards to the SD43. Tackled by Steven Nelson.","(1:15) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(1:15) San Diego Chargers timeout.","(2:03) Danny Woodhead rush up the middle for 5 yards to the SD35. Tackled by Dee Ford.","(2:47) Philip Rivers pass to the right to Travis Benjamin for 5 yards to the SD30. Tackled by Steven Nelson.","(2:47) Cairo Santos kicks off to the endzone. Touchback.","(2:47) Cairo Santos extra point is good.","(2:53) Alex Smith pass to the left to Tyreek Hill for 9 yards for a TOUCHDOWN.","(3:19) Alex Smith pass to the left to Albert Wilson for 3 yards to the SD9. Tackled by Jahleel Addae.","(3:57) Alex Smith pass to the left to Travis Kelce for 13 yards to the SD12. Tackled by Casey Hayward.","(4:03) Alex Smith incomplete pass to the left intended for Demetrius Harris.","(4:42) Charcandrick West rush to the left for a loss of 4 yards to the SD25. Tackled by Corey Liuget.","(5:20) Alex Smith pass to the left to Spencer Ware for 9 yards to the SD21. Tackled by Denzel Perryman.","(6:02) Alex Smith pass to the left to Spencer Ware for 45 yards to the SD30. Tackled by Manti Te'o.","(6:02) Josh Lambo kicks off to the endzone. Touchback.","(6:06) Josh Lambo 29 yard field goal attempt is GOOD. Holder: Drew Kaser.","(6:11) Philip Rivers incomplete pass to the right intended for Tyrell Williams defensed by Ron Parker.","(6:57) Danny Woodhead rush up the middle for 1 yard to the KC11. Tackled by Dee Ford.","(7:01) Philip Rivers incomplete pass to the right intended for Travis Benjamin.","(7:34) Philip Rivers pass to the right to Travis Benjamin for 5 yards to the KC12. Tackled by Steven Nelson.","(8:20) Danny Woodhead rush up the middle for 6 yards to the KC17. Tackled by Nick Williams.","(8:56) Philip Rivers rush to the left for 10 yards to the KC23. Tackled by Justin March.","(9:35) Melvin Gordon rush up the middle for 3 yards to the KC33. Tackled by Derrick Johnson.","(10:02) Melvin Gordon rush up the middle for 9 yards to the KC36. Tackled by Steven Nelson.","(10:11) Dustin Colquitt punts for 39 yards to KC46. Travis Benjamin return for 1 yard to KC45. Tackled by Eric Murray.","(10:53) Alex Smith sacked at KC7 for a loss of 10 yards by Brandon Mebane.","(11:37) Alex Smith pass to the right to Demetrius Harris for 7 yards to the KC17. Tackled by Casey Hayward.","(12:23) Jeremy Maclin rush to the left for a loss of 1 yard to the KC10. Tackled by Brandon Flowers.","(12:35) Drew Kaser punts for 35 yards to KC13. Tyreek Hill return for 8 yards to KC21. Tackled by Jerry Attaochu and Jatavis Brown. Penalty: Illegal Block on Kansas City (James O'Shaughnessy) -10 yards.","(12:35) Penalty: Delay of Game on San Diego (Drew Kaser) -5 yards.","(12:35) Kansas City Chiefs timeout.","(12:54) Melvin Gordon rush up the middle for no gain to the KC43. Tackled by Justin March and Nick Williams.","(13:33) Danny Woodhead rush up the middle for 3 yards to the KC43. Tackled by Justin March.","(14:10) Philip Rivers pass to the right to Dontrelle Inman for 6 yards to the KC46. Tackled by Ron Parker and Frank Zombo.","(14:53) Danny Woodhead rush up the middle for 21 yards to the SD48. Tackled by Ron Parker.","(15:00) Cairo Santos kicks off to the SD4. Craig Mager return for 23 yards to SD27. Tackled by Steven Nelson.","(0:08) Philip Rivers rush up the middle for a loss of 1 yard to the SD21.","(0:16) Dustin Colquitt punts for 25 yards to SD22. No return.","(0:21) Alex Smith incomplete pass to the middle intended for Chris Conley.","(0:29) Alex Smith pass to the right to Charcandrick West for 3 yards to the SD47. Tackled by Brandon Flowers.","(0:34) Alex Smith incomplete pass to the right.","(0:40) Alex Smith pass to the left to Travis Kelce for 20 yards to the KC50. Tackled by Dexter McCoil.","(0:58) Alex Smith pass to the middle to Travis Kelce for 5 yards to the KC30. Tackled by Dexter McCoil.","(1:04) Drew Kaser punts for 31 yards to KC25. No return.","(1:08) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(1:13) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(1:53) Philip Rivers pass to the middle to Danny Woodhead for 8 yards to the SD44. Tackled by Derrick Johnson.","(2:00) Two Minute Warning.","(2:20) Philip Rivers pass to the right to Keenan Allen for 11 yards to the SD36. Tackled by Justin March.","(2:20) Kansas City Chiefs timeout.","(2:27) Philip Rivers pass to the left to Antonio Gates for 8 yards to the SD25. Tackled by Phillip Gaines.","(2:27) Kansas City Chiefs timeout.","(2:35) Philip Rivers pass to the right to Danny Woodhead for no gain to the SD17. Tackled by D.J. White.","(2:58) Philip Rivers pass to the right to Keenan Allen for 8 yards to the SD17. Tackled by Marcus Peters.","(3:39) Melvin Gordon rush up the middle for 3 yards to the SD9. Tackled by Derrick Johnson.","(3:51) Dustin Colquitt punts for 50 yards to SD6. No return.","(4:29) Alex Smith pass to the right to Charcandrick West for no gain to the KC44. Tackled by Corey Liuget.","(5:15) Alex Smith pass to the left to Travis Kelce for 13 yards to the KC44. Tackled by Brandon Flowers.","(5:55) Charcandrick West rush up the middle for a loss of 5 yards to the KC31. Tackled by Manti Te'o.","(6:30) Spencer Ware rush up the middle for 2 yards to the KC36. Tackled by Brandon Mebane.","(7:14) Alex Smith rush up the middle for 1 yard to the KC34. Tackled by Melvin Ingram.","(7:54) Charcandrick West rush to the right for 8 yards to the KC33. Tackled by Darius Philon.","(7:54) Josh Lambo kicks off to the endzone. Touchback.","(7:54) Josh Lambo extra point is good.","(7:59) Philip Rivers pass to the right to Danny Woodhead for 4 yards for a TOUCHDOWN.","(8:44) Philip Rivers pass to the right to Travis Benjamin for 8 yards to the KC4. Tackled by Ron Parker.","(9:26) Philip Rivers pass to the left to Antonio Gates for 8 yards to the KC12. Tackled by Justin March.","(10:09) Philip Rivers pass to the left to Danny Woodhead for 7 yards to the KC20. Tackled by Phillip Gaines.","(10:35) Penalty: Holding on San Diego (Derek Watt) -10 yards.","(10:52) Philip Rivers pass to the right to Keenan Allen for 6 yards to the KC32. Tackled by Marcus Peters. Penalty: Face Mask on Kansas City (Marcus Peters) 15 yards.","(11:26) Danny Woodhead rush up the middle for no gain to the KC38. Tackled by Frank Zombo.","(11:35) Dustin Colquitt punts for 38 yards to KC45. Travis Benjamin return for 7 yards to KC38. Tackled by Tyreek Hill.","(12:15) Alex Smith sacked at KC7 for a loss of 14 yards by Jerry Attaochu.","(12:38) Penalty: False Start on Kansas City (Tyreek Hill) -5 yards.","(13:25) Spencer Ware rush up the middle for 10 yards to the KC26. Tackled by Casey Hayward and Manti Te'o.","(14:06) Alex Smith sacked at KC16 for a loss of 9 yards by Caraun Reid.","(14:06) Josh Lambo kicks off to the endzone. Touchback.","(14:06) Josh Lambo extra point is good.","(14:10) Melvin Gordon rush up the middle for 6 yards for a TOUCHDOWN.","(14:10) San Diego Chargers timeout.","(15:00) Danny Woodhead rush up the middle for 9 yards to the KC6. Tackled by Eric Berry.","(15:00) Philip Rivers incomplete pass to the left intended for Hunter Henry.","(0:14) Danny Woodhead rush up the middle for 12 yards to the KC15. Tackled by Eric Berry.","(0:59) Melvin Gordon rush up the middle for 4 yards to the KC27. Tackled by Justin March.","(1:00) San Diego Chargers timeout.","(1:48) Philip Rivers pass to the left to Antonio Gates for 4 yards to the KC31. Tackled by Justin March.","(2:32) Melvin Gordon rush up the middle for 5 yards to the KC35. Tackled by Steven Nelson.","(3:11) Danny Woodhead rush up the middle for 3 yards to the KC40. Tackled by Allen Bailey.","(3:49) Philip Rivers pass to the left to Travis Benjamin for 8 yards to the KC43. Tackled by Frank Zombo.","(4:29) Philip Rivers pass to the right to Keenan Allen for 9 yards to the SD49. Tackled by Marcus Peters.","(4:34) Philip Rivers incomplete pass to the left intended for Keenan Allen.","(5:17) Melvin Gordon rush to the left for 5 yards to the SD40. Tackled by Frank Zombo.","(5:57) Philip Rivers pass to the left to Keenan Allen for 15 yards to the SD35. Tackled by Steven Nelson.","(6:07) Dustin Colquitt punts for 45 yards to SD0. Touchback.","(6:11) Alex Smith incomplete pass to the right intended for Ross Travis defensed by Jatavis Brown.","(6:11) Penalty: Offside on San Diego (Caraun Reid) 5 yards.","(6:24) Alex Smith incomplete pass to the left intended for Albert Wilson.","(6:33) Alex Smith incomplete pass to the right.","(7:12) Alex Smith pass to the right to Chris Conley for 13 yards to the KC50. Tackled by Jahleel Addae and Casey Hayward.","(7:49) Spencer Ware rush to the left for 1 yard to the KC37. Tackled by Manti Te'o.","(8:27) Spencer Ware rush up the middle for 11 yards to the KC36. Tackled by Denzel Perryman.","(8:27) Josh Lambo kicks off to the endzone. Touchback.","(8:27) Josh Lambo extra point is good.","(8:30) Melvin Gordon rush to the right for 1 yard for a TOUCHDOWN.","(8:35) Penalty: Pass Interference on Kansas City (Marcus Peters) 6 yards.","(8:35) San Diego Chargers timeout.","(9:18) Melvin Gordon rush up the middle for 17 yards to the KC7. Tackled by Frank Zombo.","(9:56) Philip Rivers pass to the left to Tyrell Williams for 33 yards to the KC24. Tackled by Phillip Gaines.","(10:40) Danny Woodhead rush up the middle for 6 yards to the SD43. Tackled by Ron Parker.","(11:21) Melvin Gordon rush to the right for a loss of 2 yards to the SD37. Tackled by Allen Bailey.","(11:51) Philip Rivers pass to the middle to Keenan Allen for 14 yards to the SD39. Tackled by Justin March.","(11:51) Cairo Santos kicks off to the endzone. Touchback.","(11:55) Cairo Santos 47 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(12:01) Alex Smith incomplete pass to the left intended for Jeremy Maclin.","(12:44) Spencer Ware rush to the right for 6 yards to the SD29. Tackled by Manti Te'o.","(13:17) Spencer Ware rush up the middle for no gain to the SD35. Tackled by Corey Liuget.","(13:55) Alex Smith pass to the right to Spencer Ware for 28 yards to the SD35. Tackled by Dwight Lowery.","(14:23) Alex Smith pass to the left to Jeremy Maclin for 7 yards to the KC37. Tackled by Jason Verrett.","(15:00) Alex Smith pass to the middle to Jeremy Maclin for 5 yards to the KC30. Tackled by Jahleel Addae.","(15:00) Josh Lambo kicks off to the endzone. Touchback."]