["(0:24) Case Keenum rush up the middle for a loss of 1 yard to the LA43.","(0:31) Bradley Pinion punts for 36 yards to LA44. No return.","(0:31) San Francisco 49ers timeout.","(1:16) Mike Davis rush up the middle for a loss of 2 yards to the SF20. Tackled by Ethan Westbrooks.","(2:00) Mike Davis rush to the right for 2 yards to the SF22. Tackled by Dominique Easley and Lamarcus Joyner.","(2:00) Two Minute Warning.","(2:33) Mike Davis rush to the left for 1 yard to the SF20. Tackled by Eugene Sims.","(2:41) Case Keenum rush to the right for 5 yards to the SF19. Tackled by NaVorro Bowman.","(2:50) Case Keenum incomplete pass to the left intended for Kenny Britt.","(2:54) Case Keenum incomplete pass to the left intended for Tavon Austin.","(2:58) Case Keenum incomplete pass to the middle intended for Tyler Higbee.","(3:26) Case Keenum pass to the right to Brian Quick for 15 yards to the SF24. Tackled by Dontae Johnson.","(3:52) Case Keenum pass to the right to Kenny Britt for 15 yards to the SF39.","(3:52) Case Keenum incomplete pass to the right intended for Brian Quick defensed by Dontae Johnson.","(4:23) Case Keenum pass to the right to Brian Quick for 5 yards to the LA46. Tackled by Eric Reid.","(4:49) Malcolm Brown rush up the middle for 5 yards to the LA41. Tackled by Ahmad Brooks and NaVorro Bowman.","(5:07) Case Keenum pass to the right to Malcolm Brown for 8 yards to the LA36. Tackled by Ray-Ray Armstrong.","(5:14) Bradley Pinion kicks off to the LA-4. Benny Cunningham return for 32 yards to LA28. Tackled by Dontae Johnson.","(5:14) Phil Dawson extra point is good.","(5:18) Carlos Hyde rush up the middle for 1 yard for a TOUCHDOWN.","(6:00) Carlos Hyde rush to the left for no gain to the LA1. Tackled by Maurice Alexander.","(6:03) Penalty: Pass Interference on Los Angeles (Coty Sensabaugh) 5 yards.","(6:42) Carlos Hyde rush to the left for 5 yards to the LA6. Tackled by William Hayes.","(7:20) Blaine Gabbert rush to the right for 2 yards to the LA38. Tackled by Alec Ogletree. Penalty: Unnecessary Roughness on Los Angeles (Aaron Donald) 15 yards. Penalty: Disqualification on Los Angeles (Aaron Donald) 12 yards.","(7:55) Shaun Draughn rush to the left for no gain to the LA40. Tackled by T.J. McDonald.","(8:39) Blaine Gabbert pass to the right to Garrett Celek for 15 yards to the LA40. Tackled by T.J. McDonald.","(9:15) Carlos Hyde rush up the middle for 4 yards to the SF45. Tackled by Dominique Easley.","(9:52) Carlos Hyde rush up the middle for 7 yards to the SF41. Tackled by Alec Ogletree.","(9:57) Blaine Gabbert incomplete pass to the right intended for Jeremy Kerley.","(10:32) Blaine Gabbert pass to the left to Jeremy Kerley for 8 yards to the SF34. Tackled by Alec Ogletree.","(11:05) Blaine Gabbert pass to the right to Vance McDonald for 6 yards to the SF26. Tackled by Alec Ogletree.","(11:13) Johnny Hekker punts for 49 yards to SF20. No return.","(11:17) Case Keenum incomplete pass to the right intended for Tavon Austin.","(12:03) Case Keenum pass to the left to Lance Kendricks for 6 yards to the LA31. Tackled by NaVorro Bowman.","(12:07) Case Keenum incomplete pass to the right intended for Tavon Austin.","(12:07) Bradley Pinion kicks off to the endzone. Touchback.","(12:07) Phil Dawson extra point is good.","(12:12) Blaine Gabbert pass to the left to Vance McDonald for 8 yards for a TOUCHDOWN.","(12:16) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(12:48) Carlos Hyde rush up the middle for a loss of 1 yard to the LA8. Tackled by William Hayes.","(13:18) Blaine Gabbert pass to the left to Quinton Patton for 35 yards to the LA7. Tackled by Alec Ogletree.","(13:33) Penalty: Illegal Shift on San Francisco -5 yards.","(14:16) Blaine Gabbert rush to the left for 1 yard to the LA37. Tackled by Alec Ogletree.","(14:20) Penalty: Pass Interference on Los Angeles (Trumaine Johnson) 12 yards.","(14:20) Penalty: False Start on San Francisco (Andrew Tiller) -5 yards.","(14:24) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(14:24) San Francisco 49ers timeout.","(15:00) Blaine Gabbert pass to the right to Jeremy Kerley for 17 yards to the LA45. Tackled by Lamarcus Joyner.","(0:23) Blaine Gabbert pass to the left to Quinton Patton for 13 yards to the SF38. Tackled by Coty Sensabaugh. FUMBLE, recovered by SF.","(0:58) Carlos Hyde rush up the middle for 2 yards to the SF25. Tackled by Michael Brockers and William Hayes.","(1:02) Blaine Gabbert incomplete pass to the left intended for Garrett Celek defensed by Alec Ogletree.","(1:10) Case Keenum pass intended for Lance Kendricks INTERCEPTED by Ray-Ray Armstrong and returned for 5 yards. Tackled by Greg Robinson.","(1:53) Todd Gurley rush to the left for 1 yard to the SF26. Tackled by Ray-Ray Armstrong.","(2:29) Case Keenum pass to the left to Tavon Austin for 5 yards to the SF27. Tackled by Jimmie Ward.","(3:12) Benny Cunningham rush to the right for 1 yard to the SF32. Tackled by Quinton Dial.","(3:52) Todd Gurley rush to the left for 5 yards to the SF33. Tackled by Mike Purcell.","(4:07) Bradley Pinion punts for 48 yards to LA34. Tavon Austin return for 28 yards to SF38. Tackled by Jaquiski Tartt.","(4:12) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(4:41) Carlos Hyde rush to the left for 4 yards to the SF18. Tackled by Michael Brockers.","(5:03) Carlos Hyde rush to the left for a loss of 2 yards to the SF14. Tackled by T.J. McDonald.","(5:11) Johnny Hekker punts for 47 yards to SF16. No return.","(5:43) Case Keenum pass to the right to Benny Cunningham for 7 yards to the LA37. Tackled by Jaquiski Tartt.","(6:00) Penalty: Illegal Use of Hands on Los Angeles (Cody Wichmann) -10 yards.","(6:35) Todd Gurley rush to the left for 2 yards to the LA40. Tackled by Antoine Bethea.","(7:12) Case Keenum pass to the right to Tavon Austin for no gain to the LA38. Tackled by Eric Reid.","(7:36) Todd Gurley rush up the middle for 10 yards to the LA38. Tackled by NaVorro Bowman.","(7:44) Bradley Pinion punts for 39 yards to LA28. No return.","(8:17) Blaine Gabbert pass to the left to Jeremy Kerley for a loss of 2 yards to the SF33. Tackled by T.J. McDonald.","(8:45) Carlos Hyde rush to the right for no gain to the SF35. Tackled by Cam Thomas.","(9:09) Carlos Hyde rush to the left for no gain to the SF35. Tackled by Robert Quinn.","(9:21) Johnny Hekker punts for 47 yards to SF31. Jeremy Kerley return for 4 yards to SF35. Tackled by Chase Reynolds.","(9:25) Case Keenum incomplete pass to the left intended for Kenny Britt defensed by Jimmie Ward.","(10:11) Case Keenum pass to the right to Tavon Austin for 5 yards to the LA22. Tackled by Jimmie Ward.","(10:16) Case Keenum incomplete pass to the right intended for Tavon Austin.","(10:26) Bradley Pinion punts for 52 yards to LA27. Tavon Austin - no return. Tackled by Jaquiski Tartt. Penalty: Holding on Los Angeles (Josh Forrest) -10 yards.","(10:33) Blaine Gabbert incomplete pass to the left intended for Jeremy Kerley.","(11:05) Carlos Hyde rush to the right for 3 yards to the SF21. Tackled by Alec Ogletree.","(11:08) Blaine Gabbert incomplete pass to the right intended for Vance McDonald defensed by Maurice Alexander.","(11:16) Johnny Hekker punts for 37 yards to SF18. No return.","(11:52) Case Keenum pass to the right to Brian Quick for 3 yards to the LA45. Tackled by Antoine Bethea.","(12:31) Todd Gurley rush to the left for a loss of 3 yards to the LA42. Tackled by NaVorro Bowman.","(13:04) Todd Gurley rush to the left for 4 yards to the LA45. Tackled by NaVorro Bowman.","(13:16) Bradley Pinion punts for 52 yards to LA33. Tavon Austin return for 8 yards to LA41. Tackled by Jaquiski Tartt.","(13:51) Blaine Gabbert pass to the left to Blaine Gabbert for a loss of 16 yards to the SF15. Tackled by T.J. McDonald.","(14:28) Blaine Gabbert pass to the left to Quinton Patton for 6 yards to the SF31. Tackled by Coty Sensabaugh.","(15:00) Carlos Hyde rush up the middle for no gain to the SF25. Tackled by William Hayes.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback.","(0:16) Blaine Gabbert rush up the middle for a loss of 1 yard to the SF25.","(0:22) Johnny Hekker punts for 44 yards to SF26. No return.","(0:22) San Francisco 49ers timeout.","(0:35) Case Keenum sacked at LA30 for a loss of 4 yards by Arik Armstead.","(0:40) Case Keenum incomplete pass to the right intended for Brian Quick.","(1:07) Case Keenum pass to the left to Todd Gurley for a loss of 5 yards to the LA34. Tackled by Ray-Ray Armstrong.","(1:16) Bradley Pinion punts for 40 yards to LA37. Tavon Austin return for 2 yards to LA39. Tackled by Aaron Burbridge.","(1:20) Blaine Gabbert incomplete pass to the right intended for Jeremy Kerley.","(2:00) Carlos Hyde rush to the left for 4 yards to the SF23. Tackled by Robert Quinn.","(2:00) Two Minute Warning.","(2:24) Carlos Hyde rush to the left for a loss of 1 yard to the SF19. Tackled by Coty Sensabaugh and Alec Ogletree.","(2:31) Johnny Hekker punts for 39 yards to SF20. No return.","(2:34) Case Keenum incomplete pass to the left intended for Tavon Austin.","(2:38) Case Keenum incomplete pass to the left intended for Tyler Higbee defensed by Ray-Ray Armstrong.","(3:17) Todd Gurley rush to the left for 2 yards to the LA41.","(3:30) Blaine Gabbert pass to the middle to Shaun Draughn for 11 yards to the LA39. Tackled by Dominique Easley. FUMBLE, recovered by LA (Trumaine Johnson). Tackled by Shaun Draughn.","(3:49) Blaine Gabbert pass to the left to Jeremy Kerley for 10 yards to the SF50. Tackled by Lamarcus Joyner.","(4:23) Shaun Draughn rush up the middle for 3 yards to the SF40. Tackled by Aaron Donald.","(4:54) Blaine Gabbert pass to the right to Carlos Hyde for 1 yard to the SF37. Tackled by Trumaine Johnson.","(4:59) Penalty: Roughing Passer on Los Angeles (Aaron Donald) 15 yards.","(5:26) Carlos Hyde rush to the left for 11 yards to the SF21. Tackled by Lamarcus Joyner.","(5:34) Johnny Hekker punts for 36 yards to SF10. No return.","(5:38) Case Keenum incomplete pass to the left intended for Tavon Austin defensed by Jimmie Ward.","(6:19) Todd Gurley rush up the middle for no gain to the SF46. Tackled by Quinton Dial and NaVorro Bowman.","(6:58) Todd Gurley rush to the right for 5 yards to the SF46. Tackled by NaVorro Bowman.","(7:36) Case Keenum pass to the right to Kenny Britt for 22 yards to the LA49. Tackled by Antoine Bethea.","(8:16) Tavon Austin rush to the right for 2 yards to the LA27. Tackled by Ahmad Brooks.","(8:16) Bradley Pinion kicks off to the endzone. Touchback.","(8:16) Phil Dawson extra point is good.","(8:21) Shaun Draughn rush to the left for 3 yards for a TOUCHDOWN.","(8:28) Blaine Gabbert rush up the middle for 9 yards to the LA6. Tackled by Mark Barron and Trumaine Johnson. Penalty: Holding on Los Angeles (Lamarcus Joyner) 3 yards.","(9:03) Shaun Draughn rush up the middle for 6 yards to the LA15. Tackled by Aaron Donald.","(9:37) Carlos Hyde rush to the left for no gain to the LA21. Tackled by Maurice Alexander.","(10:06) Blaine Gabbert pass to the left to Jeremy Kerley for 18 yards to the LA21. Tackled by Coty Sensabaugh.","(10:31) Blaine Gabbert pass to the right to Jeremy Kerley for 4 yards to the LA39. Tackled by T.J. McDonald.","(10:37) Blaine Gabbert incomplete pass to the left intended for Carlos Hyde.","(10:41) Blaine Gabbert incomplete pass to the left intended for Garrett Celek defensed by Mark Barron.","(11:00) Carlos Hyde rush to the left for 16 yards to the LA43. Tackled by Coty Sensabaugh.","(11:07) Case Keenum pass intended for Todd Gurley INTERCEPTED by NaVorro Bowman defensed by Quinton Dial. No return. Tackled by Rodger Saffold.","(11:36) Todd Gurley rush up the middle for 3 yards to the SF30. Tackled by Mike Purcell. Penalty: Taunting on Los Angeles (Todd Gurley) -15 yards.","(12:18) Todd Gurley rush to the right for 2 yards to the SF33. Tackled by NaVorro Bowman and Ray-Ray Armstrong.","(12:19) Los Angeles Rams timeout.","(12:57) Todd Gurley rush to the right for 5 yards to the SF35.","(13:34) Todd Gurley rush to the left for 2 yards to the SF40. Tackled by Eli Harold and DeForest Buckner.","(14:10) Case Keenum pass to the right to Kenny Britt for 22 yards to the SF42. Tackled by Jimmie Ward.","(14:13) Blaine Gabbert pass to the right to Torrey Smith for a loss of 2 yards to the LA36. Tackled by T.J. McDonald.","(14:31) Blaine Gabbert rush to the left for 2 yards to the LA34. Tackled by William Hayes.","(15:00) Shaun Draughn rush to the right for 1 yard to the LA36. Tackled by Alec Ogletree.","(0:14) Shaun Draughn rush to the right for 6 yards to the LA37. Tackled by Alec Ogletree.","(0:53) Carlos Hyde rush to the right for 18 yards to the LA43. Tackled by Alec Ogletree.","(1:14) Carlos Hyde rush to the right for 1 yard to the SF39. Tackled by T.J. McDonald.","(1:44) Blaine Gabbert pass to the right to Torrey Smith for 15 yards to the SF38. Tackled by Maurice Alexander.","(1:51) Johnny Hekker punts for 50 yards to SF23. No return.","(1:55) Case Keenum incomplete pass to the right intended for Tyler Higbee defensed by Tramaine Brock.","(2:36) Todd Gurley rush up the middle for 3 yards to the LA27. Tackled by Mike Purcell and Quinton Dial.","(3:19) Case Keenum pass to the left to Tavon Austin for 3 yards to the LA24. Tackled by Antoine Bethea.","(3:24) Bradley Pinion kicks off to the LA-6. Benny Cunningham return for 27 yards to LA21. Tackled by Michael Wilhoite.","(3:24) Phil Dawson extra point is good.","(3:30) Carlos Hyde rush up the middle for 11 yards for a TOUCHDOWN.","(4:02) Shaun Draughn rush up the middle for a loss of 1 yard to the LA11. Tackled by Lamarcus Joyner.","(4:35) Blaine Gabbert pass to the left to Shaun Draughn for 7 yards to the LA10. Tackled by Coty Sensabaugh.","(4:39) Blaine Gabbert incomplete pass to the left intended for Garrett Celek defensed by Mark Barron.","(5:02) Carlos Hyde rush up the middle for 4 yards to the LA17. Tackled by Aaron Donald.","(5:10) Blaine Gabbert rush to the left for 11 yards to the LA26. Tackled by Mark Barron. Penalty: Holding on Los Angeles (Lamarcus Joyner) 5 yards.","(5:44) Blaine Gabbert pass to the right to Carlos Hyde for 4 yards to the LA37. Tackled by Lamarcus Joyner.","(6:14) Blaine Gabbert rush up the middle for 5 yards to the LA41. Tackled by Alec Ogletree.","(6:20) Blaine Gabbert incomplete pass to the right intended for Jeremy Kerley.","(6:42) Blaine Gabbert pass to the right to Jeremy Kerley for 6 yards to the LA46. Tackled by Trumaine Johnson.","(6:53) Johnny Hekker punts for 54 yards to SF41. Jeremy Kerley return for 7 yards to SF48. Tackled by Chase Reynolds.","(7:30) Case Keenum sacked at LA5 for a loss of 6 yards by Ahmad Brooks.","(8:14) Todd Gurley rush to the right for 1 yard to the LA11. Tackled by Mike Purcell.","(8:55) Todd Gurley rush to the left for 1 yard to the LA10. Tackled by Quinton Dial.","(9:02) Bradley Pinion punts for 52 yards to LA9. No return.","(9:38) Blaine Gabbert pass to the left to Quinton Patton for 1 yard to the SF39. Tackled by Lamarcus Joyner.","(10:04) Blaine Gabbert pass to the left to Quinton Patton for 5 yards to the SF38. Tackled by Coty Sensabaugh.","(10:32) Blaine Gabbert rush to the left for 3 yards to the SF33. Tackled by Coty Sensabaugh.","(10:57) Blaine Gabbert rush up the middle for 11 yards to the SF30.","(11:00) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(11:20) Carlos Hyde rush to the left for 1 yard to the SF19. Tackled by Coty Sensabaugh and Mark Barron.","(11:28) Johnny Hekker punts for 28 yards to SF18. No return.","(11:32) Case Keenum incomplete pass to the right intended for Tavon Austin.","(11:36) Case Keenum incomplete pass to the right intended for Tavon Austin.","(11:40) Case Keenum incomplete pass to the left intended for Todd Gurley.","(12:25) Case Keenum rush to the right for 6 yards to the SF46. Tackled by Tramaine Brock.","(13:00) Case Keenum pass to the middle to Lance Kendricks for 9 yards to the LA48. Tackled by Gerald Hodges Jr..","(13:36) Case Keenum pass to the left to Kenny Britt for 8 yards to the LA39. Tackled by DeForest Buckner and Tramaine Brock.","(14:17) Case Keenum pass to the right to Tyler Higbee for 2 yards to the LA31. Tackled by Tank Carradine and Eric Reid.","(15:00) Todd Gurley rush to the right for 4 yards to the LA29. Tackled by Gerald Hodges Jr. and DeForest Buckner.","(15:00) Bradley Pinion kicks off to the endzone. Touchback."]