["(0:14) Aaron Rodgers rush up the middle for a loss of 1 yard to the GB14.","(0:23) Blake Bortles pass to the right to Allen Hurns for a loss of 1 yard to the GB15. Tackled by Damarious Randall.","(0:23) Green Bay Packers timeout.","(0:27) Blake Bortles incomplete pass to the right intended for Rashad Greene.","(0:47) Blake Bortles pass to the left to Rashad Greene for 9 yards to the GB14. Tackled by Quinten Rollins.","(0:52) Blake Bortles incomplete pass to the left intended for Allen Robinson defensed by Quinten Rollins.","(1:15) Blake Bortles pass to the middle to Allen Robinson for 22 yards to the GB23. Tackled by Ha Ha Clinton-Dix. FUMBLE, recovered by Jax (Allen Robinson).","(1:43) Blake Bortles pass to the middle to T.J. Yeldon for 6 yards to the GB45. Tackled by Morgan Burnett.","(1:53) Penalty: Holding on Green Bay (Morgan Burnett) 5 yards.","(2:00) Penalty: Holding on Jacksonville (Luke Joeckel) -10 yards.","(2:00) Two Minute Warning.","(2:08) Blake Bortles pass to the left to T.J. Yeldon for 6 yards to the GB46. Tackled by Joe Thomas.","(2:08) Green Bay Packers timeout.","(2:14) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(2:39) T.J. Yeldon rush to the left for no gain to the Jax48. Tackled by Sam Shields.","(3:17) Blake Bortles pass to the left to Marcedes Lewis for 11 yards to the Jax48. Tackled by Ladarius Gunter.","(3:23) Jacob Schum punts for 34 yards to Jax47. No return. Penalty: Holding on Jacksonville (Jalen Ramsey) -10 yards.","(3:28) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(3:28) Penalty: Delay of Game on Green Bay (Aaron Rodgers) -5 yards.","(3:28) Green Bay Packers timeout.","(4:13) Eddie Lacy rush to the left for a loss of 2 yards to the GB24. Tackled by Telvin Smith.","(5:05) Aaron Rodgers rush to the left for 8 yards to the GB26. Tackled by Telvin Smith.","(5:12) Jason Myers kicks off to the GB4. Ty Montgomery return for 14 yards to GB18. Tackled by Arrelious Benn.","(5:17) Jason Myers 50 yard field goal attempt is GOOD. Holder: Brad Nortman.","(6:02) Blake Bortles sacked at GB32 for a loss of 2 yards by Nick Perry.","(6:02) Penalty: Delay of Game on Jacksonville (Blake Bortles) -5 yards.","(6:07) Blake Bortles incomplete pass to the left intended for Allen Robinson defensed by Ha Ha Clinton-Dix.","(6:50) T.J. Yeldon rush up the middle for 4 yards to the GB25. Tackled by Jake Ryan.","(7:29) Blake Bortles pass to the middle to Allen Robinson for 9 yards to the GB29. Tackled by Ladarius Gunter.","(7:29) Jacksonville Jaguars timeout.","(8:07) Blake Bortles pass to the left to Allen Robinson for 7 yards to the GB38. Tackled by Sam Shields.","(8:11) Blake Bortles incomplete pass to the right intended for T.J. Yeldon.","(8:11) Jacksonville Jaguars timeout.","(8:17) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Damarious Randall.","(8:45) Blake Bortles pass to the right to Allen Robinson for 4 yards to the GB45. Tackled by Damarious Randall.","(9:29) T.J. Yeldon rush up the middle for a loss of 2 yards to the GB49. Tackled by Nick Perry.","(10:10) T.J. Yeldon rush to the right for 2 yards to the GB47. Tackled by Morgan Burnett.","(10:45) T.J. Yeldon rush to the left for 6 yards to the GB49. Tackled by Dean Lowry.","(11:10) Blake Bortles pass to the left to Allen Robinson for 22 yards to the Jax45. Tackled by Morgan Burnett.","(11:52) Blake Bortles sacked at Jax23 for a loss of 8 yards by Morgan Burnett.","(12:01) Mason Crosby kicks off to the Jax-1. Corey Grant return for 32 yards to Jax31. Tackled by Damarious Randall.","(12:04) Mason Crosby 20 yard field goal attempt is GOOD. Holder: Jacob Schum.","(12:47) James Starks rush up the middle for no gain to the Jax2. Tackled by Jared Odrick and Dante Fowler Jr..","(13:31) Eddie Lacy rush up the middle for 1 yard to the Jax2. Tackled by Johnathan Cyprien.","(14:12) Eddie Lacy rush up the middle for 3 yards to the Jax3. Tackled by Johnathan Cyprien.","(14:54) Randall Cobb rush to the right for 4 yards to the Jax6. Tackled by Paul Posluszny.","(15:00) Penalty: Offside on Jacksonville (Malik Jackson) 5 yards.","(15:00) Aaron Rodgers incomplete pass to the left intended for Randall Cobb.","(0:19) Eddie Lacy rush up the middle for 2 yards to the Jax15. Tackled by Johnathan Cyprien.","(0:19) Jacksonville Jaguars timeout.","(0:56) Eddie Lacy rush to the right for 28 yards to the Jax17. Tackled by Johnathan Cyprien.","(1:28) Eddie Lacy rush up the middle for 3 yards to the Jax45. Tackled by Dante Fowler Jr..","(1:36) Penalty: Holding on Jacksonville (Prince Amukamara) 4 yards.","(1:45) Aaron Rodgers incomplete pass to the left intended for Richard Rodgers.","(2:24) Aaron Rodgers rush up the middle for 3 yards to the GB48. Tackled by Jared Odrick.","(3:01) Aaron Rodgers pass to the left to Jared Abbrederis for 8 yards to the GB45. Tackled by Prince Amukamara.","(3:41) Randall Cobb rush to the left for 1 yard to the GB37. Tackled by Jared Odrick.","(4:26) Aaron Rodgers pass to the left to Randall Cobb for 4 yards to the GB36. Tackled by Tashaun Gipson.","(5:35) Aaron Rodgers pass to the left to Jared Cook for 7 yards to the GB32. Tackled by Jalen Ramsey.","(6:15) Aaron Rodgers sacked at GB25 for no gain by Jared Odrick.","(6:15) Jason Myers kicks off to the endzone. Touchback.","(6:19) Jason Myers 39 yard field goal attempt is GOOD. Holder: Brad Nortman.","(6:24) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(6:30) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(7:09) Denard Robinson rush to the left for 3 yards to the GB21. Tackled by Blake Martinez.","(7:41) Denard Robinson rush up the middle for 2 yards to the GB24. Tackled by Clay Matthews.","(8:18) T.J. Yeldon rush up the middle for 5 yards to the GB26. Tackled by Blake Martinez.","(8:54) T.J. Yeldon rush up the middle for 3 yards to the GB31. Tackled by Jake Ryan.","(9:29) Blake Bortles pass to the right to Allen Hurns for 38 yards to the GB34. Tackled by Ha Ha Clinton-Dix.","(9:33) Blake Bortles incomplete pass to the right intended for T.J. Yeldon.","(10:12) Blake Bortles rush to the left for 3 yards to the Jax28. Tackled by Jake Ryan.","(10:12) Mason Crosby kicks off to the endzone. Touchback.","(10:14) Mason Crosby 25 yard field goal attempt is GOOD. Holder: Jacob Schum.","(10:40) Aaron Rodgers pass to the left to Randall Cobb for no gain to the Jax7. Tackled by Prince Amukamara.","(10:46) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(11:20) Aaron Rodgers pass to the right to Jordy Nelson for 1 yard to the Jax7. Tackled by Dwayne Gratz.","(11:40) Aaron Rodgers pass to the left to Richard Rodgers for 22 yards to the Jax8. Tackled by Johnathan Cyprien.","(11:44) Aaron Rodgers incomplete pass to the left intended for Randall Cobb.","(12:21) James Starks rush up the middle for 1 yard to the Jax30. Tackled by Johnathan Cyprien.","(13:08) Aaron Rodgers pass to the right to Randall Cobb for 32 yards to the Jax31. Tackled by Johnathan Cyprien.","(13:16) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(13:22) Aaron Rodgers incomplete pass to the right intended for Eddie Lacy.","(13:58) Aaron Rodgers pass to the right to Jordy Nelson for 8 yards to the GB37. Tackled by Davon House.","(14:32) Aaron Rodgers pass to the left to Jordy Nelson for 3 yards to the GB29. Tackled by Johnathan Cyprien.","(15:00) Eddie Lacy rush up the middle for 6 yards to the GB26. Tackled by Paul Posluszny and Telvin Smith.","(15:00) Penalty: Delay of Game on Green Bay (Aaron Rodgers) -5 yards.","(15:00) Jason Myers kicks off to the endzone. Touchback.","(0:13) Blake Bortles rush up the middle for a loss of 1 yard to the Jax24.","(0:13) Mason Crosby kicks off to the endzone. Touchback.","(0:13) Mason Crosby extra point is good.","(0:20) Aaron Rodgers pass to the right to Davante Adams for 29 yards for a TOUCHDOWN.","(0:27) Aaron Rodgers incomplete pass to the left intended for Jared Cook.","(0:28) Aaron Rodgers incomplete pass to the middle.","(0:42) Aaron Rodgers pass to the left to Randall Cobb for 10 yards to the Jax29. Tackled by Jalen Ramsey.","(1:02) Aaron Rodgers pass to the right to James Starks for 6 yards to the Jax39. Tackled by Johnathan Cyprien.","(1:09) Penalty: Pass Interference on Jacksonville (Johnathan Cyprien) 30 yards.","(1:09) Jason Myers kicks off to the endzone. Touchback.","(1:09) Jason Myers extra point is good.","(1:14) Blake Bortles pass to the right to Julius Thomas for 22 yards for a TOUCHDOWN.","(1:19) Blake Bortles incomplete pass to the middle intended for Allen Hurns defensed by Jake Ryan.","(1:52) T.J. Yeldon rush up the middle for no gain to the GB22. Tackled by Morgan Burnett.","(2:00) Blake Bortles pass to the right to Allen Hurns for 30 yards to the GB22. Tackled by Quinten Rollins.","(2:00) Two Minute Warning.","(2:31) Blake Bortles pass to the left to Julius Thomas for 10 yards to the Jax48. Tackled by Morgan Burnett.","(3:00) Blake Bortles pass to the left to T.J. Yeldon for 11 yards to the Jax38. Tackled by Blake Martinez.","(3:00) Green Bay Packers timeout.","(3:05) Denard Robinson rush up the middle for 2 yards to the Jax27. Tackled by Jake Ryan.","(3:05) Mason Crosby kicks off to the endzone. Touchback.","(3:05) Mason Crosby extra point is good.","(3:14) Aaron Rodgers pass to the right to Jordy Nelson for 6 yards for a TOUCHDOWN.","(3:46) Aaron Rodgers pass to the right to Jordy Nelson for 6 yards to the Jax6. Tackled by Davon House.","(4:27) Aaron Rodgers pass to the right to Eddie Lacy for 17 yards to the Jax12. Tackled by Tashaun Gipson.","(5:00) Aaron Rodgers pass to the right to Jordy Nelson for 8 yards to the Jax29. Tackled by Paul Posluszny.","(5:34) Aaron Rodgers pass to the left to Davante Adams for 5 yards to the Jax37. Tackled by Jalen Ramsey and Yannick Ngakoue.","(5:34) Green Bay Packers timeout.","(6:12) Aaron Rodgers pass to the left to Davante Adams for 16 yards to the Jax42.","(6:49) Eddie Lacy rush up the middle for 6 yards to the GB42. Tackled by Telvin Smith.","(7:16) Randall Cobb rush up the middle for 6 yards to the GB36. Tackled by Dan Skuta.","(7:48) Eddie Lacy rush to the right for 5 yards to the GB30. Tackled by Paul Posluszny.","(7:48) Jason Myers kicks off to the endzone. Touchback.","(7:52) Jason Myers 26 yard field goal attempt is GOOD. Holder: Brad Nortman.","(8:33) Blake Bortles pass to the right to T.J. Yeldon for 7 yards to the GB8. Tackled by Damarious Randall.","(8:33) Jacksonville Jaguars timeout.","(8:38) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(9:24) T.J. Yeldon rush up the middle for a loss of 1 yard to the GB15. Tackled by Christian Ringo.","(10:05) T.J. Yeldon rush up the middle for 3 yards to the GB14. Tackled by Damarious Randall.","(10:33) Blake Bortles pass to the left to Allen Hurns for 8 yards to the GB17. Tackled by Sam Shields.","(11:09) T.J. Yeldon rush up the middle for 1 yard to the GB25. Tackled by Jake Ryan and Morgan Burnett.","(11:47) Blake Bortles pass to the right to Julius Thomas for 14 yards to the GB26. Tackled by Morgan Burnett.","(12:12) Blake Bortles pass to the right to Allen Robinson for 8 yards to the GB40. Tackled by Morgan Burnett.","(12:55) Blake Bortles pass to the left to Marqise Lee for 12 yards to the GB48. Tackled by Joe Thomas.","(13:01) Blake Bortles incomplete pass to the right intended for Marqise Lee.","(13:40) T.J. Yeldon rush up the middle for a loss of 2 yards to the Jax40. Tackled by Mike Daniels.","(13:40) Penalty: False Start on Jacksonville (Allen Hurns) -5 yards.","(13:51) Jacob Schum punts for 46 yards to Jax47. No return.","(13:56) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(14:21) Penalty: Offside on Jacksonville (Dante Fowler Jr.) 5 yards.","(14:56) Eddie Lacy rush to the left for a loss of 1 yard to the GB2. Tackled by Telvin Smith.","(15:00) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(0:09) Brad Nortman punts for 67 yards to GB3. No return.","(0:46) Blake Bortles pass to the left to Julius Thomas for 9 yards to the Jax30. Tackled by Micah Hyde.","(1:28) T.J. Yeldon rush to the right for a loss of 7 yards to the Jax21. Tackled by Clay Matthews.","(2:10) T.J. Yeldon rush up the middle for 7 yards to the Jax28. Tackled by Blake Martinez and Kenny Clark.","(2:17) Jacob Schum punts for 48 yards to Jax21. No return.","(2:27) Aaron Rodgers incomplete pass to the left intended for Davante Adams defensed by Prince Amukamara.","(3:05) James Starks rush up the middle for 4 yards to the GB31. Tackled by Yannick Ngakoue.","(3:40) James Starks rush to the left for 2 yards to the GB27. Tackled by Sen'Derrick Marks.","(3:40) Jason Myers kicks off to the endzone. Touchback.","(3:40) Jason Myers extra point is good.","(3:43) T.J. Yeldon rush up the middle for 5 yards for a TOUCHDOWN.","(4:22) T.J. Yeldon rush up the middle for 6 yards to the GB5. Tackled by Jake Ryan.","(4:22) Jacksonville Jaguars timeout.","(5:04) Blake Bortles pass to the left to Marcedes Lewis for 37 yards to the GB11. Tackled by Damarious Randall.","(5:16) Jacob Schum punts for 56 yards to Jax38. Rashad Greene return for 14 yards to GB48. Tackled by Blake Martinez.","(5:21) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(5:27) Aaron Rodgers incomplete pass to the left intended for Richard Rodgers.","(5:56) Eddie Lacy rush up the middle for 3 yards to the GB6. Tackled by Paul Posluszny.","(6:06) Brad Nortman punts for 58 yards to GB3. No return.","(6:43) Blake Bortles sacked at Jax39 for a loss of 10 yards by Clay Matthews.","(7:12) Blake Bortles pass to the left to Marqise Lee for 10 yards to the Jax49. Tackled by Ha Ha Clinton-Dix.","(7:52) T.J. Yeldon rush up the middle for a loss of 2 yards to the Jax39. Tackled by Letroy Guion.","(8:21) Blake Bortles pass to the right to Julius Thomas for 9 yards to the Jax41. Tackled by Ha Ha Clinton-Dix.","(8:49) Penalty: Offside on Green Bay (Mike Daniels) 5 yards.","(8:55) Penalty: Pass Interference on Green Bay (Morgan Burnett) 4 yards.","(9:00) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Damarious Randall.","(9:36) T.J. Yeldon rush to the right for a loss of 2 yards to the Jax23. Tackled by Letroy Guion.","(9:36) Mason Crosby kicks off to the endzone. Touchback.","(9:36) Mason Crosby extra point is good.","(9:45) Aaron Rodgers rush to the right for 6 yards for a TOUCHDOWN.","(10:29) Eddie Lacy rush to the right for no gain to the Jax6. Tackled by Jared Odrick and Telvin Smith.","(10:33) Eddie Lacy rush up the middle for 9 yards to the Jax11. Tackled by Tashaun Gipson. Penalty: Too Many Men on Field on Jacksonville (Dante Fowler Jr.) 5 yards.","(11:29) Aaron Rodgers pass to the right to Randall Cobb for 6 yards to the Jax20. Tackled by Telvin Smith.","(12:07) Aaron Rodgers pass to the right to Randall Cobb for 5 yards to the Jax26. Tackled by Telvin Smith.","(12:41) Eddie Lacy rush to the left for a loss of 2 yards to the Jax31. Tackled by Dante Fowler Jr..","(12:53) Blake Bortles pass intended for Marqise Lee INTERCEPTED by Joe Thomas defensed by Quinten Rollins and returned for 9 yards. Tackled by Brandon Linder. FUMBLE, recovered by GB (Micah Hyde).","(13:30) T.J. Yeldon rush to the left for 2 yards to the Jax31. Tackled by Nick Perry.","(13:37) Blake Bortles incomplete pass to the right intended for Allen Robinson.","(14:16) T.J. Yeldon rush to the right for 5 yards to the Jax29. Tackled by Blake Martinez.","(14:56) T.J. Yeldon rush up the middle for 6 yards to the Jax24. Tackled by Jake Ryan.","(15:00) Mason Crosby kicks off to the Jax-1. Corey Grant return for 19 yards to Jax18. Tackled by Kyler Fackrell."]