["(0:14) Tom Brady rush up the middle for a loss of 1 yard to the NE23.","(0:23) Trevor Siemian pass to the left to Jordan Norwood for 12 yards to the NE30. Tackled by Kyle Van Noy. FUMBLE, recovered by NE (Devin McCourty) and returned for 3 yards. Tackled by Jordan Norwood.","(0:43) Trevor Siemian incomplete pass to the right intended for Devontae Booker. Penalty: Intentional Grounding on Denver (Trevor Siemian) -14 yards.","(1:03) Trevor Siemian pass to the middle to Devontae Booker for 14 yards to the NE28. Tackled by Kyle Van Noy and Dont'a Hightower.","(1:23) Trevor Siemian pass to the right to A.J. Derby for 12 yards to the NE42. Tackled by Devin McCourty.","(1:28) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(1:54) Trevor Siemian pass to the right to Emmanuel Sanders for 20 yards to the Den46. Tackled by Patrick Chung.","(2:00) LeGarrette Blount rush up the middle for no gain to the Den26. Tackled by Von Miller and Todd Davis.","(2:00) Two Minute Warning.","(2:16) LeGarrette Blount rush to the right for 1 yard to the Den26. Tackled by Corey Nelson and Zaire Anderson.","(2:59) LeGarrette Blount rush to the left for 4 yards to the Den27. Tackled by Billy Winn and Todd Davis.","(3:42) LeGarrette Blount rush to the right for 2 yards to the Den31. Tackled by Todd Davis and Darian Stewart.","(3:46) Tom Brady incomplete pass to the right intended for Julian Edelman. Penalty: Unnecessary Roughness on Denver (T.J. Ward) 15 yards.","(3:46) Denver Broncos timeout.","(3:51) LeGarrette Blount rush to the left for 2 yards to the Den48. Tackled by Darian Stewart and Corey Nelson.","(3:51) Denver Broncos timeout.","(3:58) LeGarrette Blount rush up the middle for 5 yards to the NE50. Tackled by Todd Davis.","(4:40) Dion Lewis rush up the middle for 8 yards to the NE45. Tackled by Jared Crick.","(4:40) New England Patriots timeout.","(5:26) LeGarrette Blount rush to the left for 2 yards to the NE37. Tackled by Todd Davis and Shaquil Barrett.","(5:30) Penalty: Holding on Denver (Von Miller) 5 yards.","(5:58) LeGarrette Blount rush to the left for no gain to the NE30. Tackled by Jared Crick and Shaquil Barrett.","(6:04) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas defensed by Devin McCourty.","(6:35) Trevor Siemian pass to the left to Demaryius Thomas for 13 yards to the NE30. Tackled by Logan Ryan.","(7:19) Trevor Siemian sacked at NE43 for a loss of 5 yards by Trey Flowers.","(7:24) Trevor Siemian incomplete pass to the right intended for A.J. Derby defensed by Alan Branch.","(7:52) Trevor Siemian pass to the middle to Emmanuel Sanders for 21 yards to the NE38. Tackled by Malcolm Butler.","(8:16) Trevor Siemian pass to the right to A.J. Derby for 16 yards to the Den41. Tackled by Logan Ryan.","(8:16) Stephen Gostkowski kicks off to the endzone. Touchback.","(8:19) Stephen Gostkowski 21 yard field goal attempt is GOOD. Holder: Ryan Allen.","(8:24) Tom Brady incomplete pass to the middle intended for Julian Edelman.","(9:07) James White rush to the right for 2 yards to the Den3. Tackled by Von Miller and Justin Simmons.","(9:49) LeGarrette Blount rush up the middle for no gain to the Den5. Tackled by T.J. Ward and Sylvester Williams.","(10:21) Tom Brady pass to the left to Malcolm Mitchell for 14 yards to the Den5. Tackled by Darian Stewart.","(10:56) Tom Brady pass to the left to Martellus Bennett for 34 yards to the Den19. Tackled by Todd Davis.","(11:02) Riley Dixon punts for 46 yards to NE47. No return.","(11:34) Trevor Siemian sacked at Den7 for a loss of 14 yards by Malcom Brown.","(12:09) Devontae Booker rush up the middle for 2 yards to the Den21. Tackled by Malcom Brown.","(12:33) Trevor Siemian pass to the right to Emmanuel Sanders for 7 yards to the Den19.","(12:46) Ryan Allen punts for 49 yards to Den12. No return.","(13:27) Tom Brady pass to the right to James White for 4 yards to the NE39. Tackled by Todd Davis.","(13:31) Tom Brady incomplete pass to the middle intended for James White.","(13:39) Tom Brady incomplete pass to the right.","(13:52) Riley Dixon punts for 58 yards to NE30. Julian Edelman return for 5 yards to NE35. Tackled by Quentin Gause.","(14:00) Trevor Siemian incomplete pass to the left intended for Justin Forsett.","(14:36) Justin Forsett rush up the middle for 1 yard to the Den12. Tackled by Rob Ninkovich.","(15:00) Trevor Siemian rush to the left for 4 yards to the Den11.","(0:07) Ryan Allen punts for 43 yards to Den7. No return.","(0:11) Tom Brady incomplete pass to the middle intended for Chris Hogan.","(0:48) James White rush up the middle for 1 yard to the NE50. Tackled by Jared Crick.","(1:17) Dion Lewis rush up the middle for 4 yards to the NE49. Tackled by Jared Crick.","(1:39) Dion Lewis rush to the right for 5 yards to the NE45. Tackled by Corey Nelson.","(2:14) Dion Lewis rush up the middle for 5 yards to the NE40. Tackled by Jared Crick.","(2:58) Tom Brady pass to the left to James White for 16 yards to the NE35. Tackled by Darian Stewart.","(3:44) James White rush up the middle for 8 yards to the NE19. Tackled by Von Miller and Darian Stewart.","(4:25) Dion Lewis rush up the middle for 6 yards to the NE11. Tackled by Aqib Talib and Corey Nelson.","(4:38) Penalty: False Start on New England (Marcus Cannon) -5 yards.","(4:38) Riley Dixon punts for 52 yards to NE20. Julian Edelman - no return. Tackled by Cody Latimer. Penalty: Holding on New England (Brandon Bolden) -10 yards.","(4:44) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas defensed by Eric Rowe.","(5:16) Devontae Booker rush up the middle for 3 yards to the Den28. Tackled by Alan Branch and Kyle Van Noy.","(5:27) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(5:28) Stephen Gostkowski kicks off to the endzone. Touchback.","(5:32) Stephen Gostkowski 40 yard field goal attempt is GOOD. Holder: Ryan Allen.","(5:36)  FUMBLE, recovered by NE (Tom Brady). Tom Brady incomplete pass to the middle intended for Julian Edelman.","(6:16) LeGarrette Blount rush up the middle for 4 yards to the Den22. Tackled by Adam Gotsis.","(6:52) LeGarrette Blount rush up the middle for 2 yards to the Den26. Tackled by Adam Gotsis and T.J. Ward.","(7:29) Tom Brady pass to the left to Julian Edelman for 17 yards to the Den28. Tackled by Will Parks.","(7:29) New England Patriots timeout.","(8:10) Dion Lewis rush to the left for 4 yards to the Den45. Tackled by Todd Davis.","(8:16) Tom Brady incomplete pass to the right intended for Julian Edelman defensed by Corey Nelson.","(8:42) Tom Brady pass to the right to Chris Hogan for 18 yards to the Den49. Tackled by Chris Harris Jr..","(9:19) Tom Brady pass to the middle to Julian Edelman for 8 yards to the NE33. Tackled by Corey Nelson.","(10:02) Tom Brady pass to the left to Dion Lewis for 4 yards to the NE25. Tackled by Corey Nelson.","(10:02) Denver Broncos timeout.","(10:40) Dion Lewis rush up the middle for 4 yards to the NE21. Tackled by Shaquil Barrett.","(10:49) Riley Dixon punts for 42 yards to NE17. No return.","(11:25) Trevor Siemian pass to the right to Demaryius Thomas for 12 yards to the Den41. Tackled by Dont'a Hightower and Jabaal Sheard.","(11:29) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas.","(11:54) Penalty: Holding on Denver (Russell Okung) -10 yards.","(12:16) Justin Forsett rush to the left for 2 yards to the Den39. Tackled by Malcom Brown.","(12:27) Ryan Allen punts for 49 yards to Den32. Jordan Norwood return for 5 yards to Den37. Tackled by Barkevious Mingo.","(12:43) Tom Brady sacked at NE19 for a loss of 7 yards by Shane Ray.","(12:48) Tom Brady incomplete pass to the left intended for Martellus Bennett.","(13:29) LeGarrette Blount rush up the middle for 1 yard to the NE26. Tackled by T.J. Ward.","(13:39) Riley Dixon punts for 58 yards to NE9. Julian Edelman return for 16 yards to NE25. Tackled by Cody Latimer.","(13:46) Trevor Siemian incomplete pass to the right intended for A.J. Derby defensed by Patrick Chung.","(14:29) Trevor Siemian pass to the right to Demaryius Thomas for 8 yards to the Den33. Tackled by Logan Ryan.","(14:54) Trevor Siemian sacked at Den25 for a loss of 6 yards by Jabaal Sheard.","(15:00) Stephen Gostkowski kicks off to the Den0. Cody Latimer return for 31 yards to Den31. Tackled by Nate Ebner.","(0:32) Justin Forsett rush to the left for 7 yards to the Den27. Tackled by Devin McCourty.","(0:39) Ryan Allen punts for 51 yards to Den0. Touchback.","(1:20) Tom Brady pass to the right to Martellus Bennett for 1 yard to the NE49. Tackled by T.J. Ward.","(1:27) Tom Brady incomplete pass to the right intended for Dion Lewis.","(1:32) Tom Brady pass to the right to Dion Lewis for 5 yards to the NE48. Tackled by Aqib Talib.","(1:56) Dion Lewis rush to the right for 13 yards to the NE43. Tackled by Aqib Talib.","(2:00) Tom Brady incomplete pass to the middle intended for Julian Edelman.","(2:00) Two Minute Warning.","(2:06) Tom Brady pass to the left to Julian Edelman for 6 yards to the NE30. Tackled by Chris Harris Jr. and Darian Stewart.","(2:44) Dion Lewis rush up the middle for 3 yards to the NE24. Tackled by Justin Simmons.","(2:44) New England Patriots timeout.","(3:24) LeGarrette Blount rush up the middle for 2 yards to the NE21. Tackled by Adam Gotsis.","(3:58) Tom Brady pass to the middle to James White for 4 yards to the NE19. Tackled by T.J. Ward.","(4:38) Dion Lewis rush up the middle for 4 yards to the NE15. Tackled by Derek Wolfe and Corey Nelson.","(5:14) LeGarrette Blount rush to the left for 3 yards to the NE11. Tackled by Corey Nelson.","(5:20) Riley Dixon punts for 29 yards to NE8. No return.","(5:56) Trevor Siemian pass to the right to Justin Forsett for a loss of 6 yards to the NE37. Tackled by Kyle Van Noy.","(6:04) Trevor Siemian incomplete pass to the right intended for Jeff Heuerman.","(6:40) Trevor Siemian pass to the right to Devontae Booker for 2 yards to the NE31. Tackled by Patrick Chung.","(7:10) Trevor Siemian pass to the left to Jordan Taylor for 15 yards to the NE33. Tackled by Eric Rowe.","(7:54) Trevor Siemian sacked at NE48 for a loss of 6 yards by Trey Flowers.","(8:19) Devontae Booker rush up the middle for 4 yards to the NE42. Tackled by Jabaal Sheard and Shea McClellin.","(8:49) Trevor Siemian pass to the left to Demaryius Thomas for 16 yards to the NE46. Tackled by Duron Harmon.","(9:29) Justin Forsett rush to the left for 2 yards to the Den38. Tackled by Chris Long.","(9:34) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(9:40) Penalty: Offside on New England (Chris Long) 5 yards.","(10:19) Justin Forsett rush to the left for a loss of 1 yard to the Den31. Tackled by Alan Branch.","(10:55) Trevor Siemian pass to the right to Justin Forsett for 8 yards to the Den32. Tackled by Logan Ryan and Jabaal Sheard.","(11:01) Stephen Gostkowski kicks off to the Den3. Cody Latimer return for 21 yards to Den24. Tackled by Brandon Bolden.","(11:01) Stephen Gostkowski extra point is good.","(11:05) LeGarrette Blount rush up the middle for 1 yard for a TOUCHDOWN.","(11:39) Dion Lewis rush up the middle for 2 yards to the Den1. Tackled by Darian Stewart. FUMBLE, recovered by NE (Dion Lewis).","(12:10) Tom Brady pass to the right to James Develin for 13 yards to the Den3. Tackled by Aqib Talib.","(12:51) Tom Brady pass to the middle to Julian Edelman for 12 yards to the Den16. Tackled by Corey Nelson.","(13:16) Tom Brady pass to the right to Julian Edelman for 15 yards to the Den28. Tackled by Corey Nelson.","(13:37) Penalty: Holding on New England (David Andrews) -10 yards.","(14:05) Tom Brady pass to the left to Julian Edelman for 17 yards to the Den33. Tackled by Corey Nelson.","(14:50) Tom Brady sacked at NE50 for a loss of 4 yards by Jared Crick. FUMBLE, recovered by NE (Joe Thuney).","(15:00) Trevor Siemian pass intended for Emmanuel Sanders INTERCEPTED by Logan Ryan and returned for 46 yards. Tackled by Demaryius Thomas.","(0:32) Trevor Siemian pass to the right to A.J. Derby for 6 yards to the NE14. Tackled by Devin McCourty.","(1:15) Devontae Booker rush up the middle for 1 yard to the NE20. Tackled by Shea McClellin.","(1:36) Trevor Siemian pass to the left to Demaryius Thomas for 12 yards to the NE21. Tackled by Eric Rowe.","(2:01) Devontae Booker rush up the middle for 5 yards to the NE33. Tackled by Kyle Van Noy.","(2:32) Devontae Booker rush up the middle for 2 yards to the NE38. Tackled by Trey Flowers.","(3:05) Trevor Siemian pass to the right to Jeff Heuerman for 9 yards to the NE40. Tackled by Logan Ryan.","(3:36) Trevor Siemian pass to the left to Jeff Heuerman for 31 yards to the NE49. Tackled by Devin McCourty.","(3:40) Trevor Siemian incomplete pass to the right intended for Jeff Heuerman.","(4:12) Justin Forsett rush up the middle for 6 yards to the Den20. Tackled by Kyle Van Noy.","(4:45) Trevor Siemian pass to the right to Demaryius Thomas for 7 yards to the Den14. Tackled by Logan Ryan.","(4:51) Ryan Allen punts for 37 yards to Den7. No return.","(4:56) Tom Brady incomplete pass to the left intended for James White.","(5:33) Dion Lewis rush to the left for no gain to the Den44. Tackled by Jared Crick.","(5:55) Tom Brady incomplete pass to the middle intended for Martellus Bennett.","(5:55) Dion Lewis rush up the middle for 4 yards to the Den49. Tackled by Corey Nelson and Todd Davis. Penalty: Holding on Denver (Sylvester Williams) 5 yards.","(6:26) Dion Lewis rush up the middle for 8 yards to the NE47. Tackled by Todd Davis and T.J. Ward.","(6:58) Dion Lewis rush up the middle for 14 yards to the NE39. Tackled by Todd Davis and Aqib Talib.","(6:58) Brandon McManus kicks off to the endzone. Touchback.","(7:02) Brandon McManus 33 yard field goal attempt is GOOD. Holder: Riley Dixon.","(7:07) Trevor Siemian incomplete pass to the right intended for Devontae Booker.","(7:49) Justin Forsett rush to the left for no gain to the NE15. Tackled by Dont'a Hightower.","(8:16) Trevor Siemian pass to the right to Justin Forsett for 5 yards to the NE15. Tackled by Devin McCourty and Jonathan Jones.","(8:41) Trevor Siemian pass to the right to Demaryius Thomas for 23 yards to the NE20. Tackled by Jonathan Jones.","(9:05) Trevor Siemian pass to the left to Virgil Green for 9 yards to the NE43. Tackled by Chris Long.","(9:30) Justin Forsett rush to the left for 1 yard to the Den48. Tackled by Malcom Brown and Alan Branch.","(9:53) Trevor Siemian pass to the left to Justin Forsett for 9 yards to the Den47. Tackled by Jonathan Jones.","(10:00) Ryan Allen punts for 45 yards to Den38. No return.","(10:04) Tom Brady incomplete pass to the right intended for James White.","(10:47) LeGarrette Blount rush up the middle for 4 yards to the NE17. Tackled by Derek Wolfe.","(11:18) LeGarrette Blount rush to the left for a loss of 2 yards to the NE13. Tackled by Todd Davis.","(11:27) Riley Dixon punts for 40 yards to NE15. No return.","(11:41) Trevor Siemian pass to the right to A.J. Derby for 1 yard to the Den45. Tackled by Logan Ryan.","(12:06) Justin Forsett rush to the left for 6 yards to the Den44. Tackled by Malcolm Butler.","(12:09) Trevor Siemian incomplete pass to the left intended for Virgil Green.","(12:27) Justin Forsett rush to the left for 13 yards to the Den38. Tackled by Malcolm Butler.","(12:27) Stephen Gostkowski kicks off to the endzone. Touchback.","(12:32) Stephen Gostkowski 45 yard field goal attempt is GOOD. Holder: Ryan Allen.","(13:08) Dion Lewis rush up the middle for 4 yards to the Den27. Tackled by Von Miller.","(13:12) Tom Brady incomplete pass to the right intended for James White defensed by Adam Gotsis.","(13:16) Tom Brady incomplete pass to the left intended for James White.","(13:30) Ryan Allen punts for 38 yards to Den31. Jordan Norwood - no return. FUMBLE, recovered by NE (Jonathan Jones). Tackled by Jordan Norwood.","(13:34) Tom Brady incomplete pass to the right intended for Julian Edelman defensed by Derek Wolfe.","(14:13) Dion Lewis rush to the left for 5 yards to the NE31. Tackled by Corey Nelson and DeMarcus Ware.","(14:55) Dion Lewis rush up the middle for 2 yards to the NE26. Tackled by Von Miller.","(15:00) Brandon McManus kicks off to the NE1. Dion Lewis return for 23 yards to NE24. Tackled by Dekoda Watson."]