["(0:34) Russell Wilson rush up the middle for a loss of 1 yard to the LA40.","(1:15) Russell Wilson rush up the middle for a loss of 1 yard to the LA39.","(1:57) Russell Wilson rush up the middle for a loss of 1 yard to the LA38.","(1:57) Two Minute Warning.","(2:02) Case Keenum pass to the left to Tavon Austin for 1 yard to the LA37. Tackled by DeAndre Elliott.","(2:07) Case Keenum incomplete pass to the right intended for Todd Gurley.","(2:11) Case Keenum incomplete pass to the middle intended for Tavon Austin defensed by Dewey McDonald.","(2:17) Case Keenum pass to the right to Mike Thomas for 6 yards to the LA36. Tackled by Deshawn Shead.","(2:38) Case Keenum pass to the left to Brian Quick for 16 yards to the LA30. Tackled by Neiko Thorpe.","(3:08) Case Keenum pass to the left to Brian Quick for 5 yards to the LA14. Tackled by Jeron Johnson and Kevin Pierre-Louis.","(3:18) Russell Wilson pass intended for Jermaine Kearse INTERCEPTED by Alec Ogletree and returned for 8 yards. Tackled by Luke Willson and Thomas Rawls.","(4:01) Thomas Rawls rush to the right for a loss of 7 yards to the LA24. Tackled by Ethan Westbrooks.","(4:45) Thomas Rawls rush to the left for a loss of 2 yards to the LA17. Tackled by T.J. McDonald.","(5:12) Penalty: Face Mask on Los Angeles (Aaron Donald) 15 yards. Penalty: Unsports. Conduct on Los Angeles (Aaron Donald) 15 yards.","(5:12) Penalty: False Start on Seattle (Germain Ifedi) -5 yards.","(5:22) Los Angeles Rams timeout.","(5:22) Jon Ryan rush up the middle for 26 yards to the LA47. FUMBLE, recovered by Sea (Neiko Thorpe).","(6:00) Russell Wilson pass to the left to Tyler Lockett for 8 yards to the Sea27. Tackled by Troy Hill and Cody Davis.","(6:35) Thomas Rawls rush to the right for a loss of 2 yards to the Sea19. Tackled by Mark Barron.","(7:19) Thomas Rawls rush to the left for 3 yards to the Sea21. Tackled by Dominique Easley and Cam Thomas.","(7:24) Case Keenum incomplete pass to the right intended for Tavon Austin.","(7:27) Case Keenum incomplete pass to the left intended for Todd Gurley.","(7:58) Penalty: Offside on Seattle (Frank Clark) 5 yards.","(8:37) Case Keenum pass to the left to Pharoh Cooper for 4 yards to the Sea23. Tackled by Jeremy Lane.","(9:11) Penalty: Holding on Los Angeles (Andrew Donnal) -10 yards.","(9:15) Jared Goff incomplete pass to the left intended for Brian Quick defensed by Deshawn Shead.","(10:00) Jared Goff pass to the left to Pharoh Cooper for 13 yards to the Sea17. Tackled by Deshawn Shead.","(10:44) Todd Gurley rush up the middle for no gain to the Sea30. Tackled by K.J. Wright and Kam Chancellor.","(11:21) Jared Goff pass to the left to Tavon Austin for 8 yards to the Sea30. Tackled by Jeremy Lane and Jarran Reed.","(12:02) Jared Goff pass to the middle to Tyler Higbee for 15 yards to the Sea38. Tackled by Cliff Avril and Deshawn Shead.","(12:44) Jared Goff pass to the right to Malcolm Brown for 12 yards to the LA47. Tackled by K.J. Wright and Cassius Marsh.","(12:49) Jared Goff incomplete pass to the right intended for Kenny Britt.","(13:17) Todd Gurley rush to the right for a loss of 2 yards to the LA35. Tackled by Michael Bennett.","(13:29) Penalty: Holding on Seattle 5 yards.","(13:32) Jared Goff incomplete pass to the right intended for Mike Thomas.","(14:10) Todd Gurley rush to the right for a loss of 3 yards to the LA32. Tackled by Ahtyba Rubin.","(14:45) Jared Goff pass to the right to Kenny Britt for 15 yards to the LA35. Tackled by Richard Sherman.","(14:49) Steven Hauschka kicks off to the LA-4. Pharoh Cooper return for 24 yards to LA20. Tackled by Jeron Johnson.","(14:49) Steven Hauschka extra point is good.","(14:56) Russell Wilson pass to the right to Tyler Lockett for 57 yards for a TOUCHDOWN.","(15:00) Russell Wilson incomplete pass to the right defensed by Aaron Donald.","(0:25) Thomas Rawls rush to the left for a loss of 1 yard to the Sea43. Tackled by Morgan Fox and Aaron Donald.","(0:57) Thomas Rawls rush to the right for 5 yards to the Sea44. Tackled by Alec Ogletree.","(1:32) Russell Wilson pass to the middle to Thomas Rawls for 6 yards to the Sea39. Tackled by Cam Thomas.","(1:45) Johnny Hekker punts for 66 yards to Sea20. Tyler Lockett return for 13 yards to Sea33. Tackled by Bryce Hager.","(1:51) Jared Goff incomplete pass to the right intended for Lance Kendricks.","(2:39) Jared Goff pass to the middle to Lance Kendricks for 5 yards to the LA14. Tackled by Kam Chancellor and Bobby Wagner.","(3:08) Todd Gurley rush to the left for a loss of 4 yards to the LA9. Tackled by Mike Morgan.","(3:12) Steven Hauschka kicks off to the LA2. Pharoh Cooper return for 21 yards to LA23. Tackled by Brandon Williams. Penalty: Holding on Los Angeles (Chase Reynolds) -10 yards.","(3:12) Steven Hauschka extra point is good.","(3:17) Russell Wilson pass to the left to Doug Baldwin for 1 yard for a TOUCHDOWN.","(3:58) Marcel Reece rush up the middle for no gain to the LA1. Tackled by Alec Ogletree and Michael Brockers.","(4:03) Los Angeles Rams timeout.","(4:03) Russell Wilson incomplete pass to the right intended for Jimmy Graham defensed by Bryce Hager.","(4:08) Penalty: Holding on Los Angeles (Troy Hill) 1 yards.","(4:39) Thomas Rawls rush to the left for 7 yards to the LA2. Tackled by Mike Jordan and Alec Ogletree.","(4:54) Penalty: False Start on Seattle (Luke Willson) -5 yards.","(5:38) Thomas Rawls rush up the middle for 1 yard to the LA4. Tackled by William Hayes and Michael Brockers.","(6:24) Russell Wilson pass to the left to Luke Willson for 9 yards to the LA5. Tackled by Cory Littleton and Cody Davis.","(6:24) Seattle Seahawks timeout.","(7:13) Russell Wilson pass to the left to Jimmy Graham for 31 yards to the LA14. Tackled by Cody Davis and Lamarcus Joyner.","(7:49) Russell Wilson pass to the left to Doug Baldwin for 17 yards to the LA45. Tackled by Mark Barron.","(7:57) Johnny Hekker punts for 48 yards to Sea38. No return.","(8:34) Jared Goff sacked at LA14 for a loss of 7 yards by Cassius Marsh.","(9:03) Penalty: Offside on Seattle (Michael Bennett) 5 yards.","(9:40) Tavon Austin rush to the left for 8 yards to the LA16. Tackled by Kam Chancellor.","(10:24) Jared Goff sacked at LA8 for a loss of 6 yards by Cliff Avril. FUMBLE, recovered by LA (Jared Goff).","(10:31) Jon Ryan punts for 31 yards to LA14. No return.","(10:35) Russell Wilson incomplete pass to the left defensed by Alec Ogletree.","(11:09) Russell Wilson pass to the left to Doug Baldwin for 7 yards to the LA45. Tackled by Mike Jordan.","(11:46) Thomas Rawls rush up the middle for 1 yard to the Sea48. Tackled by Cam Thomas and Ethan Westbrooks.","(12:21) Thomas Rawls rush to the right for 12 yards to the Sea47. Tackled by Cody Davis and Lamarcus Joyner.","(12:59) Thomas Rawls rush up the middle for 4 yards to the Sea35. Tackled by Lamarcus Joyner and Alec Ogletree.","(13:28) Russell Wilson rush to the right for 9 yards to the Sea31. Tackled by Mark Barron.","(14:12) Thomas Rawls rush to the right for 4 yards to the Sea22. Tackled by William Hayes.","(14:55) Thomas Rawls rush up the middle for no gain to the Sea18. Tackled by Aaron Donald and William Hayes.","(15:00) Greg Zuerlein kicks off to the Sea-3. Tyler Lockett return for 21 yards to Sea18. Tackled by Bradley Marquez.","(0:05) Thomas Rawls rush to the left for 1 yard to the Sea29. Tackled by Eugene Sims.","(0:48) Thomas Rawls rush to the right for 2 yards to the Sea28. Tackled by William Hayes and Dominique Easley.","(0:55) Greg Zuerlein kicks off to the Sea-1. Tyler Lockett return for 27 yards to Sea26. Tackled by T.J. McDonald and Greg Zuerlein.","(0:59) Greg Zuerlein 36 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(0:59) Seattle Seahawks timeout.","(1:10) Jared Goff pass to the middle to Pharoh Cooper for 4 yards to the Sea18. Tackled by Deshawn Shead.","(1:53) Todd Gurley rush up the middle for 1 yard to the Sea22. Tackled by Ahtyba Rubin and K.J. Wright.","(2:00) Jared Goff incomplete pass to the right intended for Kenny Britt defensed by Richard Sherman.","(2:00) Two Minute Warning.","(2:26) Todd Gurley rush to the left for 22 yards to the Sea23. Tackled by Deshawn Shead and Steven Terrell.","(3:04) Jared Goff pass to the left to Kenny Britt for 24 yards to the Sea45. Tackled by Steven Terrell.","(3:50) Todd Gurley rush to the left for a loss of 6 yards to the LA31. Tackled by Mike Morgan.","(3:55) Penalty: Holding on Seattle (Richard Sherman) 5 yards.","(4:34) Todd Gurley rush to the right for 1 yard to the LA32. Tackled by Ahtyba Rubin.","(4:42) Jon Ryan punts for 37 yards to LA31. No return.","(5:10) Russell Wilson pass to the left to Tyler Lockett for 13 yards to the Sea32. Tackled by Alec Ogletree.","(5:48) Russell Wilson sacked at Sea19 for a loss of 2 yards by Ethan Westbrooks.","(6:12) Penalty: False Start on Seattle (Germain Ifedi) -6 yards.","(6:47) Russell Wilson pass to the left to Thomas Rawls for a loss of 1 yard to the Sea27. Tackled by Alec Ogletree.","(6:54) Johnny Hekker punts for 50 yards to Sea28. No return.","(7:33) Jared Goff sacked at LA22 for a loss of 9 yards by Cliff Avril and Frank Clark.","(7:40) Jared Goff incomplete pass to the right intended for Todd Gurley.","(7:45) Jared Goff incomplete pass to the right intended for Lance Kendricks.","(7:50) Penalty: Offside on Seattle (Cliff Avril) 5 yards.","(8:35) Todd Gurley rush up the middle for 10 yards to the LA26. Tackled by K.J. Wright and Bobby Wagner.","(8:35) Penalty: False Start on Los Angeles (Greg Robinson) -5 yards.","(8:39) Jared Goff incomplete pass to the left intended for Kenny Britt defensed by Tony McDaniel.","(8:45) Steven Hauschka kicks off to the LA2. Pharoh Cooper return for 19 yards to LA21. Tackled by Kam Chancellor.","(8:50) Steven Hauschka 48 yard field goal attempt is GOOD. Holder: Jon Ryan.","(9:27) Russell Wilson pass to the left to Doug Baldwin for 5 yards to the LA30. Tackled by T.J. McDonald.","(10:07) Thomas Rawls rush to the right for a loss of 7 yards to the LA35. Tackled by William Hayes and T.J. McDonald.","(10:48) Russell Wilson pass to the left to Luke Willson for 2 yards to the LA28. Tackled by Mike Jordan.","(10:52) Johnny Hekker incomplete pass to the left intended for Mike Thomas.","(11:30) Jared Goff pass to the middle to Tavon Austin for 5 yards to the LA30. Tackled by Jeremy Lane.","(11:34) Jared Goff incomplete pass to the right intended for Kenny Britt.","(12:15) Malcolm Brown rush up the middle for a loss of 4 yards to the LA25. Tackled by K.J. Wright.","(12:21) Steven Hauschka kicks off to the LA0. Pharoh Cooper return for 14 yards to LA14. Tackled by Brandon Williams. Penalty: Face Mask on Seattle (Brandon Williams) 15 yards.","(12:21) Steven Hauschka extra point is good.","(12:27) Russell Wilson pass to the left to Luke Willson for 8 yards for a TOUCHDOWN.","(12:31) Penalty: Holding on Los Angeles (Alec Ogletree) 5 yards.","(13:09) Los Angeles Rams timeout.","(13:09) Russell Wilson pass to the right to Doug Baldwin for 5 yards to the LA13. Tackled by Trumaine Johnson.","(13:09) Seattle Seahawks timeout.","(13:44) Thomas Rawls rush to the left for 1 yard to the LA18. Tackled by Eugene Sims and Mark Barron.","(14:20) Thomas Rawls rush to the right for 3 yards to the LA19. Tackled by Alec Ogletree.","(14:24) Penalty: Roughing Passer on Los Angeles (Dominique Easley) 15 yards.","(15:00) Russell Wilson pass to the left to Tyler Lockett for 11 yards to the LA37. Tackled by Mike Jordan.","(0:44) Russell Wilson sacked at LA48 for no gain by William Hayes.","(1:06) Russell Wilson incomplete pass to the left intended for Doug Baldwin defensed by Cody Davis.","(1:31) Russell Wilson rush up the middle for 9 yards to the LA48. Tackled by Mark Barron.","(1:37) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(2:18) Russell Wilson pass to the left to Tyler Lockett for 6 yards to the Sea43. Tackled by Mike Jordan.","(2:49) Russell Wilson pass to the left to Tyler Lockett for 29 yards to the Sea37. Tackled by Mike Jordan.","(3:35) Russell Wilson rush to the left for a loss of 3 yards to the Sea8. Tackled by Mark Barron.","(4:08) Thomas Rawls rush to the left for 4 yards to the Sea11. Tackled by Cam Thomas.","(4:16) Todd Gurley rush to the left for no gain to the Sea7. Tackled by Bobby Wagner and K.J. Wright.","(4:16) Los Angeles Rams timeout.","(4:21) Jared Goff incomplete pass to the right intended for Brian Quick.","(5:07) Todd Gurley rush to the right for 4 yards to the Sea7. Tackled by Bobby Wagner and Jarran Reed.","(5:51) Jared Goff pass to the left to Kenny Britt for 5 yards to the Sea11. Tackled by K.J. Wright.","(6:17) Jared Goff pass to the left to Brian Quick for 25 yards to the Sea16. Tackled by K.J. Wright.","(6:44) Penalty: Offside on Seattle (Cassius Marsh) 5 yards.","(7:27) Todd Gurley rush up the middle for 2 yards to the Sea46. Tackled by K.J. Wright and Bobby Wagner.","(8:10) Todd Gurley rush to the left for 11 yards to the Sea48. Tackled by Bobby Wagner and Kam Chancellor.","(8:17) Jared Goff incomplete pass to the left intended for Mike Thomas.","(8:42) Jared Goff pass to the middle to Kenny Britt for 6 yards to the LA41. Tackled by K.J. Wright and Bobby Wagner.","(9:24) Tavon Austin rush to the right for 5 yards to the LA35. Tackled by Jeremy Lane and Steven Terrell.","(9:56) Todd Gurley rush to the left for 2 yards to the LA30. Tackled by Richard Sherman.","(10:03) Jon Ryan punts for 40 yards to LA13. No return. Penalty: Unsports. Conduct on Seattle (Cassius Marsh) 15 yards.","(10:49) Thomas Rawls rush to the left for 5 yards to the Sea47. Tackled by Mark Barron.","(11:08) Penalty: False Start on Seattle (Germain Ifedi) -5 yards.","(11:32) Thomas Rawls rush up the middle for no gain to the Sea47. Tackled by Eugene Sims.","(12:22) Jimmy Graham rush to the left for no gain to the Sea47. Tackled by T.J. McDonald.","(12:47) Russell Wilson pass to the right to Tyler Lockett for 6 yards to the Sea47. Tackled by Trumaine Johnson.","(12:50) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(13:25) Russell Wilson pass to the right to Marcel Reece for 9 yards to the Sea41. Tackled by Trumaine Johnson and Mike Jordan.","(13:25) Penalty: False Start on Seattle (Mark Glowinski) -5 yards.","(13:34) Johnny Hekker punts for 52 yards to Sea34. Tyler Lockett return for 3 yards to Sea37. Tackled by Temarrick Hemingway.","(14:10) Jared Goff sacked at LA14 for a loss of 9 yards by Frank Clark.","(14:52) Jared Goff pass to the left to Todd Gurley for a loss of 2 yards to the LA23. Tackled by Kam Chancellor and Ahtyba Rubin.","(14:56) Jared Goff incomplete pass to the left intended for Lance Kendricks.","(15:00) Steven Hauschka kicks off to the LA5. Pharoh Cooper return for 20 yards to LA25. Tackled by Brandon Williams."]