["(0:08) Ryan Fitzpatrick pass intended for Charone Peake INTERCEPTED by Tony Lippett. No return. Touchback.","(0:34) Ryan Fitzpatrick pass to the right to Robby Anderson for 1 yard to the Mia16. Tackled by Michael Thomas.","(0:37) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(0:38) New York Jets timeout.","(0:38) Ryan Fitzpatrick rush to the left for 3 yards to the Mia17. Tackled by Jason Jones.","(0:53) Ryan Fitzpatrick pass to the right to Bilal Powell for 13 yards to the Mia20. Tackled by Mike Hull and Neville Hewitt.","(0:59) Penalty: Unnecessary Roughness on Miami (Isa Abdul-Quddus) 15 yards.","(1:14) Matt Darr punts for 46 yards to NYJ25. Nick Marshall return for 27 yards to Mia48. Tackled by Zach Vigil.","(1:14) Miami Dolphins timeout.","(2:00) Damien Williams rush to the right for no gain to the Mia29. Tackled by Sheldon Richardson.","(2:00) Two Minute Warning.","(2:43) Kenyan Drake rush to the right for 1 yard to the Mia29. Tackled by Rontez Miles and David Harris.","(3:26) Kenyan Drake rush to the left for a loss of 3 yards to the Mia28. Tackled by Bruce Carter.","(4:11) Kenyan Drake rush to the left for 16 yards to the Mia31. Tackled by Rontez Miles.","(4:55) Kenyan Drake rush to the right for 1 yard to the Mia15. Tackled by Deon Simon.","(5:39) Kenyan Drake rush to the right for 1 yard to the Mia14. Tackled by Rontez Miles.","(5:43) Nick Folk kicks off to the Mia0. Jakeem Grant return for 13 yards to Mia13.","(5:47) Nick Folk 36 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(5:51) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(6:34) Matt Forte rush to the left for 6 yards to the Mia18. Tackled by Neville Hewitt.","(6:39) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(7:19) Matt Forte rush to the left for 5 yards to the Mia24. Tackled by Kiko Alonso and Earl Mitchell.","(7:58) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 9 yards to the Mia29. Tackled by Bacarri Rambo.","(8:36) Matt Forte rush up the middle for 8 yards to the Mia38. Tackled by Tony Lippett.","(9:15) Ryan Fitzpatrick pass to the middle to Matt Forte for 7 yards to the Mia46. Tackled by Kiko Alonso and Spencer Paysinger.","(9:51) Matt Forte rush up the middle for 2 yards to the NYJ47. Tackled by Jason Jones and Earl Mitchell.","(9:59) Matt Darr punts for 41 yards to NYJ45. No return.","(10:40) Jay Ajayi rush up the middle for 7 yards to the Mia14. Tackled by Bruce Carter and Calvin Pryor.","(11:07) Penalty: Illegal Shift on Miami -5 yards.","(11:48) Jay Ajayi rush up the middle for 5 yards to the Mia12. Tackled by Bruce Carter and Deon Simon.","(12:26) Jay Ajayi rush to the left for 2 yards to the Mia7. Tackled by Rontez Miles.","(12:32) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa defensed by Spencer Paysinger.","(13:20) Ryan Fitzpatrick rush to the left for 8 yards to the Mia5. Tackled by Spencer Paysinger.","(14:01) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 1 yard to the Mia13. Tackled by Ndamukong Suh.","(14:38) Bilal Powell rush up the middle for a loss of 1 yard to the Mia14. Tackled by Ndamukong Suh.","(15:00) Bryce Petty pass to the right to Robby Anderson for 28 yards to the Mia13. Tackled by Xavien Howard.","(0:13) Bryce Petty pass to the left to Quincy Enunwa for 14 yards to the Mia41. Tackled by Tony Lippett and Jason Jones.","(0:56) Bryce Petty sacked at NYJ45 for a loss of 9 yards by Neville Hewitt.","(1:38) Bilal Powell rush to the right for 2 yards to the Mia46. Tackled by Xavien Howard.","(2:18) Bilal Powell rush up the middle for 9 yards to the Mia48. Tackled by Isa Abdul-Quddus.","(2:28) Matt Darr punts for 43 yards to NYJ43. No return.","(3:07) Matt Moore sacked at Mia14 for no gain by Jordan Jenkins.","(3:33) Penalty: False Start on Miami (Branden Albert) -5 yards.","(4:02) Jay Ajayi rush up the middle for 8 yards to the Mia19. Tackled by Calvin Pryor.","(4:42) Jay Ajayi rush to the right for a loss of 6 yards to the Mia11. Tackled by Jordan Jenkins and Leonard Williams.","(4:48) Lachlan Edwards punts for 29 yards to Mia17. No return.","(4:53) Bryce Petty incomplete pass to the right intended for Charone Peake.","(4:58) Bryce Petty incomplete pass to the right intended for Brandon Marshall defensed by Xavien Howard.","(5:42) Bryce Petty pass to the right to Austin Seferian-Jenkins for 3 yards to the Mia46. Tackled by Spencer Paysinger and Kiko Alonso.","(5:47) Penalty: Unnecessary Roughness on Miami (Isa Abdul-Quddus) 15 yards.","(6:26) Bilal Powell rush to the left for 11 yards to the NYJ36. Tackled by Cameron Wake.","(6:26) Andrew Franks kicks off to the endzone. Touchback.","(6:26) Andrew Franks extra point is good.","(6:36) Matt Moore pass to the middle to Jarvis Landry for 66 yards for a TOUCHDOWN.","(6:48) Lachlan Edwards punts for 52 yards to Mia24. Jakeem Grant return for 10 yards to Mia34. Tackled by Darron Lee.","(6:52) Bryce Petty incomplete pass to the left intended for Brandon Marshall.","(6:56) Bryce Petty incomplete pass to the right intended for Robby Anderson defensed by Xavien Howard.","(7:36) Bilal Powell rush up the middle for 4 yards to the NYJ24. Tackled by Bacarri Rambo and Spencer Paysinger.","(7:43) Andrew Franks kicks off to the NYJ0. Nick Marshall return for 20 yards to NYJ20. Tackled by Spencer Paysinger.","(7:43) Andrew Franks extra point is good.","(7:47) Matt Moore pass to the right to Dion Sims for 1 yard for a TOUCHDOWN.","(8:26) Jay Ajayi rush up the middle for no gain to the NYJ1. Tackled by David Harris and Deon Simon.","(9:04) Damien Williams rush up the middle for no gain to the NYJ1. Tackled by Darron Lee and Leonard Williams.","(9:29) Matt Moore pass to the left to Dion Sims for 28 yards to the NYJ1. Tackled by Calvin Pryor.","(10:15) Matt Moore pass to the right to Jarvis Landry for 31 yards to the NYJ29. Tackled by Juston Burris.","(10:23) Bryce Petty pass intended for Robby Anderson INTERCEPTED by Tony Lippett. No return. Tackled by Robby Anderson.","(10:30) Andrew Franks kicks off to the NYJ-3. Nick Marshall return for 22 yards to NYJ19. Tackled by Mike Hull and Neville Hewitt.","(10:30) Andrew Franks extra point is good.","(10:37) Lachlan Edwards punt blocked by Walt Aikens. Returned by Walt Aikens for a TOUCHDOWN.","(10:42) Bryce Petty incomplete pass to the middle intended for Quincy Enunwa.","(11:29) Bryce Petty pass to the right to Bilal Powell for 5 yards to the NYJ41. Tackled by Spencer Paysinger.","(12:10) Bryce Petty pass to the left to Bilal Powell for a loss of 7 yards to the NYJ36. Tackled by Andre Branch.","(12:44) Bilal Powell rush to the left for 13 yards to the NYJ43. Tackled by Kiko Alonso.","(12:51) Matt Moore pass intended for DeVante Parker INTERCEPTED by Juston Burris. No return. Tackled by DeVante Parker.","(12:54) Matt Moore incomplete pass to the right intended for DeVante Parker.","(13:40) Jay Ajayi rush to the right for 4 yards to the Mia39. Tackled by Jordan Jenkins.","(14:15) Jay Ajayi rush to the right for 6 yards to the Mia35. Tackled by Rontez Miles.","(14:55) Jay Ajayi rush to the right for 6 yards to the Mia27. FUMBLE, recovered by Mia (MarQueis Gray).","(15:00) Nick Folk kicks off to the Mia0. Kenyan Drake return for 21 yards to Mia21. Tackled by Josh Martin.","(0:10) Matt Moore incomplete pass to the right. Penalty: Intentional Grounding on Miami (Matt Moore) -10 yards.","(0:16) Penalty: Pass Interference on New York (Doug Middleton) 22 yards.","(0:18) Nick Folk kicks off to the Mia24. MarQueis Gray return for 11 yards to Mia35. Tackled by Nick Marshall.","(0:22) Nick Folk 48 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(0:26) Bryce Petty incomplete pass to the right intended for Brandon Marshall.","(0:26) New York Jets timeout.","(0:33) Bryce Petty pass to the middle to Charone Peake for 8 yards to the Mia30. Tackled by Kiko Alonso.","(0:37) Bryce Petty incomplete pass to the right intended for Bilal Powell.","(1:02) Bryce Petty pass to the right to Bilal Powell for 16 yards to the Mia38. Tackled by Bacarri Rambo.","(1:07) Bryce Petty incomplete pass to the right.","(1:10) Bryce Petty incomplete pass to the middle intended for Quincy Enunwa.","(1:14) Bryce Petty pass to the right to Quincy Enunwa for 13 yards to the NYJ46.","(1:19) Bryce Petty pass to the right to Robby Anderson for 11 yards to the NYJ33. Tackled by Xavien Howard.","(1:24) Bryce Petty incomplete pass to the left intended for Brandon Marshall.","(1:45) Bryce Petty pass to the middle to Charone Peake for 10 yards to the NYJ22. Tackled by Bobby McCain.","(1:51) Penalty: Holding on New York (Brian Winters) -10 yards.","(1:58) Andrew Franks kicks off to the NYJ5. Nick Marshall return for 17 yards to NYJ22. Tackled by Walt Aikens and Spencer Paysinger.","(1:58) Two Minute Warning.","(1:58) Andrew Franks extra point is good.","(2:06) Matt Moore pass to the right to Kenny Stills for 52 yards for a TOUCHDOWN.","(2:06) Miami Dolphins timeout.","(2:32) Penalty: False Start on Miami (Kenny Stills) -5 yards.","(3:14) Jay Ajayi rush to the left for 1 yard to the NYJ47. Tackled by Sheldon Richardson.","(3:49) Jay Ajayi rush to the left for 5 yards to the NYJ48. Tackled by Darron Lee.","(3:49) New York Jets timeout.","(3:59) Bilal Powell rush to the left for no gain to the Mia47. Tackled by Earl Mitchell.","(4:45) Bryce Petty pass to the middle to Bilal Powell for 6 yards to the Mia47. Tackled by Andre Branch.","(5:26) Bryce Petty sacked at NYJ47 for a loss of 2 yards by Isa Abdul-Quddus.","(5:32) Bryce Petty incomplete pass to the right intended for Brandon Marshall defensed by Xavien Howard.","(5:49) Penalty: Offside on Miami (Jordan Phillips) 5 yards.","(6:22) Bilal Powell rush up the middle for 12 yards to the NYJ44. Tackled by Isa Abdul-Quddus.","(6:36) Matt Darr punts for 43 yards to NYJ18. Darryl Roberts - no return. FUMBLE, recovered by NYJ (Nick Marshall) and advanced for 14 yards.","(6:40) Matt Moore incomplete pass to the right intended for Kenny Stills defensed by Juston Burris.","(7:25) Jay Ajayi rush to the left for 1 yard to the Mia39. Tackled by Muhammad Wilkerson and Calvin Pryor.","(8:04) Matt Moore pass to the left to MarQueis Gray for 2 yards to the Mia38. Tackled by Jordan Jenkins.","(8:10) Bryce Petty pass intended for Brandon Marshall INTERCEPTED by Cameron Wake and returned for 12 yards. Tackled by Bilal Powell.","(8:15) Bryce Petty incomplete pass to the right intended for Brandon Marshall.","(9:02) Bryce Petty pass to the left to Quincy Enunwa for 27 yards to the Mia27. Tackled by Neville Hewitt.","(9:43) Bryce Petty pass to the left to Bilal Powell for 8 yards to the NYJ46. Tackled by Tony Lippett and Bobby McCain.","(10:17) Bilal Powell rush to the left for 4 yards to the NYJ38. Tackled by Andre Branch.","(10:57) Bilal Powell rush to the left for 9 yards to the NYJ34. Tackled by Jelani Jenkins and Bacarri Rambo.","(10:57) Andrew Franks kicks off to the endzone. Touchback.","(10:57) Andrew Franks extra point is NO GOOD.","(11:03) Matt Moore pass to the right to Dion Sims for 1 yard for a TOUCHDOWN.","(11:39) Jay Ajayi rush up the middle for no gain to the NYJ1. Tackled by Muhammad Wilkerson.","(12:17) Damien Williams rush up the middle for no gain to the NYJ1. Tackled by Leonard Williams.","(12:51) Matt Moore pass to the right to MarQueis Gray for 19 yards to the NYJ1. Tackled by David Harris.","(13:36) Matt Moore pass to the left to Jarvis Landry for 11 yards to the NYJ20. Tackled by Calvin Pryor.","(14:19) Matt Moore pass to the left to DeVante Parker for 17 yards to the NYJ31. Tackled by Darrelle Revis.","(15:00) Jay Ajayi rush to the left for 4 yards to the NYJ48. Tackled by Jordan Jenkins.","(0:20) Jay Ajayi rush to the right for no gain to the Mia48. Tackled by Freddie Bishop III and Leonard Williams.","(0:28) Lachlan Edwards punts for 38 yards to Mia41. Jakeem Grant return for 7 yards to Mia48. Tackled by Nick Marshall and Rontez Miles.","(1:06) Bryce Petty pass to the left to Bilal Powell for 3 yards to the NYJ21. Tackled by Jason Jones.","(1:46) Bryce Petty pass to the left to Bilal Powell for a loss of 5 yards to the NYJ18. Tackled by Jordan Phillips.","(2:24) Bilal Powell rush to the right for 8 yards to the NYJ23. Tackled by Bacarri Rambo and Jason Jones.","(2:41) Penalty: Illegal Use of Hands on New York (Ben Ijalana) -10 yards.","(2:50) Matt Darr punts for 46 yards to NYJ25. No return.","(2:56) Matt Moore incomplete pass to the right intended for Kenny Stills defensed by Doug Middleton.","(3:39) Jay Ajayi rush to the left for 3 yards to the Mia29. Tackled by David Harris.","(4:15) Matt Moore pass to the left to Dion Sims for 1 yard to the Mia26. Tackled by Darron Lee.","(4:22) Bryce Petty sacked at Mia25 for a loss of 11 yards by Cameron Wake. FUMBLE, recovered by Mia (Ndamukong Suh). Tackled by Wesley Johnson.","(4:58) Bilal Powell rush to the left for 2 yards to the Mia14. Tackled by Jelani Jenkins and Ndamukong Suh.","(5:35) Bryce Petty pass to the middle to Bilal Powell for a loss of 1 yard to the Mia16. Tackled by Ndamukong Suh.","(6:00) Penalty: Offside on Miami (Ndamukong Suh) 5 yards.","(6:40) Bryce Petty pass to the middle to Brandon Marshall for 16 yards to the Mia20. Tackled by Tony Lippett.","(7:22) Bryce Petty rush up the middle for no gain to the Mia33. FUMBLE, recovered by NYJ (Bryce Petty).","(7:58) Bryce Petty pass to the right to Bilal Powell for 18 yards to the Mia33. Tackled by Isa Abdul-Quddus.","(8:33) Bilal Powell rush to the right for 3 yards to the NYJ49. Tackled by Tony Lippett.","(8:42) Matt Darr punts for 38 yards to NYJ41. Nick Marshall return for 5 yards to NYJ46. Tackled by Zach Vigil.","(8:46) Matt Moore incomplete pass to the right intended for Jarvis Landry.","(9:28) Jay Ajayi rush up the middle for 1 yard to the Mia21. Tackled by Leonard Williams.","(10:08) Jay Ajayi rush to the right for a loss of 1 yard to the Mia20. Tackled by Leonard Williams.","(10:41) Matt Moore pass to the left to MarQueis Gray for 7 yards to the Mia21. Tackled by Calvin Pryor.","(11:24) Jay Ajayi rush up the middle for 5 yards to the Mia14. Tackled by Freddie Bishop III and Rontez Miles.","(11:32) Nick Folk kicks off to the Mia2. Jakeem Grant return for 7 yards to Mia9. Tackled by Devin Smith.","(11:32) Nick Folk extra point is good.","(11:39) Bryce Petty pass to the middle to Robby Anderson for 40 yards for a TOUCHDOWN.","(11:45) Bryce Petty incomplete pass to the left intended for Austin Seferian-Jenkins.","(12:27) Bilal Powell rush to the left for 5 yards to the Mia40. Tackled by Kiko Alonso.","(13:30) Penalty: Offside on Miami (Andre Branch) 5 yards.","(13:30) Bilal Powell rush up the middle for 4 yards to the NYJ50. Tackled by Jordan Phillips.","(14:11) Bryce Petty pass to the right to Bilal Powell for 22 yards to the NYJ46. Tackled by Bobby McCain.","(14:48) Bilal Powell rush to the right for a loss of 1 yard to the NYJ24. Tackled by Isa Abdul-Quddus and Earl Mitchell.","(14:54) Bryce Petty incomplete pass to the right intended for Quincy Enunwa.","(15:00) Andrew Franks kicks off to the NYJ-3. Nick Marshall return for 28 yards to NYJ25. Tackled by Spencer Paysinger."]