["(0:03) Mason Crosby 32 yard field goal attempt is GOOD. Holder: Jacob Schum.","(0:03) Chicago Bears timeout.","(0:04) Aaron Rodgers incomplete pass to the middle.","(0:31) Aaron Rodgers pass to the left to Jordy Nelson for 60 yards to the Chi14. Tackled by Cre'von LeBlanc.","(0:46) Green Bay Packers timeout.","(1:08) Aaron Rodgers pass to the right to Ty Montgomery for a loss of 1 yard to the GB26. Tackled by Nick Kwiatkoski.","(1:13) Aaron Rodgers incomplete pass to the right intended for Jared Cook.","(1:19) Connor Barth kicks off to the GB6. Jeff Janis return for 21 yards to GB27. Tackled by Harold Jones-Quartey.","(1:23) Connor Barth 22 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(1:27) Matt Barkley incomplete pass to the left intended for Cameron Meredith defensed by Micah Hyde.","(1:27) Green Bay Packers timeout.","(1:33) Jordan Howard rush to the right for no gain to the GB4. Tackled by Kentrell Brice.","(1:34) Green Bay Packers timeout.","(1:45) Matt Barkley pass to the right to Cameron Meredith for 9 yards to the GB4. Tackled by Jake Ryan.","(1:50) Penalty: Holding on Chicago (Logan Paulsen) -10 yards.","(1:50) Green Bay Packers timeout.","(2:00) Jordan Howard rush to the right for 13 yards to the GB3. Tackled by Blake Martinez and Ha Ha Clinton-Dix.","(2:00) Two Minute Warning.","(2:14) Matt Barkley pass to the left to Jeremy Langford for 18 yards to the GB16. Tackled by Jake Ryan.","(2:20) Penalty: Holding on Green Bay (Ladarius Gunter) 5 yards.","(2:24) Matt Barkley incomplete pass to the right intended for Alshon Jeffery.","(3:11) Matt Barkley pass to the middle to Cameron Meredith for 4 yards to the GB39. Tackled by Micah Hyde.","(3:50) Matt Barkley pass to the left to Cameron Meredith for 8 yards to the GB43. Tackled by Micah Hyde.","(3:54) Matt Barkley incomplete pass to the middle intended for Cameron Meredith defensed by Micah Hyde.","(4:07) Matt Barkley pass to the right to Deonte Thompson for 6 yards to the Chi49. Tackled by Quinten Rollins.","(4:48) Matt Barkley pass to the left to Jordan Howard for 3 yards to the Chi43. Tackled by Joe Thomas.","(5:13) Jordan Howard rush to the left for 4 yards to the Chi40. Tackled by Letroy Guion.","(5:42) Matt Barkley pass to the right to Deonte Thompson for 15 yards to the Chi36. Tackled by Quinten Rollins.","(5:55) Jacob Schum punts for 52 yards to Chi13. Cre'von LeBlanc return for 8 yards to Chi21. Tackled by Micah Hyde.","(6:35) Aaron Rodgers rush to the right for 4 yards to the GB35. Tackled by John Timu.","(7:21) Ty Montgomery rush to the left for 4 yards to the GB31. Tackled by Adrian Amos.","(7:27) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(7:34) Connor Barth kicks off to the GB10. Ty Montgomery return for 17 yards to GB27. Tackled by Demontre Hurst.","(7:34) Connor Barth extra point is good.","(7:40) Jordan Howard rush to the left for 9 yards for a TOUCHDOWN.","(8:04) Matt Barkley pass to the right to Alshon Jeffery for 9 yards to the GB18. Tackled by Quinten Rollins. Penalty: Roughing Passer on Green Bay (Jake Ryan) 9 yards.","(8:26) Matt Barkley pass to the middle to Alshon Jeffery for 12 yards to the GB27. Tackled by Quinten Rollins.","(8:34) Matt Barkley incomplete pass to the left intended for Deonte Thompson.","(9:02) Matt Barkley pass to the right to Cameron Meredith for 5 yards to the GB39. Tackled by Quinten Rollins.","(9:38) Matt Barkley pass to the left to Alshon Jeffery for 10 yards to the GB44. Tackled by Ladarius Gunter.","(10:11) Jordan Howard rush to the left for 4 yards to the Chi46. Tackled by Joe Thomas.","(10:42) Matt Barkley pass to the right to Jordan Howard for 9 yards to the Chi42. Tackled by Mike Daniels.","(11:11) Jordan Howard rush to the right for 11 yards to the Chi33. Tackled by Morgan Burnett.","(11:19) Jacob Schum punts for 45 yards to Chi32. No return. Penalty: Illegal Block on Chicago (Deiondre' Hall) -10 yards.","(11:56) Aaron Rodgers sacked at GB23 for a loss of 10 yards by Pernell McPhee.","(11:56) Chicago Bears timeout.","(12:36) Aaron Rodgers pass to the left to Jordy Nelson for 6 yards to the GB33. Tackled by Cre'von LeBlanc.","(13:20) Ty Montgomery rush to the right for 1 yard to the GB27. Tackled by C.J. Wilson.","(13:27) Connor Barth kicks off to the GB16. Ty Montgomery return for 10 yards to GB26. Tackled by Sherrick McManis.","(13:27) Connor Barth extra point is good.","(13:31) Matt Barkley pass to the right to Alshon Jeffery for 8 yards for a TOUCHDOWN.","(13:36) Matt Barkley incomplete pass to the middle intended for Deonte Thompson.","(14:24) Matt Barkley pass to the right to Alshon Jeffery for 27 yards to the GB8. Tackled by Quinten Rollins.","(14:54) Matt Barkley pass to the right to Alshon Jeffery for 23 yards to the GB35. Tackled by Jake Ryan.","(14:54) Penalty: False Start on Chicago (Ted Larsen) -5 yards.","(15:00) Penalty: Holding on Green Bay (Damarious Randall) 5 yards.","(0:33) Jeremy Langford rush to the right for 4 yards to the Chi42. Tackled by Jake Ryan.","(1:03) Jordan Howard rush to the left for 13 yards to the Chi38. Tackled by Ha Ha Clinton-Dix.","(1:03) Mason Crosby kicks off to the endzone. Touchback.","(1:03) Mason Crosby extra point is good.","(1:13) Christine Michael rush to the right for 42 yards for a TOUCHDOWN.","(1:55) Ty Montgomery rush to the left for 3 yards to the Chi42. Tackled by Cre'von LeBlanc.","(2:05) Matt Barkley pass intended for Daniel Braverman INTERCEPTED by Ha Ha Clinton-Dix and returned for 27 yards. Tackled by Deonte Thompson.","(2:10) Matt Barkley incomplete pass to the right intended for Joshua Bellamy.","(2:41) Matt Barkley pass to the right to Cameron Meredith for 9 yards to the Chi50. Tackled by Morgan Burnett.","(3:15) Jordan Howard rush to the left for 9 yards to the Chi41. Tackled by Ladarius Gunter.","(3:35) Penalty: False Start on Chicago (Ted Larsen) -5 yards.","(4:13) Matt Barkley pass to the left to Jordan Howard for 8 yards to the Chi37. Tackled by Jake Ryan and Ha Ha Clinton-Dix.","(4:46) Jordan Howard rush to the right for 4 yards to the Chi29. Tackled by Letroy Guion.","(4:53) Mason Crosby kicks off to the Chi4. Deonte Thompson return for 21 yards to Chi25. Tackled by Jeff Janis.","(4:53) Mason Crosby extra point is good.","(4:57) Ty Montgomery rush to the left for 3 yards for a TOUCHDOWN.","(5:41) Ty Montgomery rush to the right for a loss of 1 yard to the Chi3. Tackled by Pernell McPhee.","(6:30) Ty Montgomery rush to the left for 26 yards to the Chi2. Tackled by Adrian Amos.","(7:13) Aaron Rodgers pass to the right to Jordy Nelson for 11 yards to the Chi28. Tackled by Tracy Porter.","(8:03) Aaron Rodgers pass to the middle to Richard Rodgers for 10 yards to the Chi39. Tackled by Nick Kwiatkoski.","(8:35) Penalty: Illegal Use of Hands on Green Bay (Lane Taylor) -10 yards.","(9:23) Aaron Rodgers pass to the left to Davante Adams for 19 yards to the Chi39. Tackled by Nick Kwiatkoski.","(9:28) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(9:42) Matt Barkley pass intended for Daniel Brown INTERCEPTED by Ha Ha Clinton-Dix and returned for 16 yards. Tackled by Jordan Howard.","(9:49) Matt Barkley incomplete pass to the right intended for Cameron Meredith defensed by Damarious Randall.","(10:26) Jordan Howard rush to the left for 1 yard to the Chi42. Tackled by Mike Daniels.","(11:03) Matt Barkley pass to the right to Cameron Meredith for 17 yards to the Chi41. Tackled by Joe Thomas.","(11:10) Mason Crosby kicks off to the Chi3. Deonte Thompson return for 21 yards to Chi24. Tackled by Kyler Fackrell.","(11:15) Mason Crosby 18 yard field goal attempt is GOOD. Holder: Jacob Schum.","(12:12) Aaron Rodgers rush to the right for 7 yards to the Chi1. Tackled by Demontre Hurst.","(12:54) Aaron Rodgers rush to the left for 8 yards to the Chi8. Tackled by Cre'von LeBlanc.","(13:00) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(13:24) Penalty: Holding on Green Bay (T.J. Lang) -10 yards.","(14:11) Ty Montgomery rush to the left for 3 yards to the Chi6. Tackled by Adrian Amos.","(14:53) Aaron Rodgers pass to the right to Jared Cook for 8 yards to the Chi9. Tackled by John Timu.","(15:00) Matt Barkley sacked at Chi17 for a loss of 8 yards by Julius Peppers. FUMBLE, recovered by GB (Julius Peppers). Tackled by Matt Barkley.","(15:00) Mason Crosby kicks off to the endzone. Touchback.","(0:05) Matt Barkley pass intended for Alshon Jeffery INTERCEPTED by Micah Hyde. No return. Touchback.","(0:05) Green Bay Packers timeout.","(0:11) Matt Barkley pass to the right to Deonte Thompson for 20 yards to the GB44.","(0:11) Chicago Bears timeout.","(0:20) Matt Barkley pass to the left to Cameron Meredith for 7 yards to the Chi36. Tackled by Quinten Rollins.","(0:20) Chicago Bears timeout.","(0:26) Matt Barkley pass to the right to Deonte Thompson for 7 yards to the Chi29. Tackled by Joe Thomas.","(0:32) Mason Crosby kicks off to the Chi4. Deonte Thompson return for 18 yards to Chi22. Tackled by Kyler Fackrell.","(0:37) Mason Crosby 34 yard field goal attempt is GOOD. Holder: Jacob Schum.","(0:46) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson defensed by Deon Bush.","(0:50) Aaron Rodgers incomplete pass to the right intended for Davante Adams.","(0:50) Green Bay Packers timeout.","(0:58) Aaron Rodgers pass to the right to Jared Cook for no gain to the Chi16. Tackled by Demontre Hurst.","(1:45) Ty Montgomery rush to the left for 36 yards to the Chi16. Tackled by Adrian Amos.","(1:50) Aaron Rodgers pass to the left to Jared Cook for 12 yards to the GB48.","(1:57) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson defensed by Cre'von LeBlanc.","(1:57) Two Minute Warning.","(2:06) Aaron Rodgers pass to the right to Jared Cook for 21 yards to the GB36. Tackled by Deon Bush.","(2:11) Aaron Rodgers incomplete pass to the left intended for Jared Cook.","(2:16) Connor Barth kicks off to the GB2. Ty Montgomery return for 13 yards to GB15. Tackled by Joshua Bellamy.","(2:16) Connor Barth extra point is good.","(2:23) Matt Barkley pass to the right to Joshua Bellamy for 10 yards for a TOUCHDOWN.","(2:59) Matt Barkley pass to the middle to Daniel Brown for 8 yards to the GB10. Tackled by Morgan Burnett.","(3:41) Matt Barkley pass to the right to Cameron Meredith for 34 yards to the GB18. Tackled by Ha Ha Clinton-Dix.","(4:24) Jordan Howard rush to the left for 3 yards to the Chi48. Tackled by Julius Peppers.","(4:31) Jacob Schum punts for 33 yards to Chi35. No return. Penalty: Holding on Green Bay (Kentrell Brice) 10 yards.","(4:41) Aaron Rodgers incomplete pass to the left intended for Ty Montgomery.","(5:24) Aaron Rodgers pass to the left to Jordy Nelson for 5 yards to the GB32. Tackled by John Timu.","(6:00) Aaron Rodgers pass to the middle to Ty Montgomery for 2 yards to the GB27. Tackled by John Timu.","(6:00) Connor Barth kicks off to the endzone. Touchback.","(6:05) Connor Barth 26 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(6:10) Matt Barkley incomplete pass to the left intended for Cameron Meredith.","(6:56) Ka'Deem Carey rush to the left for 1 yard to the GB8. Tackled by Joe Thomas.","(7:36) Jordan Howard rush to the right for 6 yards to the GB9. Tackled by Ha Ha Clinton-Dix.","(8:09) Matt Barkley pass to the right to Deonte Thompson for 17 yards to the GB15. Tackled by Damarious Randall.","(8:43) Matt Barkley pass to the middle to Deonte Thompson for 11 yards to the GB32. Tackled by Ladarius Gunter.","(9:18) Jordan Howard rush to the left for 1 yard to the GB43. Tackled by Jake Ryan.","(10:06) Matt Barkley pass to the right to Cameron Meredith for 11 yards to the GB44. Tackled by Jake Ryan.","(10:39) Matt Barkley pass to the right to Deonte Thompson for 15 yards to the Chi45. Tackled by Joe Thomas.","(11:12) Jordan Howard rush to the right for 2 yards to the Chi30. Tackled by Letroy Guion.","(11:20) Aaron Rodgers sacked at Chi28 for a loss of 6 yards by Pernell McPhee.","(11:20) Green Bay Packers timeout.","(12:10) Ty Montgomery rush to the right for a loss of 2 yards to the Chi22. Tackled by C.J. Wilson.","(12:58) Christine Michael rush to the left for 4 yards to the Chi20. Tackled by Nick Kwiatkoski.","(13:36) Aaron Rodgers pass to the right to Jordy Nelson for 10 yards to the Chi24. Tackled by Tracy Porter.","(14:02) Penalty: False Start on Green Bay (Jared Cook) -5 yards.","(14:45) Ty Montgomery rush to the left for 61 yards to the Chi29. Tackled by Tracy Porter.","(15:00) Patrick O'Donnell punts for 48 yards to GB18. Micah Hyde return for 2 yards to GB20. Tackled by Christian Jones and Jonathan Anderson. Penalty: Holding on Green Bay (Blake Martinez) -10 yards.","(0:10) Matt Barkley incomplete pass to the left intended for Joshua Bellamy.","(0:52) Jordan Howard rush to the left for 3 yards to the Chi34. Tackled by Datone Jones.","(1:31) Matt Barkley pass to the left to Jordan Howard for 3 yards to the Chi31. Tackled by Quinten Rollins.","(1:42) Jacob Schum punts for 38 yards to Chi19. Cre'von LeBlanc return for 9 yards to Chi28. Tackled by Jeff Janis.","(2:18) Aaron Rodgers sacked at GB43 for a loss of 11 yards by Demontre Hurst.","(2:18) Chicago Bears timeout.","(2:59) Aaron Rodgers pass to the left to Geronimo Allison for 7 yards to the Chi46. Tackled by Cre'von LeBlanc.","(3:43) Christine Michael rush to the right for a loss of 2 yards to the GB47. Tackled by John Timu.","(4:28) Christine Michael rush to the left for 1 yard to the GB49. Tackled by Nick Kwiatkoski.","(5:13) Ty Montgomery rush to the right for 9 yards to the GB48. Tackled by Adrian Amos.","(5:51) Ty Montgomery rush to the left for 13 yards to the GB39. Tackled by Deon Bush.","(6:21) Penalty: Holding on Chicago (Tracy Porter) 5 yards.","(6:29) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(7:17) Aaron Rodgers sacked at GB21 for no gain by C.J. Wilson.","(7:45) Aaron Rodgers pass to the left to Jordy Nelson for 20 yards to the GB21. Tackled by Cre'von LeBlanc.","(7:55) Patrick O'Donnell punts for 40 yards to GB1. No return.","(8:00) Matt Barkley incomplete pass to the left intended for Alshon Jeffery.","(8:38) Jordan Howard rush to the right for 2 yards to the GB41. Tackled by Mike Daniels and Julius Peppers.","(9:15) Jordan Howard rush to the left for 5 yards to the GB43. Tackled by Julius Peppers.","(9:49) Matt Barkley pass to the right to Deonte Thompson for 19 yards to the GB48. Tackled by Morgan Burnett.","(9:57) Mason Crosby kicks off to the Chi6. Deonte Thompson return for 27 yards to Chi33. Tackled by Jayrone Elliott.","(9:57) Mason Crosby extra point is good.","(10:02) Ty Montgomery rush to the right for 4 yards for a TOUCHDOWN.","(10:34) Aaron Rodgers pass to the right to Jordy Nelson for 12 yards to the Chi9. Tackled by Deon Bush. Penalty: Roughing Passer on Chicago (Akiem Hicks) 5 yards.","(11:22) Ty Montgomery rush to the right for 1 yard to the Chi21. Tackled by Deon Bush.","(12:05) Aaron Rodgers pass to the left to Jared Cook for 17 yards to the Chi22. Tackled by Cre'von LeBlanc.","(12:49) Ty Montgomery rush to the left for a loss of 1 yard to the Chi39. Tackled by John Timu.","(12:55) Aaron Rodgers incomplete pass to the right intended for Randall Cobb.","(13:39) Aaron Rodgers pass to the left to Jared Cook for 27 yards to the Chi38. Tackled by Demontre Hurst.","(14:15) Aaron Rodgers pass to the right to Davante Adams for 6 yards to the GB35. Tackled by Deon Bush.","(14:53) Ty Montgomery rush to the right for 2 yards to the GB29. Tackled by Willie Young and Akiem Hicks.","(15:00) Connor Barth kicks off to the GB10. Ty Montgomery return for 17 yards to GB27. Tackled by Sam Acho."]