["(0:19) Derek Carr rush up the middle for a loss of 3 yards to the SD22.","(0:58) Derek Carr rush up the middle for a loss of 4 yards to the SD19.","(1:37) Derek Carr rush up the middle for a loss of 2 yards to the SD15.","(1:51) Philip Rivers pass intended for Dontrelle Inman INTERCEPTED by Reggie Nelson and returned for 15 yards. Tackled by Dontrelle Inman.","(2:00) Philip Rivers incomplete pass to the left defensed by Darius Latham.","(2:00) Two Minute Warning.","(2:31) Philip Rivers sacked at SD9 for a loss of 5 yards by Bruce Irvin.","(2:35) Philip Rivers incomplete pass to the right intended for Travis Benjamin.","(2:40) Sebastian Janikowski kicks off to the SD5. Geremy Davis return for 9 yards to SD14. Tackled by Daren Bates.","(2:42) Sebastian Janikowski 44 yard field goal attempt is GOOD. Holder: Marquette King.","(3:28) Derek Carr sacked at SD26 for a loss of 7 yards by Melvin Ingram.","(3:33) Derek Carr incomplete pass to the left intended for Amari Cooper.","(4:16) Latavius Murray rush up the middle for 2 yards to the SD19. Tackled by Kyle Emanuel and Joey Bosa.","(4:23) Derek Carr rush to the right for 8 yards to the SD21. Tackled by Jahleel Addae.","(5:03) Jalen Richard rush up the middle for 2 yards to the SD29. Tackled by Joey Bosa.","(5:08) Derek Carr incomplete pass to the right intended for Clive Walford.","(5:40) Derek Carr pass to the left to Seth Roberts for 22 yards to the SD31. Tackled by Trevor Williams.","(6:27) Latavius Murray rush up the middle for 27 yards to the Oak47. Tackled by Dwight Lowery and Chris Landrum.","(6:36) Drew Kaser punts for 66 yards to Oak0. Touchback.","(7:13) Philip Rivers pass to the left to Tyrell Williams for 1 yard to the SD34. Tackled by David Amerson.","(7:58) Kenneth Farrow rush up the middle for no gain to the SD33. Tackled by Malcolm Smith.","(8:38) Philip Rivers pass to the right to Kenneth Farrow for 8 yards to the SD33. Tackled by Perry Riley Jr..","(8:38) Sebastian Janikowski kicks off to the endzone. Touchback.","(8:44) Sebastian Janikowski 21 yard field goal attempt is GOOD. Holder: Marquette King.","(9:27) Latavius Murray rush to the left for a loss of 1 yard to the SD2. Tackled by Kyle Emanuel.","(9:32) Derek Carr incomplete pass to the right intended for Clive Walford.","(10:10) Latavius Murray rush to the right for no gain to the SD1. Tackled by Kyle Emanuel.","(10:53) Derek Carr pass to the middle to Jamize Olawale for 12 yards to the SD1. Tackled by Trovon Reed and Melvin Ingram.","(11:35) Latavius Murray rush up the middle for no gain to the SD13. Tackled by Melvin Ingram.","(11:44) Kenneth Farrow rush up the middle for a loss of 2 yards to the SD14. Tackled by Perry Riley Jr.. FUMBLE, recovered by Oak (Malcolm Smith) and returned for 1 yard. Tackled by Sean McGrath.","(12:28) Kenneth Farrow rush up the middle for 4 yards to the SD16. Tackled by Bruce Irvin and Darius Latham.","(12:28) San Diego Chargers timeout.","(13:13) Kenneth Farrow rush up the middle for 4 yards to the SD12. Tackled by Perry Riley Jr. and Malcolm Smith.","(13:54) Kenneth Farrow rush up the middle for 3 yards to the SD8. Tackled by Nate Allen.","(14:06) Marquette King punts for 64 yards to SD7. Isaiah Burse return for 3 yards to SD10. Tackled by Daren Bates. Penalty: Illegal Block on San Diego (Adrian Phillips) -5 yards.","(14:13) Derek Carr incomplete pass to the left intended for Amari Cooper defensed by Casey Hayward.","(14:18) Derek Carr incomplete pass to the left intended for Mychal Rivera.","(15:00) Jalen Richard rush to the left for 2 yards to the Oak29. Tackled by Trovon Reed.","(0:01) Penalty: Offside on San Diego (Melvin Ingram) 5 yards.","(0:33) Derek Carr pass to the right to Michael Crabtree for 19 yards to the Oak22. Tackled by Trevor Williams.","(0:43) Drew Kaser punts for 69 yards to Oak3. No return.","(1:18) Philip Rivers sacked at SD28 for a loss of 8 yards by Denico Autry.","(1:22) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(2:05) Kenneth Farrow rush up the middle for 4 yards to the SD36. Tackled by Denico Autry.","(2:41) Philip Rivers pass to the right to Tyrell Williams for 3 yards to the SD32. Tackled by David Amerson.","(3:30) Ronnie Hillman rush to the left for 2 yards to the SD29. Tackled by Khalil Mack and Justin Ellis.","(4:10) Ronnie Hillman rush to the right for 7 yards to the SD27. Tackled by Reggie Nelson.","(4:18) Marquette King punts for 46 yards to SD20. No return.","(4:56) Latavius Murray rush up the middle for no gain to the Oak34. Tackled by Korey Toomer.","(4:56) San Diego Chargers timeout.","(5:34) Derek Carr pass to the right to Jalen Richard for 5 yards to the Oak34. Tackled by Trevor Williams.","(6:14) Jalen Richard rush up the middle for 4 yards to the Oak29. Tackled by Melvin Ingram.","(6:14) Josh Lambo kicks off to the endzone. Touchback.","(6:14) Josh Lambo extra point is NO GOOD.","(6:19) Philip Rivers pass to the left to Hunter Henry for 7 yards for a TOUCHDOWN.","(7:08) Philip Rivers pass to the right to Dontrelle Inman for 26 yards to the Oak7. Tackled by TJ Carrie.","(7:52) Philip Rivers pass to the left to Tyrell Williams for 11 yards to the Oak33. Tackled by TJ Carrie.","(8:36) Philip Rivers pass to the right to Dontrelle Inman for 6 yards to the Oak44. Tackled by David Amerson.","(9:23) Ronnie Hillman rush up the middle for no gain to the SD50. Tackled by Malcolm Smith.","(10:01) Kenneth Farrow rush to the right for 6 yards to the SD50. Tackled by Malcolm Smith.","(10:42) Philip Rivers pass to the left to Dontrelle Inman for 21 yards to the SD44. Tackled by Sean Smith.","(10:48) Sebastian Janikowski kicks off to the SD2. Isaiah Burse return for 21 yards to SD23. Tackled by Cory James.","(10:52) Sebastian Janikowski 33 yard field goal attempt is GOOD. Holder: Marquette King.","(10:56) Derek Carr incomplete pass to the right intended for Michael Crabtree defensed by Melvin Ingram.","(11:41) Derek Carr pass to the left to Seth Roberts for 5 yards to the SD15. Tackled by Trevor Williams.","(12:24) Latavius Murray rush to the right for 3 yards to the SD20. Tackled by Damion Square.","(13:09) Derek Carr pass to the middle to Andre Holmes for 23 yards to the SD23. Tackled by Jahleel Addae and Denzel Perryman.","(13:31) Penalty: False Start on Oakland (Rodney Hudson) -5 yards.","(14:12) Derek Carr pass to the left to Clive Walford for 13 yards to the SD41. Tackled by Dwight Lowery.","(14:55) Derek Carr pass to the right to Michael Crabtree for 6 yards to the Oak46. Tackled by Trevor Williams.","(15:00) Derek Carr incomplete pass to the right intended for DeAndre Washington.","(15:00) Josh Lambo kicks off to the Oak10, out of bounds. No return.","(0:18) Kenneth Farrow rush up the middle for 5 yards to the SD31. Tackled by Perry Riley Jr..","(0:22) Sebastian Janikowski kicks off to the SD16. Hunter Henry return for 10 yards to SD26. Tackled by Johnny Holton.","(0:22) Sebastian Janikowski extra point is good.","(0:27) Derek Carr pass to the right to Michael Crabtree for 13 yards for a TOUCHDOWN.","(0:32) Penalty: Holding on San Diego (Dwight Lowery) 5 yards.","(0:32) Oakland Raiders timeout.","(0:42) Derek Carr pass to the right to Jalen Richard for 3 yards to the SD18. Tackled by Jatavis Brown and Damion Square.","(0:47) Derek Carr incomplete pass to the left intended for DeAndre Washington defensed by Jatavis Brown.","(0:47) Oakland Raiders timeout.","(0:56) DeAndre Washington rush up the middle for 12 yards to the SD21. Tackled by Adrian Phillips.","(0:56) Oakland Raiders timeout.","(1:07) Latavius Murray rush up the middle for 33 yards to the SD33. Tackled by Dwight Lowery.","(1:28) Latavius Murray rush up the middle for 9 yards to the Oak34. Tackled by Jatavis Brown.","(1:29) Josh Lambo kicks off to the endzone. Touchback.","(1:33) Josh Lambo 35 yard field goal attempt is GOOD. Holder: Kellen Clemens.","(1:40) Philip Rivers incomplete pass to the right intended for Kenneth Farrow.","(1:46) Philip Rivers incomplete pass to the right intended for Hunter Henry.","(1:51) Philip Rivers pass to the right to Tyrell Williams for 5 yards to the Oak17. Tackled by David Amerson.","(1:57) Philip Rivers pass to the right to Travis Benjamin for 9 yards to the Oak22. Tackled by David Amerson.","(1:57) Two Minute Warning.","(2:04) Philip Rivers incomplete pass to the middle intended for Tyrell Williams defensed by David Amerson.","(2:47) Ronnie Hillman rush to the left for 3 yards to the Oak31. Tackled by Bruce Irvin.","(3:16) Ronnie Hillman rush to the right for 17 yards to the Oak34. Tackled by Reggie Nelson.","(3:44) Philip Rivers pass to the middle to Hunter Henry for 10 yards to the SD49. Tackled by Malcolm Smith and Nate Allen.","(3:50) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(4:34) Ronnie Hillman rush to the left for 8 yards to the SD39. Tackled by Nate Allen and James Cowser.","(5:16) Philip Rivers pass to the left to Antonio Gates for 11 yards to the SD31. Tackled by Sean Smith.","(5:21) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(5:27) Philip Rivers incomplete pass to the left intended for Dontrelle Inman.","(5:35) Marquette King punts for 43 yards to SD0. Touchback.","(6:17) Derek Carr pass to the left to Jalen Richard for 10 yards to the SD43. Tackled by Casey Hayward and Jatavis Brown.","(6:50) Derek Carr pass to the left to Latavius Murray for 11 yards to the SD43. Tackled by Joey Bosa. Penalty: Illegal Block on Oakland (Seth Roberts) -10 yards.","(6:50) San Diego Chargers timeout.","(7:33) Derek Carr sacked at Oak46 for a loss of 6 yards by Joey Bosa.","(8:10) DeAndre Washington rush up the middle for no gain to the SD48. Tackled by Ryan Carrethers.","(8:22) Drew Kaser punts for 42 yards to Oak49. Jalen Richard return for 3 yards to SD48. Tackled by Robert McClain and Tourek Williams.","(8:25) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(9:08) Kenneth Farrow rush up the middle for 1 yard to the SD9. Tackled by James Cowser.","(9:49) Kenneth Farrow rush up the middle for 2 yards to the SD8. Tackled by Dan Williams and Khalil Mack.","(9:58) Derek Carr pass intended for Seth Roberts INTERCEPTED by Trovon Reed and returned for 3 yards. Tackled by Seth Roberts.","(10:41) DeAndre Washington rush to the right for 5 yards to the SD16. Tackled by Jatavis Brown.","(11:22) Jalen Richard rush to the left for a loss of 1 yard to the SD21. Tackled by Jatavis Brown.","(12:09) Derek Carr pass to the left to Amari Cooper for 28 yards to the SD20. Tackled by Trovon Reed.","(12:53) Derek Carr pass to the middle to Michael Crabtree for 5 yards to the SD48. Tackled by Jatavis Brown.","(13:27) Derek Carr pass to the left to Jalen Richard for a loss of 5 yards to the Oak47. Tackled by Denzel Perryman.","(14:10) Derek Carr pass to the left to DeAndre Washington for 11 yards to the SD48. Tackled by Jahleel Addae.","(14:51) Latavius Murray rush up the middle for 4 yards to the Oak41. Tackled by Denzel Perryman.","(15:00) Drew Kaser punts for 45 yards to Oak37. No return.","(0:23) Philip Rivers pass to the right to Kenneth Farrow for 6 yards to the SD18. Tackled by Bruce Irvin. FUMBLE, recovered by SD.","(1:07) Kenneth Farrow rush up the middle for a loss of 1 yard to the SD12. Tackled by Denico Autry.","(1:44) Kenneth Farrow rush up the middle for 4 yards to the SD13. Tackled by Nate Allen.","(1:52) Latavius Murray rush to the right for 4 yards to the SD10. Tackled by Melvin Ingram. FUMBLE, recovered by SD (Kyle Emanuel). Tackled by Gabe Jackson.","(2:37) Jalen Richard rush to the left for 23 yards to the SD14. Tackled by Jahleel Addae.","(3:14) Jalen Richard rush to the left for 6 yards to the SD37. Tackled by Denzel Perryman.","(3:14) Penalty: Offside on San Diego (Joey Bosa) 5 yards.","(3:25) Drew Kaser punts for 52 yards to Oak29. Jalen Richard return for 8 yards to Oak37. Tackled by Korey Toomer. Penalty: Face Mask on San Diego (Korey Toomer) 15 yards.","(4:01) Philip Rivers sacked at SD19 for a loss of 3 yards by Bruce Irvin.","(4:45) Ronnie Hillman rush to the left for a loss of 3 yards to the SD22. Tackled by Justin Ellis and Khalil Mack.","(4:53) Philip Rivers incomplete pass to the right intended for Dontrelle Inman defensed by Nate Allen.","(4:53) Sebastian Janikowski kicks off to the endzone. Touchback.","(4:58) Sebastian Janikowski 45 yard field goal attempt is GOOD. Holder: Marquette King.","(5:03) Derek Carr incomplete pass to the right intended for Michael Crabtree defensed by Trevor Williams.","(5:40) Latavius Murray rush to the right for a loss of 4 yards to the SD27. Tackled by Melvin Ingram. FUMBLE, recovered by Oak.","(6:14) Derek Carr rush to the right for 6 yards to the SD23. Tackled by Jahleel Addae.","(6:59) Derek Carr pass to the left to Mychal Rivera for 15 yards to the SD29. Tackled by Jahleel Addae.","(7:03) Derek Carr incomplete pass to the left intended for Jalen Richard.","(7:42) DeAndre Washington rush up the middle for 2 yards to the SD44. Tackled by Jahleel Addae.","(8:20) DeAndre Washington rush up the middle for 4 yards to the SD46. Tackled by Damion Square.","(9:02) Derek Carr pass to the left to Michael Crabtree for 9 yards to the Oak50. Tackled by Jahleel Addae.","(9:40) Latavius Murray rush up the middle for 4 yards to the Oak41. Tackled by Korey Toomer.","(10:26) Derek Carr pass to the left to Michael Crabtree for 8 yards to the Oak37. Tackled by Trovon Reed.","(10:32) Josh Lambo kicks off to the Oak9. DeAndre Washington return for 20 yards to Oak29. Tackled by Trovon Reed.","(10:32) Josh Lambo extra point is good.","(10:39) Philip Rivers pass to the right to Travis Benjamin for 47 yards for a TOUCHDOWN.","(10:46) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(11:25) Kenneth Farrow rush up the middle for 2 yards to the Oak47. Tackled by Jihad Ward and Nate Allen.","(12:02) Philip Rivers pass to the left to Dontrelle Inman for 9 yards to the Oak49. Tackled by TJ Carrie.","(12:43) Philip Rivers pass to the right to Dontrelle Inman for 6 yards to the SD42. Tackled by David Amerson.","(13:25) Kenneth Farrow rush to the right for 1 yard to the SD36. Tackled by Khalil Mack and Bruce Irvin.","(14:13) Philip Rivers pass to the middle to Hunter Henry for 20 yards to the SD35. Tackled by Nate Allen and Reggie Nelson.","(14:55) Kenneth Farrow rush up the middle for 6 yards to the SD15. Tackled by Perry Riley Jr..","(15:00) Sebastian Janikowski kicks off to the SD1. Isaiah Burse return for 17 yards to SD18. Tackled by Brynden Trawick. Penalty: Holding on San Diego (Trovon Reed) -9 yards."]