["(0:00) Robert Griffin III pass to the right to Duke Johnson Jr. for 22 yards to the Buf27. Tackled by Shaq Lawson. FUMBLE, recovered by Cle.","(0:23) Robert Griffin III pass to the right to Seth DeValve for 6 yards to the Buf49. Tackled by Zach Brown.","(0:29) Robert Griffin III rush to the right for 6 yards to the Cle45. Tackled by Corey Graham.","(0:56) Duke Johnson Jr. rush up the middle for 2 yards to the Cle39. Tackled by Lorenzo Alexander.","(1:04) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(1:27) Robert Griffin III pass to the middle to Gary Barnidge for 7 yards to the Cle37. Tackled by Preston Brown and Zach Brown.","(1:34) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 3 yards to the Cle30. Tackled by Nickell Robey-Coleman.","(1:57) Robert Griffin III pass to the right to Duke Johnson Jr. for 9 yards to the Cle27. Tackled by Zach Brown.","(1:57) Two Minute Warning.","(2:05) Robert Griffin III pass to the right to Danny Vitale for 17 yards to the Cle18. Tackled by Stephon Gilmore.","(2:11) Jonathan Williams rush to the right for no gain to the Cle1. Tackled by Joe Schobert and Ibraheim Campbell.","(2:56) Jonathan Williams rush up the middle for 5 yards to the Cle1. Tackled by Joe Schobert and Ed Reynolds.","(3:00) EJ Manuel incomplete pass to the left intended for Justin Hunter defensed by Marcus Burley.","(3:42) EJ Manuel rush to the left for 1 yard to the Cle6. Tackled by Carl Nassib and Tracy Howard.","(4:27) Jonathan Williams rush to the right for 5 yards to the Cle7. Tackled by Christian Kirksey and Jamie Meder.","(4:33) Mike Gillislee rush to the right for 8 yards to the Cle12. Tackled by Demario Davis.","(5:17) Mike Gillislee rush to the right for 5 yards to the Cle20. Tackled by Tank Carder.","(6:00) Mike Gillislee rush to the right for 5 yards to the Cle25. Tackled by Demario Davis.","(6:13) Britton Colquitt punts for 35 yards to Buf41. Brandon Tate return for 29 yards to Cle30. Tackled by Charley Hughlett.","(6:46) Robert Griffin III rush to the left for 6 yards to the Cle24. Tackled by Jerry Hughes.","(7:16) Robert Griffin III sacked at Cle18 for a loss of 7 yards by Lorenzo Alexander.","(7:21) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(7:21) Dan Carpenter kicks off to the endzone. Touchback.","(7:25) Dan Carpenter 34 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(8:03) Tyrod Taylor rush to the left for a loss of 3 yards to the Cle16. Tackled by Jamie Collins.","(8:44) Tyrod Taylor pass to the left to Charles Clay for 2 yards to the Cle13. Tackled by Ibraheim Campbell.","(9:29) Mike Gillislee rush to the right for 6 yards to the Cle15. Tackled by Christian Kirksey.","(10:03) LeSean McCoy rush to the right for 16 yards to the Cle21. Tackled by Jamar Taylor and Demario Davis.","(10:43) Tyrod Taylor rush to the right for 2 yards to the Cle37. Tackled by Cam Johnson.","(11:21) LeSean McCoy rush to the left for 11 yards to the Cle39. Tackled by Ed Reynolds.","(11:32) Britton Colquitt punts for 37 yards to Buf43. Brandon Tate return for 7 yards to Buf50. Tackled by Ricardo Louis.","(12:16) Robert Griffin III sacked at Cle20 for a loss of 9 yards by Kyle Williams.","(12:16) Cleveland Browns timeout.","(12:25) Robert Griffin III incomplete pass to the left.","(12:32) Robert Griffin III incomplete pass to the left intended for Gary Barnidge.","(12:38) Dan Carpenter kicks off to the Cle16. Seth DeValve return for 13 yards to Cle29. Tackled by Lorenzo Alexander.","(12:38) Dan Carpenter extra point is NO GOOD.","(12:45) LeSean McCoy rush to the right for 8 yards for a TOUCHDOWN.","(13:20) Tyrod Taylor pass to the right to Justin Hunter for 16 yards to the Cle8.","(14:08) Tyrod Taylor rush to the left for 12 yards to the Cle24. Tackled by Jamar Taylor.","(14:36) LeSean McCoy rush to the left for 4 yards to the Cle36. Tackled by Gabe Wright.","(15:00) Tyrod Taylor pass to the left to Marquise Goodwin for 11 yards to the Cle40.","(0:29) Tyrod Taylor pass to the right to LeSean McCoy for 14 yards to the Buf49. Tackled by Ibraheim Campbell.","(0:54) LeSean McCoy rush to the left for 2 yards to the Buf35. Tackled by Cam Johnson.","(1:25) Tyrod Taylor rush to the left for 8 yards to the Buf33. Tackled by Christian Kirksey.","(1:32) Cody Parkey kicks off to the Buf6. Brandon Tate return for 19 yards to Buf25. Tackled by Joe Schobert.","(1:35) Cody Parkey 40 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(2:04) Robert Griffin III rush to the right for 3 yards to the Buf22. Tackled by Zach Brown.","(2:44) Isaiah Crowell rush to the right for a loss of 1 yard to the Buf25. Tackled by Adolphus Washington.","(2:50) Robert Griffin III incomplete pass to the left intended for Isaiah Crowell.","(3:19) Penalty: Holding on Cleveland (Joe Thomas) -11 yards.","(3:50) Robert Griffin III pass to the left to Gary Barnidge for 28 yards to the Buf27. Tackled by Lorenzo Alexander. Penalty: Roughing Passer on Buffalo (Zach Brown) 14 yards.","(4:27) Isaiah Crowell rush up the middle for 1 yard to the Cle45. Tackled by Kyle Williams and Marcell Dareus.","(5:06) Robert Griffin III rush to the left for 7 yards to the Cle44. Tackled by Zach Brown.","(5:42) Robert Griffin III rush to the right for 4 yards to the Cle37. Tackled by Adolphus Washington.","(5:50) Dan Carpenter kicks off to the Cle9. Mario Alford return for 24 yards to Cle33. Tackled by Brandon Tate and Lorenzo Alexander.","(5:50) Dan Carpenter extra point is good.","(5:53) LeSean McCoy rush to the right for 3 yards for a TOUCHDOWN.","(6:35) Tyrod Taylor rush to the right for 28 yards to the Cle3. Tackled by Ibraheim Campbell.","(6:57) Tyrod Taylor pass to the right to Charles Clay for 9 yards to the Cle46. Tackled by Ibraheim Campbell. Penalty: Roughing Passer on Cleveland (Danny Shelton) 15 yards.","(7:30) Mike Gillislee rush up the middle for 3 yards to the Buf45. Tackled by Christian Kirksey and Danny Shelton.","(8:09) Tyrod Taylor pass to the left to Charles Clay for 12 yards to the Buf42. Tackled by Danny Shelton.","(8:51) Tyrod Taylor pass to the right to Robert Woods for 5 yards to the Buf30. Tackled by Demario Davis.","(8:58) Cody Parkey kicks off to the Buf1. Brandon Tate return for 24 yards to Buf25. Tackled by Cam Johnson and Tracy Howard.","(8:58) Cody Parkey extra point is good.","(9:10) Robert Griffin III rush up the middle for 18 yards for a TOUCHDOWN.","(9:15) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(9:49) Robert Griffin III rush to the left for 4 yards to the Buf18. Tackled by Lorenzo Alexander.","(10:25) Duke Johnson Jr. rush to the left for 13 yards to the Buf22. Tackled by Corey Graham.","(11:01) Robert Griffin III pass to the right to Andrew Hawkins for 33 yards to the Buf35. Tackled by Corey White.","(11:42) Isaiah Crowell rush to the right for a loss of 1 yard to the Cle32. Tackled by Kyle Williams.","(11:47) Robert Griffin III incomplete pass to the right intended for Isaiah Crowell.","(12:11) Penalty: Offside on Buffalo (Shaq Lawson) 5 yards.","(12:52) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 8 yards to the Cle28. Tackled by Stephon Gilmore.","(13:04) Colton Schmidt punts for 48 yards to Cle9. Mario Alford return for 11 yards to Cle20. Tackled by Ramon Humber.","(13:08) Tyrod Taylor incomplete pass to the left intended for Sammy Watkins.","(13:37) LeSean McCoy rush to the right for 7 yards to the Buf43. Tackled by Christian Kirksey.","(13:42) Tyrod Taylor incomplete pass to the right intended for Nick O'Leary defensed by Cam Johnson.","(14:23) LeSean McCoy rush to the right for 2 yards to the Buf36. Tackled by Demario Davis.","(15:00) LeSean McCoy rush to the right for 9 yards to the Buf34. Tackled by Demario Davis and Ed Reynolds.","(15:00) Cody Parkey kicks off to the endzone. Touchback.","(0:03) Robert Griffin III incomplete pass to the right intended for Corey Coleman defensed by Kevon Seymour.","(0:03) Cleveland Browns timeout.","(0:11) Robert Griffin III pass to the right to Duke Johnson Jr. for 7 yards to the Cle35. Tackled by Nickell Robey-Coleman.","(0:20) Robert Griffin III pass to the middle to Duke Johnson Jr. for 11 yards to the Cle28. Tackled by Zach Brown.","(0:24) Robert Griffin III incomplete pass to the left intended for Terrelle Pryor Sr..","(0:34) Dan Carpenter kicks off to the Cle4. Mario Alford return for 13 yards to Cle17. Tackled by Ramon Humber.","(0:34) Dan Carpenter extra point is good.","(0:40) Tyrod Taylor pass to the left to Charles Clay for 19 yards for a TOUCHDOWN.","(0:45) Tyrod Taylor incomplete pass to the left intended for Sammy Watkins.","(1:20) Tyrod Taylor pass to the left to Marquise Goodwin for 9 yards to the Cle19. Tackled by Briean Boddy-Calhoun.","(2:00) Tyrod Taylor pass to the left to LeSean McCoy for 4 yards to the Cle28. Tackled by Ibraheim Campbell.","(2:00) Two Minute Warning.","(2:37) LeSean McCoy rush to the right for 1 yard to the Cle32. Tackled by Demario Davis.","(3:14) Tyrod Taylor pass to the middle to Marquise Goodwin for 23 yards to the Cle33. Tackled by Christian Kirksey.","(3:53) Mike Gillislee rush up the middle for 1 yard to the Buf44. Tackled by Jamie Collins and Christian Kirksey.","(4:33) Tyrod Taylor sacked at Buf43 for a loss of 3 yards by Emmanuel Ogbah.","(4:57) Penalty: Illegal Block on Buffalo (Marquise Goodwin) -10 yards.","(5:37) Tyrod Taylor pass to the right to Charles Clay for 13 yards to the Cle44. Tackled by Demario Davis and Jamar Taylor.","(6:16) Mike Gillislee rush to the left for 2 yards to the Buf43. Tackled by Ed Reynolds.","(6:52) Tyrod Taylor pass to the left to Jerome Felton for 12 yards to the Buf41.","(7:33) LeSean McCoy rush to the right for 2 yards to the Buf29. Tackled by Jamie Collins.","(8:03) LeSean McCoy rush to the right for 18 yards to the Buf27. Tackled by Joe Haden.","(8:16) Britton Colquitt punts for 52 yards to Buf10. Brandon Tate return for 7 yards to Buf17. Tackled by Joe Schobert. Penalty: Illegal Block on Buffalo (Ronald Darby) -8 yards.","(8:22) Robert Griffin III incomplete pass to the left intended for Duke Johnson Jr. defensed by Zach Brown.","(9:06) Robert Griffin III pass to the right to Corey Coleman for 5 yards to the Cle38. Tackled by Ronald Darby.","(9:45) Isaiah Crowell rush up the middle for 1 yard to the Cle33. Tackled by Ramon Humber and Leger Douzable.","(9:58) Colton Schmidt punts for 42 yards to Cle20. Mario Alford return for 12 yards to Cle32. Tackled by Garrison Sanborn.","(10:02) Tyrod Taylor incomplete pass to the middle intended for Robert Woods defensed by Jamar Taylor.","(10:09) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(10:43) Mike Gillislee rush up the middle for 4 yards to the Buf38. Tackled by Danny Shelton and Jamie Meder.","(11:18) LeSean McCoy rush to the left for 8 yards to the Buf34. Tackled by Cam Johnson.","(12:00) Tyrod Taylor pass to the left to Charles Clay for 4 yards to the Buf26. Tackled by Christian Kirksey.","(12:34) LeSean McCoy rush to the left for no gain to the Buf22. Tackled by Christian Kirksey.","(12:46) Britton Colquitt punts for 53 yards to Buf19. Brandon Tate return for 3 yards to Buf22. Tackled by Ed Reynolds.","(13:25) Duke Johnson Jr. rush up the middle for 13 yards to the Cle28. Tackled by Ronald Darby.","(14:01) Duke Johnson Jr. rush to the right for a loss of 1 yard to the Cle15. Tackled by Jerry Hughes and Preston Brown.","(14:55) Robert Griffin III sacked at Cle16 for a loss of 8 yards by Jerry Hughes.","(15:00) Dan Carpenter kicks off to the Cle8. Mario Alford return for 16 yards to Cle24. Tackled by Lorenzo Alexander.","(15:00) Dan Carpenter extra point is good.","(0:03) Mike Gillislee rush to the left for 3 yards for a TOUCHDOWN.","(0:37) LeSean McCoy rush to the right for 9 yards to the Cle3. Tackled by Cam Johnson.","(1:19) Brandon Tate rush to the left for 30 yards to the Cle12. Tackled by Demario Davis.","(1:58) Tyrod Taylor pass to the middle to Charles Clay for 13 yards to the Cle42. Tackled by Jamie Collins.","(2:37) LeSean McCoy rush to the right for 2 yards to the Buf45. Tackled by Ed Reynolds.","(2:42) Tyrod Taylor incomplete pass to the left intended for Sammy Watkins.","(3:12) Tyrod Taylor pass to the right to Sammy Watkins for 10 yards to the Buf43. Tackled by Jamar Taylor.","(3:44) LeSean McCoy rush up the middle for 7 yards to the Buf33. Tackled by Ibraheim Campbell and Jamie Collins.","(3:50) Cody Parkey kicks off to the Buf7. Brandon Tate return for 19 yards to Buf26. Tackled by Joe Schobert.","(3:54) Cody Parkey 35 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(4:29) Robert Griffin III sacked at Buf17 for a loss of 6 yards by Lorenzo Alexander and Kyle Williams.","(4:29) Cleveland Browns timeout.","(4:54) Robert Griffin III sacked at Buf11 for a loss of 4 yards by Zach Brown.","(5:32) Isaiah Crowell rush to the right for a loss of 2 yards to the Buf7. Tackled by Preston Brown.","(6:02) Duke Johnson Jr. rush up the middle for 4 yards to the Buf5. Tackled by Corey White.","(6:35) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 8 yards to the Buf9. Tackled by Ronald Darby.","(7:12) Isaiah Crowell rush to the right for 25 yards to the Buf17. Tackled by Preston Brown.","(7:17) Penalty: Offside on Buffalo (Lorenzo Alexander) 5 yards.","(7:45) Robert Griffin III pass to the left to Corey Coleman for 11 yards to the Buf47. Tackled by Lorenzo Alexander.","(8:16) Isaiah Crowell rush to the left for 3 yards to the Cle42. Tackled by Corey Graham.","(8:52) Robert Griffin III pass to the right to Duke Johnson Jr. for 13 yards to the Cle39. Tackled by Preston Brown.","(9:32) Robert Griffin III rush up the middle for no gain to the Cle28. FUMBLE, recovered by Cle (Isaiah Crowell).","(10:08) Robert Griffin III pass to the left to Corey Coleman for 8 yards to the Cle28. Tackled by Lorenzo Alexander.","(10:14) Dan Carpenter kicks off to the Cle-1. Mario Alford return for 21 yards to Cle20. Tackled by Sergio Brown and Shamiel Gary.","(10:17) Dan Carpenter 21 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(10:56) Tyrod Taylor rush to the right for 2 yards to the Cle3. Tackled by Jamie Meder.","(11:01) Tyrod Taylor incomplete pass to the right intended for Justin Hunter.","(11:36) Tyrod Taylor rush to the right for no gain to the Cle5. Tackled by Ed Reynolds.","(12:11) LeSean McCoy rush to the right for 24 yards to the Cle5. Tackled by Ed Reynolds.","(12:46) LeSean McCoy rush to the left for 20 yards to the Cle29. Tackled by Tramon Williams.","(13:20) Tyrod Taylor pass to the right to LeSean McCoy for a loss of 2 yards to the Cle49. Tackled by Demario Davis.","(13:31) Britton Colquitt punts for 45 yards to Buf38. No return. Penalty: FC Interference on Cleveland (Briean Boddy-Calhoun) 15 yards.","(13:35) Robert Griffin III incomplete pass to the middle intended for Duke Johnson Jr..","(14:11) Isaiah Crowell rush to the right for 2 yards to the Cle17. Tackled by Ronald Darby.","(14:33) Penalty: Holding on Cleveland (Jonathan Cooper) -10 yards.","(15:00) Robert Griffin III pass to the right to Terrelle Pryor Sr. for no gain to the Cle25. Tackled by Stephon Gilmore.","(15:00) Dan Carpenter kicks off to the endzone. Touchback."]