["(0:36) Trevor Siemian rush up the middle for a loss of 1 yard to the SD48.","(1:12) Trevor Siemian rush up the middle for a loss of 1 yard to the SD47.","(1:16) Philip Rivers incomplete pass to the right intended for Melvin Gordon.","(1:25) Philip Rivers pass to the right to Melvin Gordon for 1 yard to the SD46. Tackled by Von Miller and Corey Nelson.","(1:28) Philip Rivers incomplete pass to the left intended for Dontrelle Inman defensed by Jared Crick.","(1:32) Philip Rivers incomplete pass to the right intended for Melvin Gordon.","(2:00) Philip Rivers pass to the right to Melvin Gordon for 9 yards to the SD45. Tackled by Bradley Roby.","(2:00) Two Minute Warning.","(2:08) Melvin Gordon rush up the middle for 3 yards to the SD36. Tackled by T.J. Ward.","(2:19) Riley Dixon punts for 68 yards to SD29. Dexter McCluster return for 4 yards to SD33. Tackled by Zaire Anderson and Dekoda Watson.","(2:26) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(2:26) San Diego Chargers timeout.","(2:31) Devontae Booker rush up the middle for 2 yards to the Den3. Tackled by Kyle Emanuel.","(2:31) Denver Broncos timeout.","(2:31) San Diego Chargers timeout.","(2:36) Devontae Booker rush up the middle for a loss of 1 yard to the Den1. Tackled by Kyle Emanuel.","(2:40) Philip Rivers incomplete pass to the left intended for Hunter Henry defensed by Lorenzo Doss.","(2:45) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(2:51) Philip Rivers incomplete pass to the right.","(2:54) Philip Rivers incomplete pass to the right.","(3:00) Philip Rivers pass to the right to Hunter Henry for 7 yards to the Den2. Tackled by Will Parks.","(3:46) Melvin Gordon rush up the middle for 3 yards to the Den9. Tackled by Billy Winn and Todd Davis.","(4:24) Kenneth Farrow rush up the middle for 5 yards to the Den12. Tackled by T.J. Ward.","(4:31) Melvin Gordon rush up the middle for 17 yards to the Den17. Tackled by Chris Harris Jr..","(4:40) Philip Rivers pass to the left to Melvin Gordon for 30 yards to the Den34. Tackled by T.J. Ward.","(5:14) Philip Rivers pass to the right to Dontrelle Inman for 16 yards to the SD36. Tackled by Bradley Roby.","(5:14) Penalty: False Start on San Diego (Joe Barksdale) -5 yards.","(5:19) Philip Rivers incomplete pass to the right intended for Antonio Gates.","(5:19) Brandon McManus kicks off to the endzone. Touchback.","(5:24) Brandon McManus 22 yard field goal attempt is GOOD. Holder: Riley Dixon.","(5:27) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(6:07) Devontae Booker rush to the right for a loss of 2 yards to the SD4. Tackled by Joey Bosa.","(6:52) Devontae Booker rush to the left for 2 yards to the SD2. Tackled by Brandon Mebane and Korey Toomer.","(7:21) Trevor Siemian pass to the left to Demaryius Thomas for 40 yards to the SD4.","(8:02) Trevor Siemian pass to the right to Virgil Green for 31 yards to the SD44. Tackled by Dwight Lowery.","(8:02) Josh Lambo kicks off to the endzone. Touchback.","(8:02) Philip Rivers 2 pt conversion pass is NO GOOD - intended for Hunter Henry.","(8:02) Penalty: Pass Interference on San Diego (Antonio Gates) -10 yards.","(8:10) Trevor Siemian pass intended for Jordan Norwood INTERCEPTED by Casey Hayward and returned for 24 yards for a TOUCHDOWN.","(8:14) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(8:54) Devontae Booker rush to the right for 1 yard to the Den16. Tackled by Korey Toomer.","(9:12) Trevor Siemian pass to the right to Demaryius Thomas for 14 yards to the Den15. Tackled by Casey Hayward.","(9:43) Devontae Booker rush to the right for a loss of 1 yard to the Den1. Tackled by Corey Liuget.","(9:51) Drew Kaser punts for 60 yards to Den2. No return.","(10:28) Philip Rivers sacked at SD38 for a loss of 9 yards by Justin Simmons.","(10:31) Philip Rivers incomplete pass to the left intended for Travis Benjamin.","(11:16) Kenneth Farrow rush to the right for 1 yard to the SD47. Tackled by Billy Winn.","(11:53) Melvin Gordon rush to the right for 20 yards to the SD46. Tackled by Bradley Roby.","(12:32) Melvin Gordon rush up the middle for 1 yard to the SD26. Tackled by Von Miller.","(12:32) Brandon McManus kicks off to the endzone. Touchback.","(12:32) Brandon McManus extra point is good.","(12:38) Juwan Thompson rush up the middle for 1 yard for a TOUCHDOWN.","(13:21) Trevor Siemian pass to the middle to Emmanuel Sanders for 7 yards to the SD1. Tackled by Dwight Lowery.","(13:27) Trevor Siemian incomplete pass to the right.","(14:02) Devontae Booker rush to the left for 18 yards to the SD8. Tackled by Dwight Lowery.","(14:24) Penalty: Offside on San Diego (Joey Bosa) 5 yards.","(15:00) Kapri Bibbs rush to the right for a loss of 1 yard to the SD31. Tackled by Brandon Mebane.","(0:28) Kapri Bibbs rush to the left for 5 yards to the SD30. Tackled by Joey Bosa.","(1:06) Trevor Siemian pass to the left to Virgil Green for 13 yards to the SD35. Tackled by Jatavis Brown.","(1:12) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(1:47) Devontae Booker rush up the middle for 6 yards to the SD48. Tackled by Jatavis Brown.","(2:21) Trevor Siemian pass to the middle to Virgil Green for 8 yards to the Den46. Tackled by Jatavis Brown.","(2:52) Devontae Booker rush to the left for 4 yards to the Den38. Tackled by Adrian Phillips.","(3:33) Devontae Booker rush to the right for no gain to the Den34. Tackled by Darius Philon.","(4:01) Trevor Siemian pass to the right to Emmanuel Sanders for 9 yards to the Den34. Tackled by Brandon Flowers.","(4:02) Josh Lambo kicks off to the endzone. Touchback.","(4:02) Josh Lambo extra point is BLOCKED.","(4:09) Philip Rivers pass to the left to Travis Benjamin for 14 yards for a TOUCHDOWN.","(4:12) Philip Rivers incomplete pass to the middle intended for Antonio Gates defensed by Todd Davis.","(4:57) Melvin Gordon rush to the left for no gain to the Den14. Tackled by Shane Ray and Jared Crick.","(5:43) Philip Rivers pass to the middle to Antonio Gates for 8 yards to the Den14. Tackled by T.J. Ward.","(5:46) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(6:29) Melvin Gordon rush up the middle for 2 yards to the Den22. Tackled by Billy Winn and Shaquil Barrett.","(7:11) Melvin Gordon rush up the middle for 7 yards to the Den24. Tackled by Adam Gotsis and Todd Davis.","(7:53) Melvin Gordon rush to the right for 5 yards to the Den31. Tackled by T.J. Ward and Corey Nelson.","(8:38) Philip Rivers pass to the right to Dontrelle Inman for 37 yards to the Den36. Tackled by Chris Harris Jr. and T.J. Ward.","(9:18) Philip Rivers pass to the left to Dontrelle Inman for 15 yards to the SD27. Tackled by Lorenzo Doss.","(10:03) Melvin Gordon rush up the middle for 1 yard to the SD12. Tackled by Todd Davis.","(10:44) Melvin Gordon rush to the left for 4 yards to the SD11. Tackled by Todd Davis and T.J. Ward.","(11:04) Penalty: Holding on San Diego (Hunter Henry) -7 yards.","(11:44) Melvin Gordon rush to the right for 12 yards to the SD14. Tackled by Todd Davis.","(11:52) Trevor Siemian pass to the right to Devontae Booker for 9 yards to the SD2. Tackled by Korey Toomer. FUMBLE, recovered by SD (Jatavis Brown). Tackled by Virgil Green.","(12:30) Devontae Booker rush up the middle for a loss of 4 yards to the SD11. Tackled by Jatavis Brown and Dwight Lowery.","(12:40) Philip Rivers pass intended for Griff Whalen INTERCEPTED by T.J. Ward and returned for 23 yards. Tackled by Tyrell Williams.","(12:45) Philip Rivers incomplete pass to the right intended for Antonio Gates.","(12:45) Brandon McManus kicks off to the endzone. Touchback.","(12:45) Brandon McManus extra point is good.","(12:50) Devontae Booker rush to the left for 3 yards for a TOUCHDOWN.","(13:30) Devontae Booker rush to the left for 7 yards to the SD3. Tackled by Jatavis Brown.","(13:40) Philip Rivers pass intended for Travis Benjamin INTERCEPTED by Darian Stewart defensed by Lorenzo Doss and returned for 25 yards. Tackled by Travis Benjamin.","(14:24) Melvin Gordon rush up the middle for 2 yards to the SD32. Tackled by Von Miller and Derek Wolfe.","(15:00) Melvin Gordon rush to the right for 5 yards to the SD30. Tackled by Sylvester Williams and Derek Wolfe.","(15:00) Brandon McManus kicks off to the endzone. Touchback.","(0:09) Philip Rivers sacked at SD44 for a loss of 3 yards by Jared Crick.","(0:14) Philip Rivers incomplete pass to the right intended for Tyrell Williams defensed by Derek Wolfe.","(0:19) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(0:19) Denver Broncos timeout.","(0:23) Trevor Siemian incomplete pass to the right intended for Jordan Norwood.","(0:27) Trevor Siemian incomplete pass to the left intended for Virgil Green defensed by Korey Toomer.","(0:48) Trevor Siemian pass to the middle to Devontae Booker for 4 yards to the SD46. Tackled by Jatavis Brown.","(0:54) Trevor Siemian pass to the left to Emmanuel Sanders for 15 yards to the Den50. Tackled by Steve Williams.","(0:59) 45 yard field goal attempt by Josh Lambo is NO GOOD. Holder: Kellen Clemens.","(1:04) Philip Rivers incomplete pass to the left intended for Travis Benjamin.","(1:11) Philip Rivers incomplete pass to the left intended for Melvin Gordon defensed by Corey Nelson.","(1:17) Philip Rivers incomplete pass to the right intended for Travis Benjamin.","(1:23) Philip Rivers pass to the right to Antonio Gates for 12 yards to the Den27. Tackled by T.J. Ward.","(2:00) Philip Rivers pass to the right to Melvin Gordon for 4 yards to the Den39. Tackled by Corey Nelson.","(2:00) Two Minute Warning.","(2:22) Philip Rivers pass to the right to Travis Benjamin for 12 yards to the Den43. Tackled by Chris Harris Jr..","(2:29) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(3:12) Melvin Gordon rush to the left for 2 yards to the SD45. Tackled by Todd Davis and Corey Nelson.","(3:32) Penalty: Offside on Denver (Von Miller) 5 yards.","(4:01) Kenneth Farrow rush up the middle for 6 yards to the SD33. Tackled by Sylvester Williams. Penalty: Holding on Denver (Sylvester Williams) 5 yards.","(4:37) Melvin Gordon rush to the left for 11 yards to the SD27. Tackled by Darian Stewart.","(4:43) Trevor Siemian sacked at SD16 for a loss of 9 yards by Melvin Ingram. FUMBLE, recovered by SD (Tenny Palepoi). Tackled by Michael Schofield.","(4:48) Trevor Siemian incomplete pass to the left intended for Virgil Green defensed by Casey Hayward.","(5:23) Devontae Booker rush to the right for 4 yards to the SD7. Tackled by Dwight Lowery and Tenny Palepoi.","(5:23) Denver Broncos timeout.","(6:05) Trevor Siemian pass to the right to Emmanuel Sanders for 37 yards to the SD11. Tackled by Dwight Lowery.","(6:44) Trevor Siemian pass to the left to Devontae Booker for 12 yards to the SD48. Tackled by Dwight Lowery.","(7:23) Devontae Booker rush to the right for 3 yards to the Den40. Tackled by Brandon Mebane.","(7:57) Devontae Booker rush up the middle for 5 yards to the Den37. Tackled by Brandon Mebane.","(8:11) Drew Kaser punts for 54 yards to Den22. Jordan Norwood return for 10 yards to Den32. Tackled by Sean McGrath. FUMBLE, recovered by Den (Jordan Taylor).","(8:17) Philip Rivers incomplete pass to the middle intended for Travis Benjamin.","(9:01) Philip Rivers pass to the left to Antonio Gates for 6 yards to the SD24. Tackled by Darian Stewart.","(9:06) Philip Rivers incomplete pass to the left intended for Tyrell Williams defensed by Chris Harris Jr..","(9:10) Brandon McManus kicks off to the SD1. Dexter McCluster return for 17 yards to SD18. Tackled by Jordan Taylor and Dekoda Watson.","(9:10) Brandon McManus extra point is good.","(9:22) Philip Rivers pass intended for Tyrell Williams INTERCEPTED by Bradley Roby and returned for 51 yards for a TOUCHDOWN.","(9:40) Penalty: False Start on San Diego (Joe Barksdale) -5 yards.","(10:11) Penalty: Illegal Formation on San Diego (Joe Barksdale) -5 yards.","(10:21) Penalty: Running into Kicker on Denver (Justin Simmons) 15 yards.","(10:25) Philip Rivers incomplete pass to the left intended for Tyrell Williams defensed by DeMarcus Ware.","(11:12) Melvin Gordon rush to the right for 3 yards to the SD41. Tackled by Derek Wolfe.","(11:56) Philip Rivers sacked at SD38 for a loss of 1 yard by Von Miller.","(12:05) Riley Dixon punts for 45 yards to SD39. No return.","(12:10) Trevor Siemian incomplete pass to the middle intended for Emmanuel Sanders defensed by Jatavis Brown.","(12:16) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas.","(12:44) Penalty: Holding on Denver (John Phillips) -10 yards.","(13:08) Devontae Booker rush to the right for 6 yards to the Den26. Tackled by Melvin Ingram.","(13:19) Drew Kaser punts for 51 yards to Den0. Touchback.","(13:51) Philip Rivers pass to the right to Tyrell Williams for 4 yards to the SD49. Tackled by Chris Harris Jr. and Bradley Roby.","(14:18) Philip Rivers pass to the left to Dexter McCluster for 3 yards to the SD45. Tackled by T.J. Ward.","(15:00) Melvin Gordon rush to the right for no gain to the SD42. Tackled by Corey Nelson and Bradley Roby.","(0:27) Philip Rivers pass to the right to Hunter Henry for 7 yards to the SD42. Tackled by Bradley Roby.","(1:10) Melvin Gordon rush up the middle for 4 yards to the SD35. Tackled by Bradley Roby and Todd Davis.","(1:17) Riley Dixon punts for 52 yards to SD31. No return.","(1:54) Trevor Siemian pass to the left to Devontae Booker for 2 yards to the Den17. Tackled by Korey Toomer.","(1:54) Penalty: False Start on Denver (Virgil Green) -5 yards.","(1:58) Trevor Siemian incomplete pass to the right intended for Bennie Fowler.","(2:04) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(2:14) Drew Kaser punts for 58 yards to Den0. Touchback.","(2:49) Philip Rivers sacked at SD42 for a loss of 8 yards by T.J. Ward.","(2:54) Philip Rivers incomplete pass to the left intended for Travis Benjamin.","(2:59) Philip Rivers incomplete pass to the left intended for Hunter Henry defensed by Jared Crick.","(2:59) Penalty: False Start on San Diego (Sean McGrath) -5 yards.","(3:10) Riley Dixon punts for 44 yards to SD49. Dexter McCluster return for 6 yards to Den45. Tackled by Zaire Anderson.","(3:14) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas defensed by Casey Hayward.","(3:40) Trevor Siemian pass to the left to Demaryius Thomas for 1 yard to the Den7. Tackled by Casey Hayward.","(4:16) Devontae Booker rush up the middle for 1 yard to the Den6. Tackled by Denzel Perryman.","(4:28) Drew Kaser punts for 62 yards to Den5. Jordan Norwood return for 5 yards to Den10. Tackled by Jatavis Brown. Penalty: Illegal Block on Denver (Lorenzo Doss) -5 yards.","(4:34) Philip Rivers incomplete pass to the right intended for Dontrelle Inman defensed by Bradley Roby.","(5:19) Philip Rivers pass to the right to Dontrelle Inman for 4 yards to the SD33. Tackled by Darian Stewart.","(5:55) Melvin Gordon rush up the middle for 2 yards to the SD29. Tackled by Todd Davis.","(6:06) Riley Dixon punts for 44 yards to SD23. Dexter McCluster return for 4 yards to SD27. Tackled by Dekoda Watson.","(6:39) Trevor Siemian pass to the middle to Jordan Norwood for 9 yards to the Den33. Tackled by Dwight Lowery.","(7:18) Trevor Siemian rush up the middle for no gain to the Den25. FUMBLE, recovered by Den (Kapri Bibbs).","(7:24) Trevor Siemian incomplete pass to the right intended for Demaryius Thomas defensed by Kyle Emanuel.","(7:24) Josh Lambo kicks off to the endzone. Touchback.","(7:24) Josh Lambo extra point is good.","(7:30) Philip Rivers pass to the left to Antonio Gates for 7 yards for a TOUCHDOWN.","(8:14) Melvin Gordon rush to the left for a loss of 1 yard to the Den7. Tackled by Kayvon Webster and Shane Ray.","(8:53) Melvin Gordon rush up the middle for 3 yards to the Den6. Tackled by Billy Winn.","(9:46) Philip Rivers pass to the right to Derek Watt for 53 yards to the Den9. Tackled by Chris Harris Jr..","(10:21) Philip Rivers pass to the left to Travis Benjamin for 18 yards to the SD38.","(10:25) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(10:56) Melvin Gordon rush to the left for 5 yards to the SD20. Tackled by Chris Harris Jr..","(11:05) Brandon McManus kicks off to the SD0. Griff Whalen return for 25 yards to SD25. Tackled by Will Parks. Penalty: Holding on San Diego (Chris Landrum) -10 yards.","(11:07) Brandon McManus 28 yard field goal attempt is GOOD. Holder: Riley Dixon.","(11:54) Trevor Siemian incomplete pass to the left intended for Devontae Booker defensed by Brandon Flowers.","(11:54) Trevor Siemian pass to the right to Devontae Booker for 3 yards to the SD10. Tackled by Joshua Perry and Jatavis Brown.","(12:32) Devontae Booker rush to the left for no gain to the SD13. Tackled by Tenny Palepoi and Melvin Ingram.","(12:58) Trevor Siemian pass to the right to Demaryius Thomas for 13 yards to the SD13. Tackled by Adrian Phillips.","(13:34) Trevor Siemian pass to the right to Demaryius Thomas for 11 yards to the SD26. Tackled by Casey Hayward and Jatavis Brown.","(14:09) Trevor Siemian pass to the left to Jordan Taylor for 35 yards to the SD37. Tackled by Adrian Phillips.","(14:18) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas defensed by Adrian Phillips.","(15:00) Trevor Siemian pass to the left to Virgil Green for 3 yards to the Den28. Tackled by Adrian Phillips.","(15:00) Josh Lambo kicks off to the endzone. Touchback."]