["(0:09) Matt Ryan rush up the middle for a loss of 1 yard to the GB32.","(0:14) Aaron Rodgers incomplete pass to the right intended for Davante Adams.","(0:20) Aaron Rodgers incomplete pass to the right intended for Geronimo Allison defensed by C.J. Goodwin.","(0:20) Green Bay Packers timeout.","(0:26) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(0:31) Aaron Rodgers pass to the left to Jeff Janis for 7 yards to the GB32.","(0:31) Matt Bosher kicks off to the endzone. Touchback.","(0:31) Matt Bryant extra point is good.","(0:36) Matt Ryan pass to the middle to Mohamed Sanu for 11 yards for a TOUCHDOWN.","(1:14) Matt Ryan pass to the right to Austin Hooper for 3 yards to the GB11. Tackled by Blake Martinez.","(1:20) Matt Ryan pass to the right to Mohamed Sanu for 9 yards to the GB14. Tackled by Demetri Goodson.","(1:25) Matt Ryan incomplete pass to the left intended for Julio Jones defensed by Ladarius Gunter.","(2:00) Matt Ryan pass to the left to Devonta Freeman for 1 yard to the GB23. Tackled by Joe Thomas.","(2:00) Two Minute Warning.","(2:31) Matt Ryan pass to the left to Mohamed Sanu for 9 yards to the GB24. Tackled by Ha Ha Clinton-Dix.","(2:37) Matt Ryan pass to the left to Mohamed Sanu for 12 yards to the GB33. Tackled by Micah Hyde.","(3:02) Matt Ryan pass to the left to Devonta Freeman for 8 yards to the GB45. Tackled by Ladarius Gunter.","(3:05) Matt Ryan incomplete pass to the left intended for Mohamed Sanu defensed by Ladarius Gunter.","(3:32) Matt Ryan pass to the right to Justin Hardy for 13 yards to the Atl47. Tackled by Demetri Goodson.","(3:58) Matt Ryan pass to the left to Mohamed Sanu for 9 yards to the Atl34. Tackled by Joe Thomas.","(3:58) Mason Crosby kicks off to the endzone. Touchback.","(3:58) Aaron Rodgers 2 pt rush attempt. Successful.","(4:04) Aaron Rodgers pass to the left to Jeff Janis for 7 yards for a TOUCHDOWN.","(4:48) Aaron Ripkowski rush to the left for no gain to the Atl7. Tackled by Grady Jarrett and Keanu Neal.","(5:34) Aaron Ripkowski rush to the left for 6 yards to the Atl7. Tackled by Keanu Neal and De'Vondre Campbell.","(6:46) Aaron Rodgers pass to the right to Jeff Janis for 6 yards to the Atl18. Tackled by Desmond Trufant. Penalty: Too Many Men on Field on Atlanta (Brooks Reed) 5 yards.","(7:13) Aaron Rodgers incomplete pass to the left intended for Davante Adams defensed by C.J. Goodwin.","(7:52) Aaron Rodgers rush to the right for 13 yards to the Atl24. Tackled by C.J. Goodwin.","(8:36) Aaron Ripkowski rush to the left for 2 yards to the Atl37. Tackled by Courtney Upshaw.","(9:12) Aaron Ripkowski rush to the left for 5 yards to the Atl39. Tackled by Vic Beasley Jr..","(9:45) Aaron Rodgers pass to the left to Geronimo Allison for 17 yards to the Atl44.","(10:33) Aaron Rodgers rush up the middle for 2 yards to the GB39. Tackled by Keanu Neal.","(11:00) Aaron Rodgers pass to the left to Davante Adams for 11 yards to the GB37. Tackled by Ricardo Allen.","(11:47) Aaron Rodgers rush to the left for 11 yards to the GB26. Tackled by Robert Alford.","(12:31) Aaron Rodgers pass to the left to Davante Adams for 1 yard to the GB15. Tackled by Brian Poole.","(12:43) Matt Bosher punts for 52 yards to GB23. Trevor Davis return for 5 yards to GB28. Tackled by Kemal Ishmael. Penalty: Face Mask on Green Bay (Kentrell Brice) -14 yards.","(13:23) Matt Ryan sacked at Atl25 for a loss of 2 yards by Julius Peppers.","(14:10) Matt Ryan sacked at Atl27 for a loss of 9 yards by Mike Daniels.","(14:48) Devonta Freeman rush to the left for 3 yards to the Atl36. Tackled by Demetri Goodson and Jake Ryan.","(15:00) Jacob Schum punts for 50 yards to Atl15. Eric Weems return for 18 yards to Atl33. Tackled by Jayrone Elliott.","(0:12) Aaron Rodgers sacked at GB35 for a loss of 8 yards by Adrian Clayborn.","(0:57) Aaron Rodgers pass to the left to Davante Adams for a loss of 2 yards to the GB43. Tackled by Brian Poole.","(1:39) Don Jackson rush to the right for a loss of 1 yard to the GB45. Tackled by Deion Jones.","(2:07) Aaron Rodgers pass to the left to Davante Adams for 14 yards to the GB46. Tackled by Desmond Trufant.","(2:52) Knile Davis rush to the left for no gain to the GB32. Tackled by Adrian Clayborn.","(3:31) Aaron Rodgers pass to the right to Davante Adams for 7 yards to the GB32. Tackled by Robert Alford.","(3:31) Matt Bosher kicks off to the endzone. Touchback.","(3:31) Matt Bryant extra point is good.","(3:35) Devonta Freeman rush to the right for 1 yard for a TOUCHDOWN.","(4:20) Devonta Freeman rush to the left for no gain to the GB1. Tackled by Ha Ha Clinton-Dix.","(4:57) Devonta Freeman rush to the left for no gain to the GB1. Tackled by Jake Ryan and Mike Pennel.","(4:57) Atlanta Falcons timeout.","(5:37) Matt Ryan pass to the right to Terron Ward for 11 yards to the GB1. Tackled by Kentrell Brice.","(6:20) Terron Ward rush to the right for 3 yards to the GB12. Tackled by Jake Ryan.","(7:02) Devonta Freeman rush to the right for 1 yard to the GB15. Tackled by Nick Perry.","(7:30) Devonta Freeman rush to the left for 7 yards to the GB16. Tackled by Morgan Burnett.","(8:10) Devonta Freeman rush to the right for 3 yards to the GB23. Tackled by Jayrone Elliott.","(8:43) Terron Ward rush to the right for 26 yards to the GB26. Tackled by Ha Ha Clinton-Dix.","(9:07) Matt Ryan pass to the left to Mohamed Sanu for 4 yards to the Atl48. Tackled by Jake Ryan.","(9:33) Matt Ryan pass to the middle to Taylor Gabriel for 10 yards to the Atl44. Tackled by Morgan Burnett.","(9:55) Devonta Freeman rush to the right for 4 yards to the Atl34. Tackled by Blake Martinez and Morgan Burnett.","(10:11) Penalty: Offside on Green Bay (Kyler Fackrell) 5 yards.","(10:58) Matt Ryan pass to the right to Mohamed Sanu for 5 yards to the Atl25. Tackled by Morgan Burnett and Letroy Guion.","(11:02) Matt Ryan incomplete pass to the middle intended for Levine Toilolo defensed by Blake Martinez.","(11:11) Jacob Schum punts for 55 yards to Atl0. Touchback.","(11:43) Aaron Rodgers sacked at GB45 for a loss of 8 yards by Adrian Clayborn.","(11:43) Green Bay Packers timeout.","(12:31) Aaron Rodgers pass to the right to Davante Adams for 4 yards to the Atl47. Tackled by Keanu Neal.","(12:37) Aaron Rodgers incomplete pass to the left intended for Geronimo Allison.","(13:24) Aaron Ripkowski rush to the right for 12 yards to the GB49. Tackled by De'Vondre Campbell and Grady Jarrett.","(14:05) Aaron Rodgers pass to the left to Davante Adams for 4 yards to the GB37. Tackled by Brian Poole.","(14:54) Aaron Rodgers rush to the left for 8 yards to the GB33. Tackled by Courtney Upshaw.","(15:00) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson defensed by Robert Alford.","(15:00) Matt Bosher kicks off to the endzone. Touchback.","(0:04) Mason Crosby 29 yard field goal attempt is GOOD. Holder: Jacob Schum.","(0:09) Aaron Ripkowski rush to the left for 9 yards to the Atl22. Tackled by De'Vondre Campbell. Penalty: Unnecessary Roughness on Atlanta (Keanu Neal) 11 yards.","(0:09) Green Bay Packers timeout.","(0:17) Aaron Rodgers pass to the right to Jordy Nelson for 21 yards to the Atl31. Tackled by Ricardo Allen and Brian Poole.","(0:27) Aaron Rodgers rush to the right for 23 yards to the GB48. Tackled by Ricardo Allen.","(0:27) Matt Bosher kicks off to the endzone. Touchback.","(0:27) Matt Ryan 2 pt rush attempt.","(0:32) Matt Ryan pass to the left to Devonta Freeman for 5 yards for a TOUCHDOWN.","(1:14) Devonta Freeman rush to the right for no gain to the GB5. Tackled by Jake Ryan.","(2:00) Matt Ryan pass to the left to Austin Hooper for 17 yards to the GB5. Tackled by Ha Ha Clinton-Dix.","(2:00) Two Minute Warning.","(2:26) Terron Ward rush to the right for 5 yards to the GB22. Tackled by Morgan Burnett.","(3:00) Matt Ryan pass to the right to Taylor Gabriel for 11 yards to the GB27. Tackled by Demetri Goodson.","(3:32) Penalty: Roughing Passer on Green Bay (Datone Jones) 15 yards.","(4:03) Matt Ryan pass to the left to Austin Hooper for 13 yards to the Atl47. Tackled by Jake Ryan.","(4:22) Matt Ryan pass to the left to Devonta Freeman for 9 yards to the Atl34. Tackled by Ha Ha Clinton-Dix and Joe Thomas.","(4:22) Mason Crosby kicks off to the endzone. Touchback.","(4:22) Mason Crosby extra point is good.","(4:31) Aaron Rodgers pass to the right to Trevor Davis for 9 yards for a TOUCHDOWN.","(5:03) Aaron Rodgers pass to the left to Davante Adams for a loss of 2 yards to the Atl9. Tackled by Keanu Neal. FUMBLE, recovered by GB.","(5:40) Aaron Rodgers rush to the left for 3 yards to the Atl12. Tackled by Deion Jones. Penalty: Holding on Atlanta (Brian Poole) 5 yards.","(5:46) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(6:02) Matt Bosher punts for 49 yards to GB30. Trevor Davis return for 55 yards to Atl15. Tackled by Kemal Ishmael.","(6:08) Matt Ryan incomplete pass to the right intended for Aldrick Robinson defensed by Demetri Goodson.","(6:15) Matt Ryan incomplete pass to the left intended for Julio Jones.","(6:15) Green Bay Packers timeout.","(6:40) Matt Ryan pass to the right to Austin Hooper for 4 yards to the Atl21. Tackled by Joe Thomas and Demetri Goodson.","(7:10) Penalty: Illegal Formation on Atlanta (Julio Jones) -5 yards.","(7:25) Jacob Schum punts for 58 yards to Atl22. Eric Weems return for 10 yards to Atl32. Tackled by Micah Hyde. Penalty: Holding on Atlanta (Kemal Ishmael) -10 yards.","(8:03) Aaron Rodgers sacked at GB20 for a loss of 7 yards by Vic Beasley Jr..","(8:08) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(8:52) Don Jackson rush to the left for 2 yards to the GB27. Tackled by Jonathan Babineaux.","(8:52) Matt Bosher kicks off to the endzone. Touchback.","(8:55) Matt Bryant 40 yard field goal attempt is GOOD. Holder: Matt Bosher.","(9:35) Matt Ryan pass to the middle to Julio Jones for 5 yards to the GB22. Tackled by Ladarius Gunter.","(10:20) Devonta Freeman rush to the right for a loss of 1 yard to the GB27. Tackled by Jake Ryan and Kenny Clark.","(10:56) Terron Ward rush to the left for a loss of 1 yard to the GB26. Tackled by Jake Ryan.","(11:21) Matt Ryan pass to the middle to Mohamed Sanu for 11 yards to the GB25. Tackled by Morgan Burnett.","(11:47) Terron Ward rush to the right for 10 yards to the GB36. Tackled by Demetri Goodson.","(11:51) Penalty: Pass Interference on Green Bay (Ladarius Gunter) 24 yards.","(11:53) Mason Crosby kicks off to the endzone. Touchback. Penalty: Offside on Green Bay (Kentrell Brice) 5 yards.","(11:53) Mason Crosby extra point is good.","(11:58) Aaron Rodgers pass to the right to Geronimo Allison for 4 yards for a TOUCHDOWN.","(12:03) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Deion Jones.","(12:51) Aaron Rodgers pass to the left to Aaron Ripkowski for a loss of 1 yard to the Atl4. Tackled by Deion Jones and Keanu Neal.","(13:36) Aaron Rodgers pass to the right to Trevor Davis for 9 yards to the Atl3. Tackled by Brian Poole.","(14:17) Aaron Rodgers pass to the left to Davante Adams for 2 yards to the Atl12. Tackled by Brian Poole.","(15:00) Aaron Rodgers pass to the right to Knile Davis for 10 yards to the Atl14. Tackled by Keanu Neal.","(0:34) Aaron Rodgers pass to the right to Davante Adams for 22 yards to the Atl24. Tackled by Desmond Trufant.","(0:57) Penalty: False Start on Green Bay (Bryan Bulaga) -5 yards.","(1:25) Aaron Rodgers pass to the left to Knile Davis for a loss of 6 yards to the Atl41. Tackled by De'Vondre Campbell.","(1:25) Atlanta Falcons timeout.","(1:35) Aaron Rodgers pass to the left to Jeff Janis for 10 yards to the Atl35. Tackled by Robert Alford.","(2:20) Aaron Rodgers pass to the right to Trevor Davis for 6 yards to the Atl45.","(2:58) Aaron Rodgers pass to the left to Davante Adams for 10 yards to the GB49. Tackled by Robert Alford.","(3:34) Aaron Rodgers pass to the right to Jordy Nelson for 10 yards to the GB39. Tackled by Desmond Trufant.","(4:20) Knile Davis rush to the left for 4 yards to the GB29. Tackled by De'Vondre Campbell.","(4:28) Aaron Rodgers incomplete pass to the right intended for Trevor Davis.","(4:28) Matt Bosher kicks off to the endzone. Touchback.","(4:28) Matt Bryant extra point is good.","(4:36) Matt Ryan pass to the middle to Taylor Gabriel for 47 yards for a TOUCHDOWN.","(5:19) Matt Ryan pass to the right to Julio Jones for 12 yards to the GB47. Tackled by Morgan Burnett.","(6:01) Matt Ryan pass to the right to Julio Jones for 12 yards to the Atl41. Tackled by Blake Martinez.","(6:08) Mason Crosby kicks off to the Atl8. Eric Weems return for 21 yards to Atl29. Tackled by Blake Martinez.","(6:08) Mason Crosby extra point is good.","(6:14) Aaron Rodgers pass to the right to Jordy Nelson for 5 yards for a TOUCHDOWN.","(7:00) Don Jackson rush to the right for 2 yards to the Atl5. Tackled by Keanu Neal and Courtney Upshaw.","(7:37) Aaron Rodgers pass to the right to Jordy Nelson for 58 yards to the Atl7. Tackled by Ricardo Allen.","(8:21) Knile Davis rush to the right for no gain to the GB35. Tackled by Brooks Reed.","(9:06) Don Jackson rush to the right for 7 yards to the GB35. Tackled by Deion Jones and Vic Beasley Jr..","(9:41) Aaron Rodgers pass to the left to Davante Adams for 3 yards to the GB28. Tackled by Robert Alford.","(9:41) Matt Bosher kicks off to the endzone. Touchback.","(9:46) Matt Bryant 36 yard field goal attempt is GOOD. Holder: Matt Bosher.","(10:23) Matt Ryan pass to the left to Austin Hooper for 4 yards to the GB18. Tackled by Demetri Goodson.","(10:27) Matt Ryan incomplete pass to the left intended for Devonta Freeman defensed by Nick Perry.","(11:09) Terron Ward rush to the right for 3 yards to the GB22. Tackled by Letroy Guion.","(11:47) Devonta Freeman rush to the left for 17 yards to the GB25. Tackled by Blake Martinez.","(12:08) Matt Ryan pass to the right to Jacob Tamme for 13 yards to the GB42. Tackled by Morgan Burnett.","(12:46) Matt Ryan pass to the left to Jacob Tamme for 6 yards to the Atl45. Tackled by Blake Martinez.","(13:10) Penalty: Illegal Formation on Atlanta (Ryan Schraeder) -5 yards.","(13:41) Penalty: Illegal Formation on Atlanta (Taylor Gabriel) -5 yards.","(13:45) Matt Ryan incomplete pass to the right intended for Devonta Freeman.","(14:29) Matt Ryan rush up the middle for 10 yards to the Atl49. Tackled by Jake Ryan.","(15:00) Matt Ryan pass to the right to Mohamed Sanu for 14 yards to the Atl39. Tackled by Morgan Burnett.","(15:00) Mason Crosby kicks off to the endzone. Touchback."]