["(0:02) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(0:02) Washington Redskins timeout.","(0:30) Kirk Cousins pass to the right to Jordan Reed for 8 yards to the Cin48. Tackled by Vincent Rey.","(0:30) Washington Redskins timeout.","(0:46) Kirk Cousins pass to the right to Jamison Crowder for 1 yard to the Was44. Tackled by Darqueze Dennard.","(0:54) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(1:02) Penalty: Pass Interference on Washington (Pierre Garcon) -10 yards.","(1:11) Andy Dalton rush up the middle for 1 yard to the Cin47. Tackled by Chris Baker. FUMBLE, recovered by Was (Anthony Lanier). Tackled by Andrew Whitworth.","(1:31) Andy Dalton pass to the left to Tyler Boyd for 9 yards to the Cin46. Tackled by Kendall Fuller.","(1:37) Andy Dalton incomplete pass to the right intended for Tyler Eifert defensed by Su'a Cravens.","(2:00) Andy Dalton pass to the right to Tyler Boyd for 9 yards to the Cin37. Tackled by Josh Norman.","(2:00) Two Minute Warning.","(2:09) Andy Dalton pass to the left to Tyler Eifert for 4 yards to the Cin28. Tackled by Donte Whitner.","(2:13) 34 yard field goal attempt by Dustin Hopkins is NO GOOD. Holder: Tress Way.","(2:13) Cincinnati Bengals timeout.","(2:52) Kirk Cousins rush up the middle for a loss of 3 yards to the Cin16. Tackled by Karlos Dansby.","(3:23) Rob Kelley rush to the left for 16 yards to the Cin13. Tackled by Karlos Dansby.","(3:28) Penalty: Holding on Washington (Brandon Scherff) -10 yards.","(3:32) Kirk Cousins pass to the right to Jordan Reed for 9 yards to the Cin19. Tackled by Dre Kirkpatrick.","(4:05) Rob Kelley rush to the left for 4 yards to the Cin28. Tackled by Vontaze Burfict.","(4:11) Penalty: Holding on Cincinnati (Vontaze Burfict) 5 yards.","(4:11) Cincinnati Bengals timeout.","(4:49) Chris Thompson rush to the right for 5 yards to the Cin37. Tackled by Domata Peko.","(5:28) Kirk Cousins pass to the left to Pierre Garcon for 4 yards to the Cin42. Tackled by Shawn Williams.","(5:56) Kirk Cousins pass to the left to Pierre Garcon for 12 yards to the Cin46. Tackled by Josh Shaw.","(6:24) Kirk Cousins pass to the right to Jordan Reed for 14 yards to the Was42. Tackled by Dre Kirkpatrick.","(6:53) Rob Kelley rush to the left for 6 yards to the Was28. Tackled by Domata Peko.","(7:00) Kevin Huber punts for 41 yards to Was7. No return. Penalty: FC Interference on Cincinnati (Darqueze Dennard) 15 yards.","(7:41) Andy Dalton sacked at Was48 for a loss of 8 yards by Ryan Kerrigan.","(7:45) Andy Dalton incomplete pass to the right intended for Tyler Boyd.","(8:29) Jeremy Hill rush to the left for 2 yards to the Was40. Tackled by Will Compton and Cullen Jenkins.","(8:59) Andy Dalton rush up the middle for 14 yards to the Was42. Tackled by Donte Whitner.","(9:43) Andy Dalton pass to the left to A.J. Green for 10 yards to the Cin44. Tackled by Kendall Fuller.","(9:50) Penalty: Holding on Cincinnati (Russell Bodine) -10 yards.","(10:33) Jeremy Hill rush to the right for 1 yard to the Cin44. Tackled by Chris Baker.","(11:02) Jeremy Hill rush to the left for 4 yards to the Cin43. Tackled by Ryan Kerrigan.","(11:28) Jeremy Hill rush to the left for 8 yards to the Cin39. Tackled by Will Compton.","(11:54) Andy Dalton pass to the left to Giovani Bernard for 14 yards to the Cin31. Tackled by Duke Ihenacho.","(12:02) Tress Way punts for 35 yards to Cin10. Alex Erickson return for 7 yards to Cin17. Tackled by Houston Bates.","(12:07) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(12:12) Kirk Cousins incomplete pass to the left intended for Ryan Grant.","(12:53) Rob Kelley rush to the right for 3 yards to the Cin45. Tackled by Shawn Williams.","(13:23) Kirk Cousins pass to the left to Chris Thompson for 13 yards to the Cin48. Tackled by Vincent Rey.","(13:43) Penalty: False Start on Washington (Shawn Lauvao) -5 yards.","(14:24) Rob Kelley rush to the left for 3 yards to the Was44. Tackled by Vontaze Burfict.","(15:00) Kirk Cousins pass to the right to Pierre Garcon for 16 yards to the Was41. Tackled by Josh Shaw.","(15:00) Mike Nugent kicks off to the endzone. Touchback.","(0:03) Kirk Cousins rush up the middle for a loss of 1 yard to the Was19.","(0:11) Kevin Huber punts for 61 yards to Was0. Touchback.","(0:11) Washington Redskins timeout.","(0:21) Andy Dalton sacked at Cin39 for a loss of 4 yards by Su'a Cravens.","(0:25) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(0:32) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Duke Ihenacho.","(0:38) Penalty: Illegal Use of Hands on Washington (Josh Norman) 5 yards.","(0:46) Andy Dalton incomplete pass to the right intended for A.J. Green.","(1:07) Andy Dalton pass to the middle to Tyler Eifert for 13 yards to the Cin38. Tackled by Preston Smith.","(1:07) Dustin Hopkins kicks off to the endzone. Touchback.","(1:11) Dustin Hopkins 40 yard field goal attempt is GOOD. Holder: Tress Way.","(1:16) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(1:21) Kirk Cousins incomplete pass to the right intended for Jordan Reed defensed by Carlos Dunlap.","(1:27) Kirk Cousins incomplete pass to the right intended for Maurice Harris.","(1:56) Kirk Cousins pass to the right to Jamison Crowder for 20 yards to the Cin22. Tackled by Dre Kirkpatrick.","(2:00) Kirk Cousins incomplete pass to the left intended for Jordan Reed.","(2:00) Two Minute Warning.","(2:07) Chris Thompson rush to the left for a loss of 3 yards to the Cin42. Tackled by Geno Atkins.","(2:37) Kirk Cousins pass to the left to Ryan Grant for 17 yards to the Cin39. Tackled by Shawn Williams.","(2:41) Kirk Cousins pass to the left to Chris Thompson for 7 yards to the Was44. Tackled by Adam Jones.","(3:15) Chris Thompson rush to the left for 4 yards to the Was37. Tackled by Vontaze Burfict.","(3:27) Kevin Huber punts for 58 yards to Was10. Jamison Crowder return for 23 yards to Was33. Tackled by Rex Burkhead.","(3:32) Andy Dalton incomplete pass to the right intended for A.J. Green.","(3:35) Andy Dalton incomplete pass to the left intended for A.J. Green.","(3:35) Washington Redskins timeout.","(3:41) Giovani Bernard rush to the right for 1 yard to the Cin32. Tackled by Trent Murphy.","(4:20) Andy Dalton rush to the left for 5 yards to the Cin31. Tackled by Preston Smith.","(4:59) Giovani Bernard rush to the left for 2 yards to the Cin26. Tackled by Will Compton.","(5:44) Jeremy Hill rush to the right for 6 yards to the Cin24. Tackled by Ziggy Hood.","(5:59) Tress Way punts for 51 yards to Cin29. Adam Jones - no return. Tackled by Mason Foster. FUMBLE, recovered by Cin (Marquis Flowers). Penalty: Illegal Block on Cincinnati (Marquis Flowers) -10 yards.","(6:06) Kirk Cousins incomplete pass to the left intended for Maurice Harris.","(6:09) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(6:46) Rob Kelley rush to the right for 2 yards to the Was20. Tackled by Shawn Williams.","(6:54) Mike Nugent kicks off to the Was1. Maurice Harris return for 17 yards to Was18. Tackled by Margus Hunt.","(6:54) Mike Nugent extra point is good.","(6:58) Jeremy Hill rush to the left for 1 yard for a TOUCHDOWN.","(7:03) Penalty: Pass Interference on Washington (Quinton Dunbar) 1 yards.","(7:42) Jeremy Hill rush to the right for 5 yards to the Was2. Tackled by Mason Foster.","(8:04) Andy Dalton pass to the left to A.J. Green for 40 yards to the Was7. Tackled by Josh Norman.","(8:34) Andy Dalton pass to the right to Tyler Eifert for 22 yards to the Was47. Tackled by Kendall Fuller.","(9:09) Giovani Bernard rush to the right for 5 yards to the Cin31. Tackled by Donte Whitner.","(9:30) Giovani Bernard rush to the left for 1 yard to the Cin26. Tackled by Will Compton.","(9:30) Dustin Hopkins kicks off to the endzone. Touchback.","(9:30) Dustin Hopkins extra point is good.","(9:39) Kirk Cousins pass to the left to Jamison Crowder for 33 yards for a TOUCHDOWN.","(10:16) Kirk Cousins pass to the right to Vernon Davis for 7 yards to the Cin33. Tackled by Vontaze Burfict.","(10:31) Penalty: False Start on Washington (Morgan Moses) -5 yards.","(11:10) Kirk Cousins pass to the middle to Jamison Crowder for 10 yards to the Cin35. Tackled by Vontaze Burfict.","(11:44) Kirk Cousins rush up the middle for 3 yards to the Cin45. Tackled by Vontaze Burfict.","(12:25) Rob Kelley rush up the middle for 4 yards to the Cin48. Tackled by Vontaze Burfict.","(13:02) Rob Kelley rush to the right for 5 yards to the Was48. Tackled by George Iloka.","(13:48) Kirk Cousins pass to the right to Vernon Davis for 26 yards to the Was43. Tackled by Shawn Williams.","(13:55) Andy Dalton pass intended for Tyler Eifert INTERCEPTED by Will Compton and returned for 5 yards. Tackled by Tyler Eifert.","(14:30) Jeremy Hill rush to the left for no gain to the Was20. Tackled by Ricky Jean Francois.","(14:35) Penalty: Pass Interference on Washington (Quinton Dunbar) 7 yards.","(15:00) Jeremy Hill rush to the left for 3 yards to the Was27. Tackled by Will Compton.","(0:27) Jeremy Hill rush to the right for 4 yards to the Was30. Tackled by Chris Baker.","(0:59) Giovani Bernard rush to the left for 2 yards to the Was34. Tackled by Will Compton.","(1:29) Andy Dalton pass to the right to A.J. Green for 8 yards to the Was36. Tackled by Josh Norman.","(2:05) Andy Dalton pass to the left to A.J. Green for 8 yards to the Was44. Tackled by Josh Norman.","(2:34) Jeremy Hill rush to the right for 3 yards to the Cin48. Tackled by Josh Norman.","(3:02) Giovani Bernard rush to the left for 5 yards to the Cin30. Tackled by Duke Ihenacho. Penalty: Face Mask on Washington (Bashaud Breeland) 15 yards.","(3:02) Dustin Hopkins kicks off to the endzone. Touchback.","(3:02) Dustin Hopkins extra point is good.","(3:12) Kirk Cousins pass to the right to Jordan Reed for 23 yards for a TOUCHDOWN.","(3:51) Rob Kelley rush up the middle for 3 yards to the Cin23. Tackled by Carlos Dunlap.","(4:22) Rob Kelley rush to the left for 4 yards to the Cin41. Tackled by Domata Peko. Penalty: Unnecessary Roughness on Cincinnati (Domata Peko) 15 yards.","(4:44) Kirk Cousins pass to the right to DeSean Jackson for 38 yards to the Cin45. Tackled by George Iloka.","(5:10) Rob Kelley rush to the right for 8 yards to the Was17. Tackled by Domata Peko.","(5:15) Mike Nugent kicks off to the Was0. Chris Thompson return for 18 yards to Was18. Tackled by Clayton Fejedelem. Penalty: Holding on Washington (Martrell Spaight) -9 yards.","(5:15) Mike Nugent extra point is good.","(5:20) Andy Dalton rush to the right for 1 yard for a TOUCHDOWN.","(5:52) Jeremy Hill rush to the right for 2 yards to the Was1. Tackled by Trent Murphy.","(6:14) Jeremy Hill rush to the left for 5 yards to the Was7. Tackled by Ryan Kerrigan. Penalty: Holding on Washington (Ziggy Hood) 4 yards.","(6:37) Andy Dalton pass to the right to A.J. Green for 15 yards to the Was12. Tackled by Quinton Dunbar.","(6:56) Andy Dalton pass to the right to A.J. Green for 9 yards to the Was27. Tackled by Quinton Dunbar.","(7:33) Andy Dalton pass to the right to Tyler Eifert for 7 yards to the Was36. Tackled by Donte Whitner.","(7:33) Cincinnati Bengals timeout.","(7:39) Andy Dalton incomplete pass to the left intended for A.J. Green defensed by Josh Norman.","(8:07) Andy Dalton pass to the middle to Tyler Eifert for 14 yards to the Was43. Tackled by Kendall Fuller.","(8:45) Andy Dalton pass to the left to Brandon LaFell for 6 yards to the Cin43. Tackled by Bashaud Breeland.","(9:13) Jeremy Hill rush to the left for 1 yard to the Cin37. Tackled by Duke Ihenacho.","(9:25) Tress Way punts for 42 yards to Cin34. Adam Jones return for 2 yards to Cin36. Tackled by Trent Murphy.","(9:59) Kirk Cousins pass to the left to Jamison Crowder for 11 yards to the Was24. Tackled by Adam Jones.","(10:37) Kirk Cousins sacked at Was13 for a loss of 12 yards by Geno Atkins.","(10:42) Kirk Cousins incomplete pass to the right intended for Rob Kelley.","(10:42) Mike Nugent kicks off to the endzone. Touchback.","(10:42) Mike Nugent extra point is NO GOOD.","(10:46) Andy Dalton pass to the left to Tyler Eifert for 15 yards for a TOUCHDOWN.","(11:23) Jeremy Hill rush to the left for 4 yards to the Was15. Tackled by Duke Ihenacho.","(11:43) Jeremy Hill rush to the right for 12 yards to the Was19. Tackled by Preston Smith.","(12:19) Andy Dalton pass to the left to A.J. Green for 11 yards to the Was31. Tackled by Will Compton.","(12:22) Andy Dalton incomplete pass to the left intended for A.J. Green defensed by Josh Norman.","(12:26) Andy Dalton incomplete pass to the right intended for Tyler Boyd defensed by Ryan Kerrigan.","(12:46) Andy Dalton pass to the left to Tyler Eifert for 5 yards to the Was42. Tackled by Donte Whitner.","(13:24) Tyler Boyd rush to the right for 3 yards to the Was47. Tackled by Kendall Fuller.","(14:00) Andy Dalton pass to the right to Tyler Boyd for 3 yards to the Cin50. Tackled by Kendall Fuller.","(14:28) Giovani Bernard rush to the left for 12 yards to the Cin47. Tackled by Will Compton.","(15:00) Andy Dalton pass to the left to A.J. Green for 10 yards to the Cin35. Tackled by Josh Norman.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback.","(0:04) 55 yard field goal attempt by Dustin Hopkins is NO GOOD. Holder: Tress Way.","(0:29) Kirk Cousins pass to the left to Jordan Reed for 6 yards to the Cin38. Tackled by Josh Shaw.","(0:29) Washington Redskins timeout.","(0:35) Kirk Cousins pass to the left to Jamison Crowder for 3 yards to the Cin44. Tackled by Josh Shaw.","(0:39) Kirk Cousins incomplete pass to the left intended for Jordan Reed.","(0:48) Kirk Cousins pass to the right to Pierre Garcon for 6 yards to the Was38. Tackled by Dre Kirkpatrick. Penalty: Horse Collar Tackle on Cincinnati (Dre Kirkpatrick) 15 yards.","(1:16) Kirk Cousins pass to the right to Chris Thompson for no gain to the Was32. Tackled by Karlos Dansby.","(1:21) Kirk Cousins pass to the right to Jamison Crowder for 5 yards to the Was32. Tackled by Dre Kirkpatrick.","(1:28) Kevin Huber punts for 42 yards to Was27. No return.","(1:32) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Josh Norman.","(1:32) Washington Redskins timeout.","(1:50) Giovani Bernard rush to the left for 2 yards to the Cin31. Tackled by Su'a Cravens.","(1:57) Andy Dalton incomplete pass to the left intended for A.J. Green.","(2:00) Penalty: Illegal Use of Hands on Washington (Josh Norman) 5 yards.","(2:00) Two Minute Warning.","(2:24) Andy Dalton pass to the right to A.J. Green for 10 yards to the Cin24.","(2:33) Kirk Cousins pass intended for DeSean Jackson INTERCEPTED by George Iloka. No return. Tackled by DeSean Jackson.","(3:19) Chris Thompson rush to the left for a loss of 4 yards to the Was37. Tackled by Karlos Dansby.","(3:25) Kirk Cousins incomplete pass to the left intended for Rob Kelley.","(3:29) 51 yard field goal attempt by Mike Nugent is NO GOOD. Holder: Kevin Huber.","(4:13) Andy Dalton pass to the right to Tyler Eifert for 12 yards to the Was33. Tackled by Donte Whitner.","(4:57) Andy Dalton sacked at Was45 for a loss of 9 yards by Chris Baker.","(5:36) Jeremy Hill rush to the left for 1 yard to the Was36. Tackled by Chris Baker.","(6:19) Andy Dalton pass to the middle to Tyler Eifert for 10 yards to the Was37. Tackled by Donte Whitner.","(6:35) Penalty: Holding on Washington (Bashaud Breeland) 5 yards.","(7:17) Andy Dalton pass to the right to Tyler Boyd for 9 yards to the Cin48. Tackled by Bashaud Breeland.","(7:51) Giovani Bernard rush to the left for 9 yards to the Cin39. Tackled by Mason Foster.","(8:16) Penalty: Illegal Use of Hands on Washington (Josh Norman) 5 yards.","(8:16) Dustin Hopkins kicks off to the endzone. Touchback.","(8:21) Dustin Hopkins 20 yard field goal attempt is GOOD. Holder: Tress Way.","(9:03) Kirk Cousins pass to the left to Chris Thompson for 3 yards to the Cin2. Tackled by Karlos Dansby.","(9:03) Washington Redskins timeout.","(9:08) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(9:50) Rob Kelley rush to the left for 3 yards to the Cin5. Tackled by Vincent Rey.","(10:25) Kirk Cousins pass to the right to Jordan Reed for 8 yards to the Cin8. Tackled by Shawn Williams.","(10:43) Kirk Cousins pass to the right to Chris Thompson for 4 yards to the Cin16. Tackled by Vincent Rey.","(11:21) Rob Kelley rush up the middle for no gain to the Cin20. Tackled by Vontaze Burfict.","(12:02) Kirk Cousins pass to the right to Vernon Davis for 15 yards to the Cin20. Tackled by George Iloka.","(12:20) Washington Redskins timeout.","(12:20) Kirk Cousins pass to the left to Vernon Davis for 44 yards to the Cin35. Tackled by Shawn Williams.","(12:30) Kevin Huber punts for 59 yards to Was21. Jamison Crowder - no return. Tackled by Clark Harris.","(12:34) Andy Dalton incomplete pass to the left intended for Tyler Eifert.","(13:05) Jeremy Hill rush to the left for 2 yards to the Cin20. Tackled by Mason Foster and Ziggy Hood.","(13:10) Andy Dalton incomplete pass to the right intended for A.J. Green.","(13:17) Rob Kelley rush to the right for no gain to the Cin18. Tackled by Dre Kirkpatrick.","(13:17) Cincinnati Bengals timeout.","(14:05) Chris Thompson rush to the right for 2 yards to the Cin18. Tackled by Vincent Rey.","(14:29) Kirk Cousins pass to the right to Vernon Davis for 1 yard to the Cin20. Tackled by Rey Maualuga.","(15:00) Chris Thompson rush to the right for 6 yards to the Cin21. Tackled by Shawn Williams.","(0:36) Kirk Cousins pass to the middle to Pierre Garcon for 23 yards to the Cin27. Tackled by Karlos Dansby.","(1:18) Rob Kelley rush to the left for 4 yards to the Was50. Tackled by Rey Maualuga.","(1:50) Kirk Cousins pass to the right to DeSean Jackson for 6 yards to the Was31. Tackled by Shawn Williams. Penalty: Unnecessary Roughness on Cincinnati (Shawn Williams) 15 yards.","(2:31) Chris Thompson rush to the right for 4 yards to the Was25. Tackled by Vontaze Burfict.","(2:54) Penalty: Delay of Game on Washington (Kirk Cousins) -5 yards.","(3:47) Rob Kelley rush to the left for 7 yards to the Was26. Tackled by Carlos Dunlap.","(3:51) Mike Nugent kicks off to the Was0. Chris Thompson return for 19 yards to Was19. Tackled by Rex Burkhead.","(3:51) Mike Nugent extra point is good.","(3:58) Giovani Bernard rush to the right for 8 yards for a TOUCHDOWN. Penalty: Face Mask on Washington (Bashaud Breeland) 15 yards.","(4:36) Giovani Bernard rush to the right for 5 yards to the Was8. Tackled by Donte Whitner.","(5:09) Jeremy Hill rush to the right for 3 yards to the Was13. Tackled by Bashaud Breeland.","(5:32) Jeremy Hill rush to the right for 9 yards to the Was16. Tackled by Mason Foster.","(6:10) Andy Dalton pass to the left to Tyler Boyd for 8 yards to the Was25. Tackled by Kendall Fuller.","(6:50) Andy Dalton pass to the right to Tyler Kroft for 6 yards to the Was33. Tackled by Will Compton and Donte Whitner.","(7:27) Andy Dalton pass to the right to Jeremy Hill for a loss of 3 yards to the Was39. Tackled by Will Compton.","(7:38) Dustin Hopkins kicks off to the Cin-1. Alex Erickson return for 65 yards to Was36. Tackled by Bashaud Breeland.","(7:38) Dustin Hopkins extra point is good.","(7:44) Rob Kelley rush up the middle for 4 yards for a TOUCHDOWN.","(8:24) Kirk Cousins pass to the left to Jamison Crowder for 7 yards to the Cin4. Tackled by Josh Shaw.","(9:06) Kirk Cousins pass to the middle to Jordan Reed for 12 yards to the Cin11. Tackled by Vontaze Burfict.","(9:10) Kirk Cousins incomplete pass to the left intended for Jordan Reed.","(9:50) Rob Kelley rush to the left for 3 yards to the Cin23. Tackled by Michael Johnson.","(10:28) Kirk Cousins pass to the left to Pierre Garcon for 6 yards to the Cin26. Tackled by Adam Jones.","(11:03) Rob Kelley rush to the right for 4 yards to the Cin32. Tackled by George Iloka.","(11:45) Rob Kelley rush to the right for 4 yards to the Cin36. Tackled by Will Clarke.","(12:34) Kirk Cousins pass to the right to Jamison Crowder for 17 yards to the Cin40. Tackled by Carlos Dunlap.","(12:39) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(13:20) Kirk Cousins pass to the left to Jordan Reed for 12 yards to the Was43. Tackled by Vincent Rey.","(13:24) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(13:50) Kirk Cousins pass to the left to DeSean Jackson for 4 yards to the Was31. Tackled by Josh Shaw.","(14:34) Rob Kelley rush to the left for no gain to the Was27. Tackled by George Iloka.","(14:54) Kirk Cousins pass to the left to Jordan Reed for 7 yards to the Was27. Tackled by Adam Jones.","(15:00) Mike Nugent kicks off to the Was4. Chris Thompson return for 16 yards to Was20. Tackled by Nick Vigil and James Wright."]