["(0:29) Jimmy Garoppolo rush up the middle for a loss of 1 yard to the NE8.","(0:30) Dan Carpenter kicks off to the NE9. Devin McCourty - no return. Tackled by Kevon Seymour.","(0:30) EJ Manuel 2 pt conversion pass to Nick O'Leary is GOOD.","(0:30) Buffalo Bills timeout.","(0:33) Jonathan Williams rush to the right for 1 yard for a TOUCHDOWN.","(0:33) New England Patriots timeout.","(1:02) Jonathan Williams rush up the middle for no gain to the NE1. Tackled by Barkevious Mingo and Trey Flowers.","(1:08) Penalty: Pass Interference on New England (Eric Rowe) 29 yards.","(1:47) EJ Manuel sacked at NE30 for a loss of 2 yards by Trey Flowers.","(1:52) EJ Manuel incomplete pass to the left intended for Walt Powell.","(2:00) EJ Manuel pass to the right to Walt Powell for 35 yards to the NE28. Tackled by Duron Harmon.","(2:00) Two Minute Warning.","(2:26) Jonathan Williams rush to the right for 3 yards to the Buf37. Tackled by Trey Flowers and Geneo Grissom.","(2:34) Ryan Allen punts for 49 yards to Buf34. No return.","(3:13) Jimmy Garoppolo sacked at NE17 for a loss of 8 yards by Zach Brown and Lerentee McCray.","(3:52) LeGarrette Blount rush to the right for 2 yards to the NE25. Tackled by Lerentee McCray.","(4:29) LeGarrette Blount rush to the right for no gain to the NE23. Tackled by Marcell Dareus.","(4:29) New England Patriots timeout.","(4:38) Tyrod Taylor pass to the left to Robert Woods for 9 yards to the NE23. Tackled by Malcolm Butler.","(4:43) Tyrod Taylor incomplete pass to the left intended for Justin Hunter.","(5:19) Jonathan Williams rush up the middle for no gain to the NE32. Tackled by Chris Long.","(5:25) Tyrod Taylor incomplete pass to the right intended for Walt Powell.","(5:29) Penalty: Illegal Use of Hands on New England (Malcolm Butler) 5 yards.","(5:59) Mike Gillislee rush up the middle for 6 yards to the NE37. Tackled by Devin McCourty.","(6:18) Tyrod Taylor rush to the right for 17 yards to the NE43. Tackled by Jamie Collins.","(6:37) Penalty: Illegal Contact on New England (Elandon Roberts) 5 yards.","(7:06) Tyrod Taylor pass to the right to Nick O'Leary for 10 yards to the Buf35. Tackled by Logan Ryan.","(7:06) Stephen Gostkowski kicks off to the endzone. Touchback.","(7:10) Stephen Gostkowski 32 yard field goal attempt is GOOD. Holder: Ryan Allen.","(7:52) Tom Brady sacked at Buf14 for a loss of 5 yards by Marcell Dareus and Lerentee McCray.","(8:35) Tom Brady pass to the right to Julian Edelman for 7 yards to the Buf9. Tackled by Robert Blanton and Preston Brown.","(8:56) Penalty: False Start on New England (Rob Gronkowski) -5 yards.","(9:24) LeGarrette Blount rush up the middle for 4 yards to the Buf11. Tackled by Adolphus Washington.","(9:34) Penalty: Holding on Buffalo (Stephon Gilmore) 5 yards.","(9:38) Tom Brady incomplete pass to the left intended for James White.","(10:18) LeGarrette Blount rush to the left for a loss of 2 yards to the Buf20. Tackled by Kyle Williams and Zach Brown.","(11:03) Tom Brady pass to the left to Rob Gronkowski for 33 yards to the Buf18. Tackled by Jonathan Meeks and Zach Brown.","(12:01) LeGarrette Blount rush to the left for a loss of 2 yards to the NE49. Tackled by Adolphus Washington.","(12:40) LeGarrette Blount rush to the right for 7 yards to the Buf49. Tackled by Marcell Dareus and Brandon Spikes.","(12:47) Penalty: Roughing Passer on Buffalo (Shaq Lawson) 15 yards.","(13:27) James White rush up the middle for 8 yards to the NE29. Tackled by Robert Blanton and Nickell Robey-Coleman.","(14:04) Tom Brady sacked at NE21 for a loss of 5 yards by Shaq Lawson.","(14:47) Tom Brady pass to the right to Martellus Bennett for 16 yards to the NE26. Tackled by Brandon Spikes and Robert Blanton.","(14:55) Tom Brady incomplete pass to the right intended for Julian Edelman defensed by Ronald Darby.","(15:00) Tyrod Taylor incomplete pass to the middle intended for Charles Clay.","(0:42) Tyrod Taylor pass to the left to Robert Woods for 6 yards to the NE10. Tackled by Malcolm Butler.","(0:48) Tyrod Taylor incomplete pass to the left intended for Robert Woods.","(1:34) Reggie Bush rush to the right for a loss of 10 yards to the NE16. FUMBLE, recovered by Buf (Tyrod Taylor).","(1:39) Penalty: Pass Interference on New England (Justin Coleman) 19 yards.","(2:16) Tyrod Taylor pass to the left to Robert Woods for 15 yards to the NE25. Tackled by Justin Coleman.","(2:55) Tyrod Taylor pass to the right to Robert Woods for 20 yards to the NE40. Tackled by Devin McCourty.","(3:05) Stephen Gostkowski kicks off to the Buf5. Reggie Bush return for 35 yards to Buf40. Tackled by Devin McCourty.","(3:05) Stephen Gostkowski extra point is good.","(3:08) LeGarrette Blount rush up the middle for 1 yard for a TOUCHDOWN.","(3:14) Penalty: Holding on Buffalo (Stephon Gilmore) 2 yards.","(3:38) Tom Brady pass to the left to Chris Hogan for 3 yards to the Buf3. Tackled by Stephon Gilmore.","(3:57) Tom Brady pass to the left to Danny Amendola for 5 yards to the Buf12. Tackled by Nickell Robey-Coleman. Penalty: Unnecessary Roughness on Buffalo (Nickell Robey-Coleman) 6 yards.","(4:20) James White rush to the right for 7 yards to the Buf17. Tackled by Preston Brown.","(4:27) Tom Brady incomplete pass to the right intended for Julian Edelman.","(4:43) Penalty: Too Many Men on Field on Buffalo 5 yards.","(5:06) LeGarrette Blount rush up the middle for 5 yards to the Buf29. Tackled by Leger Douzable and Zach Brown.","(5:38) LeGarrette Blount rush to the right for no gain to the Buf34. Tackled by Adolphus Washington.","(6:07) Tom Brady pass to the left to Rob Gronkowski for 18 yards to the Buf34. Tackled by Brandon Spikes.","(6:41) LeGarrette Blount rush to the right for 3 yards to the NE48. Tackled by Preston Brown.","(7:18) Tom Brady rush up the middle for 15 yards to the NE45. Tackled by Preston Brown.","(7:21) Tom Brady incomplete pass to the left intended for Julian Edelman.","(7:57) LeGarrette Blount rush to the left for 5 yards to the NE30. Tackled by Stephon Gilmore and Shaq Lawson.","(7:57) Dan Carpenter kicks off to the endzone. Touchback.","(7:57) Dan Carpenter extra point is good.","(8:04) Tyrod Taylor rush up the middle for 26 yards for a TOUCHDOWN.","(8:09) Tyrod Taylor incomplete pass to the right intended for Walt Powell.","(8:46) Mike Gillislee rush to the left for 1 yard to the NE26. Tackled by Elandon Roberts.","(9:21) Mike Gillislee rush up the middle for 6 yards to the NE27. Tackled by Chris Long.","(9:58) Tyrod Taylor pass to the left to Reggie Bush for 9 yards to the NE33. Tackled by Dont'a Hightower and Jamie Collins.","(10:32) Tyrod Taylor pass to the left to Charles Clay for 4 yards to the NE42. Tackled by Patrick Chung.","(10:54) Tyrod Taylor pass to the left to Brandon Tate for 10 yards to the NE46. Tackled by Devin McCourty.","(11:30) Jonathan Williams rush to the left for 8 yards to the Buf44. Tackled by Rob Ninkovich and Dont'a Hightower.","(12:07) Tyrod Taylor pass to the right to Mike Gillislee for no gain to the Buf36. Tackled by Malcolm Butler.","(12:41)  FUMBLE, recovered by Buf (Colton Schmidt). Colton Schmidt rush to the right for 16 yards to the Buf36.","(13:19) Tyrod Taylor sacked at Buf20 for a loss of 7 yards by Trey Flowers and Dont'a Hightower.","(13:55) Tyrod Taylor rush to the left for 2 yards to the Buf27. Tackled by Dont'a Hightower.","(14:00) Tyrod Taylor incomplete pass to the left intended for Justin Hunter.","(14:00) Stephen Gostkowski kicks off to the endzone. Touchback.","(14:00) Stephen Gostkowski extra point is good.","(14:07) Tom Brady pass to the right to Julian Edelman for 12 yards for a TOUCHDOWN.","(14:46) Tom Brady pass to the middle to Martellus Bennett for 12 yards to the Buf12. Tackled by Zach Brown and Robert Blanton.","(15:00) Dan Carpenter kicks off to the NE3. Danny Amendola return for 73 yards to Buf24. Tackled by Kevon Seymour.","(0:03) Stephen Gostkowski 51 yard field goal attempt is GOOD. Holder: Ryan Allen.","(0:03) Buffalo Bills timeout.","(0:03) New England Patriots timeout.","(0:07) Tom Brady pass to the right to Rob Gronkowski for 7 yards to the Buf33. Tackled by Ronald Darby and Zach Brown.","(0:07) New England Patriots timeout.","(0:12) Tom Brady pass to the right to Danny Amendola for 15 yards to the Buf40. Tackled by Robert Blanton.","(0:20) Tom Brady pass to the right to James White for 6 yards to the NE45. Tackled by Robert Blanton.","(0:27) Tom Brady incomplete pass to the right intended for Danny Amendola.","(0:32) 49 yard field goal attempt by Dan Carpenter is NO GOOD. Holder: Colton Schmidt.","(0:38) Tyrod Taylor incomplete pass to the left intended for Robert Woods.","(0:44) Tyrod Taylor incomplete pass to the right intended for Walt Powell.","(0:49) Tyrod Taylor incomplete pass to the right intended for Robert Woods.","(0:55) Penalty: Illegal Contact on New England (Eric Rowe) 5 yards.","(1:21) Tyrod Taylor pass to the right to Walt Powell for 12 yards to the NE36. Tackled by Eric Rowe.","(1:28) Tyrod Taylor incomplete pass to the left intended for Justin Hunter.","(2:00) Tyrod Taylor pass to the right to Brandon Tate for 7 yards to the NE48. Tackled by Jamie Collins.","(2:00) Two Minute Warning.","(2:44) Tyrod Taylor rush to the right for 2 yards to the Buf45. Tackled by Logan Ryan.","(3:15) Tyrod Taylor pass to the left to Walt Powell for 12 yards to the Buf43. Tackled by Jabaal Sheard and Logan Ryan.","(3:34) Penalty: Holding on Buffalo (Eric Wood) -10 yards.","(4:10) Mike Gillislee rush to the right for 16 yards to the Buf41. Tackled by Eric Rowe.","(4:18) Tyrod Taylor incomplete pass to the right intended for Jerome Felton.","(4:18) Stephen Gostkowski kicks off to the endzone. Touchback.","(4:18) Stephen Gostkowski extra point is good.","(4:27) Tom Brady pass to the middle to Rob Gronkowski for 53 yards for a TOUCHDOWN.","(5:11) LeGarrette Blount rush to the left for 3 yards to the NE47. Tackled by Zach Brown.","(5:45) Tom Brady pass to the right to Chris Hogan for 19 yards to the NE44. Tackled by Ronald Darby.","(6:22) LeGarrette Blount rush to the right for 4 yards to the NE25. Tackled by Preston Brown and Lerentee McCray.","(6:26) Dan Carpenter kicks off to the NE-3. Danny Amendola return for 24 yards to NE21. Tackled by Lerentee McCray.","(6:26) Dan Carpenter extra point is good.","(6:30) Mike Gillislee rush up the middle for 3 yards for a TOUCHDOWN.","(6:30) New England Patriots timeout.","(6:51) Penalty: Too Many Men on Field on New England 4 yards.","(7:26) Tyrod Taylor pass to the right to Reggie Bush for 25 yards to the NE7. Tackled by Patrick Chung.","(7:33) Penalty: Pass Interference on New England (Eric Rowe) 29 yards.","(8:09) Tyrod Taylor pass to the right to Jerome Felton for 4 yards to the Buf39. Tackled by Elandon Roberts.","(8:15) Tyrod Taylor incomplete pass to the left intended for Charles Clay.","(8:40) Mike Gillislee rush to the left for 4 yards to the Buf45. Tackled by Devin McCourty. Penalty: Holding on Buffalo (Eric Wood) -10 yards.","(8:47) Ryan Allen punts for 44 yards to Buf41. No return.","(9:23) Tom Brady sacked at NE15 for a loss of 5 yards by Preston Brown.","(9:33) Tom Brady incomplete pass to the left intended for Julian Edelman.","(10:09) Tom Brady pass to the left to Martellus Bennett for 2 yards to the NE20. Tackled by Robert Blanton and Shaq Lawson.","(10:20) Colton Schmidt punts for 56 yards to NE8. Julian Edelman return for 10 yards to NE18. Tackled by Kevon Seymour.","(11:04) Tyrod Taylor pass to the right to Mike Gillislee for 6 yards to the Buf36. Tackled by Trey Flowers.","(11:10) Tyrod Taylor incomplete pass to the left intended for Charles Clay defensed by Devin McCourty.","(11:34) Penalty: Pass Interference on Buffalo (Walt Powell) -10 yards.","(12:01) Penalty: Illegal Formation on Buffalo -5 yards.","(12:38) Mike Gillislee rush to the right for 1 yard to the Buf45. Tackled by Jabaal Sheard and Malcolm Butler.","(13:07) Tyrod Taylor pass to the right to Justin Hunter for 7 yards to the Buf44. Tackled by Eric Rowe.","(13:49) Mike Gillislee rush to the right for 8 yards to the Buf37. Tackled by Elandon Roberts.","(13:55) Tyrod Taylor incomplete pass to the right intended for Walt Powell.","(14:05) Ryan Allen punts for 41 yards to Buf27. Brandon Tate return for 2 yards to Buf29. Tackled by Nate Ebner.","(14:35) Tom Brady sacked at NE32 for a loss of 7 yards by Kyle Williams.","(14:42) Tom Brady incomplete pass to the right intended for Rob Gronkowski.","(14:50) Tom Brady incomplete pass to the right intended for James White.","(15:00) Colton Schmidt punts for 42 yards to NE30. Julian Edelman return for 9 yards to NE39. Tackled by Preston Brown.","(0:12) Tyrod Taylor pass to the right to Mike Gillislee for 3 yards to the Buf28. Tackled by Patrick Chung.","(0:56) Reggie Bush rush to the right for 2 yards to the Buf25. Tackled by Alan Branch and Patrick Chung.","(1:27) Mike Gillislee rush to the left for 4 yards to the Buf23. Tackled by Vincent Valentine.","(1:33) Stephen Gostkowski kicks off to the Buf1. Reggie Bush return for 18 yards to Buf19. Tackled by Barkevious Mingo and Brandon King.","(1:33) Stephen Gostkowski extra point is good.","(1:41) Tom Brady pass to the left to Chris Hogan for 53 yards for a TOUCHDOWN.","(2:18) Penalty: Illegal Plyr Downfld on New England (Marcus Cannon) -5 yards.","(2:23) Tom Brady incomplete pass to the right intended for James White defensed by Jerry Hughes.","(3:00) LeGarrette Blount rush up the middle for 2 yards to the Buf48. Tackled by Lorenzo Alexander and Leger Douzable.","(3:05) Penalty: Holding on Buffalo (Robert Blanton) 5 yards.","(3:41) Penalty: Pass Interference on New England (Danny Amendola) -10 yards.","(3:49) Colton Schmidt punts for 33 yards to Buf45. No return.","(3:54) Tyrod Taylor incomplete pass to the right intended for Brandon Tate.","(3:59) Tyrod Taylor incomplete pass to the left intended for Charles Clay.","(4:31) Mike Gillislee rush to the right for 5 yards to the Buf12. Tackled by Elandon Roberts.","(4:35) Stephen Gostkowski kicks off to the Buf-2. Reggie Bush return for 15 yards to Buf13. Tackled by Matthew Slater. Penalty: Holding on Buffalo (Lerentee McCray) -6 yards.","(4:35) Stephen Gostkowski extra point is good.","(4:41) Tom Brady pass to the right to Danny Amendola for 9 yards for a TOUCHDOWN.","(5:21) Tom Brady pass to the right to Rob Gronkowski for a loss of 2 yards to the Buf9. Tackled by Ronald Darby.","(5:42) LeGarrette Blount rush to the right for 4 yards to the Buf7. Tackled by Robert Blanton.","(6:13) Tom Brady pass to the left to Julian Edelman for 10 yards to the Buf11. Tackled by Zach Brown.","(6:56) LeGarrette Blount rush up the middle for 7 yards to the Buf21. Tackled by Preston Brown and Robert Blanton.","(7:30) LeGarrette Blount rush up the middle for 1 yard to the Buf28. Tackled by Corey Graham.","(8:06) Tom Brady pass to the left to Chris Hogan for 16 yards to the Buf29. Tackled by Stephon Gilmore.","(8:44) Julian Edelman rush to the left for no gain to the Buf45. Tackled by Zach Brown.","(8:50) Tom Brady incomplete pass to the left intended for Rob Gronkowski.","(9:23) Tom Brady pass to the left to James White for 8 yards to the Buf45. Tackled by Zach Brown.","(9:44) Tom Brady pass to the left to Martellus Bennett for 5 yards to the NE47. Tackled by Zach Brown.","(10:20) LeGarrette Blount rush up the middle for a loss of 1 yard to the NE42. Tackled by Marcell Dareus.","(10:50) Tom Brady pass to the right to Julian Edelman for 8 yards to the NE43. Tackled by Robert Blanton.","(10:50) Penalty: Too Many Men on Field on Buffalo 5 yards.","(10:57) Tom Brady incomplete pass to the right intended for Martellus Bennett.","(11:05) Dan Carpenter kicks off to the NE10. Matthew Slater return for 15 yards to NE25. Tackled by Walt Powell. FUMBLE, recovered by NE (Shea McClellin).","(11:07) Dan Carpenter 23 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(11:15) Tyrod Taylor incomplete pass to the left intended for Reggie Bush.","(11:51) Tyrod Taylor rush up the middle for 1 yard to the NE5. Tackled by Chris Long.","(11:51) Buffalo Bills timeout.","(12:00) Tyrod Taylor incomplete pass to the left.","(12:44) Tyrod Taylor pass to the right to Jerome Felton for 22 yards to the NE6. Tackled by Rob Ninkovich and Elandon Roberts.","(13:18) Brandon Tate rush to the right for 14 yards to the NE28. Tackled by Logan Ryan.","(13:25) Tyrod Taylor incomplete pass to the left intended for Justin Hunter.","(14:00) Mike Gillislee rush up the middle for 3 yards to the NE42. Tackled by Dont'a Hightower.","(14:29) Mike Gillislee rush to the left for 28 yards to the NE45. Tackled by Patrick Chung.","(15:00) Tyrod Taylor pass to the right to Charles Clay for 2 yards to the Buf27. Tackled by Dont'a Hightower.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback."]