["(0:02) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(0:02) Russell Wilson incomplete pass to the middle.","(0:16) Russell Wilson pass to the middle to C.J. Prosise for 8 yards to the NO10. Tackled by Kenny Vaccaro.","(0:16) New Orleans Saints timeout.","(0:16) Russell Wilson incomplete pass to the middle.","(0:33) Russell Wilson pass to the left to Doug Baldwin for 27 yards to the NO18. Tackled by Ken Crawley.","(0:37) Russell Wilson incomplete pass to the right.","(1:01) Russell Wilson pass to the left to Doug Baldwin for 4 yards to the NO45. Tackled by Jairus Byrd.","(1:28) Russell Wilson pass to the middle to C.J. Prosise for 14 yards to the NO49. Tackled by Kenny Vaccaro.","(1:50) Russell Wilson rush up the middle for 5 yards to the Sea37. Tackled by Craig Robertson.","(1:57) Wil Lutz kicks off to the Sea5. Tyler Lockett return for 27 yards to Sea32. Tackled by Vonn Bell.","(2:00) Wil Lutz 41 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(2:00) Penalty: False Start on New Orleans (Andrus Peat) -5 yards.","(2:00) Two Minute Warning.","(2:22) Drew Brees sacked at Sea18 for a loss of 8 yards by Cliff Avril.","(2:22) Seattle Seahawks timeout.","(2:46) Drew Brees pass to the right to Tim Hightower for no gain to the Sea10. Tackled by Kelcie McCray.","(2:46) Seattle Seahawks timeout.","(2:50) Tim Hightower rush to the left for 2 yards to the Sea10. Tackled by Bobby Wagner.","(3:35) Tim Hightower rush to the left for 12 yards to the Sea12. Tackled by Kelcie McCray.","(3:35) Seattle Seahawks timeout.","(3:55) Drew Brees pass to the right to Brandin Cooks for 20 yards to the Sea24. Tackled by Richard Sherman.","(4:35) Tim Hightower rush to the left for 5 yards to the Sea44. Tackled by Bobby Wagner.","(4:40) Drew Brees incomplete pass to the right intended for John Kuhn.","(4:48) Penalty: Holding on Seattle (Richard Sherman) 6 yards.","(5:30) Drew Brees pass to the left to Michael Thomas for 2 yards to the NO45. Tackled by Brock Coyle.","(6:12) Tim Hightower rush to the left for 2 yards to the NO43. Tackled by Deshawn Shead and Kelcie McCray.","(6:38) Drew Brees pass to the right to Willie Snead for 16 yards to the NO41. Tackled by Richard Sherman.","(6:38) Steven Hauschka kicks off to the endzone. Touchback.","(6:41) Steven Hauschka 21 yard field goal attempt is GOOD. Holder: Jon Ryan.","(7:20) Russell Wilson pass to the right to Tyler Lockett for 7 yards to the NO3. Tackled by Ken Crawley.","(7:24) Russell Wilson incomplete pass to the middle intended for Jimmy Graham.","(7:24) Penalty: False Start on Seattle (Christine Michael) -5 yards.","(7:29) Russell Wilson incomplete pass to the right intended for Paul Richardson.","(8:14) Russell Wilson pass to the left to Jimmy Graham for 15 yards to the NO5. Tackled by Jairus Byrd.","(8:53) Christine Michael rush to the left for 2 yards to the NO20. Tackled by Craig Robertson.","(8:57) Russell Wilson incomplete pass to the right intended for Jermaine Kearse.","(9:33) Russell Wilson pass to the left to Doug Baldwin for 10 yards to the NO22. Tackled by Jairus Byrd.","(10:16) Russell Wilson rush to the left for 4 yards to the NO32. Tackled by Craig Robertson.","(10:52) Christine Michael rush to the left for 4 yards to the NO36. Tackled by Nate Stupar.","(11:21) Russell Wilson pass to the left to Jermaine Kearse for 17 yards to the NO40. Tackled by Vonn Bell.","(11:54) Russell Wilson pass to the right to Paul Richardson for 10 yards to the Sea43. Tackled by Nate Stupar.","(12:24) Russell Wilson pass to the left to Tyler Lockett for 8 yards to the Sea33. Tackled by Vonn Bell.","(12:24) Wil Lutz kicks off to the endzone. Touchback.","(12:24) Drew Brees 2 pt conversion pass to Coby Fleener is NO GOOD.","(12:30) Drew Brees pass to the left to Brandin Cooks for 2 yards for a TOUCHDOWN.","(13:10) Tim Hightower rush to the right for 3 yards to the Sea2. Tackled by Earl Thomas and Jarran Reed.","(13:50) Drew Brees pass to the left to Willie Snead for 5 yards to the Sea5. Tackled by Jeremy Lane.","(14:27) Tim Hightower rush to the left for 28 yards to the Sea10. Tackled by Frank Clark.","(15:00) Tim Hightower rush to the right for 4 yards to the Sea38. Tackled by Cliff Avril and Jarran Reed.","(0:00) Drew Brees pass to the left to John Kuhn for 7 yards to the Sea42. Tackled by K.J. Wright.","(0:38) Daniel Lasco rush to the right for 3 yards to the Sea49. Tackled by Bobby Wagner and Sealver Siliga.","(1:20) Drew Brees pass to the left to Michael Thomas for 16 yards to the NO48. Tackled by Deshawn Shead.","(1:51) Daniel Lasco rush to the left for 3 yards to the NO32. Tackled by Tony McDaniel and Kelcie McCray.","(1:59) Jon Ryan punts for 43 yards to NO29. No return.","(2:02) Russell Wilson incomplete pass to the right intended for Jimmy Graham defensed by Cameron Jordan.","(2:07) Russell Wilson incomplete pass to the right intended for Doug Baldwin.","(2:46) C.J. Prosise rush to the right for 6 yards to the Sea28. Tackled by Jairus Byrd.","(3:09) C.J. Prosise rush to the left for 8 yards to the Sea32. Tackled by Ken Crawley. Penalty: Illegal Block on Seattle (Justin Britt) -10 yards.","(3:14) Wil Lutz kicks off to the Sea-5. Tyler Lockett return for 29 yards to Sea24. Tackled by Nate Stupar.","(3:17) Wil Lutz 21 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(4:01) Tim Hightower rush to the left for a loss of 2 yards to the Sea3. Tackled by Ahtyba Rubin.","(4:06) Drew Brees incomplete pass to the left intended for Tim Hightower.","(4:42) Tim Hightower rush to the left for no gain to the Sea1. Tackled by Richard Sherman and Frank Clark.","(5:27) Drew Brees pass to the right to Coby Fleener for 13 yards to the Sea1. Tackled by Kelcie McCray and Richard Sherman.","(5:47) Penalty: False Start on New Orleans (Senio Kelemete) -5 yards.","(6:26) Tim Hightower rush to the right for 2 yards to the Sea9. Tackled by Cliff Avril.","(6:57) Drew Brees pass to the right to Brandon Coleman for 38 yards to the Sea11. Tackled by Richard Sherman.","(7:01) Penalty: Holding on Seattle (Deshawn Shead) 5 yards.","(7:06) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(7:41) Tim Hightower rush to the right for 5 yards to the NO46. Tackled by Richard Sherman.","(8:16) Drew Brees pass to the middle to Michael Thomas for 17 yards to the NO41. Tackled by Earl Thomas.","(8:49) Tim Hightower rush to the left for 1 yard to the NO24. Tackled by Frank Clark and Bobby Wagner.","(8:56) Steven Hauschka kicks off to the NO0. Tommylee Lewis return for 23 yards to NO23. Tackled by Jeremy Lane.","(9:01) Steven Hauschka 44 yard field goal attempt is GOOD. Holder: Jon Ryan.","(9:40) Russell Wilson pass to the left to Nick Vannett for 7 yards to the NO26. Tackled by De'Vante Harris.","(10:24) Christine Michael rush to the right for a loss of 3 yards to the NO33. Tackled by Cameron Jordan.","(10:32) Russell Wilson incomplete pass to the right intended for Christine Michael.","(11:14) Russell Wilson rush to the right for 2 yards to the NO30. Tackled by Nate Stupar.","(11:49) C.J. Prosise rush to the left for 2 yards to the NO32. Tackled by Jairus Byrd.","(12:28) C.J. Prosise rush to the left for 7 yards to the NO34. Tackled by Dannell Ellerbe.","(13:03) Christine Michael rush to the left for 10 yards to the NO41. Tackled by Dannell Ellerbe.","(13:45) Christine Michael rush to the right for 8 yards to the Sea49. Tackled by Dannell Ellerbe.","(14:23) Christine Michael rush to the left for 7 yards to the Sea41. Tackled by Craig Robertson and Jairus Byrd.","(15:00) Christine Michael rush to the left for 9 yards to the Sea34. Tackled by Nick Fairley and Jairus Byrd.","(15:00) Wil Lutz kicks off to the endzone. Touchback.","(0:01)  FUMBLE, recovered by Sea (Jon Ryan). Jon Ryan incomplete pass to the right.","(0:05) Russell Wilson pass to the left to Jermaine Kearse for 6 yards to the NO38. Tackled by Ken Crawley.","(0:10) Russell Wilson pass to the left to Jermaine Kearse for 23 yards to the NO44. Tackled by Jairus Byrd.","(0:31) Russell Wilson pass to the left to Doug Baldwin for 10 yards to the Sea33. Tackled by Jairus Byrd.","(0:35) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(0:35) New Orleans Saints timeout.","(0:41) Russell Wilson pass to the middle to Jimmy Graham for 6 yards to the Sea23. Tackled by Dannell Ellerbe.","(0:49) Wil Lutz kicks off to the Sea-5. Tyler Lockett return for 22 yards to Sea17. Tackled by Daniel Lasco.","(0:49) Wil Lutz extra point is good.","(0:50) Drew Brees rush up the middle for 1 yard for a TOUCHDOWN.","(0:50) Seattle Seahawks timeout.","(0:54) Tim Hightower rush to the left for no gain to the Sea1. Tackled by Ahtyba Rubin.","(0:54) Seattle Seahawks timeout.","(1:18) Tim Hightower rush to the right for no gain to the Sea1. Tackled by Ahtyba Rubin.","(2:00) Tim Hightower rush to the right for 2 yards to the Sea1. Tackled by K.J. Wright.","(2:00) Two Minute Warning.","(2:20) Tim Hightower rush to the left for 3 yards to the Sea3. Tackled by Ahtyba Rubin and Tony McDaniel.","(3:04) Drew Brees pass to the right to John Kuhn for 5 yards to the Sea6. Tackled by Richard Sherman.","(3:10) Penalty: Illegal Contact on Seattle (Earl Thomas) 5 yards.","(3:45) Tim Hightower rush to the left for 8 yards to the Sea21. Tackled by Kelcie McCray. Penalty: Illegal Use of Hands on Seattle (Frank Clark) 5 yards.","(4:24) Drew Brees pass to the middle to Travaris Cadet for 7 yards to the Sea29. Tackled by Kelcie McCray.","(5:02) Tim Hightower rush to the left for 1 yard to the Sea36. Tackled by Tony McDaniel.","(5:08) Russell Wilson pass intended for Jermaine Kearse INTERCEPTED by Nate Stupar. No return. Tackled by Jimmy Graham.","(5:08) Penalty: False Start on Seattle (Mark Glowinski) -5 yards.","(5:15) Wil Lutz kicks off to the Sea-4. Tyler Lockett return for 37 yards to Sea33. Tackled by Wil Lutz.","(5:20) Wil Lutz 53 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(5:26) Drew Brees incomplete pass to the right intended for Travaris Cadet.","(6:04) Drew Brees pass to the left to Josh Hill for 3 yards to the Sea35. Tackled by Bobby Wagner.","(6:04) Seattle Seahawks timeout.","(6:37) Tim Hightower rush to the right for 1 yard to the Sea38. Tackled by Tony McDaniel.","(7:10) Drew Brees pass to the left to Willie Snead for 6 yards to the Sea39. Tackled by Bobby Wagner.","(7:53) Daniel Lasco rush to the right for 2 yards to the Sea45. Tackled by Bobby Wagner and K.J. Wright.","(8:24) Daniel Lasco rush to the left for 5 yards to the Sea47. Tackled by Deshawn Shead.","(8:55) Drew Brees pass to the left to Willie Snead for 8 yards to the NO48. Tackled by Jeremy Lane.","(9:29) Daniel Lasco rush to the right for 2 yards to the NO40. Tackled by Bobby Wagner.","(9:53) Drew Brees pass to the left to Willie Snead for 13 yards to the NO38. Tackled by Kelcie McCray.","(9:53) Steven Hauschka kicks off to the endzone. Touchback.","(9:53) Steven Hauschka extra point is good.","(9:57) Christine Michael rush to the right for 2 yards for a TOUCHDOWN.","(10:27) Tanner McEvoy pass to the right to C.J. Prosise for 43 yards to the NO2. Tackled by Michael Mauti.","(11:05) Russell Wilson pass to the left to Paul Richardson for 23 yards to the NO45. Tackled by Jairus Byrd.","(11:33) Russell Wilson pass to the right to Tyler Lockett for 7 yards to the Sea32. Tackled by Nate Stupar.","(11:33) Wil Lutz kicks off to the endzone. Touchback.","(11:37) Wil Lutz 22 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(12:00) Drew Brees pass to the right to Brandon Coleman for 6 yards to the Sea4. Tackled by Kelcie McCray.","(12:05) Drew Brees incomplete pass to the left intended for Tim Hightower defensed by Cliff Avril.","(12:52) Tim Hightower rush to the left for 3 yards to the Sea10. Tackled by Bobby Wagner.","(13:24) Drew Brees pass to the left to Coby Fleener for 11 yards to the Sea13. Tackled by Bobby Wagner.","(13:59) Tim Hightower rush to the left for 10 yards to the Sea24. Tackled by Deshawn Shead.","(14:26) Drew Brees pass to the left to Brandin Cooks for 8 yards to the Sea34. Tackled by Deshawn Shead.","(15:00) Tim Hightower rush to the right for 4 yards to the Sea42. Tackled by Tony McDaniel and Frank Clark.","(0:19) Tim Hightower rush to the right for 3 yards to the Sea46. Tackled by Ahtyba Rubin and K.J. Wright.","(0:27) Drew Brees incomplete pass to the left intended for Brandin Cooks defensed by Earl Thomas.","(1:04) Drew Brees pass to the left to Michael Thomas for 9 yards to the Sea49. Tackled by Bobby Wagner.","(1:40) Drew Brees pass to the left to Brandin Cooks for 14 yards to the NO42. Tackled by Deshawn Shead.","(2:16) Drew Brees pass to the right to Willie Snead for 8 yards to the NO28. Tackled by Bobby Wagner.","(2:52) Tim Hightower rush to the left for 2 yards to the NO20. Tackled by Bobby Wagner.","(3:33) Tim Hightower rush to the left for 5 yards to the NO18. Tackled by Jarran Reed.","(3:43) Jon Ryan punts for 45 yards to NO13. No return.","(4:17) Russell Wilson pass to the middle to Jimmy Graham for 13 yards to the Sea42. Tackled by Craig Robertson.","(4:38) Penalty: False Start on Seattle (George Fant) -5 yards.","(5:23) Russell Wilson pass to the left to Tyler Lockett for 10 yards to the Sea34. Tackled by Ken Crawley.","(6:05) Russell Wilson sacked at Sea24 for a loss of 11 yards by Paul Kruger.","(6:18) Thomas Morstead punts for 48 yards to Sea32. Tyler Lockett return for 3 yards to Sea35. Tackled by Craig Robertson.","(6:33) Drew Brees sacked at NO20 for a loss of 5 yards by Frank Clark.","(7:13) Drew Brees pass to the middle to Coby Fleener for 8 yards to the NO25. Tackled by Bobby Wagner.","(7:48) Tim Hightower rush to the left for a loss of 2 yards to the NO17. Tackled by K.J. Wright.","(7:53) Steven Hauschka kicks off to the NO9. Travaris Cadet - no return. Tackled by Paul Richardson.","(7:53) Steven Hauschka extra point is good.","(7:53) Mark Ingram rush to the right for 2 yards to the NO34. Tackled by Cliff Avril. FUMBLE, recovered by Sea (Earl Thomas) and returned for 34 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Seattle (Earl Thomas) -15 yards.","(8:44) Drew Brees pass to the right to Michael Thomas for 12 yards to the NO32. Tackled by Richard Sherman and Kelcie McCray.","(8:56) Jon Ryan punts for 58 yards to NO0. Touchback. Penalty: Illegal Touch on Seattle (Steven Terrell) 0 yards.","(9:18) Russell Wilson pass to the right to C.J. Prosise for 15 yards to the Sea42. Tackled by Craig Robertson.","(9:58) Russell Wilson pass to the right to Christine Michael for 2 yards to the Sea27. Tackled by Dannell Ellerbe.","(10:24) Penalty: Clipping on Seattle (George Fant) -15 yards.","(11:00) Christine Michael rush to the right for 1 yard to the Sea40. Tackled by Kenny Vaccaro and Nick Fairley.","(11:30) Russell Wilson pass to the left to Jermaine Kearse for 11 yards to the Sea39. Tackled by Ken Crawley.","(12:08) Christine Michael rush to the right for no gain to the Sea28. Tackled by Cameron Jordan and Craig Robertson.","(12:20) Thomas Morstead punts for 44 yards to Sea17. Tyler Lockett return for 11 yards to Sea28. Tackled by Josh Hill.","(12:25) Drew Brees incomplete pass to the left intended for Willie Snead.","(12:30) Drew Brees incomplete pass to the left intended for Willie Snead.","(13:09) Mark Ingram rush to the right for 1 yard to the NO39. Tackled by Frank Clark.","(13:51) Drew Brees pass to the right to Michael Thomas for 7 yards to the NO38. Tackled by K.J. Wright.","(14:26) Mark Ingram rush to the right for 2 yards to the NO31. Tackled by Deshawn Shead and Bobby Wagner.","(15:00) Drew Brees pass to the right to Coby Fleener for 4 yards to the NO29. Tackled by Deshawn Shead.","(15:00) Steven Hauschka kicks off to the endzone. Touchback."]