["(0:00) Philip Rivers pass to the middle to Travis Benjamin for 20 yards to the SD38. Tackled by Erik Walden. FUMBLE, recovered by Ind (D'Qwell Jackson). Tackled by Dexter McCluster.","(0:07) Pat McAfee punts for 27 yards to SD18. No return.","(0:07) Indianapolis Colts timeout.","(0:54) Frank Gore rush up the middle for no gain to the SD45. Tackled by Dwight Lowery and Melvin Ingram.","(0:54) Penalty: False Start on Indianapolis (Jack Doyle) -5 yards.","(0:58) San Diego Chargers timeout.","(0:58) Frank Gore rush to the right for 2 yards to the SD40. Tackled by Darius Philon and Nick Dzubnar.","(1:02) San Diego Chargers timeout.","(1:02) Frank Gore rush to the right for 2 yards to the SD42. Tackled by Kyle Emanuel and Jason Verrett.","(1:11) Philip Rivers pass to the right to Hunter Henry for 14 yards to the SD38. Tackled by Clayton Geathers. FUMBLE, recovered by Ind (Mike Adams). Tackled by Hunter Henry.","(1:11) Penalty: False Start on San Diego (Hunter Henry) -5 yards.","(1:17) Philip Rivers pass to the right to Tyrell Williams for 4 yards to the SD29. Tackled by Vontae Davis.","(1:17) Pat McAfee kicks off to the endzone. Touchback.","(1:17) Andrew Luck 2 pt conversion pass is NO GOOD - intended for T.Y. Hilton.","(1:28) Andrew Luck pass to the middle to T.Y. Hilton for 63 yards for a TOUCHDOWN.","(1:28) San Diego Chargers timeout.","(1:39) Andrew Luck pass to the left to Josh Ferguson for 9 yards to the Ind37. Tackled by Denzel Perryman.","(2:00) Andrew Luck pass to the right to T.Y. Hilton for 8 yards to the Ind28. Tackled by Brandon Flowers.","(2:00) Two Minute Warning.","(2:05) Andrew Luck incomplete pass to the left intended for Josh Ferguson defensed by Dexter McCoil.","(2:11) Andrew Luck incomplete pass to the right intended for Chester Rogers.","(2:29) Andrew Luck pass to the left to Phillip Dorsett for 3 yards to the Ind20. Tackled by Jason Verrett.","(2:36) Drew Kaser punts for 36 yards to Ind17. No return.","(2:40) Philip Rivers incomplete pass to the right intended for Travis Benjamin.","(2:40) Indianapolis Colts timeout.","(2:44) Melvin Gordon rush to the left for no gain to the SD47. Tackled by Sio Moore.","(3:29) Melvin Gordon rush to the left for 7 yards to the SD47. Tackled by Clayton Geathers.","(4:11) Philip Rivers pass to the left to Tyrell Williams for 11 yards to the SD40. Tackled by Vontae Davis.","(4:53) Melvin Gordon rush up the middle for no gain to the SD29. Tackled by Sio Moore.","(5:20) Philip Rivers pass to the left to Tyrell Williams for 7 yards to the SD29. Tackled by Darryl Morris.","(5:56) Philip Rivers rush to the right for 2 yards to the SD22. Tackled by Sio Moore.","(6:38) Melvin Gordon rush up the middle for 2 yards to the SD20. Tackled by D'Qwell Jackson and David Parry.","(6:46) Pat McAfee punts for 50 yards to SD18. No return.","(6:46) Penalty: False Start on Indianapolis (Curt Maggitt) -5 yards.","(6:52) Andrew Luck incomplete pass to the right intended for Dwayne Allen.","(6:58) Andrew Luck incomplete pass to the left intended for Frank Gore.","(7:04) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(7:34) Andrew Luck pass to the right to T.Y. Hilton for 12 yards to the Ind37.","(7:34) Josh Lambo kicks off to the endzone. Touchback.","(7:38) Josh Lambo 27 yard field goal attempt is GOOD. Holder: Drew Kaser.","(8:24) Philip Rivers sacked at Ind9 for a loss of 5 yards by Erik Walden.","(8:30) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(9:09) Philip Rivers pass to the right to Tyrell Williams for 6 yards to the Ind4. Tackled by Antonio Cromartie.","(9:35) Philip Rivers pass to the left to Hunter Henry for 12 yards to the Ind10. Tackled by T.J. Green.","(10:15) Philip Rivers pass to the right to Travis Benjamin for 43 yards to the Ind7. Tackled by Darryl Morris. Penalty: Unsports. Conduct on San Diego (Philip Rivers) -15 yards.","(10:52) Melvin Gordon rush to the left for 1 yard to the SD50. Tackled by D'Qwell Jackson.","(11:18) Philip Rivers pass to the left to Melvin Gordon for 25 yards to the SD49. Tackled by Sio Moore.","(11:59) Philip Rivers pass to the left to Derek Watt for 6 yards to the SD24. Tackled by Sio Moore and T.J. Green.","(12:10) Pat McAfee punts for 44 yards to SD19. Travis Benjamin - no return. FUMBLE, recovered by SD (Jason Verrett).","(12:42) Andrew Luck pass to the right to Jack Doyle for 13 yards to the Ind37. Tackled by Nick Dzubnar.","(13:22) Robert Turbin rush up the middle for 3 yards to the Ind24. Tackled by Denzel Perryman and Kyle Emanuel.","(13:49) Penalty: Holding on Indianapolis (Jack Doyle) -10 yards.","(14:20) Penalty: Pass Interference on Indianapolis (Chester Rogers) -10 yards.","(14:23) Andrew Luck incomplete pass to the left.","(14:54) Penalty: Holding on Indianapolis (Jack Doyle) -10 yards.","(15:00) Penalty: Holding on San Diego (Jason Verrett) 5 yards.","(0:27) Andrew Luck pass to the left to Frank Gore for 1 yard to the Ind46. Tackled by Denzel Perryman.","(1:05) Frank Gore rush up the middle for 2 yards to the Ind45. Tackled by Nick Dzubnar and Brandon Mebane.","(1:32) Andrew Luck pass to the right to Jack Doyle for 11 yards to the Ind43. Tackled by Nick Dzubnar.","(1:42) Drew Kaser punts for 39 yards to Ind32. Quan Bray - no return. Tackled by Tourek Williams.","(1:47) Philip Rivers incomplete pass to the right intended for Travis Benjamin.","(1:54) Philip Rivers incomplete pass to the right intended for Melvin Gordon defensed by Antonio Cromartie.","(2:39) Melvin Gordon rush up the middle for 4 yards to the SD29. Tackled by D'Qwell Jackson and Curt Maggitt.","(2:39) Pat McAfee kicks off to the endzone. Touchback.","(2:39) Adam Vinatieri extra point is good.","(2:43) Robert Turbin rush to the right for 1 yard for a TOUCHDOWN.","(2:47) Penalty: Pass Interference on San Diego (Adrian Phillips) 0 yards.","(3:26) Frank Gore rush up the middle for no gain to the SD1. Tackled by Corey Liuget.","(3:57) Andrew Luck pass to the left to T.Y. Hilton for 9 yards to the SD1.","(4:43) Andrew Luck pass to the left to Dwayne Allen for 14 yards to the SD10. Tackled by Jatavis Brown.","(5:27) Andrew Luck pass to the left to T.Y. Hilton for 6 yards to the SD24. Tackled by Jason Verrett.","(6:09) Frank Gore rush to the right for 2 yards to the SD30. Tackled by Jatavis Brown.","(6:23) Andrew Luck pass to the right to T.Y. Hilton for 33 yards to the SD32.","(7:04) Frank Gore rush to the right for a loss of 1 yard to the Ind35. Tackled by Jatavis Brown.","(7:45) Andrew Luck pass to the right to Phillip Dorsett for 6 yards to the Ind36. Tackled by Brandon Flowers.","(8:23) Frank Gore rush up the middle for 5 yards to the Ind30. Tackled by Jatavis Brown.","(8:23) Josh Lambo kicks off to the endzone. Touchback.","(8:23) Josh Lambo extra point is BLOCKED.","(8:27) Melvin Gordon rush to the right for 1 yard for a TOUCHDOWN.","(8:33) Penalty: Too Many Men on Field on Indianapolis (Antonio Cromartie) 0 yards.","(9:17) Philip Rivers pass to the right to Dexter McCluster for 6 yards to the Ind1. Tackled by Sio Moore.","(10:02) Melvin Gordon rush up the middle for 3 yards to the Ind7. Tackled by Sio Moore.","(10:43) Philip Rivers pass to the right to Dexter McCluster for 3 yards to the Ind10. Tackled by Sio Moore.","(11:11) Philip Rivers pass to the right to Tyrell Williams for 19 yards to the Ind13. Tackled by Clayton Geathers.","(11:57) Philip Rivers pass to the right to Melvin Gordon for a loss of 3 yards to the Ind32. Tackled by Clayton Geathers.","(12:31) Philip Rivers pass to the left to Travis Benjamin for 8 yards to the Ind29. Tackled by Vontae Davis.","(13:09) Philip Rivers pass to the right to Hunter Henry for 7 yards to the Ind37. Tackled by D'Qwell Jackson.","(13:37) Melvin Gordon rush to the left for 4 yards to the Ind44. Tackled by David Parry.","(14:11) Philip Rivers pass to the left to Melvin Gordon for 10 yards to the Ind48. Tackled by Mike Adams.","(14:48) Philip Rivers pass to the middle to Tyrell Williams for 22 yards to the SD42. Tackled by Mike Adams and Darryl Morris.","(14:54) Philip Rivers incomplete pass to the right intended for Travis Benjamin defensed by Darryl Morris.","(15:00) Pat McAfee kicks off to the SD0. Craig Mager return for 20 yards to SD20. Tackled by Robert Turbin and Josh McNary.","(0:06) Frank Gore rush to the right for 1 yard to the Ind25. Tackled by Darius Philon.","(0:55) Frank Gore rush to the right for a loss of 1 yard to the Ind24. Tackled by Kyle Emanuel. FUMBLE, recovered by Ind (Andrew Luck).","(0:55) Josh Lambo kicks off to the endzone. Touchback.","(0:55) Josh Lambo extra point is good.","(1:08) Andrew Luck sacked at SD39 for a loss of 11 yards by Jatavis Brown and Adrian Phillips. FUMBLE, recovered by SD (Caraun Reid) and returned for 61 yards for a TOUCHDOWN.","(1:08) Penalty: False Start on Indianapolis (Ryan Kelly) -5 yards.","(1:16) Andrew Luck pass to the left to T.Y. Hilton for 19 yards to the SD23. Tackled by Casey Hayward.","(1:43) Andrew Luck pass to the left to Josh Ferguson for 14 yards to the SD42. Tackled by Melvin Ingram.","(1:50) Andrew Luck pass to the left to Josh Ferguson for 6 yards to the Ind44. Tackled by Jatavis Brown and Denzel Perryman.","(1:56) Philip Rivers sacked at Ind23 for a loss of 6 yards by Erik Walden. FUMBLE, recovered by Ind (Kendall Langford). Tackled by Matt Slauson. Penalty: Unsports. Conduct on San Diego (Chris Hairston) 15 yards.","(2:00) Philip Rivers incomplete pass to the left intended for Melvin Gordon.","(2:00) Two Minute Warning.","(2:29) Melvin Gordon rush to the left for 1 yard to the Ind17. Tackled by David Parry.","(3:08) Philip Rivers pass to the left to Travis Benjamin for 11 yards to the Ind18.","(3:50) Melvin Gordon rush up the middle for 1 yard to the Ind29. Tackled by Zach Kerr.","(4:25) Philip Rivers pass to the right to Hunter Henry for 33 yards to the Ind30. Tackled by Antonio Morrison.","(5:05) Melvin Gordon rush to the right for 5 yards to the SD37. Tackled by D'Qwell Jackson and Trent Cole.","(5:41) Philip Rivers pass to the middle to Dontrelle Inman for 9 yards to the SD32. Tackled by T.J. Green.","(6:21) Melvin Gordon rush up the middle for 4 yards to the SD23. Tackled by D'Qwell Jackson.","(6:25) Pat McAfee kicks off to the SD4. Dexter McCluster return for 15 yards to SD19. Tackled by Antonio Morrison.","(6:30) Adam Vinatieri 33 yard field goal attempt is GOOD. Holder: Pat McAfee.","(7:11) Andrew Luck sacked at SD15 for a loss of 3 yards by Denzel Perryman.","(7:57) Josh Ferguson rush to the left for 2 yards to the SD12. Tackled by Denzel Perryman.","(8:37) Andrew Luck pass to the right to Dwayne Allen for 7 yards to the SD14. Tackled by Casey Hayward.","(9:20) Frank Gore rush to the right for 5 yards to the SD21. Tackled by Dwight Lowery.","(10:05) Andrew Luck pass to the middle to Jack Doyle for 14 yards to the SD26. Tackled by Adrian Phillips.","(10:29) Penalty: False Start on Indianapolis (Joe Reitz) -5 yards.","(11:15) Frank Gore rush to the left for 9 yards to the SD35. Tackled by Adrian Phillips and Tourek Williams.","(11:59) Andrew Luck pass to the right to Jack Doyle for 6 yards to the SD44. Tackled by Denzel Perryman.","(12:04) Penalty: Holding on San Diego (Jason Verrett) 5 yards.","(12:48) Robert Turbin rush to the left for no gain to the Ind45. Tackled by Corey Liuget and Casey Hayward.","(13:28) Frank Gore rush to the right for 1 yard to the Ind45. Tackled by Brandon Mebane.","(14:04) Frank Gore rush up the middle for 19 yards to the Ind44. Tackled by Brandon Flowers and Adrian Phillips.","(14:04) Josh Lambo kicks off to the endzone. Touchback.","(14:09) Josh Lambo 34 yard field goal attempt is GOOD. Holder: Drew Kaser.","(14:17) Philip Rivers incomplete pass to the right.","(14:26) Philip Rivers incomplete pass to the right.","(14:31) Philip Rivers incomplete pass to the left intended for Dexter McCluster.","(14:36) Penalty: Holding on San Diego (D.J. Fluker) -10 yards.","(14:36) Indianapolis Colts timeout.","(14:45) Andrew Luck pass intended for Chester Rogers INTERCEPTED by Casey Hayward and returned for 21 yards. Tackled by Chester Rogers. Penalty: Face Mask on Indianapolis (Chester Rogers) 6 yards.","(14:51) Josh Lambo kicks off to the Ind14. Jordan Todman return for 15 yards to Ind29. Tackled by Jerry Attaochu.","(14:56) Josh Lambo 42 yard field goal attempt is GOOD. Holder: Drew Kaser.","(15:00) Philip Rivers incomplete pass to the right intended for Melvin Gordon.","(0:20) Philip Rivers pass to the right to Dontrelle Inman for 9 yards to the Ind25. Tackled by Antonio Cromartie.","(0:26) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(1:12) Philip Rivers pass to the middle to Sean McGrath for 13 yards to the Ind34. Tackled by Mike Adams.","(1:51) Melvin Gordon rush to the right for 1 yard to the Ind47. Tackled by Antonio Morrison and D'Qwell Jackson.","(2:22) Philip Rivers pass to the left to Melvin Gordon for 11 yards to the Ind48. Tackled by T.J. Green.","(2:22) San Diego Chargers timeout.","(2:32) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(3:10) Melvin Gordon rush up the middle for 2 yards to the SD41. Tackled by Kendall Langford.","(3:39) Philip Rivers pass to the left to Dontrelle Inman for 14 yards to the SD39. Tackled by Darryl Morris.","(3:39) Pat McAfee kicks off to the endzone. Touchback.","(3:39) Adam Vinatieri extra point is good.","(3:43) Frank Gore rush up the middle for 6 yards for a TOUCHDOWN.","(3:50) Andrew Luck incomplete pass to the left intended for Dwayne Allen defensed by Jatavis Brown.","(4:34) Andrew Luck pass to the right to Jack Doyle for 16 yards to the SD6. Tackled by Kyle Emanuel.","(4:39) Penalty: Leverage on San Diego (Tenny Palepoi) 15 yards.","(4:45) Andrew Luck incomplete pass to the left intended for Phillip Dorsett defensed by Jatavis Brown.","(4:45) Penalty: Offside on San Diego (Denzel Perryman) 5 yards.","(4:51) Andrew Luck incomplete pass to the left intended for Frank Gore.","(4:57) Andrew Luck incomplete pass to the right intended for T.Y. Hilton defensed by Melvin Ingram.","(5:42) Andrew Luck pass to the middle to T.Y. Hilton for 24 yards to the SD42. Tackled by Manti Te'o.","(6:22) Frank Gore rush up the middle for 7 yards to the Ind34. Tackled by Corey Liuget.","(7:04) Frank Gore rush up the middle for 12 yards to the Ind27. Tackled by Manti Te'o.","(7:13) Drew Kaser punts for 46 yards to Ind25. No return. Penalty: Holding on Indianapolis (Antonio Morrison) -10 yards.","(7:17) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(8:02) Philip Rivers pass to the right to Hunter Henry for 6 yards to the SD29. Tackled by Clayton Geathers.","(8:48) Melvin Gordon rush to the right for a loss of 1 yard to the SD23. Tackled by Clayton Geathers and David Parry.","(8:53) Pat McAfee kicks off to the SD0. Dexter McCluster return for 24 yards to SD24. Tackled by Antonio Morrison.","(8:58) Adam Vinatieri 38 yard field goal attempt is GOOD. Holder: Pat McAfee.","(9:04) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(9:46) Robert Turbin rush to the right for 5 yards to the SD20. Tackled by Kyle Emanuel.","(10:30) Frank Gore rush to the right for no gain to the SD25. Tackled by Kyle Emanuel and Darius Philon.","(10:45) Penalty: Offside on San Diego (Melvin Ingram) 5 yards.","(11:27) Frank Gore rush up the middle for 5 yards to the SD30. Tackled by Melvin Ingram.","(11:35) Andrew Luck incomplete pass to the left.","(12:14) Andrew Luck pass to the left to Phillip Dorsett for 18 yards to the SD35. Tackled by Brandon Flowers.","(12:57) Frank Gore rush to the right for 1 yard to the Ind47. Tackled by Denzel Perryman.","(13:40) Andrew Luck pass to the left to Jack Doyle for 5 yards to the Ind46. Tackled by Denzel Perryman.","(14:20) Andrew Luck pass to the middle to Dwayne Allen for 14 yards to the Ind41. Tackled by Dexter McCoil and Manti Te'o.","(14:56) Frank Gore rush to the left for 5 yards to the Ind27. Tackled by Brandon Mebane.","(15:00) Josh Lambo kicks off to the Ind4. Quan Bray return for 18 yards to Ind22. Tackled by Denzel Perryman."]