["(0:39) Aaron Rodgers rush up the middle for a loss of 1 yard to the GB45.","(1:18) Aaron Rodgers rush up the middle for a loss of 1 yard to the GB46.","(2:00) Aaron Rodgers rush up the middle for a loss of 1 yard to the GB47.","(2:00) Two Minute Warning.","(2:30) Aaron Rodgers pass to the right to Randall Cobb for 13 yards to the GB48. Tackled by Landon Collins.","(2:30) New York Giants timeout.","(2:41) Aaron Rodgers pass to the right to James Starks for 3 yards to the GB35. FUMBLE, recovered by GB (James Starks).","(2:41) New York Giants timeout.","(2:48) James Starks rush to the right for a loss of 3 yards to the GB32. Tackled by Olivier Vernon.","(2:54) Josh Brown kicks off to the GB11. Ty Montgomery return for 24 yards to GB35. Tackled by Devon Kennard.","(2:54) Josh Brown extra point is good.","(3:03) Eli Manning pass to the middle to Odell Beckham Jr. for 8 yards for a TOUCHDOWN.","(3:29) Paul Perkins rush to the left for 5 yards to the GB8. Tackled by Kyler Fackrell.","(3:36) Eli Manning pass to the left to Jerell Adams for 14 yards to the GB13. Tackled by Morgan Burnett.","(4:12) Eli Manning pass to the right to Bobby Rainey for 9 yards to the GB27. Tackled by Quinten Rollins.","(4:20) Eli Manning incomplete pass to the right intended for Paul Perkins.","(4:49) Eli Manning pass to the right to Sterling Shepard for 4 yards to the GB36. Tackled by Micah Hyde.","(5:10) Eli Manning pass to the right to Will Tye for 10 yards to the GB40. Tackled by Morgan Burnett.","(5:45) Eli Manning pass to the left to Jerell Adams for 13 yards to the NYG50. Tackled by Joe Thomas.","(6:25) Eli Manning pass to the middle to Bobby Rainey for no gain to the NYG37. Tackled by Nick Perry and Kyler Fackrell.","(6:32) Eli Manning incomplete pass to the right intended for Sterling Shepard defensed by Morgan Burnett.","(6:39) Mason Crosby kicks off to the NYG0. Bobby Rainey return for 37 yards to NYG37. Tackled by Kyler Fackrell.","(6:42) Mason Crosby 25 yard field goal attempt is GOOD. Holder: Jacob Schum.","(6:46) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson defensed by Trevin Wade.","(6:53) Aaron Rodgers incomplete pass to the right intended for Richard Rodgers.","(7:37) James Starks rush to the left for 3 yards to the NYG7. Tackled by Jason Pierre-Paul and Dominique Rodgers-Cromartie.","(8:30) Aaron Ripkowski rush up the middle for 13 yards to the NYG10. Tackled by Kelvin Sheppard and Landon Collins.","(9:01) Aaron Rodgers pass to the right to Davante Adams for 10 yards to the NYG23. Tackled by Devon Kennard and Janoris Jenkins.","(9:48) James Starks rush to the left for a loss of 1 yard to the NYG33. Tackled by Dominique Rodgers-Cromartie.","(10:18) Aaron Rodgers pass to the middle to Jordy Nelson for 17 yards to the NYG32. Tackled by Andrew Adams.","(11:00) James Starks rush up the middle for 1 yard to the NYG49. Tackled by Jonathan Casillas.","(11:31) New York Giants timeout.","(11:31) Aaron Rodgers pass to the right to Jordy Nelson for 12 yards to the GB50. Tackled by Janoris Jenkins.","(12:17) Aaron Rodgers pass to the left to Randall Cobb for 17 yards to the GB38. Tackled by Andrew Adams.","(12:24) Aaron Rodgers incomplete pass to the middle intended for Davante Adams.","(13:01) James Starks rush to the right for 1 yard to the GB21. Tackled by Jonathan Casillas and Keenan Robinson.","(13:09) Brad Wing punts for 41 yards to GB20. No return.","(13:13) Eli Manning incomplete pass to the left intended for Sterling Shepard defensed by Joe Thomas.","(13:18) Eli Manning incomplete pass to the middle intended for Odell Beckham Jr..","(13:23) Eli Manning incomplete pass to the right intended for Victor Cruz defensed by Quinten Rollins.","(13:46) Bobby Rainey rush to the left for 14 yards to the NYG39. Tackled by Ha Ha Clinton-Dix.","(13:46) Mason Crosby kicks off to the endzone. Touchback.","(13:50) Mason Crosby 33 yard field goal attempt is GOOD. Holder: Jacob Schum.","(14:13) Aaron Rodgers pass to the right to James Starks for 9 yards to the NYG15. Tackled by Jonathan Casillas.","(14:54) James Starks rush to the right for a loss of 1 yard to the NYG24. Tackled by Olivier Vernon.","(15:00) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Janoris Jenkins.","(0:37) Aaron Rodgers pass to the left to Randall Cobb for 21 yards to the NYG23. Tackled by Andrew Adams.","(1:22) James Starks rush up the middle for 2 yards to the NYG44. Tackled by Damon Harrison.","(2:05) James Starks rush to the left for 4 yards to the NYG46. Tackled by Damon Harrison.","(2:46) Aaron Rodgers pass to the right to Davante Adams for 20 yards to the GB50. Tackled by Landon Collins.","(3:32) James Starks rush to the right for 10 yards to the GB30. Tackled by Olivier Vernon.","(3:45) Brad Wing punts for 40 yards to GB17. Trevor Davis return for 3 yards to GB20. Tackled by Devon Kennard.","(3:48) Eli Manning incomplete pass to the right intended for Odell Beckham Jr. defensed by Julius Peppers.","(3:54) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(4:24) Odell Beckham Jr. sacked at NYG43 for a loss of 6 yards by Micah Hyde.","(4:31) Jacob Schum punts for 39 yards to NYG34. No return. Penalty: Unsports. Conduct on Green Bay (Jeff Janis) 15 yards.","(4:40) Aaron Rodgers incomplete pass to the right.","(5:21) Eddie Lacy rush to the right for 2 yards to the GB27. Tackled by Keenan Robinson and Olivier Vernon.","(5:26) Aaron Rodgers incomplete pass to the middle intended for Jordy Nelson.","(5:26) Josh Brown kicks off to the endzone. Touchback.","(5:31) Josh Brown 30 yard field goal attempt is GOOD. Holder: Brad Wing.","(6:09) Eli Manning rush to the right for 1 yard to the GB12. Tackled by Clay Matthews.","(6:45) Paul Perkins rush to the right for 4 yards to the GB13. Tackled by Datone Jones and Jake Ryan.","(7:23) Eli Manning sacked at GB17 for a loss of 6 yards by Nick Perry.","(7:58) Eli Manning pass to the right to Paul Perkins for 13 yards to the GB11. Tackled by Morgan Burnett.","(8:32) Eli Manning pass to the left to Bobby Rainey for 18 yards to the GB24. Tackled by Ha Ha Clinton-Dix.","(9:09) Bobby Rainey rush to the left for 2 yards to the GB42. Tackled by Mike Daniels and Joe Thomas.","(9:48) Bobby Rainey rush up the middle for 3 yards to the GB44. Tackled by Julius Peppers and Jake Ryan.","(10:09) Eli Manning pass to the left to Odell Beckham Jr. for 6 yards to the GB47. Tackled by Ha Ha Clinton-Dix.","(10:09) Jacob Schum punts for 32 yards to NYG47. No return.","(10:23) Aaron Rodgers incomplete pass to the middle intended for Richard Rodgers defensed by Keenan Robinson.","(11:06) Aaron Rodgers pass to the left to Eddie Lacy for 3 yards to the GB21. Tackled by Jason Pierre-Paul and Jonathan Casillas.","(11:41) Eddie Lacy rush to the left for 2 yards to the GB18. Tackled by Johnathan Hankins.","(11:48) Brad Wing punts for 32 yards to GB26. No return. Penalty: Holding on Green Bay (Josh Hawkins) -10 yards.","(12:28) Eli Manning pass to the right to Bobby Rainey for 7 yards to the NYG42. Tackled by Morgan Burnett.","(13:08) Eli Manning sacked at NYG35 for a loss of 3 yards by Clay Matthews.","(13:42) Orleans Darkwa rush to the left for a loss of 1 yard to the NYG38. Tackled by Jake Ryan.","(14:26) Eli Manning pass to the left to Sterling Shepard for 10 yards to the NYG39. Tackled by Micah Hyde.","(14:53) Orleans Darkwa rush up the middle for 1 yard to the NYG29. Tackled by Nick Perry.","(15:00) Mason Crosby kicks off to the NYG2. Dwayne Harris return for 26 yards to NYG28. Tackled by Kyler Fackrell.","(15:00) Penalty: Offside on Green Bay (Kentrell Brice) -5 yards.","(0:03) Mason Crosby 44 yard field goal attempt is GOOD. Holder: Jacob Schum.","(0:03) Green Bay Packers timeout.","(0:30) Aaron Rodgers pass to the right to James Starks for 7 yards to the NYG26. Tackled by Jonathan Casillas.","(0:36) Penalty: Pass Interference on Green Bay (Davante Adams) -10 yards.","(1:07) James Starks rush up the middle for 8 yards to the NYG23. Tackled by Keenan Robinson.","(1:15) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(1:22) Eli Manning sacked at NYG33 for a loss of 6 yards by Kyler Fackrell. FUMBLE, recovered by GB (Kenny Clark). Tackled by Justin Pugh.","(1:27) Eli Manning incomplete pass to the right intended for Will Tye.","(1:38) Jacob Schum punts for 42 yards to NYG33. Dwayne Harris return for 6 yards to NYG39. Tackled by Chris Banjo.","(1:44) Aaron Rodgers incomplete pass to the left intended for Richard Rodgers defensed by Damon Harrison.","(1:47) Aaron Rodgers incomplete pass to the right intended for James Starks.","(1:51) Aaron Rodgers incomplete pass to the middle intended for James Starks.","(1:51) Josh Brown kicks off to the endzone. Touchback.","(1:55) Josh Brown 41 yard field goal attempt is GOOD. Holder: Brad Wing.","(2:00) Eli Manning incomplete pass to the right intended for Sterling Shepard defensed by Micah Hyde.","(2:00) Two Minute Warning.","(2:25) Bobby Rainey rush to the left for 4 yards to the GB23. Tackled by Ha Ha Clinton-Dix and Nick Perry.","(2:31) Eli Manning incomplete pass to the left intended for Victor Cruz.","(3:04) Eli Manning pass to the right to Odell Beckham Jr. for 13 yards to the GB27. Tackled by Joe Thomas and Morgan Burnett.","(3:13) Aaron Rodgers pass intended for Davante Adams INTERCEPTED by Janoris Jenkins and returned for 3 yards. Tackled by Davante Adams.","(3:52) James Starks rush up the middle for 4 yards to the GB34. Tackled by Damon Harrison and Olivier Vernon.","(4:02) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson defensed by Landon Collins.","(4:31) Aaron Rodgers rush to the left for 7 yards to the GB25. Tackled by Jason Pierre-Paul. Penalty: Holding on New York (Janoris Jenkins) 5 yards.","(5:02) Aaron Rodgers pass to the right to Randall Cobb for 4 yards to the GB18. Tackled by Olivier Vernon.","(5:09) Brad Wing punts for 39 yards to GB14. No return.","(5:13) Eli Manning incomplete pass to the right intended for Sterling Shepard.","(5:20) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(5:52) Orleans Darkwa rush to the left for 6 yards to the NYG47. Tackled by Blake Martinez and Ha Ha Clinton-Dix.","(6:01) Mason Crosby kicks off to the NYG-1. Dwayne Harris return for 42 yards to NYG41. Tackled by Jeff Janis.","(6:01) Mason Crosby extra point is good.","(6:07) Aaron Rodgers pass to the right to Davante Adams for 29 yards for a TOUCHDOWN.","(6:46) Aaron Rodgers pass to the right to Davante Adams for 9 yards to the NYG29. Tackled by Michael Hunter.","(7:11) James Starks rush to the right for 5 yards to the NYG38. Tackled by Michael Hunter.","(7:51) Eddie Lacy rush to the left for 6 yards to the NYG43. Tackled by Landon Collins.","(8:14) Eddie Lacy rush to the left for 31 yards to the NYG49. Tackled by Jonathan Casillas.","(8:21) Josh Brown kicks off to the GB2. Jeff Janis return for 18 yards to GB20. Tackled by Paul Perkins and Kerry Wynn.","(8:26) Josh Brown 47 yard field goal attempt is GOOD. Holder: Brad Wing.","(8:32) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(8:36) Eli Manning incomplete pass to the middle intended for Odell Beckham Jr. defensed by Mike Daniels.","(9:08) Orleans Darkwa rush to the left for a loss of 1 yard to the GB29. Tackled by Kenny Clark and Micah Hyde.","(9:45) Eli Manning pass to the right to Will Tye for 27 yards to the GB28. Tackled by Jake Ryan.","(9:52) Jacob Schum punts for 33 yards to NYG45. No return.","(10:03) Aaron Rodgers incomplete pass to the left intended for Randall Cobb.","(10:34) Penalty: Holding on Green Bay (David Bakhtiari) -10 yards.","(10:37) Aaron Rodgers incomplete pass to the right intended for Randall Cobb.","(10:47) Aaron Rodgers incomplete pass to the middle intended for Jordy Nelson defensed by Andrew Adams.","(10:58) Brad Wing punts for 47 yards to GB17. No return. Penalty: FC Interference on New York (Roger Lewis) 15 yards.","(11:39) Eli Manning pass to the right to Bobby Rainey for 9 yards to the NYG36. Tackled by Morgan Burnett.","(11:45) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(12:01) Penalty: False Start on New York (Bobby Hart) -5 yards.","(12:34) Bobby Rainey rush up the middle for a loss of 1 yard to the NYG32. Tackled by Ha Ha Clinton-Dix.","(13:08) Eli Manning pass to the right to Odell Beckham Jr. for 16 yards to the NYG33. Tackled by Quinten Rollins.","(13:56) Eli Manning pass to the left to Bobby Rainey for 9 yards to the NYG17. Tackled by Jake Ryan.","(14:33) Orleans Darkwa rush to the left for 1 yard to the NYG8. Tackled by Blake Martinez and Jake Ryan.","(15:00) Penalty: Holding on New York (Ereck Flowers) -7 yards.","(0:11) Aaron Rodgers pass intended for Jordy Nelson INTERCEPTED by Janoris Jenkins and returned for 23 yards. Tackled by JC Tretter. Penalty: Unnecessary Roughness on New York (Olivier Vernon) -14 yards.","(0:19) Aaron Rodgers incomplete pass to the left intended for James Starks.","(0:57) Eddie Lacy rush up the middle for 4 yards to the NYG21. Tackled by Jay Bromley.","(1:28) Aaron Rodgers pass to the right to Randall Cobb for 13 yards to the NYG25. Tackled by Leon Hall.","(2:07) Aaron Rodgers pass to the left to Randall Cobb for 8 yards to the NYG38. Tackled by Jason Pierre-Paul.","(2:11) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Eli Apple.","(2:38) Aaron Rodgers pass to the left to Davante Adams for 17 yards to the NYG46. Tackled by Devon Kennard.","(3:15) Aaron Rodgers pass to the left to Richard Rodgers for 6 yards to the GB37. Tackled by Landon Collins.","(3:56) Eddie Lacy rush to the left for 11 yards to the GB31. Tackled by Devon Kennard.","(4:21) Eddie Lacy rush to the right for 12 yards to the GB20. Tackled by Dominique Rodgers-Cromartie.","(4:31) Brad Wing punts for 36 yards to GB15. No return. Penalty: Holding on Green Bay (Ty Montgomery) -7 yards.","(4:36) Eli Manning incomplete pass to the right intended for Tavarres King defensed by Quinten Rollins.","(4:45) Eli Manning incomplete pass to the middle intended for Odell Beckham Jr. defensed by Letroy Guion.","(5:18) Orleans Darkwa rush to the left for 1 yard to the NYG49. Tackled by Micah Hyde and Blake Martinez.","(5:47) Eli Manning pass to the right to Odell Beckham Jr. for 13 yards to the NYG48. Tackled by Quinten Rollins.","(6:12) Orleans Darkwa rush to the left for 4 yards to the NYG35. Tackled by Jake Ryan.","(6:18) Mason Crosby kicks off to the NYG-4. Dwayne Harris return for 35 yards to NYG31. Tackled by Kentrell Brice.","(6:18) Mason Crosby extra point is good.","(6:23) Aaron Rodgers pass to the right to Jordy Nelson for 2 yards for a TOUCHDOWN.","(7:03) Eddie Lacy rush to the left for 4 yards to the NYG2. Tackled by Jason Pierre-Paul and Andrew Adams.","(7:40) Aaron Rodgers rush to the left for 11 yards to the NYG6. Tackled by Landon Collins.","(7:40) Green Bay Packers timeout.","(7:45) Aaron Rodgers incomplete pass to the middle intended for Richard Rodgers defensed by Keenan Robinson.","(7:48) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(8:36) Aaron Rodgers pass to the left to Randall Cobb for 17 yards to the NYG17. Tackled by Leon Hall.","(9:13) Eddie Lacy rush to the right for 2 yards to the NYG34. Tackled by Jason Pierre-Paul.","(9:48) Aaron Rodgers pass to the left to Jordy Nelson for 7 yards to the NYG36. Tackled by Andrew Adams and Leon Hall.","(10:25) Randall Cobb rush to the right for no gain to the NYG43. Tackled by Landon Collins.","(10:52) Penalty: Encroachment on New York (Johnathan Hankins) 5 yards.","(11:33) Ty Montgomery rush to the right for 1 yard to the NYG48. Tackled by Jason Pierre-Paul.","(12:09) Aaron Rodgers pass to the middle to Randall Cobb for 9 yards to the NYG49. Tackled by Keenan Robinson.","(12:16) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(12:56) Eddie Lacy rush to the right for 4 yards to the GB42. Tackled by Johnathan Hankins and Jay Bromley.","(13:40) Aaron Ripkowski rush to the right for 4 yards to the GB38. Tackled by Jonathan Casillas and Kelvin Sheppard.","(14:17) Eddie Lacy rush to the left for 3 yards to the GB34. Tackled by Devon Kennard.","(15:00) Aaron Rodgers pass to the left to Randall Cobb for 6 yards to the GB31. Tackled by Leon Hall.","(15:00) Josh Brown kicks off to the endzone. Touchback."]