["(0:24) Landry Jones rush up the middle for a loss of 1 yard to the NYJ46.","(0:50) Landry Jones rush up the middle for a loss of 1 yard to the NYJ45.","(0:56) Ryan Fitzpatrick pass to the left to Bilal Powell for a loss of 2 yards to the NYJ44. Tackled by Lawrence Timmons.","(1:00) Ryan Fitzpatrick incomplete pass to the left intended for Bilal Powell.","(1:04) Ryan Fitzpatrick incomplete pass to the middle intended for Quincy Enunwa defensed by Sean Davis.","(1:08) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa.","(1:08) New York Jets timeout.","(1:19) Ryan Fitzpatrick pass to the left to Bilal Powell for 12 yards to the NYJ46. Tackled by Jordan Dangerfield.","(1:46) Ryan Fitzpatrick pass to the right to Bilal Powell for 9 yards to the NYJ34. Tackled by Sean Davis.","(1:46) Chris Boswell kicks off to the endzone. Touchback.","(1:46) Chris Boswell extra point is good.","(1:51) Ben Roethlisberger pass to the middle to Sammie Coates for 5 yards for a TOUCHDOWN.","(1:51) New York Jets timeout.","(1:54) Le'Veon Bell rush to the left for 2 yards to the NYJ5. Tackled by Darron Lee.","(2:00) Ben Roethlisberger incomplete pass to the middle intended for Le'Veon Bell.","(2:00) Two Minute Warning.","(2:10) Ben Roethlisberger pass to the right to Antonio Brown for 10 yards to the NYJ7. Tackled by Marcus Williams.","(2:55) Ben Roethlisberger pass to the right to Jesse James for 4 yards to the NYJ17. Tackled by Rontez Miles.","(3:00) Penalty: Pass Interference on New York (Buster Skrine) 8 yards.","(3:43) Le'Veon Bell rush to the right for no gain to the NYJ29. Tackled by Jarvis Jenkins and Rontez Miles.","(4:25) Ben Roethlisberger pass to the right to Sammie Coates for 13 yards to the NYJ29. Tackled by Juston Burris.","(5:06) Le'Veon Bell rush to the left for 3 yards to the NYJ42. Tackled by Rontez Miles and Erin Henderson.","(5:38) Ben Roethlisberger pass to the right to Sammie Coates for 8 yards to the NYJ45. Tackled by Juston Burris.","(6:18) Le'Veon Bell rush to the left for 8 yards to the Pit47. Tackled by Calvin Pryor.","(6:54) Ben Roethlisberger pass to the right to Le'Veon Bell for 16 yards to the Pit39.","(7:29) Le'Veon Bell rush to the left for 2 yards to the Pit23. Tackled by Muhammad Wilkerson.","(7:36) Lachlan Edwards punts for 33 yards to Pit21. No return.","(7:40) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(8:25) Ryan Fitzpatrick pass to the left to Robby Anderson for 10 yards to the NYJ46. Tackled by Sean Davis.","(9:04) Ryan Fitzpatrick sacked at NYJ36 for a loss of 2 yards by Vince Williams.","(9:36) Ryan Fitzpatrick pass to the right to Brandon Marshall for 19 yards to the NYJ38. Tackled by Ross Cockrell.","(9:44) Ben Roethlisberger sacked at NYJ19 for a loss of 5 yards by Leonard Williams. FUMBLE, recovered by NYJ (Sheldon Richardson). Tackled by David DeCastro.","(10:15) Le'Veon Bell rush to the right for 4 yards to the NYJ14. Tackled by Rontez Miles and Sheldon Richardson.","(10:54) Ben Roethlisberger pass to the right to Markus Wheaton for 13 yards to the NYJ18. Tackled by Marcus Williams.","(11:33) Ben Roethlisberger pass to the right to Antonio Brown for 16 yards to the NYJ31. Tackled by Marcus Williams.","(12:09) Le'Veon Bell rush up the middle for 2 yards to the NYJ47. Tackled by Steve McLendon.","(13:01) Ben Roethlisberger pass to the right to Jesse James for 13 yards to the NYJ49. Tackled by Erin Henderson.","(13:08) Lachlan Edwards punts for 33 yards to Pit38. No return.","(14:06) New York Jets timeout.","(14:06) Ryan Fitzpatrick pass to the middle to Bilal Powell for 8 yards to the NYJ29. Tackled by Anthony Chickillo and Sean Davis.","(14:12) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall defensed by Ross Cockrell.","(14:51) Bilal Powell rush to the right for 1 yard to the NYJ21. Tackled by Stephon Tuitt.","(14:55) Chris Boswell kicks off to the NYJ-5. Jeremy Ross return for 25 yards to NYJ20. Tackled by Steven Johnson and L.J. Fort.","(14:55) Chris Boswell extra point is good.","(15:00) Ben Roethlisberger pass to the middle to Antonio Brown for 5 yards for a TOUCHDOWN.","(0:15) Ben Roethlisberger pass to the middle to Markus Wheaton for 6 yards to the NYJ5. Tackled by Buster Skrine.","(0:42) Ben Roethlisberger pass to the right to Sammie Coates for 22 yards to the NYJ11. Tackled by Juston Burris.","(1:05) Le'Veon Bell rush to the left for 1 yard to the NYJ33. Tackled by Jarvis Jenkins.","(1:38) Le'Veon Bell rush up the middle for 6 yards to the NYJ34. Tackled by Darron Lee.","(2:15) Ben Roethlisberger pass to the right to Le'Veon Bell for 11 yards to the NYJ40. Tackled by Erin Henderson.","(2:50) Ben Roethlisberger pass to the middle to Le'Veon Bell for 11 yards to the Pit49. Tackled by Juston Burris.","(3:30) Le'Veon Bell rush to the left for no gain to the Pit38. Tackled by Erin Henderson.","(4:03) Ben Roethlisberger pass to the middle to Jesse James for 14 yards to the Pit38. Tackled by Calvin Pryor.","(4:07) Penalty: Pass Interference on New York (Darron Lee) 4 yards.","(4:16) Lachlan Edwards punts for 50 yards to Pit0. Touchback.","(4:22) Ryan Fitzpatrick incomplete pass to the middle intended for Brandon Marshall defensed by Ross Cockrell.","(4:26) Ryan Fitzpatrick incomplete pass to the middle intended for Quincy Enunwa.","(5:09) Matt Forte rush to the left for a loss of 1 yard to the NYJ50. Tackled by Vince Williams.","(5:49) Bilal Powell rush up the middle for 7 yards to the Pit49. Tackled by Sean Davis.","(6:30) Ryan Fitzpatrick pass to the right to Matt Forte for 7 yards to the NYJ44. Tackled by Vince Williams.","(7:08) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 11 yards to the NYJ37. Tackled by Vince Williams and Jordan Dangerfield.","(7:34) Matt Forte rush to the right for 4 yards to the NYJ26. Tackled by William Gay.","(8:10) Ryan Fitzpatrick pass to the right to Brandon Marshall for 9 yards to the NYJ22. Tackled by Mike Mitchell.","(8:16) Jordan Berry punts for 52 yards to NYJ13. No return.","(8:20) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(9:02) Ben Roethlisberger pass to the left to Antonio Brown for 1 yard to the Pit35. Tackled by Marcus Williams.","(9:05) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates.","(9:17) Lachlan Edwards punts for 50 yards to Pit16. Antonio Brown return for 18 yards to Pit34. Tackled by Calvin Pryor.","(9:49) Ryan Fitzpatrick pass to the middle to Matt Forte for no gain to the NYJ34. Tackled by Jarvis Jones.","(9:54) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall defensed by Jarvis Jones.","(10:23) Ryan Fitzpatrick pass to the right to Austin Seferian-Jenkins for 9 yards to the NYJ34. Tackled by Al-Hajj Shabazz.","(10:23) Chris Boswell kicks off to the endzone. Touchback.","(10:27) Chris Boswell 47 yard field goal attempt is GOOD. Holder: Jordan Berry.","(10:31) Ben Roethlisberger incomplete pass to the left intended for Jesse James defensed by Darron Lee.","(11:15) Ben Roethlisberger pass to the right to Xavier Grimble for 2 yards to the NYJ29. Tackled by Sheldon Richardson.","(11:21) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates defensed by Darryl Roberts.","(11:36) Lachlan Edwards punts for 52 yards to Pit36. Antonio Brown return for 33 yards to NYJ31. Tackled by Calvin Pryor.","(11:52) Ryan Fitzpatrick sacked at NYJ12 for a loss of 2 yards by Lawrence Timmons and Arthur Moats.","(11:58) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(12:34) Matt Forte rush up the middle for 1 yard to the NYJ14. Tackled by Lawrence Timmons and Stephon Tuitt.","(12:45) Jordan Berry punts for 43 yards to NYJ13. No return.","(12:50) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown defensed by Marcus Williams.","(13:09) Le'Veon Bell rush to the right for no gain to the Pit44. Tackled by Darron Lee.","(13:47) Le'Veon Bell rush up the middle for 2 yards to the Pit44. Tackled by Steve McLendon and Leonard Williams.","(14:20) Ben Roethlisberger pass to the right to Antonio Brown for 16 yards to the Pit42.","(15:00) Le'Veon Bell rush up the middle for 1 yard to the Pit26. Tackled by Leonard Williams and Marcus Gilchrist.","(15:00) Nick Folk kicks off to the endzone. Touchback.","(0:41) Bilal Powell rush up the middle for a loss of 3 yards to the NYJ22. Tackled by Vince Williams and Lawrence Timmons.","(0:41) Chris Boswell kicks off to the endzone. Touchback.","(0:41) Chris Boswell extra point is good.","(0:44) Ben Roethlisberger pass to the middle to Jesse James for 1 yard for a TOUCHDOWN.","(0:46) Ben Roethlisberger incomplete pass to the middle intended for Sammie Coates.","(0:52) Penalty: Holding on New York (Calvin Pryor) 2 yards.","(0:52) New York Jets timeout.","(1:00) Ben Roethlisberger pass to the left to Sammie Coates for 19 yards to the NYJ3. Tackled by Rontez Miles.","(1:04) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates defensed by Darryl Roberts.","(1:09) Ben Roethlisberger pass to the right to Xavier Grimble for 11 yards to the NYJ22. Tackled by Calvin Pryor.","(1:09) Pittsburgh Steelers timeout.","(1:16) Ben Roethlisberger pass to the middle to Antonio Brown for 9 yards to the NYJ33. Tackled by David Harris.","(1:20) Ben Roethlisberger incomplete pass to the middle intended for Le'Veon Bell.","(1:27) Ben Roethlisberger pass to the right to Le'Veon Bell for 8 yards to the NYJ42. Tackled by Darryl Roberts.","(1:27) Pittsburgh Steelers timeout.","(1:35) Ben Roethlisberger pass to the middle to Antonio Brown for 10 yards to the Pit50. Tackled by Darron Lee.","(2:00) Le'Veon Bell rush to the right for 6 yards to the Pit40. Tackled by Marcus Williams.","(2:00) Two Minute Warning.","(2:06) Ben Roethlisberger pass to the right to Le'Veon Bell for 9 yards to the Pit34. Tackled by David Harris.","(2:06) Nick Folk kicks off to the endzone. Touchback.","(2:06) Nick Folk extra point is good.","(2:11) Ryan Fitzpatrick pass to the left to Brandon Marshall for 15 yards for a TOUCHDOWN.","(2:53) Matt Forte rush to the left for 1 yard to the Pit15. Tackled by William Gay and Ricardo Mathews.","(3:29) Ryan Fitzpatrick pass to the left to Brandon Marshall for 16 yards to the Pit16. Tackled by Mike Mitchell.","(4:06) Matt Forte rush to the right for 1 yard to the Pit32. Tackled by Javon Hargrave and James Harrison.","(4:33) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 18 yards to the Pit33. Tackled by Mike Mitchell.","(5:12) Bilal Powell rush up the middle for 5 yards to the NYJ49. Tackled by Stephon Tuitt and Jordan Dangerfield.","(5:54) Ryan Fitzpatrick pass to the left to Bilal Powell for 13 yards to the NYJ44. Tackled by Lawrence Timmons and Arthur Moats.","(6:00) Jordan Berry rush to the right for a loss of 3 yards to the NYJ31. Tackled by Rontez Miles. FUMBLE, recovered by Pit.","(6:05) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates.","(6:47) Ben Roethlisberger pass to the left to Jesse James for 8 yards to the NYJ28. Tackled by Muhammad Wilkerson.","(6:47) New York Jets timeout.","(6:57) Ben Roethlisberger incomplete pass to the right intended for Markus Wheaton.","(7:41) Le'Veon Bell rush to the left for 9 yards to the NYJ36. Tackled by David Harris.","(8:24) Ben Roethlisberger pass to the left to Le'Veon Bell for 4 yards to the NYJ45. Tackled by Marcus Gilchrist and Erin Henderson.","(8:55) Penalty: Illegal Use of Hands on New York (Jordan Jenkins) 4 yards.","(9:37) Le'Veon Bell rush up the middle for 1 yard to the Pit47. Tackled by Calvin Pryor and David Harris.","(10:17) Ben Roethlisberger pass to the right to Le'Veon Bell for 12 yards to the Pit46. Tackled by Darryl Roberts.","(10:21) Ben Roethlisberger incomplete pass to the right intended for DeAngelo Williams defensed by Muhammad Wilkerson.","(11:00) Ben Roethlisberger pass to the left to Le'Veon Bell for 12 yards to the Pit34. Tackled by Marcus Williams.","(11:07) Nick Folk kicks off to the Pit-1. Sammie Coates return for 23 yards to Pit22. Tackled by Marcus Gilchrist and Josh Martin.","(11:12) Nick Folk 48 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(11:48) Ryan Fitzpatrick pass to the left to Charone Peake for 6 yards to the Pit30. Tackled by Artie Burns.","(12:32) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 9 yards to the Pit36. Tackled by Lawrence Timmons and Jordan Dangerfield.","(13:16) Ryan Fitzpatrick sacked at Pit45 for a loss of 7 yards by Anthony Chickillo. FUMBLE, recovered by NYJ (Ryan Fitzpatrick).","(13:53) Ryan Fitzpatrick pass to the right to Austin Seferian-Jenkins for 8 yards to the Pit38. Tackled by Vince Williams.","(14:29) Matt Forte rush to the right for 6 yards to the Pit46. Tackled by Jarvis Jones.","(15:00) Matt Forte rush to the right for 28 yards to the NYJ48. Tackled by Mike Mitchell.","(0:13) Matt Forte rush up the middle for no gain to the NYJ20. Tackled by Jarvis Jones.","(0:47) Ryan Fitzpatrick pass to the left to Brandon Marshall for 9 yards to the NYJ20. Tackled by Ross Cockrell.","(0:54) Jordan Berry punts for 44 yards to NYJ11. No return.","(1:26) Le'Veon Bell rush up the middle for no gain to the Pit45. Tackled by Muhammad Wilkerson.","(2:11) Ben Roethlisberger pass to the middle to Le'Veon Bell for 5 yards to the Pit45. Tackled by Marcus Gilchrist and Erin Henderson.","(2:35) Penalty: Holding on Pittsburgh (Alejandro Villanueva) -10 yards.","(3:15) Ben Roethlisberger pass to the left to Antonio Brown for no gain to the Pit50. Tackled by Rontez Miles.","(4:01) Le'Veon Bell rush to the right for 10 yards to the Pit50. Tackled by Erin Henderson.","(4:32) Le'Veon Bell rush to the left for 3 yards to the Pit40. Tackled by David Harris.","(5:18) Le'Veon Bell rush up the middle for 6 yards to the Pit37. Tackled by David Harris.","(5:57) Ben Roethlisberger pass to the right to Antonio Brown for 11 yards to the Pit31. Tackled by Erin Henderson and Marcus Williams.","(6:01) Ben Roethlisberger incomplete pass to the middle intended for Jesse James defensed by David Harris.","(6:09) Lachlan Edwards punts for 42 yards to Pit0. Touchback.","(6:14) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(6:53) Matt Forte rush up the middle for 1 yard to the Pit42. Tackled by James Harrison and Vince Williams.","(6:59) Ryan Fitzpatrick incomplete pass to the middle intended for Robby Anderson.","(7:42) Ryan Fitzpatrick pass to the left to Brandon Marshall for 18 yards to the Pit43. Tackled by Mike Mitchell.","(8:23) Ryan Fitzpatrick pass to the right to Bilal Powell for 1 yard to the NYJ39. Tackled by Sean Davis and Lawrence Timmons.","(9:03) Matt Forte rush up the middle for no gain to the NYJ38. Tackled by Cameron Heyward.","(9:39) Matt Forte rush up the middle for 4 yards to the NYJ38. Tackled by Javon Hargrave.","(10:16) Ryan Fitzpatrick pass to the right to Brandon Bostick for 9 yards to the NYJ34. Tackled by Lawrence Timmons and Sean Davis.","(10:16) Chris Boswell kicks off to the endzone. Touchback.","(10:16) Chris Boswell extra point is good.","(10:25) Ben Roethlisberger pass to the right to Sammie Coates for 72 yards for a TOUCHDOWN.","(11:10) DeAngelo Williams rush up the middle for no gain to the Pit28. Tackled by Leonard Williams and Steve McLendon.","(11:45) Ben Roethlisberger pass to the left to Jesse James for 3 yards to the Pit28. Tackled by Calvin Pryor.","(11:45) Nick Folk kicks off to the endzone. Touchback.","(11:50) Nick Folk 35 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(11:54) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall defensed by Ross Cockrell.","(12:38) Ryan Fitzpatrick rush to the right for 9 yards to the Pit17. Tackled by Artie Burns.","(12:50) Ryan Fitzpatrick incomplete pass to the left intended for Bilal Powell defensed by Arthur Moats.","(13:04) Ryan Fitzpatrick pass to the left to Brandon Marshall for 18 yards to the Pit26. Tackled by Ross Cockrell.","(13:45) Matt Forte rush to the right for 8 yards to the Pit44. Tackled by Vince Williams and Mike Mitchell.","(14:24) Ryan Fitzpatrick pass to the right to Brandon Marshall for 10 yards to the NYJ48. Tackled by Ross Cockrell.","(15:00) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 13 yards to the NYJ38. Tackled by Vince Williams and Mike Mitchell.","(15:00) Chris Boswell kicks off to the endzone. Touchback."]