["(0:31) Charlie Whitehurst rush up the middle for a loss of 1 yard to the Cle22.","(0:37) Ryan Allen punts for 19 yards to Cle23. No return.","(1:17) Jimmy Garoppolo rush up the middle for a loss of 2 yards to the Cle42.","(1:59) Jimmy Garoppolo rush up the middle for a loss of 1 yard to the Cle40.","(1:59) Two Minute Warning.","(2:35) D.J. Foster rush to the left for 1 yard to the Cle39. Tackled by Christian Kirksey and Tyrone Holmes.","(3:21) Matthew Slater rush to the left for 5 yards to the Cle40. Tackled by Joe Haden and Demario Davis.","(3:21) Cleveland Browns timeout.","(3:28) D.J. Foster rush to the right for 4 yards to the Cle45. Tackled by Christian Kirksey and Danny Shelton.","(3:28) Cleveland Browns timeout.","(3:35) D.J. Foster rush to the left for 3 yards to the Cle49. Tackled by Christian Kirksey.","(3:40) Terrelle Pryor Sr. incomplete pass to the middle intended for Ricardo Louis.","(3:42) New England Patriots timeout.","(3:51) Terrelle Pryor Sr. rush to the left for 2 yards to the NE48. Tackled by Patrick Chung.","(3:57) Terrelle Pryor Sr. pass to the right to Ricardo Louis for 5 yards to the Cle50. Tackled by Devin McCourty.","(4:06) Charlie Whitehurst incomplete pass to the left intended for Andrew Hawkins.","(4:35) Isaiah Crowell rush to the right for 2 yards to the Cle45. Tackled by Trey Flowers.","(4:40) Charlie Whitehurst pass to the right to Terrelle Pryor Sr. for 9 yards to the Cle43. Tackled by Logan Ryan.","(5:06) Charlie Whitehurst pass to the right to Gary Barnidge for 20 yards to the Cle34. Tackled by Devin McCourty.","(5:16) Ryan Allen punts for 46 yards to Cle14. No return.","(5:20) Jimmy Garoppolo incomplete pass to the right intended for James White.","(5:20) Cleveland Browns timeout.","(5:26) LeGarrette Blount rush to the right for no gain to the NE40. Tackled by Jamar Taylor and Stephen Paea.","(6:02) LeGarrette Blount rush to the left for 3 yards to the NE40. Tackled by Christian Kirksey.","(6:07) Britton Colquitt punts for 43 yards to NE37. No return.","(6:56) Charlie Whitehurst sacked at Cle20 for a loss of 5 yards by Malcom Brown.","(7:34) Charlie Whitehurst pass to the middle to Ricardo Louis for 8 yards to the Cle25. Tackled by Patrick Chung.","(7:38) Charlie Whitehurst incomplete pass to the left intended for Gary Barnidge.","(7:42) Stephen Gostkowski kicks off to the Cle3. Tracy Howard return for 14 yards to Cle17. Tackled by Patrick Chung.","(7:45) Stephen Gostkowski 31 yard field goal attempt is GOOD. Holder: Ryan Allen.","(8:33) Tom Brady pass to the right to James White for 10 yards to the Cle13. Tackled by Christian Kirksey.","(8:39) Tom Brady incomplete pass to the right intended for Chris Hogan.","(9:20) LeGarrette Blount rush to the right for a loss of 3 yards to the Cle23. Tackled by Cam Johnson.","(9:51) Tom Brady rush to the right for 10 yards to the Cle25. Tackled by Demario Davis. Penalty: Illegal Use of Hands on Cleveland (Danny Shelton) 5 yards.","(10:33) James White rush to the right for 3 yards to the Cle35. Tackled by Christian Kirksey and Jamie Meder.","(10:52) Penalty: Holding on New England (Rob Gronkowski) -10 yards.","(11:20) Tom Brady pass to the right to Rob Gronkowski for 37 yards to the Cle28. Tackled by Christian Kirksey.","(12:00) LeGarrette Blount rush to the right for no gain to the NE35. Tackled by Joe Haden.","(12:39) Tom Brady pass to the middle to Martellus Bennett for 13 yards to the NE35. Tackled by Derrick Kindred.","(13:20) Tom Brady pass to the right to Danny Amendola for 4 yards to the NE22. Tackled by Jamar Taylor.","(14:01) Tom Brady pass to the middle to Martellus Bennett for 3 yards to the NE18. Tackled by Derrick Kindred.","(14:05) Cody Parkey kicks off to the NE6. Devin McCourty return for 9 yards to NE15. Tackled by George Atkinson III.","(14:05) Charlie Whitehurst 2 pt conversion pass is NO GOOD - intended for Terrelle Pryor Sr..","(14:05) Charlie Whitehurst pass to the middle to Connor Hamlett for 17 yards for a TOUCHDOWN.","(14:56) Isaiah Crowell rush to the right for 5 yards to the NE17. Tackled by Jamie Collins.","(15:00) Penalty: Holding on Cleveland (John Greco) -10 yards.","(0:05) Isaiah Crowell rush to the left for 6 yards to the NE12. Tackled by Jonathan Jones.","(0:30) Charlie Whitehurst pass to the right to Gary Barnidge for 7 yards to the NE18. Tackled by Elandon Roberts.","(1:08) Charlie Whitehurst pass to the left to Gary Barnidge for 31 yards to the NE25. Tackled by Devin McCourty.","(1:47) Charlie Whitehurst pass to the left to Andrew Hawkins for 24 yards to the Cle44. Tackled by Devin McCourty.","(2:27) Isaiah Crowell rush to the left for no gain to the Cle20. Tackled by Woodrow Hamilton and Malcom Brown.","(2:36) Ryan Allen punts for 46 yards to Cle15. Joe Haden return for 5 yards to Cle20. Tackled by Nate Ebner.","(2:42) Tom Brady incomplete pass to the middle intended for Martellus Bennett defensed by Briean Boddy-Calhoun.","(3:18) Chris Hogan rush to the left for 2 yards to the NE39. Tackled by Joe Haden.","(3:58) LeGarrette Blount rush to the right for 2 yards to the NE37. Tackled by Christian Kirksey.","(4:37) Tom Brady rush to the right for 4 yards to the NE35. Tackled by Emmanuel Ogbah.","(5:15) LeGarrette Blount rush to the right for 2 yards to the NE31. Tackled by Christian Kirksey and Demario Davis.","(5:42) LeGarrette Blount rush to the left for 4 yards to the NE29. Tackled by Cam Johnson.","(5:55) Britton Colquitt punts for 50 yards to NE25. Julian Edelman - no return. Tackled by Joe Schobert.","(6:00) Charlie Whitehurst incomplete pass to the right intended for Ricardo Louis.","(6:05) Charlie Whitehurst incomplete pass to the right intended for Malcolm Johnson.","(6:44) Charlie Whitehurst pass to the right to Andrew Hawkins for 5 yards to the Cle25. Tackled by Elandon Roberts.","(6:53) Ryan Allen punts for 52 yards to Cle18. Duke Johnson Jr. return for 12 yards to Cle30. Tackled by Nate Ebner. Penalty: Holding on Cleveland -10 yards.","(7:27) Tom Brady sacked at NE30 for a loss of 3 yards by Jamie Meder.","(8:00) Tom Brady pass to the right to James White for 9 yards to the NE33. Tackled by Jordan Poyer.","(8:02) Tom Brady incomplete pass to the left intended for Martellus Bennett defensed by Demario Davis.","(8:06) Penalty: Holding on New England (David Andrews) -10 yards.","(8:17) Charlie Whitehurst pass intended for Duke Johnson Jr. INTERCEPTED by Patrick Chung and returned for 4 yards. Tackled by Duke Johnson Jr..","(9:00) Charlie Whitehurst sacked at NE39 for a loss of 9 yards by Malcom Brown.","(9:42) Isaiah Crowell rush to the right for a loss of 2 yards to the NE30. Tackled by Elandon Roberts.","(10:04) Charlie Whitehurst pass to the left to Terrelle Pryor Sr. for 15 yards to the NE28.","(10:11) Charlie Whitehurst incomplete pass to the left intended for Gary Barnidge defensed by Jabaal Sheard.","(10:45) Duke Johnson Jr. rush to the left for 2 yards to the NE43. Tackled by Jabaal Sheard.","(10:59) Charlie Whitehurst pass to the middle to Terrelle Pryor Sr. for 13 yards to the Cle40. Tackled by Logan Ryan. Penalty: Disqualification on New England (Cyrus Jones) 15 yards.","(11:42) Charlie Whitehurst pass to the left to Terrelle Pryor Sr. for 1 yard to the Cle27. Tackled by Elandon Roberts.","(12:20) Isaiah Crowell rush to the right for 2 yards to the Cle26. Tackled by Woodrow Hamilton.","(12:24) Stephen Gostkowski kicks off to the Cle3. Tracy Howard return for 21 yards to Cle24. Tackled by Jordan Richards.","(12:24) Stephen Gostkowski extra point is good.","(12:28) Tom Brady pass to the right to Martellus Bennett for 37 yards for a TOUCHDOWN.","(12:50) James White rush to the right for 3 yards to the Cle37. Tackled by Joe Schobert.","(13:19) James White rush to the left for 8 yards to the Cle40. Tackled by Ibraheim Campbell.","(13:32) Tom Brady pass to the middle to Rob Gronkowski for 12 yards to the Cle48. Tackled by Jamar Taylor.","(13:39) Tom Brady incomplete pass to the left intended for Julian Edelman.","(14:19) Tom Brady pass to the left to Malcolm Mitchell for 2 yards to the NE40. Tackled by Jamar Taylor.","(14:24) Penalty: Holding on Cleveland (Christian Kirksey) 5 yards.","(14:55) Tom Brady pass to the left to James White for 8 yards to the NE33. Tackled by Jordan Poyer.","(15:00) Tom Brady incomplete pass to the right intended for Rob Gronkowski.","(15:00) Cody Parkey kicks off to the endzone. Touchback.","(0:05) Charlie Whitehurst incomplete pass to the right intended for Ricardo Louis defensed by Jonathan Jones.","(0:05) Cleveland Browns timeout.","(0:12) Charlie Whitehurst pass to the middle to Duke Johnson Jr. for 15 yards to the NE45. Tackled by Patrick Chung.","(0:17) 50 yard field goal attempt by Stephen Gostkowski is NO GOOD. Holder: Ryan Allen.","(0:21) Tom Brady incomplete pass to the right intended for Julian Edelman.","(0:24) Tom Brady incomplete pass to the right intended for Rob Gronkowski.","(0:45) Tom Brady pass to the right to Rob Gronkowski for 7 yards to the Cle32. Tackled by Derrick Kindred.","(1:06) James White rush to the right for 4 yards to the Cle39. Tackled by Christian Kirksey.","(1:27) Tom Brady pass to the middle to Danny Amendola for 7 yards to the Cle43. Tackled by Demario Davis.","(1:46) James White rush to the right for 8 yards to the NE50. Tackled by Derrick Kindred.","(1:51) Tom Brady pass to the left to Julian Edelman for 4 yards to the NE42. Tackled by Demario Davis.","(1:51) Two Minute Warning.","(2:05) Britton Colquitt punts for 49 yards to NE26. Julian Edelman return for 12 yards to NE38. Tackled by Dominique Alexander and Charley Hughlett.","(2:09) Charlie Whitehurst incomplete pass to the left intended for Gary Barnidge.","(2:10) New England Patriots timeout.","(2:18) Charlie Whitehurst pass to the middle to Duke Johnson Jr. for 6 yards to the Cle25. Tackled by Patrick Chung and Elandon Roberts.","(2:59) Duke Johnson Jr. rush to the right for a loss of 1 yard to the Cle19. Tackled by Alan Branch.","(3:10) Ryan Allen punts for 46 yards to Cle12. Duke Johnson Jr. return for 8 yards to Cle20. Tackled by Barkevious Mingo and James Develin.","(3:38) Tom Brady pass to the right to Malcolm Mitchell for 5 yards to the NE42.","(3:40) Tom Brady incomplete pass to the right intended for Julian Edelman.","(3:48) Tom Brady incomplete pass to the left intended for Malcolm Mitchell defensed by Jamar Taylor.","(3:55) Britton Colquitt punts for 37 yards to NE36. No return.","(4:33) Charlie Whitehurst rush to the right for 2 yards to the Cle27. Tackled by Jabaal Sheard.","(5:14) Duke Johnson Jr. rush to the left for 2 yards to the Cle25. Tackled by Jabaal Sheard and Dont'a Hightower.","(5:22) Charlie Whitehurst incomplete pass to the left intended for Isaiah Crowell.","(5:22) Cleveland Browns timeout.","(5:28) Penalty: Pass Interference on New England (Malcolm Butler) 21 yards.","(6:03) Isaiah Crowell rush to the left for no gain to the Cle2. Tackled by Elandon Roberts.","(6:07) LeGarrette Blount rush to the left for no gain to the Cle1. Tackled by Demario Davis and Ibraheim Campbell.","(6:46) LeGarrette Blount rush to the left for no gain to the Cle1. Tackled by Christian Kirksey.","(7:16) D.J. Foster rush to the left for 5 yards to the Cle1. Tackled by Demario Davis.","(7:21) Tom Brady incomplete pass to the left intended for Julian Edelman.","(8:01) Tom Brady pass to the right to Chris Hogan for 63 yards to the Cle6. Tackled by Joe Haden.","(8:40) D.J. Foster rush to the right for 4 yards to the NE31. Tackled by Danny Shelton and Cam Johnson.","(9:12) D.J. Foster rush to the left for no gain to the NE27. Tackled by Christian Kirksey.","(9:20) Britton Colquitt punts for 40 yards to NE27. No return.","(9:23) Charlie Whitehurst incomplete pass to the right intended for Andrew Hawkins.","(10:05) Isaiah Crowell rush to the left for 2 yards to the Cle33. Tackled by Elandon Roberts.","(10:48) Isaiah Crowell rush to the left for a loss of 6 yards to the Cle31. Tackled by Devin McCourty.","(11:28) Charlie Whitehurst pass to the right to Gary Barnidge for 11 yards to the Cle37. Tackled by Patrick Chung.","(11:35) Terrelle Pryor Sr. incomplete pass to the right intended for Rashard Higgins.","(12:10) Terrelle Pryor Sr. rush to the left for 1 yard to the Cle26. Tackled by Jamie Collins. FUMBLE, recovered by Cle (Terrelle Pryor Sr.).","(12:10) Stephen Gostkowski kicks off to the endzone. Touchback.","(12:10) Stephen Gostkowski extra point is good.","(12:15) Tom Brady pass to the right to Martellus Bennett for 5 yards for a TOUCHDOWN.","(12:58) Tom Brady pass to the right to Julian Edelman for no gain to the Cle5. Tackled by Joe Haden and Demario Davis.","(13:42) LeGarrette Blount rush to the right for 2 yards to the Cle5. Tackled by Christian Kirksey.","(14:29) Tom Brady pass to the left to Chris Hogan for 43 yards to the Cle7. Tackled by Ibraheim Campbell.","(15:00) LeGarrette Blount rush to the left for 2 yards to the NE50. Tackled by Christian Kirksey.","(0:31) Tom Brady pass to the left to Chris Hogan for 3 yards to the NE48. Tackled by Jamar Taylor and Ibraheim Campbell.","(0:56) Tom Brady pass to the left to Chris Hogan for 5 yards to the NE45. Tackled by Jamar Taylor.","(1:13) LeGarrette Blount rush to the left for 4 yards to the NE40. Tackled by Danny Shelton.","(1:20) Britton Colquitt kicks off to the NE27. Julian Edelman return for 9 yards to NE36. Tackled by Briean Boddy-Calhoun.","(1:26) Cody Kessler rush up the middle for no gain to the Cle10. FUMBLE, recovered by Cle. Safety.","(2:01) Duke Johnson Jr. rush to the left for a loss of 2 yards to the Cle10. Tackled by Alan Branch.","(2:06) Stephen Gostkowski kicks off to the Cle1. Tracy Howard return for 11 yards to Cle12. Tackled by Barkevious Mingo.","(2:06) Stephen Gostkowski extra point is good.","(2:12) Tom Brady pass to the right to Martellus Bennett for 7 yards for a TOUCHDOWN.","(2:50) LeGarrette Blount rush to the right for 2 yards to the Cle7. Tackled by Joe Schobert.","(3:33) Tom Brady pass to the left to James White for 36 yards to the Cle9. Tackled by Joe Haden.","(4:09) LeGarrette Blount rush to the right for 1 yard to the Cle45. Tackled by Christian Kirksey and Jordan Poyer.","(4:41) Tom Brady pass to the middle to Julian Edelman for 12 yards to the Cle46. Tackled by Demario Davis.","(4:44) Tom Brady incomplete pass to the left intended for Julian Edelman.","(5:28) LeGarrette Blount rush to the left for 3 yards to the NE42. Tackled by Jordan Poyer and Danny Shelton.","(6:09) Tom Brady pass to the middle to Julian Edelman for 9 yards to the NE39. Tackled by Demario Davis.","(6:09) Penalty: Encroachment on Cleveland (Jamar Taylor) 5 yards.","(6:09) Cody Parkey kicks off to the endzone. Touchback.","(6:09) Cody Parkey extra point is good.","(6:14) Cody Kessler pass to the left to Andrew Hawkins for 11 yards for a TOUCHDOWN.","(6:31) Cody Kessler pass to the right to Terrelle Pryor Sr. for 10 yards to the NE11.","(6:38) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr..","(7:13) Isaiah Crowell rush to the right for 4 yards to the NE21. Tackled by Alan Branch.","(8:03) Cody Kessler pass to the right to Isaiah Crowell for 18 yards to the NE25. Tackled by Duron Harmon.","(8:25) Isaiah Crowell rush to the left for 4 yards to the NE43. Tackled by Malcom Brown and Chris Long.","(8:46) Cody Kessler incomplete pass to the middle intended for Isaiah Crowell.","(9:02) Penalty: Holding on New England (Malcom Brown) 5 yards.","(9:46) Cody Kessler pass to the left to Gary Barnidge for 7 yards to the Cle48. Tackled by Rob Ninkovich.","(10:28) Cody Kessler pass to the right to Andrew Hawkins for 16 yards to the Cle41. Tackled by Malcolm Butler.","(10:28) Stephen Gostkowski kicks off to the endzone. Touchback.","(10:28) Stephen Gostkowski extra point is good.","(10:32) LeGarrette Blount rush to the left for 1 yard for a TOUCHDOWN.","(10:49) LeGarrette Blount rush to the left for 1 yard to the Cle1. Tackled by Stephen Paea.","(11:17) Tom Brady pass to the middle to Rob Gronkowski for 34 yards to the Cle2. Tackled by Jamar Taylor.","(11:20) Tom Brady incomplete pass to the right intended for James White.","(11:55) Tom Brady pass to the left to Martellus Bennett for 2 yards to the Cle36. Tackled by Ibraheim Campbell.","(12:33) LeGarrette Blount rush to the right for 13 yards to the Cle38. Tackled by Jordan Poyer.","(13:11) Tom Brady pass to the middle to Rob Gronkowski for 19 yards to the NE49. Tackled by Christian Kirksey.","(13:41) Tom Brady pass to the right to Julian Edelman for 10 yards to the NE30. Tackled by Joe Haden.","(13:52) Britton Colquitt punts for 48 yards to NE20. No return.","(13:57) Cody Kessler incomplete pass to the right intended for Andrew Hawkins.","(14:32) Isaiah Crowell rush to the right for 2 yards to the Cle32. Tackled by Alan Branch and Patrick Chung.","(14:57) Isaiah Crowell rush to the right for 3 yards to the Cle30. Tackled by Malcom Brown.","(15:00) Stephen Gostkowski kicks off to the Cle10. Tracy Howard return for 17 yards to Cle27. Tackled by Nate Ebner."]