["(0:38) Drew Stanton rush up the middle for a loss of 1 yard to the Ari15.","(1:17) Drew Stanton rush up the middle for a loss of 1 yard to the Ari16.","(1:17) Bradley Pinion kicks off to the Ari17. No return.","(1:22) Blaine Gabbert sacked at SF0 for a loss of 1 yard by Calais Campbell. Safety.","(1:26) Blaine Gabbert incomplete pass to the left intended for Garrett Celek.","(1:36) Ryan Quigley punts for 44 yards to SF1. No return.","(1:42) Drew Stanton incomplete pass to the right intended for Michael Floyd defensed by Tramaine Brock.","(1:42) San Francisco 49ers timeout.","(1:46) Stepfan Taylor rush to the left for a loss of 6 yards to the SF45. Tackled by Eli Harold and Nick Bellore.","(1:46) San Francisco 49ers timeout.","(1:51) Stepfan Taylor rush to the right for 4 yards to the SF39. Tackled by Aaron Lynch.","(1:52) Phil Dawson onside kickoff to the SF43. Onside kick recovered by receiving team by Brittan Golden.","(1:52) Phil Dawson extra point is good.","(1:56) Blaine Gabbert rush to the right for 1 yard for a TOUCHDOWN.","(2:00) Penalty: Pass Interference on Arizona (Tyrann Mathieu) 7 yards.","(2:00) Two Minute Warning.","(2:17) Blaine Gabbert pass to the left to Blake Bell for 4 yards to the Ari8. Tackled by Deone Bucannon.","(2:21) Blaine Gabbert incomplete pass to the right intended for Blake Bell defensed by D.J. Swearinger.","(2:24) Blaine Gabbert incomplete pass to the left intended for Jeremy Kerley.","(2:30) Blaine Gabbert pass to the right to Jeremy Kerley for 7 yards to the Ari12. Tackled by Tyrann Mathieu.","(2:57) Blaine Gabbert pass to the left to Garrett Celek for 4 yards to the Ari19. Tackled by Tony Jefferson.","(3:01) Blaine Gabbert pass to the left to Jeremy Kerley for 11 yards to the Ari23.","(3:08) Penalty: Face Mask on Arizona (Chandler Jones) 15 yards.","(3:15) Penalty: Holding on Arizona (Tyrann Mathieu) 5 yards.","(3:21) Blaine Gabbert incomplete pass to the left intended for Garrett Celek.","(3:43) Blaine Gabbert pass to the right to Carlos Hyde for 8 yards to the SF46. Tackled by Deone Bucannon.","(4:07) Blaine Gabbert pass to the right to Quinton Patton for 7 yards to the SF38. Tackled by Gabe Martin.","(4:14) Blaine Gabbert sacked at SF31 for no gain by Kevin Minter.","(4:21) Blaine Gabbert sacked at SF31 for no gain by D.J. Swearinger.","(4:44) Blaine Gabbert pass to the left to Carlos Hyde for 6 yards to the SF31. Tackled by Deone Bucannon.","(4:44) Chandler Catanzaro kicks off to the endzone. Touchback.","(4:44) Chandler Catanzaro extra point is good.","(4:46) David Johnson rush to the right for 2 yards for a TOUCHDOWN.","(5:14) David Johnson rush to the left for 3 yards to the SF2. Tackled by Jaquiski Tartt and Quinton Dial.","(5:56) David Johnson rush to the left for 6 yards to the SF5. Tackled by Eric Reid.","(6:38) David Johnson rush to the right for 9 yards to the SF11. Tackled by Tony Jerod-Eddie.","(7:19) Andre Ellington rush to the left for 3 yards to the SF20. Tackled by Mike Purcell.","(8:00) Andre Ellington rush to the right for 4 yards to the SF23. Tackled by Arik Armstead.","(8:46) Andre Ellington rush to the left for 5 yards to the SF27. Tackled by Michael Wilhoite.","(9:24) Andre Ellington rush to the right for 2 yards to the SF32. Tackled by Taylor Hart.","(9:50) Drew Stanton pass to the left to David Johnson for 21 yards to the SF34. Tackled by Eric Reid.","(10:32) David Johnson rush up the middle for a loss of 2 yards to the Ari45. Tackled by Aaron Lynch.","(11:11) David Johnson rush to the left for 5 yards to the Ari47. Tackled by Quinton Dial.","(11:56) David Johnson rush to the right for 18 yards to the Ari42. Tackled by Tramaine Brock.","(12:04) Bradley Pinion punts for 48 yards to Ari24. No return.","(12:41) Blaine Gabbert sacked at SF28 for a loss of 3 yards by Markus Golden.","(13:10) Carlos Hyde rush to the left for no gain to the SF31. Tackled by Rodney Gunter.","(13:37) Carlos Hyde rush up the middle for 6 yards to the SF31. Tackled by Deone Bucannon.","(13:39) Chandler Catanzaro kicks off to the endzone. Touchback.","(13:44) Chandler Catanzaro 36 yard field goal attempt is GOOD. Holder: Ryan Quigley.","(13:48) Drew Stanton incomplete pass to the left intended for David Johnson.","(14:31) David Johnson rush up the middle for 2 yards to the SF18. Tackled by Nick Bellore.","(14:55) Drew Stanton pass to the right to Jermaine Gresham for 4 yards to the SF20. Tackled by Michael Wilhoite.","(15:00) Blaine Gabbert pass intended for Jeremy Kerley INTERCEPTED by Marcus Cooper and returned for 12 yards. Tackled by Garrett Celek.","(0:08) Carlos Hyde rush to the right for 2 yards to the SF25. Tackled by Markus Golden.","(0:30) Carlos Hyde rush to the left for 9 yards to the SF23. Tackled by Marcus Cooper.","(0:41) Ryan Quigley punts for 55 yards to SF14. Jeremy Kerley - no return. Tackled by Ifeanyi Momah.","(0:45) Drew Stanton incomplete pass to the left intended for Jaron Brown.","(0:50) Penalty: Offside on San Francisco (Ronald Blair) 5 yards.","(1:24) David Johnson rush to the left for 11 yards to the Ari26. Tackled by Antoine Bethea.","(1:50) Penalty: Pass Interference on Arizona (Hakeem Valles) -10 yards.","(1:54) Drew Stanton incomplete pass to the right intended for Hakeem Valles.","(1:54) Phil Dawson kicks off to the endzone. Touchback.","(1:54) Phil Dawson extra point is good.","(1:54) Penalty: Holding on San Francisco (Garrett Celek) -10 yards.","(1:59) Carlos Hyde rush up the middle for 1 yard for a TOUCHDOWN.","(2:23) Blaine Gabbert pass to the right to Quinton Patton for 9 yards to the Ari1. Tackled by Kevin Minter.","(2:57) Carlos Hyde rush to the right for 4 yards to the Ari10. Tackled by Tony Jefferson and Patrick Peterson.","(3:40) Blaine Gabbert rush to the right for 24 yards to the Ari14. Tackled by Deone Bucannon.","(4:15) Mike Davis rush to the left for 2 yards to the Ari38. Tackled by Markus Golden and Xavier Williams.","(4:39) Penalty: Offside on Arizona (Markus Golden) 5 yards.","(5:13) Mike Davis rush to the left for 2 yards to the Ari45. Tackled by Deone Bucannon and D.J. Swearinger.","(5:47) Carlos Hyde rush up the middle for 2 yards to the Ari47. Tackled by Chandler Jones.","(6:15) Carlos Hyde rush up the middle for 7 yards to the Ari49. Tackled by Chandler Jones.","(6:38) Blaine Gabbert rush to the left for 11 yards to the SF44.","(7:05) Blaine Gabbert pass to the left to Jeremy Kerley for 9 yards to the SF33. Tackled by Deone Bucannon.","(7:29) Carlos Hyde rush to the right for 6 yards to the SF24. Tackled by Deone Bucannon.","(7:35) Chandler Catanzaro kicks off to the SF-2. Chris Davis return for 20 yards to SF18. Tackled by Kareem Martin.","(7:35) Chandler Catanzaro extra point is good.","(7:43) Drew Stanton pass to the right to Larry Fitzgerald for 29 yards for a TOUCHDOWN.","(8:19) Andre Ellington rush to the left for 5 yards to the SF29. Tackled by Mike Purcell.","(9:03) Andre Ellington rush up the middle for no gain to the SF34. Tackled by Antoine Bethea.","(9:41) Drew Stanton pass to the right to Larry Fitzgerald for 9 yards to the SF34. Tackled by Rashard Robinson.","(10:18) David Johnson rush to the right for 23 yards to the SF43. Tackled by Jaquiski Tartt.","(10:54) David Johnson rush to the left for 5 yards to the Ari34. Tackled by Eric Reid.","(11:06) Bradley Pinion punts for 52 yards to Ari19. John Brown return for 10 yards to Ari29. Tackled by Shayne Skov and Michael Wilhoite.","(11:37) Blaine Gabbert pass to the right to Carlos Hyde for 1 yard to the SF29. Tackled by Alex Okafor.","(12:09) Carlos Hyde rush to the right for a loss of 1 yard to the SF28. Tackled by Kevin Minter and Deone Bucannon.","(12:45) Blaine Gabbert rush to the left for 4 yards to the SF29.","(12:45) Chandler Catanzaro kicks off to the endzone. Touchback.","(12:45) Chandler Catanzaro extra point is good.","(12:50) David Johnson rush to the right for 4 yards for a TOUCHDOWN.","(12:53) Penalty: Running into Kicker on San Francisco (Rashard Robinson) 4 yards.","(13:36) David Johnson rush to the left for 7 yards to the SF8. Tackled by Antoine Bethea and Jaquiski Tartt.","(14:19) David Johnson rush up the middle for 1 yard to the SF15. Tackled by Eric Reid. FUMBLE, recovered by Ari (David Johnson).","(14:55) David Johnson rush to the right for a loss of 2 yards to the SF16. Tackled by Nick Bellore.","(14:55) Chandler Catanzaro kicks off to the SF3. Chris Davis return for 11 yards to SF14. Tackled by Ifeanyi Momah. FUMBLE, recovered by Ari (Ifeanyi Momah). Tackled by Chris Davis.","(0:11) Carlos Hyde rush up the middle for 3 yards to the SF26. Tackled by Markus Golden.","(0:32) Carlos Hyde rush up the middle for 8 yards to the SF23. Tackled by Deone Bucannon.","(0:39) Blaine Gabbert incomplete pass to the right intended for Jeremy Kerley.","(0:46) Ryan Quigley punts for 42 yards to SF15. No return.","(0:54) Drew Stanton incomplete pass to the right intended for Jaron Brown defensed by Michael Wilhoite.","(0:58) Drew Stanton incomplete pass to the right intended for John Brown.","(1:07) Drew Stanton incomplete pass to the right.","(1:17) Bradley Pinion punts for 46 yards to Ari35. John Brown return for 8 yards to Ari43. Tackled by Nick Bellore.","(1:17) Arizona Cardinals timeout.","(1:24) Blaine Gabbert sacked at SF19 for a loss of 9 yards by Markus Golden and Alex Okafor.","(1:24) Arizona Cardinals timeout.","(1:34) Blaine Gabbert rush to the left for 2 yards to the SF28. Tackled by Calais Campbell.","(1:40) Blaine Gabbert rush to the left for 1 yard to the SF26. Tackled by Kevin Minter.","(1:40) Chandler Catanzaro kicks off to the endzone. Touchback.","(1:40) Chandler Catanzaro extra point is good.","(1:46) Drew Stanton pass to the right to Larry Fitzgerald for 21 yards for a TOUCHDOWN.","(1:55) Blaine Gabbert pass intended for Jeremy Kerley INTERCEPTED by Calais Campbell defensed by Chandler Jones and returned for 1 yard. Tackled by Andrew Tiller.","(1:55) Two Minute Warning.","(2:01) Shaun Draughn rush to the left for no gain to the SF24. Tackled by Kevin Minter.","(2:07) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(2:40) Blaine Gabbert pass to the left to Carlos Hyde for 7 yards to the SF39. Tackled by Marcus Cooper. Penalty: Taunting on San Francisco (Carlos Hyde) -15 yards.","(3:07) Carlos Hyde rush to the left for 6 yards to the SF32. Tackled by Deone Bucannon and Calais Campbell.","(3:15) Ryan Quigley punts for 46 yards to SF26. No return.","(3:22) Drew Stanton incomplete pass to the left intended for Michael Floyd.","(3:22) San Francisco 49ers timeout.","(3:29) Drew Stanton incomplete pass to the left intended for John Brown.","(4:08) Drew Stanton pass to the right to David Johnson for 4 yards to the Ari28. Tackled by Nick Bellore.","(4:12) Phil Dawson kicks off to the Ari10. J.J. Nelson return for 14 yards to Ari24. Tackled by Je'Ron Hamm.","(4:12) Phil Dawson extra point is good.","(4:17) Blaine Gabbert pass to the left to Jeremy Kerley for 9 yards for a TOUCHDOWN.","(4:54) Carlos Hyde rush up the middle for 3 yards to the Ari9. Tackled by Tony Jefferson.","(5:30) Carlos Hyde rush to the left for 2 yards to the Ari12. Tackled by Kevin Minter and Markus Golden.","(6:10) Blaine Gabbert pass to the right to Jeremy Kerley for 24 yards to the Ari14. Tackled by Tyrann Mathieu.","(6:34) Blaine Gabbert rush to the left for 9 yards to the Ari38. Tackled by Tyrann Mathieu.","(7:06) Carlos Hyde rush up the middle for 5 yards to the Ari47. Tackled by Deone Bucannon and Chandler Jones.","(7:45) Blaine Gabbert rush to the right for 4 yards to the SF48. Tackled by Markus Golden.","(7:59) Blaine Gabbert pass to the right to Jeremy Kerley for 17 yards to the SF44. Tackled by D.J. Swearinger.","(8:26) Carlos Hyde rush up the middle for 1 yard to the SF27. Tackled by Chandler Jones.","(8:58) Blaine Gabbert pass to the middle to Jeremy Kerley for 13 yards to the SF26. Tackled by D.J. Swearinger.","(9:12) Ryan Quigley punts for 47 yards to SF9. Jeremy Kerley return for 3 yards to SF12. Tackled by Kareem Martin. FUMBLE, recovered by SF (Marcus Cromartie).","(9:15) Drew Stanton incomplete pass to the left intended for Larry Fitzgerald.","(9:55) David Johnson rush to the right for 2 yards to the Ari44. Tackled by Mike Purcell.","(10:35) David Johnson rush to the left for 4 yards to the Ari42. Tackled by Gerald Hodges Jr. and Nick Bellore.","(11:15) Drew Stanton pass to the left to Larry Fitzgerald for 10 yards to the Ari38. Tackled by Eric Reid.","(11:48) David Johnson rush to the right for 1 yard to the Ari28. Tackled by Mike Purcell.","(12:01) Bradley Pinion punts for 51 yards to Ari20. John Brown return for 7 yards to Ari27. Tackled by Nick Bellore. FUMBLE, recovered by Ari (Brittan Golden).","(12:33) Blaine Gabbert sacked at SF29 for a loss of 4 yards by Calais Campbell.","(12:38) Blaine Gabbert incomplete pass to the middle intended for Jeremy Kerley.","(13:08) Carlos Hyde rush to the left for a loss of 1 yard to the SF33. Tackled by Deone Bucannon and Kevin Minter.","(13:41) Blaine Gabbert pass to the right to Jeremy Kerley for 12 yards to the SF34. Tackled by Marcus Cooper.","(13:52) Ryan Quigley punts for 45 yards to SF25. Jeremy Kerley return for a loss of 3 yards to SF22. Tackled by Tony Jefferson.","(14:28) Drew Stanton pass to the middle to David Johnson for 3 yards to the Ari30. Tackled by Nick Bellore.","(14:32) Drew Stanton incomplete pass to the right intended for John Brown defensed by Rashard Robinson.","(15:00) Drew Stanton sacked at Ari27 for a loss of 8 yards by Michael Wilhoite and Nick Bellore.","(0:31) Drew Stanton pass to the right to John Brown for 11 yards to the Ari35. Tackled by Rashard Robinson.","(0:40) Drew Stanton incomplete pass to the right intended for J.J. Nelson defensed by Tramaine Brock.","(0:49) Bradley Pinion punts for 57 yards to Ari24. John Brown - no return. Tackled by Marcus Cromartie.","(1:21) Blaine Gabbert sacked at SF19 for a loss of 10 yards by Markus Golden and Kevin Minter.","(1:51) Shaun Draughn rush up the middle for a loss of 1 yard to the SF29. Tackled by Markus Golden.","(1:57) Blaine Gabbert incomplete pass to the left intended for Rod Streater.","(2:29) Carlos Hyde rush up the middle for 10 yards to the SF30. Tackled by D.J. Swearinger and Tony Jefferson.","(2:59) Blaine Gabbert pass to the middle to Carlos Hyde for 4 yards to the SF20. Tackled by Deone Bucannon.","(3:07) Ryan Quigley punts for 45 yards to SF16. No return.","(3:11) Drew Stanton incomplete pass to the left intended for Larry Fitzgerald defensed by Jaquiski Tartt.","(3:54) David Johnson rush to the left for 4 yards to the Ari39. Tackled by Antoine Bethea.","(4:35) David Johnson rush up the middle for 1 yard to the Ari35. Tackled by Quinton Dial.","(5:13) David Johnson rush to the left for 12 yards to the Ari34. Tackled by Antoine Bethea and Tramaine Brock.","(5:53) Drew Stanton pass to the right to Larry Fitzgerald for 7 yards to the Ari22. Tackled by Eric Reid.","(6:34) Drew Stanton pass to the left to Larry Fitzgerald for 5 yards to the Ari15. Tackled by Jaquiski Tartt.","(7:13) David Johnson rush up the middle for 6 yards to the Ari10. Tackled by Quinton Dial.","(7:13) Penalty: False Start on Arizona (Jermaine Gresham) -3 yards.","(7:26) Bradley Pinion punts for 52 yards to Ari7. No return.","(7:32) Blaine Gabbert incomplete pass to the right intended for Garrett Celek.","(8:09) Carlos Hyde rush to the right for 2 yards to the SF41. Tackled by Kevin Minter.","(8:42) Carlos Hyde rush up the middle for 4 yards to the SF39. Tackled by Markus Golden and Tony Jefferson.","(9:19) Blaine Gabbert pass to the left to Carlos Hyde for 10 yards to the SF35. Tackled by Tony Jefferson.","(9:49) Blaine Gabbert rush to the right for 9 yards to the SF25. Tackled by D.J. Swearinger.","(10:13) Blaine Gabbert rush to the right for 5 yards to the SF16. Tackled by D.J. Swearinger.","(10:20) Ryan Quigley punts for 39 yards to SF11. No return.","(10:24) Drew Stanton incomplete pass to the left intended for David Johnson.","(10:24) Penalty: False Start on Arizona (D.J. Humphries) -5 yards.","(10:28) Drew Stanton incomplete pass to the left intended for David Johnson defensed by Antoine Bethea.","(11:11) David Johnson rush to the left for 4 yards to the SF45. Tackled by Nick Bellore and Taylor Hart.","(11:49) David Johnson rush to the right for 6 yards to the SF49. Tackled by Quinton Dial.","(12:28) David Johnson rush to the left for 7 yards to the Ari45. Tackled by Antoine Bethea and Rashard Robinson.","(12:34) Bradley Pinion punts for 43 yards to Ari38. No return.","(12:40) Blaine Gabbert incomplete pass to the right intended for Jeremy Kerley defensed by Tyrann Mathieu.","(13:13) Carlos Hyde rush up the middle for a loss of 1 yard to the SF19. Tackled by Chandler Jones.","(13:17) Blaine Gabbert incomplete pass to the left intended for Garrett Celek.","(13:23) Ryan Quigley punts for 19 yards to SF20. No return.","(13:30) Drew Stanton incomplete pass to the left intended for Jaron Brown defensed by Tramaine Brock.","(14:10) David Johnson rush to the right for 1 yard to the SF39. Tackled by Arik Armstead and Nick Bellore.","(14:14) Drew Stanton incomplete pass to the left intended for Michael Floyd.","(14:54) David Johnson rush to the right for 17 yards to the SF40. Tackled by Tramaine Brock and Arik Armstead.","(15:00) Phil Dawson kicks off to the Ari4. J.J. Nelson return for 39 yards to Ari43. Tackled by Aaron Burbridge."]