["(0:33) Matthew Stafford rush up the middle for a loss of 1 yard to the Det37.","(0:58) Matthew Stafford rush up the middle for a loss of 1 yard to the Det38.","(1:17) Penalty: Too Many Men on Field on Philadelphia 5 yards.","(1:28) Carson Wentz pass intended for Nelson Agholor INTERCEPTED by Darius Slay and returned for 11 yards.","(1:28) Sam Martin kicks off to the endzone. Touchback.","(1:32) Matt Prater 29 yard field goal attempt is GOOD. Holder: Sam Martin.","(1:32) Philadelphia Eagles timeout.","(1:40) Matthew Stafford sacked at Phi11 for a loss of 6 yards by Fletcher Cox.","(1:40) Philadelphia Eagles timeout.","(1:46) Zach Zenner rush up the middle for 3 yards to the Phi5. Tackled by Brandon Graham.","(1:46) Philadelphia Eagles timeout.","(1:50) Zach Zenner rush up the middle for a loss of 2 yards to the Phi8. Tackled by Mychal Kendricks.","(2:00) Matthew Stafford pass to the left to Golden Tate for 27 yards to the Phi12. Tackled by Rodney McLeod. Penalty: Unnecessary Roughness on Philadelphia (Malcolm Jenkins) 6 yards.","(2:00) Two Minute Warning.","(2:14) Matthew Stafford rush to the left for 2 yards to the Phi39. Tackled by Jordan Hicks.","(2:34) Matthew Stafford pass to the right to Golden Tate for 4 yards to the Phi41. Tackled by Jalen Mills.","(2:41) Ryan Mathews rush to the right for no gain to the Phi45. Tackled by Darius Slay. FUMBLE, recovered by Det (Tyrunn Walker). Tackled by Nelson Agholor.","(2:41) Detroit Lions timeout.","(2:46) Ryan Mathews rush up the middle for 1 yard to the Phi45. Tackled by A'Shawn Robinson.","(2:46) Detroit Lions timeout.","(2:51) Ryan Mathews rush to the left for 7 yards to the Phi44. Tackled by Tahir Whitehead.","(3:35) Carson Wentz pass to the right to Jordan Matthews for 10 yards to the Phi37. Tackled by Quandre Diggs.","(4:19) Ryan Mathews rush to the left for 2 yards to the Phi27. Tackled by Tahir Whitehead.","(4:59) Carson Wentz pass to the left to Josh Huff for 2 yards to the Phi25. Tackled by Tavon Wilson.","(5:11) Sam Martin punts for 55 yards to Phi17. Darren Sproles return for 6 yards to Phi23. Tackled by Don Carey.","(5:52) Matthew Stafford pass to the left to Theo Riddick for 9 yards to the Det28. Tackled by Nigel Bradham.","(6:35) Matthew Stafford pass to the left to Theo Riddick for a loss of 6 yards to the Det19. Tackled by Nigel Bradham.","(6:40) Matthew Stafford incomplete pass to the right intended for Marvin Jones Jr..","(6:40) Caleb Sturgis kicks off to the endzone. Touchback.","(6:45) Caleb Sturgis 49 yard field goal attempt is GOOD. Holder: Donnie Jones.","(6:50) Carson Wentz incomplete pass to the right intended for Nelson Agholor defensed by Darius Slay.","(7:33) Carson Wentz pass to the left to Trey Burton for 5 yards to the Det31. Tackled by Tahir Whitehead.","(8:05) Ryan Mathews rush to the right for 10 yards to the Det26. Tackled by Devin Taylor. Penalty: Holding on Philadelphia (Brandon Brooks) -10 yards.","(8:11) Carson Wentz incomplete pass to the middle intended for Nelson Agholor defensed by Tahir Whitehead.","(8:49) Darren Sproles rush up the middle for 10 yards to the Det36. Tackled by Tahir Whitehead.","(9:37) Carson Wentz sacked at Det46 for no gain by A'Shawn Robinson.","(10:22) Carson Wentz pass to the right to Jordan Matthews for 8 yards to the Det46. Tackled by Darius Slay.","(11:08) Carson Wentz pass to the right to Jordan Matthews for 20 yards to the Phi46. Tackled by Tahir Whitehead.","(11:51) Carson Wentz pass to the left to Dorial Green-Beckham for 11 yards to the Phi26. Tackled by Tahir Whitehead and Glover Quin.","(11:55) Carson Wentz incomplete pass to the middle intended for Trey Burton defensed by Tahir Whitehead.","(12:01) Penalty: Illegal Formation on Philadelphia (Lane Johnson) -5 yards.","(12:13) Sam Martin punts for 47 yards to Phi0. Touchback.","(12:50) Matthew Stafford sacked at Phi47 for a loss of 9 yards by Vinny Curry.","(13:32) Theo Riddick rush to the right for 1 yard to the Phi38. Tackled by Bennie Logan.","(14:17) Matthew Stafford pass to the right to Theo Riddick for 2 yards to the Phi39. Tackled by Jalen Mills and Jordan Hicks.","(15:00) Theo Riddick rush to the right for 2 yards to the Phi41. Tackled by Mychal Kendricks.","(0:41) Matthew Stafford pass to the right to Marvin Jones Jr. for 10 yards to the Phi43. Tackled by Jalen Mills.","(0:49) Matthew Stafford incomplete pass to the right.","(1:25) Theo Riddick rush up the middle for a loss of 1 yard to the Det47. Tackled by Nigel Bradham.","(1:34) Donnie Jones punts for 34 yards to Det48. No return.","(2:13) Darren Sproles rush up the middle for 3 yards to the Phi18. Tackled by Tahir Whitehead and Rafael Bush.","(2:36) Penalty: Delay of Game on Philadelphia (Carson Wentz) -5 yards.","(3:26) Carson Wentz pass to the left to Ryan Mathews for a loss of 6 yards to the Phi20. Tackled by Thurston Armbrister.","(4:07) Carson Wentz pass to the right to Darren Sproles for 7 yards to the Phi26. Tackled by Nevin Lawson.","(4:22) Sam Martin punts for 57 yards to Phi19. No return.","(5:09) Matthew Stafford pass to the right to Anquan Boldin for 8 yards to the Det24. Tackled by Vinny Curry and Jalen Mills.","(5:55) Matthew Stafford pass to the left to Zach Zenner for 4 yards to the Det16. Tackled by Jordan Hicks and Connor Barwin.","(6:40) Golden Tate rush to the right for a loss of 4 yards to the Det12. Tackled by Nigel Bradham.","(6:47) Caleb Sturgis kicks off to the Det4. Andre Roberts return for 12 yards to Det16. Tackled by Jaylen Watkins.","(6:48) Caleb Sturgis 33 yard field goal attempt is GOOD. Holder: Donnie Jones.","(6:58) Carson Wentz incomplete pass to the left intended for Dorial Green-Beckham defensed by Nevin Lawson.","(7:42) Ryan Mathews rush up the middle for 2 yards to the Det14. Tackled by Kyle Van Noy.","(7:47) Carson Wentz incomplete pass to the right intended for Nelson Agholor.","(7:57) Matthew Stafford sacked at Det12 for no gain. FUMBLE, recovered by Phi (Nigel Bradham). Tackled by Travis Swanson.","(8:32) Matthew Stafford sacked at Det25 for a loss of 1 yard by Bennie Logan. Penalty: Unsports. Conduct on Detroit (Anquan Boldin) -13 yards.","(8:37) Penalty: Pass Interference on Philadelphia (Nolan Carroll) 4 yards.","(9:12) Theo Riddick rush to the left for 4 yards to the Det22. Tackled by Jordan Hicks.","(9:18) Caleb Sturgis kicks off to the Det-3. Andre Roberts return for 21 yards to Det18. Tackled by Trey Burton.","(9:18) Caleb Sturgis extra point is good.","(9:21) Carson Wentz pass to the right to Josh Huff for 1 yard for a TOUCHDOWN.","(9:21) Detroit Lions timeout.","(9:57) Ryan Mathews rush up the middle for 2 yards to the Det1. Tackled by Tyrunn Walker.","(10:39) Carson Wentz pass to the left to Dorial Green-Beckham for 26 yards to the Det3. Tackled by Glover Quin.","(11:28) Carson Wentz pass to the right to Josh Huff for 2 yards to the Det29. Tackled by Tavon Wilson.","(12:12) Josh Huff rush to the right for no gain to the Det31. Tackled by Glover Quin.","(13:01) Carson Wentz pass to the right to Ryan Mathews for 17 yards to the Det31. Tackled by Tavon Wilson.","(13:40) Ryan Mathews rush up the middle for 3 yards to the Det48. Tackled by Brandon Copeland.","(14:23) Carson Wentz pass to the right to Nelson Agholor for 18 yards to the Phi49. Tackled by Nevin Lawson.","(15:00) Ryan Mathews rush to the left for 6 yards to the Phi31. Tackled by Tahir Whitehead.","(15:00) Sam Martin kicks off to the endzone. Touchback.","(0:03) Caleb Sturgis 50 yard field goal attempt is GOOD. Holder: Donnie Jones.","(0:03) Detroit Lions timeout.","(0:11) Carson Wentz pass to the left to Zach Ertz for 21 yards to the Det32. Tackled by Quandre Diggs.","(0:19) Penalty: Pass Interference on Philadelphia (Zach Ertz) -10 yards.","(0:48) Carson Wentz pass to the right to Darren Sproles for no gain to the Det43. Tackled by Kerry Hyder.","(0:48) Philadelphia Eagles timeout.","(0:53) Carson Wentz sacked at Det43 for a loss of 6 yards by Devin Taylor.","(1:00) Penalty: Holding on Philadelphia (Allen Barbre) -10 yards.","(1:00) Philadelphia Eagles timeout.","(1:11) Carson Wentz pass to the right to Darren Sproles for 11 yards to the Det27. Tackled by Rafael Bush.","(1:22) Carson Wentz pass to the right to Jordan Matthews for 27 yards to the Det38. Tackled by Quandre Diggs. FUMBLE, recovered by Phi.","(1:30) Carson Wentz incomplete pass to the right.","(1:37) Penalty: Illegal Block on Philadelphia (Darren Sproles) -15 yards.","(2:00) Carson Wentz rush to the left for 4 yards to the Phi50. Tackled by Devin Taylor.","(2:00) Two Minute Warning.","(2:11) Carson Wentz pass to the right to Nelson Agholor for 9 yards to the Phi46. Tackled by Darius Slay.","(2:41) Carson Wentz pass to the left to Darren Sproles for 5 yards to the Phi37. Tackled by Tavon Wilson.","(3:08) Darren Sproles rush to the left for 7 yards to the Phi32. Tackled by Tavon Wilson.","(3:08) Sam Martin kicks off to the endzone. Touchback.","(3:08) Matt Prater extra point is good.","(3:15) Matthew Stafford pass to the left to Marvin Jones Jr. for 1 yard for a TOUCHDOWN.","(4:00) Matthew Stafford pass to the middle to Golden Tate for 8 yards to the Phi1. Tackled by Rodney McLeod and Brandon Graham.","(4:25) Penalty: Unnecessary Roughness on Philadelphia (Fletcher Cox) 9 yards.","(4:25) Penalty: False Start on Detroit (Riley Reiff) -5 yards.","(4:32) Matthew Stafford incomplete pass to the right.","(5:16) Zach Zenner rush up the middle for 6 yards to the Phi13. Tackled by Brandon Graham.","(6:06) Matthew Stafford pass to the right to Zach Zenner for 19 yards to the Phi19. Tackled by Mychal Kendricks.","(6:51) Matthew Stafford pass to the left to Anquan Boldin for 13 yards to the Phi38. Tackled by Nolan Carroll and Malcolm Jenkins.","(7:32) Theo Riddick rush to the left for no gain to the Det49. Tackled by Nolan Carroll.","(8:11) Matthew Stafford rush up the middle for 2 yards to the Det49. Tackled by Vinny Curry.","(8:55) Matthew Stafford pass to the left to Theo Riddick for 10 yards to the Det47. Tackled by Connor Barwin.","(9:36) Theo Riddick rush up the middle for a loss of 1 yard to the Det37. Tackled by Bennie Logan.","(9:42) Matthew Stafford incomplete pass to the right intended for Golden Tate defensed by Leodis McKelvin.","(10:21) Theo Riddick rush to the left for 13 yards to the Det38. Tackled by Rodney McLeod.","(10:21) Caleb Sturgis kicks off to the endzone. Touchback.","(10:21) Caleb Sturgis extra point is good.","(10:26) Carson Wentz pass to the right to Ryan Mathews for 1 yard for a TOUCHDOWN.","(11:08) Darren Sproles rush up the middle for 10 yards to the Det1. Tackled by Glover Quin.","(11:38) Penalty: Delay of Game on Philadelphia (Carson Wentz) -5 yards.","(12:19) Carson Wentz pass to the right to Dorial Green-Beckham for 6 yards to the Det6. Tackled by Quandre Diggs.","(12:57) Carson Wentz rush to the left for 10 yards to the Det12.","(13:42) Darren Sproles rush to the left for 15 yards to the Det22. Tackled by Tahir Whitehead.","(14:20) Carson Wentz pass to the middle to Zach Ertz for 5 yards to the Det37. Tackled by Thurston Armbrister.","(15:00) Carson Wentz pass to the left to Zach Ertz for 11 yards to the Det42. Tackled by Tahir Whitehead.","(0:14) Carson Wentz pass to the left to Ryan Mathews for 18 yards to the Phi47. Tackled by Tahir Whitehead.","(0:53) Ryan Mathews rush to the left for 4 yards to the Phi29. Tackled by Kyle Van Noy.","(0:53) Sam Martin kicks off to the endzone. Touchback.","(0:53) Matt Prater extra point is good.","(1:00) Matthew Stafford pass to the right to Theo Riddick for 17 yards for a TOUCHDOWN.","(1:36) Theo Riddick rush up the middle for 4 yards to the Phi17. Tackled by Fletcher Cox.","(1:59) Matthew Stafford rush to the right for 14 yards to the Phi36. Tackled by Rodney McLeod. Penalty: Unnecessary Roughness on Philadelphia (Rodney McLeod) 15 yards.","(2:39) Zach Zenner rush up the middle for a loss of 2 yards to the Det50. Tackled by Brandon Graham.","(3:18) Matthew Stafford pass to the middle to Anquan Boldin for 7 yards to the Phi48. Tackled by Malcolm Jenkins.","(4:00) Zach Zenner rush up the middle for 3 yards to the Det45. Tackled by Jordan Hicks and Vinny Curry.","(4:06) Penalty: Offside on Philadelphia (Destiny Vaeao) 5 yards.","(4:42) Zach Zenner rush to the left for a loss of 2 yards to the Det37. Tackled by Marcus Smith.","(4:46) Penalty: Pass Interference on Philadelphia (Nolan Carroll) 7 yards.","(5:27) Matthew Stafford pass to the left to Marvin Jones Jr. for 9 yards to the Det32. Tackled by Nolan Carroll.","(6:02) Zach Zenner rush to the right for 3 yards to the Det23. Tackled by Brandon Graham.","(6:10) Donnie Jones punts for 42 yards to Det20. No return.","(6:49) Carson Wentz sacked at Phi38 for a loss of 2 yards by Armonty Bryant.","(6:57) Carson Wentz incomplete pass to the right intended for Nelson Agholor defensed by Nevin Lawson.","(7:33) Nelson Agholor rush to the left for 5 yards to the Phi40. Tackled by Thurston Armbrister.","(8:10) Josh Huff rush to the right for 10 yards to the Phi35. Tackled by Quandre Diggs.","(8:53) Carson Wentz pass to the left to Ryan Mathews for 3 yards to the Phi25. Tackled by Kyle Van Noy.","(9:31) Ryan Mathews rush to the left for 5 yards to the Phi22. Tackled by Tahir Whitehead.","(9:37) Sam Martin kicks off to the Phi-1. Josh Huff return for 17 yards to Phi17. Tackled by Rafael Bush.","(9:37) Matt Prater extra point is good.","(9:42) Matthew Stafford pass to the left to Theo Riddick for 1 yard for a TOUCHDOWN.","(10:22) Matthew Stafford rush up the middle for no gain to the Phi1. Tackled by Rodney McLeod and Nigel Bradham.","(11:03) Matthew Stafford pass to the middle to Anquan Boldin for 20 yards to the Phi1. Tackled by Ron Brooks.","(11:07) Matthew Stafford incomplete pass to the middle intended for Andre Roberts.","(11:54) Golden Tate rush to the left for a loss of 1 yard to the Phi21. Tackled by Brandon Graham.","(12:25) Theo Riddick rush to the right for 17 yards to the Phi20. Tackled by Rodney McLeod.","(12:29) Matthew Stafford incomplete pass to the left intended for Golden Tate.","(13:09) Golden Tate rush to the right for 11 yards to the Phi37. Tackled by Ron Brooks.","(13:49) Theo Riddick rush to the left for 4 yards to the Phi48. Tackled by Rodney McLeod.","(14:24) Matthew Stafford pass to the left to Marvin Jones Jr. for 17 yards to the Det48. Tackled by Rodney McLeod.","(15:00) Theo Riddick rush to the left for 6 yards to the Det31. Tackled by Rodney McLeod.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback."]