["(0:33) Dak Prescott rush up the middle for a loss of 1 yard to the Cin36.","(1:17) Dak Prescott rush up the middle for a loss of 1 yard to the Cin35.","(2:00) Dak Prescott rush up the middle for a loss of 2 yards to the Cin34.","(2:00) Two Minute Warning.","(2:25) Dak Prescott pass to the left to Terrance Williams for 11 yards to the Cin32. Tackled by Shawn Williams.","(2:25) Cincinnati Bengals timeout.","(2:33) Dak Prescott rush to the right for 2 yards to the Cin43. Tackled by Vontaze Burfict.","(2:33) Cincinnati Bengals timeout.","(2:39) Ezekiel Elliott rush to the left for 1 yard to the Cin45. Tackled by Shawn Williams and Karlos Dansby.","(2:39) Mike Nugent onside kickoff to the Cin46. Onside kick recovered by receiving team by Ezekiel Elliott.","(2:39) Mike Nugent extra point is good.","(2:44) Andy Dalton pass to the left to Brandon LaFell for 5 yards for a TOUCHDOWN.","(3:15) Andy Dalton pass to the right to Tyler Kroft for 7 yards to the Dal5. Tackled by Barry Church.","(3:41) Andy Dalton pass to the right to Tyler Kroft for 9 yards to the Dal12. Tackled by Sean Lee.","(3:47) Andy Dalton incomplete pass to the right intended for Brandon LaFell defensed by Morris Claiborne.","(3:54) Andy Dalton pass to the right to Brandon LaFell for 13 yards to the Dal21. Tackled by Morris Claiborne.","(4:21) Andy Dalton pass to the middle to C.J. Uzomah for 8 yards to the Dal34. Tackled by Sean Lee and Anthony Hitchens.","(4:46) Andy Dalton pass to the right to Giovani Bernard for 7 yards to the Dal42. Tackled by Sean Lee.","(5:20) Andy Dalton pass to the right to A.J. Green for 5 yards to the Dal49. Tackled by Morris Claiborne and Barry Church.","(5:49) Andy Dalton pass to the right to Giovani Bernard for 6 yards to the Cin46. Tackled by J.J. Wilcox.","(5:49) Cincinnati Bengals timeout.","(6:28) Andy Dalton sacked at Cin40 for a loss of 4 yards by Benson Mayowa.","(6:58) Andy Dalton pass to the right to Giovani Bernard for 5 yards to the Cin44. Tackled by Barry Church.","(7:17) Penalty: Holding on Dallas (Justin Durant) 5 yards.","(7:42) Andy Dalton pass to the middle to Giovani Bernard for 11 yards to the Cin34. Tackled by Justin Durant.","(7:51) Chris Jones punts for 51 yards to Cin23. Adam Jones - no return. Tackled by J.J. Wilcox.","(8:39) Dak Prescott pass to the right to Rod Smith for 4 yards to the Dal26. Tackled by Karlos Dansby and Vincent Rey.","(9:29) Dak Prescott pass to the right to Jason Witten for 5 yards to the Dal22. Tackled by Rey Maualuga.","(10:05) Alfred Morris rush to the left for a loss of 3 yards to the Dal17. Tackled by Carlos Dunlap and Pat Sims.","(10:10) Mike Nugent kicks off to the Dal5. Lucky Whitehead return for 15 yards to Dal20. Tackled by George Iloka.","(10:10) Mike Nugent extra point is good.","(10:14) Andy Dalton pass to the middle to Brandon LaFell for 7 yards for a TOUCHDOWN.","(10:47) Andy Dalton pass to the left to A.J. Green for 14 yards to the Dal7. Tackled by J.J. Wilcox.","(11:25) Andy Dalton pass to the middle to Brandon LaFell for 13 yards to the Dal21. Tackled by Barry Church.","(12:07) Andy Dalton pass to the right to Brandon LaFell for 8 yards to the Dal34. Tackled by Morris Claiborne.","(12:44) Andy Dalton sacked at Dal42 for a loss of 3 yards by Terrell McClain and Jack Crawford.","(13:21) Andy Dalton pass to the right to C.J. Uzomah for 6 yards to the Dal39. Tackled by Anthony Brown.","(13:56) Giovani Bernard rush to the left for 4 yards to the Dal45. Tackled by Anthony Brown and Anthony Hitchens.","(14:30) Giovani Bernard rush to the left for 1 yard to the Dal49. Tackled by Benson Mayowa and Anthony Hitchens.","(15:00) Andy Dalton pass to the middle to Tyler Boyd for 6 yards to the Cin50. Tackled by Anthony Brown and Benson Mayowa.","(0:23) Giovani Bernard rush up the middle for 3 yards to the Cin44. Tackled by Byron Jones.","(0:39) Dak Prescott sacked at Cin23 for a loss of 5 yards by Carlos Dunlap. FUMBLE, recovered by Cin (Vincent Rey) and returned for 10 yards. Tackled by Travis Frederick.","(0:45) Dak Prescott incomplete pass to the right intended for Jason Witten defensed by Dre Kirkpatrick.","(1:21) Alfred Morris rush to the right for 2 yards to the Cin18. Tackled by Vontaze Burfict.","(2:08) Dak Prescott pass to the right to Ezekiel Elliott for 22 yards to the Cin20. Tackled by Carlos Dunlap.","(2:51) Ezekiel Elliott rush to the left for 5 yards to the Cin42. Tackled by Michael Johnson.","(3:52) Penalty: False Start on Dallas (Ronald Leary) -5 yards.","(3:52) Dak Prescott pass to the right to Cole Beasley for 11 yards to the Cin42. Tackled by Michael Johnson.","(4:28) Dak Prescott pass to the left to Jason Witten for 7 yards to the Dal47. Tackled by Vincent Rey.","(4:28) Dallas Cowboys timeout.","(5:18) Ezekiel Elliott rush to the right for a loss of 6 yards to the Dal40. Tackled by Pat Sims.","(5:58) Dak Prescott pass to the left to Terrance Williams for 10 yards to the Dal46. Tackled by Vontaze Burfict.","(6:40) Ezekiel Elliott rush to the right for 2 yards to the Dal36. Tackled by Michael Johnson.","(7:26) Dak Prescott pass to the middle to Cole Beasley for 10 yards to the Dal34. Tackled by Shawn Williams.","(8:08) Ezekiel Elliott rush to the left for 4 yards to the Dal24. Tackled by Pat Sims and Vontaze Burfict.","(8:20) Kevin Huber punts for 44 yards to Dal10. Lucky Whitehead return for 10 yards to Dal20. Tackled by Marquis Flowers.","(8:59) Andy Dalton pass to the left to Tyler Kroft for 13 yards to the Cin46. Tackled by Justin Durant and Sean Lee.","(9:04) Andy Dalton incomplete pass to the left. Penalty: Intentional Grounding on Cincinnati (Andy Dalton) -10 yards.","(9:41) Andy Dalton sacked at Cin43 for a loss of 7 yards by Terrell McClain.","(10:20) Andy Dalton rush to the left for 13 yards to the Cin50. Tackled by Justin Durant.","(10:37) Jeremy Hill rush to the left for a loss of 1 yard to the Cin37. Tackled by Ryan Davis.","(10:46) Andy Dalton incomplete pass to the left intended for A.J. Green defensed by Byron Jones.","(10:50) Penalty: Pass Interference on Dallas (Brandon Carr) 7 yards.","(11:26) Andy Dalton pass to the left to Brandon LaFell for 11 yards to the Cin31. Tackled by Barry Church.","(11:32) Andy Dalton incomplete pass to the left.","(11:38) Dan Bailey kicks off to the Cin-4. Alex Erickson return for 24 yards to Cin20. Tackled by Anthony Brown.","(11:38) Dan Bailey extra point is good.","(11:47) Ezekiel Elliott rush to the right for 60 yards for a TOUCHDOWN.","(11:52) 50 yard field goal attempt by Mike Nugent is NO GOOD. Holder: Kevin Huber.","(12:00) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Morris Claiborne.","(12:05) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(12:44) Andy Dalton rush up the middle for 1 yard to the Dal32. Tackled by Terrell McClain.","(12:51) Penalty: Pass Interference on Dallas (Morris Claiborne) 13 yards.","(12:57) Andy Dalton incomplete pass to the left intended for A.J. Green defensed by Brandon Carr.","(13:03) Andy Dalton incomplete pass to the left intended for A.J. Green.","(13:39) Andy Dalton pass to the right to A.J. Green for 22 yards to the Dal46. Tackled by Anthony Hitchens.","(14:06) Penalty: Holding on Dallas (Morris Claiborne) 5 yards.","(14:27) Penalty: Holding on Cincinnati (Andrew Whitworth) -10 yards.","(15:00) Giovani Bernard rush to the right for 12 yards to the Cin37. Tackled by Byron Jones.","(15:00) Dan Bailey kicks off to the endzone. Touchback.","(0:03) Dak Prescott rush up the middle for a loss of 1 yard to the Dal12.","(0:11) Kevin Huber punts for 38 yards to Dal13. No return.","(0:25) Andy Dalton incomplete pass to the left intended for Brandon LaFell.","(0:32) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(0:38) Andy Dalton incomplete pass to the right intended for Tyler Boyd.","(0:38) Cincinnati Bengals timeout.","(0:44) Andy Dalton pass to the left to Tyler Boyd for 7 yards to the Cin49. Tackled by Sean Lee and Anthony Brown.","(1:02) Andy Dalton pass to the right to C.J. Uzomah for 7 yards to the Cin42. Tackled by Barry Church.","(1:24) Andy Dalton pass to the right to Tyler Boyd for 20 yards to the Cin35. Tackled by Sean Lee.","(1:32) Chris Jones punts for 36 yards to Cin15. No return.","(1:37) Dak Prescott incomplete pass to the right intended for Jason Witten.","(1:43) Dak Prescott pass to the right to Ezekiel Elliott for 5 yards to the Dal49. Tackled by Karlos Dansby.","(1:50) Dak Prescott incomplete pass to the left intended for Ezekiel Elliott.","(1:56) Dak Prescott pass to the right to Cole Beasley for 18 yards to the Dal44. Tackled by Darqueze Dennard.","(1:56) Two Minute Warning.","(2:01) Ezekiel Elliott rush to the left for 4 yards to the Dal26. Tackled by Adam Jones.","(2:09) Kevin Huber punts for 44 yards to Dal22. Lucky Whitehead - no return. FUMBLE, recovered by Dal (Lucky Whitehead).","(2:51) Andy Dalton pass to the left to C.J. Uzomah for 14 yards to the Cin34. Tackled by Barry Church.","(3:34) Andy Dalton sacked at Cin20 for a loss of 6 yards by Cedric Thornton.","(4:09) Jeremy Hill rush to the right for 1 yard to the Cin26. Tackled by Cedric Thornton and Maliek Collins.","(4:09) Dan Bailey kicks off to the endzone. Touchback.","(4:09) Dan Bailey extra point is good.","(4:17) Dak Prescott pass to the right to Cole Beasley for 14 yards for a TOUCHDOWN.","(5:04) Dak Prescott pass to the middle to Jason Witten for 31 yards to the Cin14. Tackled by Adam Jones.","(5:36) Dak Prescott pass to the left to Brice Butler for 7 yards to the Cin45.","(5:42) Dak Prescott incomplete pass to the right intended for Alfred Morris.","(6:21) Alfred Morris rush to the left for 3 yards to the Dal48. Tackled by Michael Johnson.","(6:58) Alfred Morris rush to the left for 8 yards to the Dal45. Tackled by Vontaze Burfict.","(7:41) Alfred Morris rush to the right for 17 yards to the Dal37. Tackled by Michael Johnson and Josh Shaw.","(7:47) Dak Prescott incomplete pass to the right intended for Geoff Swaim.","(7:56) Kevin Huber punts for 41 yards to Dal0. Touchback.","(8:31) Andy Dalton rush up the middle for 4 yards to the Dal41. Tackled by Sean Lee.","(9:14) Andy Dalton pass to the right to Giovani Bernard for 6 yards to the Dal45. Tackled by Justin Durant and Anthony Brown.","(9:56) Andy Dalton pass to the left to A.J. Green for 9 yards to the Cin49. Tackled by Brandon Carr.","(10:16) Penalty: Holding on Cincinnati (Kevin Zeitler) -10 yards.","(10:37) Penalty: False Start on Cincinnati (Kevin Zeitler) -5 yards.","(11:10) Jeremy Hill rush up the middle for 4 yards to the Dal45. Tackled by Sean Lee and Justin Durant.","(11:36) Jeremy Hill rush to the left for 8 yards to the Dal49. Tackled by Justin Durant.","(12:06) Andy Dalton pass to the left to Brandon LaFell for 14 yards to the Cin43. Tackled by Byron Jones.","(12:41) Giovani Bernard rush to the left for 1 yard to the Cin29. Tackled by Sean Lee and Tyrone Crawford.","(13:20) Andy Dalton rush to the right for 3 yards to the Cin28. Tackled by Terrell McClain.","(14:01) Giovani Bernard rush to the right for 5 yards to the Cin25. Tackled by Barry Church.","(14:37) Giovani Bernard rush up the middle for 3 yards to the Cin20. Tackled by Andrew Gachkar and Terrell McClain.","(14:43) Dan Bailey kicks off to the Cin-5. Alex Erickson return for 22 yards to Cin17. Tackled by J.J. Wilcox.","(14:43) Dan Bailey extra point is good.","(14:47) Dak Prescott rush to the right for 5 yards for a TOUCHDOWN.","(14:49) Penalty: Illegal Contact on Cincinnati (Vincent Rey) 5 yards.","(15:00) Dak Prescott incomplete pass to the left intended for Brice Butler defensed by Adam Jones.","(0:32)  FUMBLE, recovered by Dal (Dak Prescott). Ezekiel Elliott rush up the middle for a loss of 1 yard to the Cin10. Tackled by Michael Johnson.","(0:38) Penalty: Illegal Shift on Dallas (Jason Witten) -5 yards.","(1:24) Dak Prescott pass to the right to Terrance Williams for 21 yards to the Cin4. Tackled by Dre Kirkpatrick.","(2:06) Alfred Morris rush to the right for 6 yards to the Cin25. Tackled by Dre Kirkpatrick.","(2:43) Ezekiel Elliott rush to the left for 15 yards to the Cin31.","(3:17) Dak Prescott pass to the right to Brice Butler for 13 yards to the Cin46. Tackled by Vontaze Burfict.","(3:57) Ezekiel Elliott rush to the right for 7 yards to the Dal41. Tackled by Vontaze Burfict.","(4:40) Dak Prescott pass to the left to Terrance Williams for 17 yards to the Dal34. Tackled by Josh Shaw.","(5:24) Ezekiel Elliott rush to the left for 1 yard to the Dal17. Tackled by Pat Sims and Domata Peko.","(5:56) Dak Prescott pass to the left to Ezekiel Elliott for 10 yards to the Dal16. Tackled by Adam Jones.","(6:16) Penalty: Holding on Dallas (Tyron Smith) -5 yards.","(6:27) Kevin Huber punts for 29 yards to Dal11. No return.","(7:04) Andy Dalton rush up the middle for 8 yards to the Dal40. Tackled by J.J. Wilcox.","(7:08) Andy Dalton incomplete pass to the left intended for Jeremy Hill.","(7:46) Andy Dalton pass to the middle to Brandon LaFell for a loss of 3 yards to the Dal48. Tackled by Anthony Brown.","(8:29) Andy Dalton pass to the right to Giovani Bernard for 11 yards to the Dal45. Tackled by Sean Lee.","(9:14) Andy Dalton rush to the left for 5 yards to the Cin44. Tackled by Jack Crawford.","(9:48) Andy Dalton pass to the left to C.J. Uzomah for 8 yards to the Cin39. Tackled by Brandon Carr.","(10:30) Giovani Bernard rush to the left for 14 yards to the Cin31. Tackled by Byron Jones.","(11:01) Giovani Bernard rush up the middle for 7 yards to the Cin17. Tackled by Terrell McClain.","(11:09) Dan Bailey kicks off to the Cin-4. Rex Burkhead return for 23 yards to Cin19. Tackled by J.J. Wilcox. Penalty: Holding on Cincinnati (Derron Smith) -9 yards.","(11:09) Dan Bailey extra point is good.","(11:15) Ezekiel Elliott rush up the middle for 13 yards for a TOUCHDOWN.","(11:49) Ezekiel Elliott rush to the left for 9 yards to the Cin13. Tackled by Vontaze Burfict.","(12:29) Ezekiel Elliott rush to the left for 17 yards to the Cin22. Tackled by George Iloka and Adam Jones.","(13:08) Dak Prescott pass to the left to Terrance Williams for 11 yards to the Cin39. Tackled by Vontaze Burfict.","(13:40) Dak Prescott rush to the right for 2 yards to the Dal50. Tackled by Carlos Dunlap.","(14:20) Lucky Whitehead rush to the left for 9 yards to the Dal48. Tackled by Adam Jones.","(14:52) Ezekiel Elliott rush to the left for 3 yards to the Dal39. Tackled by Vontaze Burfict.","(15:00) Mike Nugent kicks off to the Dal6. Lucky Whitehead return for 30 yards to Dal36. Tackled by Cody Core and Darqueze Dennard."]