["(0:37) Sam Bradford rush up the middle for a loss of 1 yard to the Hou22.","(1:16) Sam Bradford rush up the middle for a loss of 1 yard to the Hou21.","(2:00) Matt Asiata rush to the left for 3 yards to the Hou20. Tackled by Joel Heath.","(2:00) Two Minute Warning.","(2:41) Matt Asiata rush to the left for 8 yards to the Hou23. Tackled by Akeem Dent.","(2:41) Houston Texans timeout.","(2:47) Matt Asiata rush up the middle for 4 yards to the Hou31. Tackled by K.J. Dillon and Brennan Scarlett.","(3:32) Matt Asiata rush up the middle for 7 yards to the Hou35. Tackled by Corey Moore and Christian Covington.","(3:32) Houston Texans timeout.","(3:44) Matt Asiata rush to the right for 4 yards to the Hou42. Tackled by K.J. Dillon.","(3:46) Nick Novak onside kickoff to the Hou46. Onside kick recovered by receiving team by Laquon Treadwell.","(3:46) Nick Novak extra point is good.","(3:48) Brock Osweiler pass to the left to DeAndre Hopkins for 1 yard for a TOUCHDOWN.","(4:27) Brock Osweiler pass to the right to C.J. Fiedorowicz for 22 yards to the Min1. Tackled by Andrew Sendejo and Harrison Smith.","(4:45) Alfred Blue rush up the middle for no gain to the Min23. Tackled by Harrison Smith.","(5:25) Brock Osweiler pass to the left to DeAndre Hopkins for 13 yards to the Min23.","(5:58) Alfred Blue rush up the middle for 2 yards to the Min36. Tackled by Eric Kendricks.","(6:01) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(6:32) Alfred Blue rush up the middle for 13 yards to the Min38. Tackled by Harrison Smith and Linval Joseph.","(6:35) Brock Osweiler incomplete pass to the right intended for Will Fuller defensed by Danielle Hunter.","(7:08) Alfred Blue rush to the right for 4 yards to the Hou49. Tackled by Harrison Smith.","(7:45) Alfred Blue rush up the middle for 8 yards to the Hou45. Tackled by Eric Kendricks.","(8:12) Alfred Blue rush to the right for 12 yards to the Hou37. Tackled by Andrew Sendejo.","(8:15) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(8:27) Jeff Locke punts for 51 yards to Hou11. Will Fuller return for 14 yards to Hou25. Tackled by Emmanuel Lamur and Trae Waynes.","(9:07) Jerick McKinnon rush to the left for no gain to the Min38. Tackled by Benardrick McKinney.","(9:47) Matt Asiata rush to the left for 6 yards to the Min38. Tackled by Jadeveon Clowney.","(10:28) Matt Asiata rush to the right for 2 yards to the Min32. Tackled by Christian Covington.","(11:07) Sam Bradford pass to the right to Adam Thielen for 14 yards to the Min30. Tackled by Charles James.","(11:11) Sam Bradford incomplete pass to the right intended for Cordarrelle Patterson defensed by Kevin Johnson.","(11:56) Jerick McKinnon rush to the left for 3 yards to the Min16. Tackled by Benardrick McKinney and D.J. Reader.","(12:04) Shane Lechler punts for 46 yards to Min13. No return.","(12:43) Brock Osweiler sacked at Hou41 for a loss of 12 yards by Danielle Hunter.","(13:21) Brock Osweiler pass to the left to Jaelen Strong for 8 yards to the Min47. Tackled by Captain Munnerlyn.","(13:28) Brock Osweiler incomplete pass to the right intended for Jaelen Strong.","(13:32) Penalty: Holding on Minnesota (Captain Munnerlyn) 5 yards.","(13:35) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by Terence Newman.","(14:09) Brock Osweiler pass to the right to C.J. Fiedorowicz for 15 yards to the Hou40. Tackled by Andrew Sendejo.","(14:09) Blair Walsh kicks off to the endzone. Touchback.","(14:09) Blair Walsh extra point is good.","(14:14) Sam Bradford pass to the right to Cordarrelle Patterson for 9 yards for a TOUCHDOWN.","(15:00) Jerick McKinnon rush to the left for a loss of 1 yard to the Hou9. Tackled by Jadeveon Clowney.","(0:03) Sam Bradford pass to the right to Matt Asiata for 20 yards to the Hou8. Tackled by Corey Moore.","(0:48) Sam Bradford pass to the left to Adam Thielen for 6 yards to the Hou28. Tackled by Charles James.","(1:12) Sam Bradford pass to the left to Matt Asiata for 3 yards to the Hou34. Tackled by Benardrick McKinney.","(1:54) Sam Bradford pass to the middle to Kyle Rudolph for 14 yards to the Hou37. Tackled by Benardrick McKinney and Brian Cushing.","(2:31) Matt Asiata rush to the left for 5 yards to the Min49. Tackled by Whitney Mercilus.","(3:06) Sam Bradford pass to the right to Jarius Wright for 7 yards to the Min44. Tackled by Kevin Johnson.","(3:51) Jerick McKinnon rush up the middle for 2 yards to the Min37. Tackled by Charles James.","(3:57) Brock Osweiler pass to the left to Will Fuller for 4 yards to the Min35. Tackled by Danielle Hunter and Everson Griffen.","(4:42) Brock Osweiler sacked at Min39 for a loss of 9 yards by Tom Johnson.","(4:45) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(5:22) Brock Osweiler pass to the right to Jaelen Strong for 3 yards to the Min30. Tackled by Captain Munnerlyn.","(5:49) Brock Osweiler pass to the left to DeAndre Hopkins for 25 yards to the Min33. Tackled by Harrison Smith.","(6:20) Brock Osweiler pass to the left to DeAndre Hopkins for 11 yards to the Hou42. Tackled by Xavier Rhodes.","(6:25) Brock Osweiler incomplete pass to the right intended for Will Fuller defensed by Terence Newman.","(6:54) Brock Osweiler pass to the left to Jaelen Strong for 16 yards to the Hou31. Tackled by Captain Munnerlyn.","(7:21) Brock Osweiler pass to the left to DeAndre Hopkins for 6 yards to the Hou15. Tackled by Xavier Rhodes.","(7:27) Jeff Locke punts for 37 yards to Hou9. No return.","(7:31) Sam Bradford incomplete pass to the right intended for Kyle Rudolph defensed by Eddie Pleasant.","(7:35) Sam Bradford incomplete pass to the right intended for Jerick McKinnon defensed by John Simon.","(8:16) Jerick McKinnon rush to the right for 2 yards to the Hou46. Tackled by Vince Wilfork.","(8:57) Sam Bradford pass to the right to Adam Thielen for 10 yards to the Hou48. Tackled by Kevin Johnson.","(9:24) Jerick McKinnon rush to the right for 1 yard to the Min42. Tackled by Jadeveon Clowney and Benardrick McKinney.","(9:45) Penalty: Offside on Houston (Christian Covington) 5 yards.","(9:55) Brock Osweiler pass intended for Jaelen Strong INTERCEPTED by Andrew Sendejo and returned for 2 yards. Tackled by Ryan Griffin. Penalty: Unsports. Conduct on Minnesota (Anthony Barr) -15 yards.","(10:01) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(10:35) Lamar Miller rush to the left for 1 yard to the Hou26. Tackled by Shamar Stephen.","(10:43) Jeff Locke punts for 52 yards to Hou10. Tyler Ervin return for 15 yards to Hou25. Tackled by Audie Cole.","(11:19) Matt Asiata rush up the middle for 6 yards to the Min38. Tackled by Eddie Pleasant and Brian Cushing.","(11:33) Penalty: Face Mask on Minnesota (T.J. Clemmings) -15 yards.","(12:12) Jerick McKinnon rush up the middle for 1 yard to the Min47. Tackled by Jadeveon Clowney.","(12:28) Penalty: False Start on Minnesota (Jeremiah Sirles) -5 yards.","(13:08) Jerick McKinnon rush up the middle for a loss of 1 yard to the Hou49. Tackled by Jadeveon Clowney.","(13:45) Sam Bradford pass to the left to Adam Thielen for 31 yards to the Hou48. Tackled by A.J. Bouye.","(13:54) Shane Lechler punts for 53 yards to Min12. Marcus Sherels return for 9 yards to Min21. Tackled by K.J. Dillon.","(14:26) Brock Osweiler pass to the right to Jaelen Strong for 6 yards to the Hou35. Tackled by Andrew Sendejo.","(14:48) Brock Osweiler sacked at Hou29 for a loss of 2 yards by Brian Robison. FUMBLE, recovered by Hou (Lamar Miller).","(14:54) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(15:00) Blair Walsh kicks off to the Hou-2. Tyler Ervin return for 33 yards to Hou31. Tackled by Andrew Sendejo.","(0:47) Matt Asiata rush up the middle for 6 yards to the Min30. Tackled by Christian Covington.","(1:30) Sam Bradford pass to the left to Charles Johnson for 2 yards to the Min24. Tackled by Charles James.","(1:37) Nick Novak kicks off to the Min5. Marcus Sherels return for 17 yards to Min22. Tackled by Brennan Scarlett.","(1:41) Nick Novak 30 yard field goal attempt is GOOD. Holder: Shane Lechler.","(1:46) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(1:46) Houston Texans timeout.","(1:51) Brock Osweiler incomplete pass to the right intended for Ryan Griffin.","(1:53) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(1:59) Brock Osweiler pass to the right to C.J. Fiedorowicz for 15 yards to the Min12.","(1:59) Two Minute Warning.","(2:03) Lamar Miller rush to the left for 4 yards to the Min27. Tackled by Everson Griffen and Linval Joseph.","(2:35) Brock Osweiler pass to the left to C.J. Fiedorowicz for 9 yards to the Min31. Tackled by Chad Greenway.","(2:38) Penalty: Offside on Minnesota (Everson Griffen) 5 yards.","(2:42) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins defensed by Eric Kendricks.","(3:15) Lamar Miller rush up the middle for 4 yards to the Min45. Tackled by Harrison Smith.","(3:41) Brock Osweiler pass to the right to Ryan Griffin for 5 yards to the Min49. Tackled by Anthony Barr.","(3:51) Jeff Locke punts for 36 yards to Hou46. No return.","(4:31) Sam Bradford sacked at Min18 for a loss of 9 yards by Whitney Mercilus.","(5:10) Sam Bradford pass to the right to Kyle Rudolph for 1 yard to the Min27. Tackled by Kevin Johnson.","(5:38) Jerick McKinnon rush to the left for 2 yards to the Min26. Tackled by Brian Cushing.","(5:42) Brian Peters kicks off to the Min8. Charles Johnson return for 16 yards to Min24. Tackled by Tyler Ervin.","(5:46) Nick Novak 38 yard field goal attempt is GOOD. Holder: Shane Lechler.","(5:52) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(5:57) Brock Osweiler incomplete pass to the right intended for Ryan Griffin.","(6:35) Lamar Miller rush to the left for 4 yards to the Min20. Tackled by Shamar Stephen.","(6:40) Penalty: Holding on Minnesota (Xavier Rhodes) 5 yards.","(6:40) Houston Texans timeout.","(7:19) Brock Osweiler pass to the right to Braxton Miller for 12 yards to the Min29. Tackled by Eric Kendricks.","(7:23) Brock Osweiler incomplete pass to the left intended for Ryan Griffin.","(8:07) Brock Osweiler sacked at Min41 for a loss of 6 yards by Brian Robison.","(8:13) Penalty: Pass Interference on Minnesota (Xavier Rhodes) 34 yards.","(8:46) Brock Osweiler pass to the left to Jaelen Strong for 6 yards to the Hou31. Tackled by Captain Munnerlyn.","(8:46) Blair Walsh kicks off to the endzone. Touchback.","(8:46) Blair Walsh extra point is good.","(9:05) Shane Lechler punts for 57 yards to Min21. Marcus Sherels return for 79 yards for a TOUCHDOWN.","(9:09) Brock Osweiler incomplete pass to the left intended for Jaelen Strong defensed by Captain Munnerlyn.","(9:51) Lamar Miller rush up the middle for 1 yard to the Hou22. Tackled by Tom Johnson.","(9:54) Brock Osweiler incomplete pass to the right intended for Lamar Miller defensed by Harrison Smith.","(9:58) Blair Walsh kicks off to the Hou1. Tyler Ervin return for 20 yards to Hou21. Tackled by Emmanuel Lamur.","(10:01) Blair Walsh 19 yard field goal attempt is GOOD. Holder: Jeff Locke.","(10:05) Sam Bradford incomplete pass to the right intended for Zach Line defensed by Eddie Pleasant.","(10:51) Sam Bradford pass to the right to Cordarrelle Patterson for 15 yards to the Hou1. Tackled by Benardrick McKinney.","(11:25) Jerick McKinnon rush to the left for a loss of 6 yards to the Hou16. Tackled by Jadeveon Clowney.","(12:02) Sam Bradford pass to the left to Jarius Wright for 11 yards to the Hou10. Tackled by Charles James.","(12:42) Jerick McKinnon rush up the middle for 3 yards to the Hou21. Tackled by Charles James and Benardrick McKinney.","(12:44) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(13:17) Sam Bradford pass to the right to Jerick McKinnon for 10 yards to the Hou24.","(13:17) Minnesota Vikings timeout.","(13:22) Sam Bradford incomplete pass to the right intended for Cordarrelle Patterson.","(13:46) Matt Asiata rush up the middle for 2 yards to the Hou34. Tackled by Vince Wilfork and Benardrick McKinney.","(14:19) Sam Bradford pass to the right to Adam Thielen for 7 yards to the Hou36. Tackled by Kevin Johnson.","(15:00) Matt Asiata rush to the left for 2 yards to the Hou43. Tackled by Jadeveon Clowney.","(0:09) Sam Bradford pass to the right to Jarius Wright for 10 yards to the Hou45. Tackled by Charles James.","(0:47) Jerick McKinnon rush to the left for a loss of 3 yards to the Min45. Tackled by Christian Covington.","(1:17) Cordarrelle Patterson rush to the right for 7 yards to the Min48. Tackled by Johnathan Joseph and Kevin Johnson.","(1:21) 51 yard field goal attempt by Nick Novak is NO GOOD. Holder: Shane Lechler.","(1:27) Brock Osweiler incomplete pass to the left intended for Ryan Griffin.","(2:09) Lamar Miller rush to the right for 1 yard to the Min33. Tackled by Danielle Hunter and Linval Joseph.","(2:42) Brock Osweiler pass to the left to Lamar Miller for 4 yards to the Min34. Tackled by Eric Kendricks.","(2:52) Jeff Locke punts for 55 yards to Hou44. Tyler Ervin return for 18 yards to Min38. Tackled by Cordarrelle Patterson.","(3:34) Sam Bradford sacked at Min1 for a loss of 7 yards by Antonio Smith and Whitney Mercilus.","(4:23) Penalty: False Start on Minnesota (Jeremiah Sirles) -5 yards.","(4:23) Sam Bradford pass to the left to Jarius Wright for 4 yards to the Min13. Tackled by A.J. Bouye.","(5:01) Jerick McKinnon rush to the right for 1 yard to the Min9. Tackled by John Simon and Brian Cushing.","(5:13) Shane Lechler punts for 54 yards to Min16. Marcus Sherels - no return. Tackled by Brennan Scarlett. Penalty: Holding on Minnesota (Justin Trattou) -8 yards.","(5:16) Brock Osweiler incomplete pass to the right intended for Lamar Miller defensed by Eric Kendricks.","(5:16) Houston Texans timeout.","(5:52) Lamar Miller rush to the left for 4 yards to the Hou30. Tackled by Linval Joseph and Anthony Barr.","(6:28) Lamar Miller rush to the left for 1 yard to the Hou26. Tackled by Eric Kendricks and Captain Munnerlyn.","(6:28) Blair Walsh kicks off to the endzone. Touchback.","(6:28) Blair Walsh extra point is good.","(6:33) Matt Asiata rush up the middle for 1 yard for a TOUCHDOWN.","(6:53) Penalty: Face Mask on Houston (Jadeveon Clowney) 0 yards.","(7:34) Jerick McKinnon rush up the middle for 1 yard to the Hou1. Tackled by Quintin Demps and John Simon.","(8:02) Jerick McKinnon rush to the left for 8 yards to the Hou2. Tackled by Benardrick McKinney.","(8:05) Penalty: Too Many Men on Field on Houston 5 yards.","(8:28) Sam Bradford pass to the left to Matt Asiata for 23 yards to the Hou15. Tackled by John Simon.","(9:08) Jerick McKinnon rush to the left for 4 yards to the Hou38. Tackled by Christian Covington and Quintin Demps.","(9:14) Sam Bradford incomplete pass to the left intended for Adam Thielen.","(9:43) Jerick McKinnon rush to the left for 5 yards to the Hou42. Tackled by Benardrick McKinney.","(10:20) Sam Bradford pass to the right to Cordarrelle Patterson for 8 yards to the Hou47. Tackled by John Simon.","(10:30) Shane Lechler punts for 47 yards to Min33. Marcus Sherels return for 12 yards to Min45. Tackled by Max Bullough.","(10:34) Brock Osweiler incomplete pass to the left intended for Jaelen Strong.","(10:41) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(11:17) Brock Osweiler pass to the right to Ryan Griffin for 3 yards to the Hou20. Tackled by Chad Greenway.","(11:23) Blair Walsh kicks off to the Hou2. Braxton Miller return for 15 yards to Hou17. Tackled by Andrew Sendejo.","(11:23) Blair Walsh extra point is good.","(11:29) Sam Bradford pass to the right to Adam Thielen for 36 yards for a TOUCHDOWN.","(11:43) Matt Asiata rush to the left for a loss of 1 yard to the Hou36. Tackled by Jadeveon Clowney.","(12:19) Sam Bradford pass to the right to Adam Thielen for 23 yards to the Hou35. Tackled by Johnathan Joseph.","(12:57) Jerick McKinnon rush to the left for a loss of 2 yards to the Min42. Tackled by John Simon.","(13:22) Jerick McKinnon rush to the right for 8 yards to the Min44. Tackled by Johnathan Joseph.","(13:57) Jerick McKinnon rush to the right for 8 yards to the Min36. Tackled by Brian Cushing.","(14:36) Sam Bradford pass to the right to Cordarrelle Patterson for 7 yards to the Min28. Tackled by Johnathan Joseph.","(14:53) Penalty: Offside on Houston (Jadeveon Clowney) 5 yards.","(14:55) Sam Bradford incomplete pass to the right intended for Jerick McKinnon.","(15:00) Brian Peters kicks off to the Min-1. Cordarrelle Patterson return for 17 yards to Min16. Tackled by K.J. Dillon."]