["(0:11) Philip Rivers pass to the right to Travis Benjamin for no gain to the SD21. FUMBLE, recovered by SD.","(0:20) Marquette King punts for 51 yards to SD12. Dexter McCluster return for 9 yards to SD21. Tackled by Johnny Holton.","(0:20) Oakland Raiders timeout.","(1:07) Jamize Olawale rush up the middle for 5 yards to the Oak37. Tackled by Jerry Attaochu.","(1:54) Jamize Olawale rush up the middle for a loss of 3 yards to the Oak32. Tackled by Joshua Perry.","(1:54) San Diego Chargers timeout.","(2:00) Jamize Olawale rush up the middle for no gain to the Oak35. Tackled by Craig Mager and Kyle Emanuel.","(2:00) Two Minute Warning.","(2:07) Drew Kaser rush up the middle for no gain to the Oak18. FUMBLE, recovered by SD (Sean McGrath).","(3:05) Melvin Gordon rush up the middle for 1 yard to the Oak18. Tackled by Jihad Ward.","(3:05) San Diego Chargers timeout.","(3:10) Philip Rivers incomplete pass to the left intended for Travis Benjamin.","(3:50) Philip Rivers pass to the right to Travis Benjamin for 8 yards to the Oak19. Tackled by DJ Hayden.","(3:56) Philip Rivers pass to the left to Tyrell Williams for 25 yards to the Oak27.","(4:03) Philip Rivers pass to the right to Travis Benjamin for 15 yards to the SD48. Tackled by Karl Joseph.","(4:08) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(4:18) Marquette King punts for 40 yards to SD27. Dexter McCluster return for 6 yards to SD33. Tackled by Shilique Calhoun.","(4:53) Derek Carr pass to the middle to Jalen Richard for 11 yards to the Oak33. Tackled by Corey Liuget.","(5:37) Derek Carr sacked at Oak22 for a loss of 4 yards by Joey Bosa.","(6:21) DeAndre Washington rush to the left for 1 yard to the Oak26. Tackled by Brandon Mebane.","(6:21) Josh Lambo kicks off to the endzone. Touchback.","(6:21) Josh Lambo extra point is good.","(6:26) Philip Rivers pass to the left to Antonio Gates for 4 yards for a TOUCHDOWN.","(7:07) Melvin Gordon rush to the right for 3 yards to the Oak4. Tackled by Bruce Irvin.","(7:53) Melvin Gordon rush up the middle for 5 yards to the Oak7. Tackled by Karl Joseph and Sean Smith.","(8:32) Melvin Gordon rush to the right for 5 yards to the Oak12. Tackled by Stacy McGee.","(9:03) Philip Rivers pass to the left to Travis Benjamin for 23 yards to the Oak17. Tackled by Reggie Nelson.","(9:27) Derek Watt rush up the middle for 2 yards to the Oak40. Tackled by Dan Williams and Khalil Mack.","(10:07) Philip Rivers pass to the right to Antonio Gates for 8 yards to the Oak42. Tackled by Perry Riley Jr..","(10:52) Melvin Gordon rush to the left for 1 yard to the SD50. Tackled by Perry Riley Jr..","(11:27) Philip Rivers pass to the middle to Hunter Henry for 14 yards to the SD49. Tackled by Karl Joseph.","(11:34) Philip Rivers incomplete pass to the left intended for Dontrelle Inman defensed by Reggie Nelson.","(12:08) Philip Rivers pass to the left to Travis Benjamin for 11 yards to the SD35. Tackled by Karl Joseph.","(12:46) Melvin Gordon rush to the left for a loss of 1 yard to the SD24. Tackled by Khalil Mack.","(12:51) Sebastian Janikowski kicks off to the SD7. Dexter McCluster return for 18 yards to SD25. Tackled by Brynden Trawick.","(12:51) Sebastian Janikowski extra point is good.","(12:54) Jamize Olawale rush up the middle for 1 yard for a TOUCHDOWN.","(12:54) Oakland Raiders timeout.","(13:01) Penalty: Pass Interference on San Diego (Dexter McCoil) 6 yards.","(13:34) Derek Carr pass to the left to Andre Holmes for 8 yards to the SD7. Tackled by Craig Mager.","(14:17) DeAndre Washington rush to the right for 6 yards to the SD15. Tackled by Casey Hayward.","(15:00) Derek Carr pass to the left to Jalen Richard for 11 yards to the SD21. Tackled by Jatavis Brown.","(0:06) Drew Kaser punts for 16 yards to SD32. No return.","(0:13) Philip Rivers incomplete pass to the right intended for Tyrell Williams defensed by David Amerson.","(0:19) Philip Rivers incomplete pass to the middle intended for Travis Benjamin.","(1:04) Philip Rivers sacked at SD16 for a loss of 3 yards by Dan Williams and Stacy McGee.","(1:09) Sebastian Janikowski kicks off to the SD1. Dexter McCluster return for 18 yards to SD19. Tackled by Shilique Calhoun.","(1:09) Derek Carr 2 pt conversion pass to Amari Cooper is GOOD.","(1:15) Derek Carr pass to the right to Michael Crabtree for 21 yards for a TOUCHDOWN.","(1:20) Derek Carr incomplete pass to the left intended for Amari Cooper.","(2:09) Derek Carr pass to the left to Andre Holmes for 5 yards to the SD21. Tackled by Steve Williams.","(2:43) Jamize Olawale rush up the middle for 2 yards to the SD26. Tackled by Casey Hayward.","(3:19) Derek Carr rush to the right for 6 yards to the SD28. Tackled by Craig Mager.","(3:54) Jalen Richard rush up the middle for 4 yards to the SD34. Tackled by Korey Toomer.","(4:00) Melvin Gordon rush to the right for 1 yard to the SD35. Tackled by Stacy McGee. FUMBLE, recovered by Oak (Karl Joseph). Tackled by Derek Watt.","(4:41) Melvin Gordon rush up the middle for 9 yards to the SD34. Tackled by Reggie Nelson.","(4:41) Sebastian Janikowski kicks off to the endzone. Touchback.","(4:46) Sebastian Janikowski 48 yard field goal attempt is GOOD. Holder: Marquette King.","(5:25) Derek Carr pass to the right to Jamize Olawale for 2 yards to the SD30. Tackled by Korey Toomer.","(5:39) Penalty: False Start on Oakland (Kelechi Osemele) -5 yards.","(6:27) Derek Carr rush up the middle for 7 yards to the SD27. Tackled by Jatavis Brown.","(6:34) Derek Carr incomplete pass to the right intended for Amari Cooper defensed by Steve Williams.","(7:18) Derek Carr pass to the left to DeAndre Washington for 10 yards to the SD34. Tackled by Craig Mager and Jatavis Brown.","(8:09) Penalty: False Start on Oakland (Kelechi Osemele) -5 yards.","(8:17) Derek Carr pass to the right to DeAndre Washington for 8 yards to the SD39. Tackled by Casey Hayward.","(8:51) DeAndre Washington rush up the middle for 7 yards to the SD47. Tackled by Steve Williams.","(9:34) DeAndre Washington rush up the middle for 5 yards to the Oak46. Tackled by Jatavis Brown.","(10:04) Derek Carr pass to the right to Seth Roberts for 16 yards to the Oak41. Tackled by Casey Hayward.","(10:10) Derek Carr incomplete pass to the right intended for Andre Holmes.","(10:10) Josh Lambo kicks off to the endzone. Touchback.","(10:10) Josh Lambo extra point is good.","(10:14) Philip Rivers pass to the left to Hunter Henry for 1 yard for a TOUCHDOWN.","(10:14) San Diego Chargers timeout.","(10:53) Melvin Gordon rush to the right for 24 yards to the Oak1. Tackled by Sean Smith.","(11:19) Philip Rivers pass to the middle to Tyrell Williams for 50 yards to the Oak25. Tackled by David Amerson.","(11:25) Sebastian Janikowski kicks off to the SD6. Dexter McCluster return for 19 yards to SD25. Tackled by Brynden Trawick.","(11:25) Sebastian Janikowski extra point is good.","(11:34) Derek Carr pass to the left to Amari Cooper for 64 yards for a TOUCHDOWN.","(11:41) Derek Carr incomplete pass to the right.","(12:22) Derek Carr pass to the right to Michael Crabtree for 11 yards to the Oak36. Tackled by Casey Hayward.","(12:28) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(12:31) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(12:31) Josh Lambo kicks off to the endzone. Touchback.","(12:31) Josh Lambo extra point is good.","(12:38) Philip Rivers pass to the left to Melvin Gordon for 18 yards for a TOUCHDOWN.","(13:23) Melvin Gordon rush to the left for 3 yards to the Oak18. Tackled by Perry Riley Jr..","(14:14) Philip Rivers pass to the left to Hunter Henry for 59 yards to the Oak21. Tackled by Sean Smith.","(15:00) Philip Rivers sacked at SD20 for a loss of 5 yards by Stacy McGee. FUMBLE, recovered by SD (Chris Hairston).","(15:00) Sebastian Janikowski kicks off to the endzone. Touchback.","(0:02) Sebastian Janikowski 56 yard field goal attempt is GOOD. Holder: Marquette King.","(0:02) San Diego Chargers timeout.","(0:02) Oakland Raiders timeout.","(0:26) Derek Carr pass to the middle to Jalen Richard for 15 yards to the SD38. Tackled by Dexter McCoil.","(1:02) Derek Carr pass to the left to Jalen Richard for 3 yards to the Oak47. Tackled by Steve Williams.","(1:39) Derek Carr sacked at Oak44 for a loss of 12 yards by Joey Bosa.","(1:54) Philip Rivers pass intended for Dontrelle Inman INTERCEPTED by Karl Joseph and returned for 21 yards. Tackled by Dontrelle Inman.","(2:00) Philip Rivers incomplete pass to the left intended for Travis Benjamin defensed by Sean Smith.","(2:00) Two Minute Warning.","(2:21) Penalty: Illegal Crackback on San Diego (Dontrelle Inman) -15 yards.","(2:47) Melvin Gordon rush to the left for 9 yards to the SD33. Tackled by DJ Hayden and Reggie Nelson.","(2:55) Marquette King punts for 48 yards to SD24. No return.","(2:59) Derek Carr incomplete pass to the left intended for Michael Crabtree.","(3:41) DeAndre Washington rush to the left for a loss of 1 yard to the Oak28. Tackled by Corey Liuget.","(4:24) Derek Carr pass to the right to Jalen Richard for 4 yards to the Oak29. Tackled by Kyle Emanuel.","(4:24) Josh Lambo kicks off to the endzone. Touchback.","(4:28) Josh Lambo 36 yard field goal attempt is GOOD. Holder: Drew Kaser.","(5:10) Philip Rivers pass to the right to Tyrell Williams for 5 yards to the Oak18. Tackled by David Amerson.","(5:55) Melvin Gordon rush up the middle for 2 yards to the Oak23. Tackled by Karl Joseph and Cory James.","(6:35) Dexter McCluster rush to the left for 1 yard to the Oak25. Tackled by Karl Joseph and Sean Smith.","(7:13) Philip Rivers pass to the right to Travis Benjamin for 54 yards to the Oak26. Tackled by Reggie Nelson.","(7:13) Penalty: False Start on San Diego (Chris Hairston) -5 yards.","(7:13) Sebastian Janikowski kicks off to the endzone. Touchback.","(7:16) Sebastian Janikowski 26 yard field goal attempt is GOOD. Holder: Marquette King.","(7:20) Derek Carr incomplete pass to the left intended for Michael Crabtree.","(8:01) DeAndre Washington rush up the middle for no gain to the SD8. Tackled by Craig Mager.","(8:06) Derek Carr incomplete pass to the left intended for Amari Cooper.","(8:11) Jalen Richard rush to the left for 5 yards to the SD20. Tackled by Jerry Attaochu. Penalty: Pass Interference on San Diego (Jatavis Brown) 12 yards.","(9:33) Derek Carr pass to the left to Amari Cooper for 21 yards to the SD25. Tackled by Steve Williams.","(10:12) Jalen Richard rush up the middle for a loss of 2 yards to the SD46. Tackled by Joey Bosa.","(10:52) Jalen Richard rush to the left for 6 yards to the SD44. Tackled by Steve Williams.","(11:37) Jamize Olawale rush to the left for 17 yards to the Oak50. Tackled by Dexter McCoil.","(12:26) Derek Carr pass to the right to DeAndre Washington for 1 yard to the Oak33. Tackled by Melvin Ingram.","(13:07) Derek Carr pass to the left to Amari Cooper for 7 yards to the Oak32. Tackled by Steve Williams.","(13:07) Josh Lambo kicks off to the endzone. Touchback.","(13:07) Josh Lambo extra point is good.","(13:13) Philip Rivers pass to the middle to Tyrell Williams for 29 yards for a TOUCHDOWN.","(13:38) Melvin Gordon rush to the left for no gain to the Oak29. Tackled by Justin Ellis.","(14:17) Philip Rivers pass to the left to Antonio Gates for 9 yards to the Oak29. Tackled by Perry Riley Jr..","(15:00) Melvin Gordon rush up the middle for a loss of 1 yard to the Oak38. Tackled by Khalil Mack.","(0:10) Melvin Gordon rush to the right for 8 yards to the Oak37. Tackled by Perry Riley Jr..","(0:41) Penalty: Offside on Oakland (Denico Autry) 6 yards.","(0:45) Philip Rivers pass to the left to Dontrelle Inman for 3 yards to the SD49. Tackled by Sean Smith.","(1:23) Philip Rivers pass to the right to Travis Benjamin for 6 yards to the SD46. Tackled by David Amerson.","(1:27) Philip Rivers incomplete pass to the right intended for Hunter Henry.","(1:32) 50 yard field goal attempt by Sebastian Janikowski is NO GOOD. Holder: Marquette King.","(1:55) Derek Carr pass to the middle to DeAndre Washington for 5 yards to the SD32. Tackled by Jatavis Brown.","(2:11) Penalty: False Start on Oakland (Donald Penn) -5 yards.","(2:56) Derek Carr pass to the right to Amari Cooper for 9 yards to the SD32. Tackled by Joey Bosa.","(3:35) DeAndre Washington rush to the right for a loss of 4 yards to the SD41. Tackled by Korey Toomer.","(3:35) Penalty: False Start on Oakland (Rodney Hudson) -5 yards.","(3:55) Philip Rivers pass intended for Travis Benjamin INTERCEPTED by Sean Smith and returned for 27 yards. Tackled by Travis Benjamin.","(4:00) Sebastian Janikowski kicks off to the SD0. Dexter McCluster return for 20 yards to SD20. Tackled by Jamize Olawale.","(4:03) Sebastian Janikowski 20 yard field goal attempt is GOOD. Holder: Marquette King.","(4:08) Derek Carr incomplete pass to the left intended for Amari Cooper.","(4:14) Derek Carr incomplete pass to the right intended for Seth Roberts defensed by Dwight Lowery.","(4:54) DeAndre Washington rush up the middle for 1 yard to the SD2. Tackled by Brandon Mebane.","(4:54) Oakland Raiders timeout.","(5:43) Derek Carr pass to the right to Michael Crabtree for 15 yards to the SD3. Tackled by Casey Hayward.","(6:17) Derek Carr pass to the left to DeAndre Washington for 5 yards to the SD18. Tackled by Joshua Perry.","(7:00) Jalen Richard rush up the middle for 4 yards to the SD23. Tackled by Joshua Perry.","(7:41) Jalen Richard rush to the right for 7 yards to the SD27. Tackled by Craig Mager.","(8:26) Derek Carr pass to the middle to Jalen Richard for 22 yards to the SD34. Tackled by Korey Toomer.","(8:49) Derek Carr sacked at SD46 for a loss of 1 yard by Jatavis Brown. Penalty: Holding on Oakland (Gabe Jackson) -10 yards.","(9:26) San Diego Chargers timeout.","(9:49) Derek Carr pass to the left to Amari Cooper for 26 yards to the SD45. Tackled by Steve Williams.","(10:33) Jalen Richard rush to the right for 5 yards to the Oak29. Tackled by Kyle Emanuel.","(11:14) Jalen Richard rush to the left for 2 yards to the Oak24. Tackled by Kyle Emanuel and Joey Bosa.","(11:53) Derek Carr pass to the right to Amari Cooper for 11 yards to the Oak22. Tackled by Casey Hayward.","(11:58) Derek Carr incomplete pass to the left intended for Jalen Richard.","(12:01) Derek Carr incomplete pass to the left intended for Amari Cooper defensed by Melvin Ingram.","(12:09) Philip Rivers pass to the middle to Antonio Gates for 9 yards to the Oak13. Tackled by Perry Riley Jr.. FUMBLE, recovered by Oak (Reggie Nelson). Tackled by Antonio Gates.","(12:53) Philip Rivers pass to the left to Tyrell Williams for 8 yards to the Oak22. Tackled by Reggie Nelson.","(13:32) Melvin Gordon rush to the right for no gain to the Oak30. Tackled by Reggie Nelson and Perry Riley Jr..","(13:40) Derek Carr pass intended for DeAndre Washington INTERCEPTED by Brandon Mebane and returned for 5 yards. Tackled by Kelechi Osemele.","(13:45) Derek Carr incomplete pass to the right intended for Amari Cooper.","(14:26) DeAndre Washington rush to the right for 8 yards to the Oak39. Tackled by Melvin Ingram.","(15:00) Derek Carr pass to the right to Seth Roberts for 6 yards to the Oak31. Tackled by Casey Hayward.","(15:00) Josh Lambo kicks off to the endzone. Touchback."]