["(0:03) Roberto Aguayo 38 yard field goal attempt is GOOD. Holder: Bryan Anger.","(0:03) Carolina Panthers timeout.","(0:03) Tampa Bay Buccaneers timeout.","(0:17) Jameis Winston rush to the right for a loss of 3 yards to the Car20.","(0:41) Penalty: Face Mask on Carolina (Kony Ealy) 15 yards.","(0:41) Jacquizz Rodgers rush to the left for 7 yards to the Car32. Tackled by Robert McClain and Thomas Davis.","(0:46) Jameis Winston pass to the right to Vincent Jackson for 5 yards to the Car39. Tackled by Zack Sanchez.","(0:49) Jameis Winston pass to the right to Vincent Jackson for 14 yards to the Car44.","(1:09) Jameis Winston pass to the right to Jacquizz Rodgers for 8 yards to the TB42. Tackled by Luke Kuechly and Zack Sanchez.","(1:09) Carolina Panthers timeout.","(1:15) Jacquizz Rodgers rush up the middle for 6 yards to the TB34. Tackled by Lavar Edwards.","(1:19) Jameis Winston incomplete pass to the right intended for Cameron Brate.","(1:42) Jameis Winston pass to the right to Mike Evans for 11 yards to the TB28. Tackled by Robert McClain and Thomas Davis.","(1:42) Tampa Bay Buccaneers timeout.","(1:46) Jacquizz Rodgers rush to the right for 3 yards to the TB17. Tackled by Luke Kuechly.","(1:46) Carolina Panthers timeout.","(1:49) Jacquizz Rodgers rush to the right for no gain to the TB14. Tackled by Kony Ealy.","(2:00) Andy Lee punts for 43 yards to TB14. No return.","(2:00) Two Minute Warning.","(2:23) Cameron Artis-Payne rush to the left for a loss of 1 yard to the Car43. Tackled by Akeem Spence and Daryl Smith.","(3:04) Cameron Artis-Payne rush to the left for 3 yards to the Car44. Tackled by William Gholston.","(3:33) Cameron Artis-Payne rush to the right for 5 yards to the Car41. Tackled by Bradley McDougald and William Gholston.","(3:38) 46 yard field goal attempt by Roberto Aguayo is NO GOOD. Holder: Bryan Anger.","(4:21) Jacquizz Rodgers rush to the right for a loss of 1 yard to the Car28. Tackled by Luke Kuechly and Robert McClain.","(4:27) Jameis Winston incomplete pass to the left intended for Mike Evans.","(5:04) Jacquizz Rodgers rush to the left for 1 yard to the Car27. Tackled by Michael Griffin and Daryl Worley.","(5:31) Jacquizz Rodgers rush to the right for 3 yards to the Car43. Tackled by Shaq Thompson. Penalty: Unnecessary Roughness on Carolina (A.J. Klein) 15 yards.","(6:11) Jameis Winston pass to the middle to Jacquizz Rodgers for 4 yards to the Car46. Tackled by Shaq Thompson and Paul Soliai.","(6:49) Jameis Winston pass to the right to Mike Evans for 16 yards to the TB50. Tackled by Luke Kuechly.","(7:28) Jacquizz Rodgers rush to the left for 2 yards to the TB34. Tackled by Paul Soliai.","(8:02) Jameis Winston pass to the right to Mike Evans for 12 yards to the TB32. Tackled by Robert McClain.","(8:39) Jacquizz Rodgers rush to the right for no gain to the TB20. Tackled by Kony Ealy.","(8:39) Tampa Bay Buccaneers timeout.","(8:45) Derek Anderson pass intended for Greg Olsen INTERCEPTED by Brent Grimes. No return. Touchback.","(9:28) Fozzy Whittaker rush to the right for 16 yards to the TB1. Tackled by Brent Grimes.","(10:04) Derek Anderson pass to the right to Greg Olsen for 11 yards to the TB17. Tackled by Bradley McDougald.","(10:47) Derek Anderson pass to the right to Kelvin Benjamin for 13 yards to the TB28. Tackled by Brent Grimes and Lavonte David.","(11:29) Fozzy Whittaker rush up the middle for 12 yards to the TB41. Tackled by Chris Conte and Kwon Alexander.","(11:57) Penalty: False Start on Carolina (Trai Turner) -5 yards.","(12:36) Cameron Artis-Payne rush to the left for 14 yards to the TB48. Tackled by Chris Conte.","(13:09) Derek Anderson pass to the left to Greg Olsen for 20 yards to the Car38. Tackled by Daryl Smith.","(13:22) Bryan Anger punts for 51 yards to Car18. No return.","(14:00) Jameis Winston sacked at TB31 for a loss of 9 yards by Tre Boston.","(14:06) Jameis Winston incomplete pass to the right intended for Adam Humphries.","(14:12) Jameis Winston incomplete pass to the left intended for Mike Evans.","(14:23) Derek Anderson rush to the right for 4 yards to the TB40. Tackled by DaVonte Lambert. FUMBLE, recovered by TB (William Gholston). Tackled by Trai Turner.","(15:00) Cameron Artis-Payne rush to the left for 4 yards to the TB44. Tackled by Noah Spence.","(0:36) Cameron Artis-Payne rush up the middle for 2 yards to the TB48. Tackled by DaVonte Lambert and William Gholston.","(1:20) Cameron Artis-Payne rush to the right for 13 yards to the Car50. Tackled by DaVonte Lambert and Vernon Hargreaves III.","(1:57) Cameron Artis-Payne rush to the left for 8 yards to the Car37. Tackled by Kwon Alexander.","(2:05) Bryan Anger punts for 41 yards to Car29. No return.","(2:11) Jameis Winston incomplete pass to the left intended for Jacquizz Rodgers.","(2:49) Jacquizz Rodgers rush up the middle for a loss of 4 yards to the TB30. Tackled by Shaq Thompson.","(3:22) Jacquizz Rodgers rush up the middle for 3 yards to the TB34. Tackled by Kony Ealy.","(3:35) Andy Lee punts for 52 yards to TB19. Adam Humphries return for 12 yards to TB31. Tackled by Jared Norris and Ed Dickson.","(3:41) Derek Anderson incomplete pass to the left intended for Greg Olsen defensed by Bradley McDougald.","(4:23) Cameron Artis-Payne rush to the left for 4 yards to the Car29. Tackled by Lavonte David and Kwon Alexander.","(4:27) Derek Anderson incomplete pass to the right intended for Kelvin Benjamin defensed by Brent Grimes.","(4:27) Roberto Aguayo kicks off to the endzone. Touchback.","(4:27) Jameis Winston 2 pt conversion pass to Adam Humphries is GOOD.","(4:34) Jameis Winston pass to the left to Mike Evans for 26 yards for a TOUCHDOWN.","(5:18) Jameis Winston pass to the left to Cameron Brate for 38 yards to the Car26. Tackled by Luke Kuechly.","(5:57) Jacquizz Rodgers rush to the left for 11 yards to the TB36. Tackled by Kony Ealy and Daryl Worley.","(6:03) Jameis Winston incomplete pass to the left intended for Mike Evans.","(6:03) Graham Gano kicks off to the endzone. Touchback.","(6:03) Graham Gano extra point is good.","(6:11) Cameron Artis-Payne rush to the left for 12 yards for a TOUCHDOWN.","(6:53) Derek Anderson pass to the right to Greg Olsen for 33 yards to the TB12. Tackled by Daryl Smith.","(7:01) Penalty: Running into Kicker on Tampa Bay (Howard Jones) 15 yards.","(7:05) Derek Anderson incomplete pass to the middle intended for Kelvin Benjamin.","(7:11) Derek Anderson incomplete pass to the right intended for Corey Brown.","(7:48) Fozzy Whittaker rush to the left for 8 yards to the Car40. Tackled by Jude Adjei-Barimah.","(7:59) Bryan Anger punts for 46 yards to Car26. Ted Ginn Jr. return for 6 yards to Car32. Tackled by Keith Tandy.","(8:06) Jameis Winston incomplete pass to the right intended for Cameron Brate.","(8:31) Jameis Winston rush to the left for 4 yards to the TB28. Tackled by Luke Kuechly.","(9:12) Jacquizz Rodgers rush up the middle for a loss of 1 yard to the TB24. Tackled by Michael Griffin and Star Lotulelei.","(9:12) Graham Gano kicks off to the endzone. Touchback.","(9:12) Graham Gano extra point is good.","(9:12) Cameron Artis-Payne rush up the middle for 1 yard for a TOUCHDOWN.","(9:22) Derek Anderson incomplete pass to the left intended for Greg Olsen.","(9:56) Mike Tolbert rush to the right for 2 yards to the TB1. Tackled by Brent Grimes.","(10:03) Derek Anderson incomplete pass to the right intended for Kelvin Benjamin.","(10:38) Derek Anderson pass to the right to Greg Olsen for 21 yards to the TB3. Tackled by Kwon Alexander.","(11:06) Penalty: Holding on Carolina (Trai Turner) -10 yards.","(11:40) Cameron Artis-Payne rush to the right for 3 yards to the TB14. Tackled by Brent Grimes and Lavonte David.","(12:22) Derek Anderson pass to the right to Corey Brown for 6 yards to the TB17. Tackled by Jude Adjei-Barimah.","(13:00) Derek Anderson pass to the left to Fozzy Whittaker for 9 yards to the TB23. Tackled by Bradley McDougald.","(13:44) Derek Anderson pass to the right to Greg Olsen for 34 yards to the TB32. Tackled by Lavonte David.","(14:24) Cameron Artis-Payne rush to the left for 4 yards to the Car34. Tackled by Bradley McDougald.","(15:00) Derek Anderson pass to the left to Ted Ginn Jr. for 5 yards to the Car30. Tackled by Vernon Hargreaves III and William Gholston.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback.","(0:01) Jameis Winston rush up the middle for a loss of 1 yard to the TB32.","(0:05) 43 yard field goal attempt by Graham Gano is NO GOOD. Holder: Andy Lee.","(0:10) Derek Anderson incomplete pass to the left intended for Greg Olsen defensed by Kwon Alexander.","(0:10) Tampa Bay Buccaneers timeout.","(0:10) Penalty: False Start on Carolina (Mike Remmers) -5 yards.","(0:15) Derek Anderson pass to the right to Greg Olsen for 20 yards to the TB20.","(0:15) Carolina Panthers timeout.","(0:15) Penalty: False Start on Carolina (Andrew Norwell) -5 yards.","(0:30) Derek Anderson pass to the right to Corey Brown for 7 yards to the TB35. Tackled by Jude Adjei-Barimah.","(0:30) Carolina Panthers timeout.","(0:35) Derek Anderson pass to the left to Kelvin Benjamin for 18 yards to the TB42. Tackled by Chris Conte.","(0:35) Carolina Panthers timeout.","(0:39) Derek Anderson pass to the middle to Greg Olsen for 24 yards to the Car40. Tackled by Kwon Alexander.","(0:43) Roberto Aguayo kicks off to the Car-5. Ted Ginn Jr. return for 21 yards to Car16. Tackled by Russell Shepard.","(0:48) Roberto Aguayo 35 yard field goal attempt is GOOD. Holder: Bryan Anger.","(0:54) Jameis Winston incomplete pass to the middle intended for Mike Evans.","(1:02) Jameis Winston incomplete pass to the right intended for Mike Evans.","(1:02) Tampa Bay Buccaneers timeout.","(1:08) Jacquizz Rodgers rush up the middle for 5 yards to the Car17. Tackled by Michael Griffin.","(1:34) Jameis Winston pass to the left to Mike Evans for 17 yards to the Car22. Tackled by Daryl Worley.","(2:00) Jameis Winston pass to the left to Mike Evans for 7 yards to the Car39. Tackled by Daryl Worley.","(2:00) Two Minute Warning.","(2:48) Jameis Winston rush up the middle for 6 yards to the Car46. Tackled by Mario Addison. FUMBLE, recovered by TB (Jameis Winston).","(3:31) Jacquizz Rodgers rush to the right for 2 yards to the TB48. Tackled by Star Lotulelei and A.J. Klein.","(4:05) Jameis Winston pass to the left to Jacquizz Rodgers for 4 yards to the TB46. Tackled by Luke Kuechly.","(4:15) Derek Anderson pass intended for Kelvin Benjamin INTERCEPTED by Daryl Smith defensed by Vernon Hargreaves III and returned for a loss of 5 yards. Tackled by Cameron Artis-Payne.","(4:47) Fozzy Whittaker rush to the left for 7 yards to the Car47. Tackled by Chris Conte.","(5:19) Derek Anderson pass to the left to Kelvin Benjamin for 17 yards to the Car40. Tackled by Bradley McDougald.","(5:24) 33 yard field goal attempt by Roberto Aguayo is NO GOOD. Holder: Bryan Anger.","(5:29) Jameis Winston incomplete pass to the right intended for Vincent Jackson.","(5:29) Tampa Bay Buccaneers timeout.","(5:48) Penalty: Delay of Game on Tampa Bay (Jameis Winston) -5 yards.","(7:01) Penalty: False Start on Tampa Bay (Gosder Cherilus) -5 yards.","(7:01) Jameis Winston pass to the middle to Jacquizz Rodgers for 11 yards to the Car5. Tackled by Thomas Davis.","(7:37) Jacquizz Rodgers rush to the left for a loss of 2 yards to the Car16. Tackled by Lavar Edwards.","(8:17) Jameis Winston pass to the right to Brandon Myers for 12 yards to the Car14. Tackled by Robert McClain.","(8:52) Jacquizz Rodgers rush up the middle for 4 yards to the Car26. Tackled by Michael Griffin.","(9:03) Bryan Anger punts for 48 yards to Car29. Ted Ginn Jr. - no return. FUMBLE, recovered by TB (Russell Shepard). Tackled by Ted Ginn Jr..","(9:09) Jameis Winston incomplete pass to the right intended for Vincent Jackson defensed by Teddy Williams.","(9:50) Peyton Barber rush to the right for 2 yards to the TB23. Tackled by Paul Soliai and Kawann Short.","(10:23) Peyton Barber rush up the middle for 1 yard to the TB21. Tackled by Kony Ealy.","(10:30) Andy Lee punts for 44 yards to TB0. Touchback.","(10:37) Derek Anderson incomplete pass to the left intended for Corey Brown.","(11:20) Cameron Artis-Payne rush up the middle for no gain to the TB44. Tackled by William Gholston.","(11:56) Cameron Artis-Payne rush up the middle for 4 yards to the TB44. Tackled by Lavonte David and John Hughes III.","(12:29) Derek Anderson pass to the left to Kelvin Benjamin for 15 yards to the TB48. Tackled by Vernon Hargreaves III.","(13:06) Derek Anderson pass to the right to Greg Olsen for 10 yards to the Car37. Tackled by Bradley McDougald.","(13:45) Fozzy Whittaker rush to the right for 2 yards to the Car27. Tackled by DaVonte Lambert and Akeem Spence.","(14:21) Derek Anderson pass to the left to Greg Olsen for 8 yards to the Car25. Tackled by Vernon Hargreaves III.","(14:52) Derek Anderson pass to the left to Kelvin Benjamin for 7 yards to the Car17. Tackled by Bradley McDougald.","(15:00) Bryan Anger punts for 39 yards to Car10. No return.","(0:26) Jameis Winston sacked at Car49 for a loss of 8 yards by Kyle Love and Robert McClain.","(0:53) Penalty: False Start on Tampa Bay (Ali Marpet) -5 yards.","(1:34) Jameis Winston pass to the left to Adam Humphries for 11 yards to the Car36. Tackled by Shaq Thompson.","(1:42) Penalty: Offside on Carolina (Lavar Edwards) 5 yards.","(2:26) Peyton Barber rush up the middle for 3 yards to the TB48. Tackled by Thomas Davis and Tre Boston.","(2:48) Penalty: Holding on Tampa Bay (Demar Dotson) -10 yards.","(3:26) Jacquizz Rodgers rush up the middle for 13 yards to the Car45. Tackled by Kurt Coleman.","(4:02) Jacquizz Rodgers rush to the right for 3 yards to the TB42. Tackled by Daryl Worley and Shaq Thompson.","(4:39) Jacquizz Rodgers rush to the left for 11 yards to the TB39. Tackled by Michael Griffin and Kurt Coleman.","(4:47) Andy Lee punts for 38 yards to TB28. No return.","(5:22) Cameron Artis-Payne rush to the left for no gain to the Car34. Tackled by Keith Tandy.","(5:58) Cameron Artis-Payne rush up the middle for 2 yards to the Car34. Tackled by Daryl Smith and Channing Ward.","(6:28) Cameron Artis-Payne rush up the middle for 7 yards to the Car32. Tackled by Channing Ward and Bradley McDougald.","(6:28) Roberto Aguayo kicks off to the endzone. Touchback.","(6:32) Roberto Aguayo 35 yard field goal attempt is GOOD. Holder: Bryan Anger.","(6:38) Jameis Winston incomplete pass to the left intended for Mike Evans.","(7:16) Jameis Winston pass to the middle to Jacquizz Rodgers for 1 yard to the Car17. Tackled by Charles Johnson.","(7:55) Jacquizz Rodgers rush to the left for a loss of 1 yard to the Car18. Tackled by Luke Kuechly and Kyle Love.","(8:42) Jacquizz Rodgers rush to the right for 7 yards to the Car17. Tackled by Robert McClain.","(9:18) Jacquizz Rodgers rush to the left for 6 yards to the Car24. Tackled by Kyle Love.","(9:56) Jameis Winston pass to the right to Vincent Jackson for 17 yards to the Car30. Tackled by Kurt Coleman.","(10:40) Jacquizz Rodgers rush up the middle for no gain to the Car47. Tackled by Paul Soliai.","(11:17) Jameis Winston pass to the left to Alan Cross for 5 yards to the Car47. Tackled by Shaq Thompson.","(11:56) Jacquizz Rodgers rush to the left for 5 yards to the TB48. Tackled by Kurt Coleman.","(12:33) Jacquizz Rodgers rush up the middle for 5 yards to the TB43. Tackled by Shaq Thompson and Luke Kuechly.","(13:11) Jacquizz Rodgers rush to the right for 2 yards to the TB38. Tackled by Kawann Short.","(13:49) Jacquizz Rodgers rush to the left for 5 yards to the TB36. Tackled by Luke Kuechly.","(14:26) Jacquizz Rodgers rush up the middle for 9 yards to the TB31. Tackled by Luke Kuechly and Charles Johnson.","(15:00) Jacquizz Rodgers rush up the middle for a loss of 3 yards to the TB22. Tackled by Kawann Short and Charles Johnson.","(15:00) Graham Gano kicks off to the endzone. Touchback."]