["(0:20) Ryan Tannehill rush up the middle for a loss of 1 yard to the NYJ11.","(1:06) Jay Ajayi rush to the right for 16 yards to the NYJ10. Tackled by Marcus Gilchrist and Darrelle Revis.","(1:06) New York Jets timeout.","(1:11) Jay Ajayi rush to the right for a loss of 1 yard to the NYJ26. Tackled by Leonard Williams.","(1:56) Jay Ajayi rush to the right for 20 yards to the NYJ25. Tackled by Marcus Gilchrist.","(2:00) Penalty: Pass Interference on New York (Julian Stanford) 2 yards.","(2:00) Two Minute Warning.","(2:09) Ryan Tannehill rush to the right for a loss of 2 yards to the NYJ47. Tackled by Darrelle Revis.","(2:54) Jay Ajayi rush up the middle for 9 yards to the NYJ45. Tackled by Julian Stanford.","(3:06) Lachlan Edwards punts for 42 yards to Mia37. Jarvis Landry return for 9 yards to Mia46. Tackled by Juston Burris.","(3:43) Ryan Fitzpatrick sacked at NYJ21 for a loss of 8 yards by Ndamukong Suh.","(4:32) Bilal Powell rush up the middle for 1 yard to the NYJ29. Tackled by Ndamukong Suh.","(5:15) Matt Forte rush up the middle for 3 yards to the NYJ28. Tackled by Kiko Alonso.","(5:15) Andrew Franks kicks off to the endzone. Touchback.","(5:15) Andrew Franks extra point is good.","(5:42) Nick Folk kicks off to the Mia4. Kenyan Drake return for 96 yards for a TOUCHDOWN.","(5:42) Penalty: Offside on New York (Antonio Allen) -5 yards.","(5:42) Nick Folk extra point is good.","(5:42) Penalty: False Start on New York (Ben Ijalana) -5 yards.","(5:47) Ryan Fitzpatrick pass to the right to Jalin Marshall for 18 yards for a TOUCHDOWN.","(5:47) New York Jets timeout.","(5:52) Ryan Fitzpatrick incomplete pass to the left intended for Jalin Marshall.","(6:01)  FUMBLE, recovered by Mia (Matt Darr) and advanced for a loss of 6 yards. Matt Darr rush up the middle for no gain to the Mia17. Tackled by C.J. Spiller. FUMBLE, recovered by Mia (Spencer Paysinger).","(6:08) Ryan Tannehill incomplete pass to the left intended for Dominique Jones defensed by Calvin Pryor.","(6:21) Ryan Tannehill incomplete pass to the right intended for Jakeem Grant.","(7:00) Jay Ajayi rush to the left for 4 yards to the Mia24. Tackled by Muhammad Wilkerson and Steve McLendon.","(7:07) Ryan Fitzpatrick pass intended for Robby Anderson INTERCEPTED by Bobby McCain. No return. Touchback.","(7:51) Matt Forte rush to the right for 2 yards to the Mia11. Tackled by Spencer Paysinger and Ndamukong Suh.","(7:59) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(8:52) Ryan Fitzpatrick pass to the right to Robby Anderson for 27 yards to the Mia13. Tackled by Tony Lippett.","(9:31) Ryan Fitzpatrick pass to the left to Bilal Powell for a loss of 1 yard to the Mia40. Tackled by Bobby McCain.","(10:12) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 25 yards to the Mia39. Tackled by Isa Abdul-Quddus.","(10:18) Penalty: Pass Interference on Miami (Byron Maxwell) 26 yards.","(10:24) Matt Darr punts for 39 yards to NYJ10. No return.","(10:31) Ryan Tannehill incomplete pass to the left intended for Leonte Carroo.","(11:11) Jay Ajayi rush to the right for 6 yards to the NYJ49. Tackled by Jordan Jenkins.","(11:18) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry.","(11:54) Ryan Tannehill pass to the left to Dominique Jones for 17 yards to the Mia45. Tackled by Buster Skrine.","(12:35) Jay Ajayi rush to the right for 1 yard to the Mia28. Tackled by Lorenzo Mauldin.","(12:42) Ryan Tannehill incomplete pass to the left intended for DeVante Parker.","(12:50) Nick Folk kicks off to the Mia0. Kenyan Drake return for 27 yards to Mia27. Tackled by Nick Marshall.","(12:55) Nick Folk 28 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(13:37) Bryce Petty pass to the left to Robby Anderson for 4 yards to the Mia10. Tackled by Michael Thomas.","(14:22) Bilal Powell rush up the middle for no gain to the Mia14. Tackled by Ndamukong Suh.","(15:00) Bilal Powell rush to the right for 3 yards to the Mia14. Tackled by Andre Branch.","(0:47) Bryce Petty pass to the right to Bilal Powell for 15 yards to the Mia17. Tackled by Andre Branch.","(0:55) Penalty: Roughing Passer on Miami (Jordan Phillips) 15 yards.","(1:15) Penalty: Holding on Miami (Michael Thomas) 5 yards.","(2:00) Ryan Fitzpatrick rush to the right for 7 yards to the NYJ48. Tackled by Spencer Paysinger.","(2:05) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(2:42) Ryan Fitzpatrick pass to the left to Brandon Marshall for 13 yards to the NYJ41. Tackled by Byron Maxwell.","(3:18) Matt Forte rush to the left for 5 yards to the NYJ28. Tackled by Bobby McCain.","(3:22) Andrew Franks kicks off to the NYJ9. C.J. Spiller return for 14 yards to NYJ23. Tackled by Michael Thomas.","(3:26) Andrew Franks 29 yard field goal attempt is GOOD. Holder: Matt Darr.","(3:29) Penalty: Illegal Formation on Miami (Laremy Tunsil) -5 yards.","(3:32) Ryan Tannehill incomplete pass to the right intended for Jay Ajayi defensed by Jordan Jenkins.","(3:32) Miami Dolphins timeout.","(4:16) Jay Ajayi rush to the right for 2 yards to the NYJ6. Tackled by Muhammad Wilkerson.","(5:00) Ryan Tannehill pass to the right to MarQueis Gray for 6 yards to the NYJ8. Tackled by David Harris.","(5:08) Ryan Fitzpatrick pass intended for Austin Seferian-Jenkins INTERCEPTED by Jordan Phillips and returned for 17 yards. Tackled by Charone Peake.","(5:08) Andrew Franks kicks off to the endzone. Touchback.","(5:12) Andrew Franks 33 yard field goal attempt is GOOD. Holder: Matt Darr.","(5:16) Ryan Tannehill incomplete pass to the left intended for MarQueis Gray.","(5:59) Damien Williams rush to the right for 5 yards to the NYJ15. Tackled by Sheldon Richardson and David Harris.","(6:03) Ryan Tannehill incomplete pass to the left intended for DeVante Parker defensed by Sheldon Richardson.","(6:48) Jay Ajayi rush up the middle for 12 yards to the NYJ20. Tackled by Marcus Gilchrist and Rontez Miles.","(7:18) Ryan Tannehill pass to the right to MarQueis Gray for 4 yards to the NYJ32. Tackled by Rontez Miles.","(7:47) Jay Ajayi rush to the left for 12 yards to the NYJ36. Tackled by Darryl Roberts.","(8:25) Jay Ajayi rush to the left for 4 yards to the NYJ48. Tackled by Darryl Roberts and Sheldon Richardson.","(8:41) Penalty: Offside on New York (Sheldon Richardson) 5 yards.","(9:19) Ryan Tannehill pass to the left to Jarvis Landry for 14 yards to the Mia43. Tackled by Calvin Pryor.","(10:01) Jay Ajayi rush up the middle for no gain to the Mia29. Tackled by Sheldon Richardson and Muhammad Wilkerson.","(10:08) Lachlan Edwards punts for 35 yards to Mia29. No return.","(10:11) Ryan Fitzpatrick incomplete pass to the middle intended for Matt Forte defensed by Kiko Alonso.","(10:56) Matt Forte rush up the middle for 3 yards to the NYJ36. Tackled by Spencer Paysinger.","(11:31) Matt Forte rush to the left for 6 yards to the NYJ33. Tackled by Cameron Wake.","(11:42) Matt Darr punts for 47 yards to NYJ17. Jalin Marshall return for 10 yards to NYJ27. Tackled by Mike Hull.","(11:53) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry defensed by Marcus Gilchrist.","(12:34) Jay Ajayi rush to the right for a loss of 2 yards to the Mia36. Tackled by Leonard Williams.","(13:19) Jay Ajayi rush to the right for 2 yards to the Mia38. Tackled by Julian Stanford.","(13:55) Ryan Tannehill pass to the right to Kenyan Drake for 6 yards to the Mia36. Tackled by Muhammad Wilkerson.","(14:34) Ryan Tannehill pass to the left to DeVante Parker for 4 yards to the Mia30. Tackled by Buster Skrine.","(15:00) Damien Williams rush to the left for 1 yard to the Mia26. Tackled by Leonard Williams.","(15:00) Nick Folk kicks off to the endzone. Touchback.","(0:30) Ryan Tannehill sacked at Mia44 for a loss of 12 yards by Josh Martin and Lorenzo Mauldin.","(0:30) Miami Dolphins timeout.","(0:36) Ryan Tannehill pass to the left to Damien Williams for 1 yard to the NYJ44. Tackled by Darryl Roberts.","(0:47) Ryan Tannehill pass to the left to Jay Ajayi for 10 yards to the NYJ45. Tackled by Calvin Pryor.","(0:57) Ryan Tannehill pass to the right to Jay Ajayi for 2 yards to the Mia45. Tackled by Darrelle Revis.","(1:19) Ryan Tannehill pass to the right to Jay Ajayi for 7 yards to the Mia43. Tackled by Julian Stanford.","(1:37) Lachlan Edwards punts for 44 yards to Mia43. Jakeem Grant return for 3 yards to Mia46. Penalty: Illegal Block on Miami (Kenyan Drake) -10 yards.","(1:56) Bilal Powell rush to the left for 7 yards to the NYJ13. Tackled by Isa Abdul-Quddus and Byron Maxwell.","(2:00) Ryan Fitzpatrick sacked at NYJ6 for a loss of 8 yards by Cameron Wake. FUMBLE, recovered by NYJ (James Carpenter).","(2:00) Two Minute Warning.","(2:07) Bilal Powell rush to the left for 3 yards to the NYJ14. Tackled by Spencer Paysinger.","(2:18) Matt Darr punts for 34 yards to NYJ11. Jalin Marshall - no return. FUMBLE, recovered by NYJ (Jalin Marshall).","(2:26) Ryan Tannehill incomplete pass to the right intended for Damien Williams.","(3:08) Damien Williams rush to the right for a loss of 1 yard to the NYJ45. Tackled by Sheldon Richardson and Jordan Jenkins.","(3:45) Jay Ajayi rush to the left for 2 yards to the NYJ44. Tackled by Leonard Williams.","(4:12) Ryan Tannehill pass to the left to Kenny Stills for 11 yards to the NYJ46. Tackled by David Harris.","(4:52) Jay Ajayi rush to the right for a loss of 1 yard to the Mia43. Tackled by Sheldon Richardson and Muhammad Wilkerson.","(5:14) Jay Ajayi rush to the left for 1 yard to the Mia29. Tackled by Sheldon Richardson. Penalty: Unnecessary Roughness on New York (Sheldon Richardson) 15 yards.","(5:20) Nick Folk kicks off to the Mia-6. Jakeem Grant return for 34 yards to Mia28. Tackled by Rontez Miles.","(5:23) Nick Folk 21 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(5:27) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa defensed by Ndamukong Suh.","(6:08) Ryan Fitzpatrick pass to the left to Brandon Marshall for 4 yards to the Mia3. Tackled by Byron Maxwell.","(6:44) Ryan Fitzpatrick pass to the left to Bilal Powell for 8 yards to the Mia7. Tackled by Spencer Paysinger.","(7:45) Penalty: False Start on New York (Brian Winters) -5 yards.","(7:45) Matt Forte rush up the middle for 32 yards to the Mia10. Tackled by Isa Abdul-Quddus and Tony Lippett.","(8:28) Matt Forte rush to the right for 4 yards to the Mia42. Tackled by Cameron Wake.","(9:08) Ryan Fitzpatrick rush to the right for 5 yards to the Mia46. Tackled by Donald Butler.","(9:34) Ryan Fitzpatrick pass to the middle to Jalin Marshall for 21 yards to the NYJ49. Tackled by Bobby McCain.","(10:10) Ryan Fitzpatrick pass to the right to Brandon Marshall for 6 yards to the NYJ28. Tackled by Kiko Alonso.","(10:16) Andrew Franks kicks off to the NYJ-1. C.J. Spiller return for 23 yards to NYJ22. Tackled by Mike Hull and Kenyan Drake.","(10:16) Andrew Franks extra point is good.","(10:20) Ryan Tannehill pass to the right to Dominique Jones for 1 yard for a TOUCHDOWN.","(11:21) Ryan Tannehill pass to the right to Jarvis Landry for 8 yards to the NYJ1. Tackled by Marcus Gilchrist.","(12:03) Jay Ajayi rush to the left for no gain to the NYJ9. Tackled by Lorenzo Mauldin.","(12:32) Ryan Tannehill pass to the right to Damien Williams for 19 yards to the NYJ9. Tackled by Mike Catapano.","(13:20) Damien Williams rush to the right for 1 yard to the NYJ28. Tackled by Muhammad Wilkerson.","(13:28) Jarvis Landry incomplete pass to the right intended for MarQueis Gray.","(14:10) Damien Williams rush to the right for 23 yards to the NYJ29. Tackled by Marcus Gilchrist and Darrelle Revis.","(14:18) Ryan Tannehill incomplete pass to the left intended for Jarvis Landry.","(15:00) Jay Ajayi rush to the left for 5 yards to the Mia48. Tackled by David Harris.","(0:02) Jay Ajayi rush to the left for 7 yards to the Mia43. Tackled by Steve McLendon.","(0:35) Ryan Tannehill pass to the left to Jarvis Landry for 11 yards to the Mia36. Tackled by Darryl Roberts.","(0:35) Nick Folk kicks off to the endzone. Touchback.","(0:35) Nick Folk extra point is good.","(0:42) Matt Forte rush to the left for 31 yards for a TOUCHDOWN.","(1:23) Ryan Fitzpatrick pass to the left to Jalin Marshall for 20 yards to the Mia31. Tackled by Isa Abdul-Quddus.","(1:27) Ryan Fitzpatrick incomplete pass to the middle intended for Quincy Enunwa defensed by Kiko Alonso.","(1:54) Penalty: Horse Collar Tackle on Miami (Andre Branch) 14 yards.","(2:41) Ryan Fitzpatrick sacked at NYJ35 for a loss of 6 yards by Cameron Wake. FUMBLE, recovered by NYJ (Breno Giacomini).","(3:26) Matt Forte rush to the left for 4 yards to the NYJ41. Tackled by Kiko Alonso.","(4:04) Ryan Fitzpatrick pass to the right to Robby Anderson for 11 yards to the NYJ37. Tackled by Tony Lippett.","(4:22) Penalty: False Start on New York (Breno Giacomini) -5 yards.","(4:56) Matt Forte rush to the left for 1 yard to the NYJ31. Tackled by Jordan Phillips.","(4:56) Penalty: Encroachment on Miami (Ndamukong Suh) 5 yards.","(4:56) Andrew Franks kicks off to the endzone. Touchback.","(4:56) Andrew Franks extra point is good.","(5:04) Jay Ajayi rush to the left for 20 yards for a TOUCHDOWN.","(5:45) Ryan Tannehill pass to the right to DeVante Parker for 4 yards to the NYJ20. Tackled by David Harris.","(6:34) Jay Ajayi rush up the middle for a loss of 5 yards to the NYJ39. Tackled by Calvin Pryor. Penalty: Taunting on New York (Calvin Pryor) 15 yards.","(6:57) Jay Ajayi rush to the left for a loss of 1 yard to the NYJ49. Tackled by Jordan Jenkins. Penalty: Unnecessary Roughness on New York (Buster Skrine) 15 yards.","(7:13) Penalty: Offside on New York (Leonard Williams) 5 yards.","(7:53) Ryan Tannehill pass to the right to Dominique Jones for 24 yards to the Mia47. Tackled by Darrelle Revis.","(8:26) Jay Ajayi rush to the left for a loss of 2 yards to the Mia23. Tackled by Steve McLendon. FUMBLE, recovered by Mia (Jay Ajayi).","(8:26) Nick Folk kicks off to the endzone. Touchback.","(8:30) Nick Folk 23 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(8:34) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(9:13) Bilal Powell rush to the left for no gain to the Mia5. Tackled by Jelani Jenkins.","(9:47) Ryan Fitzpatrick pass to the right to Brandon Marshall for 8 yards to the Mia5. Tackled by Byron Maxwell.","(10:32) Ryan Fitzpatrick pass to the right to Bilal Powell for 7 yards to the Mia13. Tackled by Jason Jones.","(11:20) Ryan Fitzpatrick pass to the middle to Matt Forte for 5 yards to the Mia20. Tackled by Kiko Alonso.","(11:56) Matt Forte rush to the left for no gain to the Mia25. Tackled by Jelani Jenkins.","(12:37) Ryan Fitzpatrick rush up the middle for 14 yards to the Mia33. Lateral to Bilal Powell for 8 yards to the Mia25. Tackled by Kiko Alonso.","(12:43) Ryan Fitzpatrick incomplete pass to the right intended for Robby Anderson.","(13:28) Matt Forte rush to the left for 1 yard to the Mia47. Tackled by Ndamukong Suh.","(14:08) Ryan Fitzpatrick pass to the middle to Brandon Marshall for 15 yards to the Mia48. Tackled by Bacarri Rambo.","(14:15) Penalty: Pass Interference on Miami (Jelani Jenkins) 5 yards.","(14:56) Ryan Fitzpatrick pass to the right to Robby Anderson for 7 yards to the NYJ32. Tackled by Tony Lippett.","(15:00) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa.","(15:00) Andrew Franks kicks off to the endzone. Touchback."]