["(0:20) Brock Osweiler rush up the middle for a loss of 1 yard to the Hou48.","(0:48) Brock Osweiler rush up the middle for a loss of 2 yards to the Hou49.","(0:49) Cairo Santos onside kickoff to the KC49. Onside kick recovered by receiving team by DeAndre Hopkins.","(0:52) Cairo Santos 30 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(0:57) Alex Smith incomplete pass to the left intended for Jeremy Maclin.","(1:18) Alex Smith pass to the middle to Jeremy Maclin for 13 yards to the Hou12. Tackled by Kareem Jackson and Benardrick McKinney.","(1:18) Penalty: False Start on Kansas City (Zach Fulton) -5 yards.","(1:18) Penalty: False Start on Kansas City (Mitchell Schwartz) -5 yards.","(1:23) Alex Smith incomplete pass to the left intended for Travis Kelce defensed by A.J. Bouye.","(1:28) Alex Smith pass to the left to Jeremy Maclin for 10 yards to the Hou15. Tackled by Kevin Johnson.","(1:32) Penalty: Pass Interference on Houston (Kareem Jackson) 12 yards.","(1:38) Alex Smith pass to the right to Jeremy Maclin for 17 yards to the Hou37.","(2:00) Alex Smith pass to the right to Travis Kelce for 7 yards to the KC46. Tackled by Kareem Jackson.","(2:00) Two Minute Warning.","(2:13) Alex Smith pass to the middle to Spencer Ware for 14 yards to the KC39. Tackled by Benardrick McKinney and Andre Hal.","(2:19) Alex Smith pass to the left to Chris Conley for 10 yards to the KC25. Tackled by Kevin Johnson.","(2:43) Alex Smith pass to the middle to Travis Kelce for 3 yards to the KC15. Tackled by A.J. Bouye.","(2:56) Nick Novak kicks off to the KC-5. Tyreek Hill return for 27 yards to KC22. Penalty: Holding on Kansas City -10 yards.","(3:00) Nick Novak 43 yard field goal attempt is GOOD. Holder: Shane Lechler.","(3:00) Houston Texans timeout.","(3:46) Brock Osweiler pass to the left to DeAndre Hopkins for 16 yards to the KC26. Tackled by Phillip Gaines.","(3:52) Penalty: Illegal Use of Hands on Houston (Xavier Su'a-Filo) -10 yards.","(3:52) Kansas City Chiefs timeout.","(3:58) Alfred Blue rush up the middle for a loss of 1 yard to the KC32. Tackled by Ron Parker.","(3:58) Kansas City Chiefs timeout.","(4:01) Alfred Blue rush to the right for 4 yards to the KC31. Tackled by Derrick Johnson.","(4:09) Brock Osweiler pass to the left to Jonathan Grimes for 13 yards to the KC35. Tackled by Dee Ford.","(4:09) Kansas City Chiefs timeout.","(4:15) Lamar Miller rush up the middle for 1 yard to the KC48. Tackled by Jaye Howard and Frank Zombo.","(4:58) Lamar Miller rush to the right for 3 yards to the KC49. Tackled by Ron Parker and Justin March.","(5:42) Lamar Miller rush up the middle for 6 yards to the Hou48. Tackled by Frank Zombo.","(6:23) Lamar Miller rush to the left for 5 yards to the Hou42. Tackled by Frank Zombo.","(7:02) Brock Osweiler pass to the right to DeAndre Hopkins for 9 yards to the Hou37. Tackled by Marcus Peters and Justin March.","(7:34) Lamar Miller rush to the left for 3 yards to the Hou28. Tackled by Dontari Poe and Justin March.","(7:34) Cairo Santos kicks off to the endzone. Touchback.","(7:38) Cairo Santos 35 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(7:47) Alex Smith incomplete pass to the right intended for Spencer Ware.","(8:18) Alex Smith rush up the middle for 2 yards to the Hou17. Tackled by Jadeveon Clowney.","(8:22) Alex Smith incomplete pass to the left intended for Chris Conley.","(8:46) Alex Smith pass to the middle to Jeremy Maclin for 16 yards to the Hou19. Tackled by Kareem Jackson.","(8:51) Alex Smith incomplete pass to the middle intended for Albert Wilson defensed by Kareem Jackson.","(8:54) Alex Smith incomplete pass to the right intended for Jeremy Maclin.","(9:27) Alex Smith pass to the right to Spencer Ware for 34 yards to the Hou35. Tackled by A.J. Bouye.","(9:34) Nick Novak kicks off to the KC1. Tyreek Hill return for 30 yards to KC31. Tackled by Nick Novak.","(9:37) Nick Novak 31 yard field goal attempt is GOOD. Holder: Shane Lechler.","(9:42) Brock Osweiler incomplete pass to the right intended for Jonathan Grimes defensed by Dee Ford.","(10:19) Lamar Miller rush to the right for a loss of 1 yard to the KC13. Tackled by Marcus Peters and Eric Berry.","(10:50) Lamar Miller rush to the right for 6 yards to the KC12. Tackled by Ron Parker and Derrick Johnson.","(11:29) Brock Osweiler pass to the left to Will Fuller for 14 yards to the KC18. Tackled by Phillip Gaines.","(12:06) Lamar Miller rush up the middle for 1 yard to the KC32. Tackled by Derrick Johnson and Chris Jones.","(12:35) Brock Osweiler pass to the right to DeAndre Hopkins for 6 yards to the KC33. Tackled by Marcus Peters.","(13:11) Lamar Miller rush up the middle for 4 yards to the KC39. Tackled by Frank Zombo.","(13:48) Lamar Miller rush up the middle for 4 yards to the KC43. Tackled by Jaye Howard.","(14:22) Lamar Miller rush to the right for 8 yards to the KC47. Tackled by Derrick Johnson.","(14:56) Lamar Miller rush up the middle for 5 yards to the Hou45. Tackled by Phillip Gaines.","(14:56) Cairo Santos kicks off to the Hou1, out of bounds. No return.","(15:00) Cairo Santos 43 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(0:47) Alex Smith pass to the left to Albert Wilson for 7 yards to the Hou25. Tackled by Benardrick McKinney.","(1:29) Alex Smith pass to the right to Jeremy Maclin for a loss of 1 yard to the Hou32. Tackled by John Simon and Johnathan Joseph.","(2:07) Charcandrick West rush to the right for a loss of 1 yard to the Hou31. Tackled by Max Bullough and Benardrick McKinney.","(2:46) Charcandrick West rush to the left for 21 yards to the Hou30. Tackled by John Simon.","(2:56) Brock Osweiler pass intended for DeAndre Hopkins INTERCEPTED by Marcus Peters and returned for 28 yards. Tackled by Lamar Miller.","(3:43) Brock Osweiler pass to the left to DeAndre Hopkins for 35 yards to the KC36. Tackled by Steven Nelson.","(3:53) Dustin Colquitt punts for 57 yards to Hou28. Tyler Ervin return for 1 yard to Hou29. Tackled by Demarcus Robinson.","(4:37) Charcandrick West rush up the middle for 8 yards to the KC15. Tackled by John Simon.","(4:43) Alex Smith incomplete pass to the middle intended for Charcandrick West.","(4:49) Alex Smith incomplete pass to the left intended for Jeremy Maclin defensed by Kevin Johnson.","(5:20) Penalty: Holding on Kansas City (Travis Kelce) -7 yards.","(5:34) Shane Lechler punts for 46 yards to KC12. Tyreek Hill return for 2 yards to KC14. Tackled by Max Bullough.","(6:12) Brock Osweiler sacked at Hou42 for a loss of 6 yards by Tamba Hali.","(6:18) Brock Osweiler incomplete pass to the left intended for Will Fuller.","(6:54) Lamar Miller rush to the right for 2 yards to the Hou48. Tackled by Jaye Howard.","(7:06) Dustin Colquitt punts for 38 yards to Hou40. Tyler Ervin return for 6 yards to Hou46. Tackled by Tyreek Hill and James O'Shaughnessy.","(7:47) Alex Smith pass to the left to Tyreek Hill for 3 yards to the KC22. Tackled by Benardrick McKinney and J.J. Watt.","(8:32) Alex Smith sacked at KC19 for a loss of 8 yards by Benardrick McKinney.","(8:45) Alex Smith incomplete pass to the left intended for Jeremy Maclin defensed by Johnathan Joseph.","(8:56) Shane Lechler punts for 44 yards to KC24. Tyreek Hill return for 13 yards to KC37. Tackled by Tyler Ervin and Jonathan Grimes. Penalty: Illegal Block on Kansas City (Ross Travis) -10 yards.","(9:34) Jonathan Grimes rush to the left for 8 yards to the Hou32. Tackled by Tamba Hali and Dontari Poe.","(9:40) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by Marcus Peters.","(10:22) Lamar Miller rush to the right for 3 yards to the Hou24. Tackled by Justin March and Dontari Poe.","(10:50) Penalty: Holding on Houston (Jeff Allen) -10 yards.","(11:33) Brock Osweiler pass to the left to Will Fuller for 20 yards to the Hou31. Tackled by Eric Berry and Derrick Johnson.","(12:10) Lamar Miller rush to the right for 4 yards to the Hou11. Tackled by Allen Bailey and Chris Jones.","(12:45) Lamar Miller rush to the left for 1 yard to the Hou7. Tackled by Tamba Hali and Justin March.","(12:56) Dustin Colquitt punts for 56 yards to Hou7. Tyler Ervin return for a loss of 1 yard to Hou6. Tackled by Tyreek Hill.","(13:41) Spencer Ware rush to the left for 1 yard to the KC37. Tackled by Vince Wilfork and Benardrick McKinney.","(14:21) Spencer Ware rush to the right for 1 yard to the KC36. Tackled by J.J. Watt and Vince Wilfork.","(14:55) Spencer Ware rush to the right for 7 yards to the KC35. Tackled by A.J. Bouye and Quintin Demps.","(15:00) Nick Novak kicks off to the KC2. Tyreek Hill return for 26 yards to KC28. Tackled by Kevin Johnson.","(0:03) 57 yard field goal attempt by Nick Novak is NO GOOD. Holder: Shane Lechler.","(0:08) Brock Osweiler incomplete pass to the right intended for Stephen Anderson.","(0:13) Brock Osweiler incomplete pass to the right intended for Jonathan Grimes.","(0:23) Alex Smith sacked at KC44 for no gain by John Simon. FUMBLE, recovered by Hou (Whitney Mercilus) and returned for 5 yards. Tackled by Mitch Morse.","(0:29) Alex Smith incomplete pass to the right intended for Chris Conley.","(0:29) Kansas City Chiefs timeout.","(0:40) Charcandrick West rush up the middle for 28 yards to the KC44. Tackled by Whitney Mercilus.","(0:40) Houston Texans timeout.","(0:47) Alex Smith pass to the right to Albert Wilson for 4 yards to the KC16. Tackled by Kareem Jackson.","(0:55) Penalty: Holding on Kansas City (Eric Fisher) -10 yards.","(1:15) Charcandrick West rush up the middle for 4 yards to the KC22. Tackled by Jadeveon Clowney.","(1:21) Nick Novak kicks off to the KC-4. Knile Davis return for 22 yards to KC18. Tackled by Brennan Scarlett.","(1:24) Nick Novak 24 yard field goal attempt is GOOD. Holder: Shane Lechler.","(1:29) Brock Osweiler incomplete pass to the middle intended for Jaelen Strong defensed by Marcus Peters.","(1:29) Kansas City Chiefs timeout.","(1:35) Lamar Miller rush up the middle for 6 yards to the KC6. Tackled by Ron Parker.","(1:35) Kansas City Chiefs timeout.","(1:40) Lamar Miller rush up the middle for 2 yards to the KC12. Tackled by Jaye Howard.","(2:00) Spencer Ware rush up the middle for 9 yards to the Hou40. Tackled by Quintin Demps. FUMBLE, recovered by Hou (Kevin Johnson) and returned for 53 yards. Tackled by Chris Conley.","(2:00) Two Minute Warning.","(2:16) Alex Smith pass to the right to Jeremy Maclin for 13 yards to the Hou49. Tackled by Johnathan Joseph.","(2:57) Alex Smith pass to the left to Travis Kelce for 8 yards to the KC38. Tackled by Kevin Johnson and Whitney Mercilus.","(2:57) Houston Texans timeout.","(3:33) Spencer Ware rush up the middle for 5 yards to the KC30. Tackled by A.J. Bouye and Whitney Mercilus.","(4:09) Spencer Ware rush to the right for 2 yards to the KC25. Tackled by John Simon and Benardrick McKinney.","(4:16) Nick Novak kicks off to the KC-1. Knile Davis return for 24 yards to KC23. Tackled by Corey Moore.","(4:19) Nick Novak 32 yard field goal attempt is GOOD. Holder: Shane Lechler.","(4:25) Houston Texans timeout.","(4:25) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(5:05) Brock Osweiler pass to the right to Lamar Miller for 5 yards to the KC14. Tackled by Daniel Sorensen.","(5:43) Braxton Miller rush to the right for a loss of 2 yards to the KC19. Tackled by Justin March.","(5:49) Brock Osweiler incomplete pass to the right intended for Will Fuller. Penalty: Taunting on Kansas City (Marcus Peters) 15 yards.","(6:28) Brock Osweiler pass to the middle to Ryan Griffin for 5 yards to the KC32. Tackled by Eric Berry.","(7:09) Brock Osweiler pass to the middle to Lamar Miller for 9 yards to the KC37. Tackled by Frank Zombo.","(7:47) Lamar Miller rush to the right for no gain to the KC46. Tackled by Dee Ford.","(8:23) Alfred Blue rush to the left for 2 yards to the KC46. Tackled by Dontari Poe and Derrick Johnson.","(8:49) Brock Osweiler pass to the right to Stephen Anderson for 7 yards to the KC48. Tackled by Daniel Sorensen.","(9:25) Brock Osweiler pass to the right to Stephen Anderson for 8 yards to the Hou45. Tackled by Marcus Peters and Ron Parker.","(9:56) Alfred Blue rush to the left for 4 yards to the Hou37. Tackled by Derrick Johnson.","(10:23) Brock Osweiler pass to the left to DeAndre Hopkins for 14 yards to the Hou33. Tackled by Phillip Gaines.","(10:59) Alfred Blue rush up the middle for 2 yards to the Hou19. Tackled by Derrick Johnson.","(11:08) Dustin Colquitt punts for 38 yards to Hou17. No return.","(11:47) Alex Smith sacked at KC45 for a loss of 2 yards by J.J. Watt and John Simon.","(11:53) Alex Smith incomplete pass to the middle intended for Demetrius Harris defensed by Andre Hal.","(12:39) Penalty: False Start on Kansas City (Eric Fisher) -5 yards.","(12:39) Charcandrick West rush to the right for 1 yard to the Hou38. Tackled by Johnathan Joseph and Quintin Demps. Penalty: Holding on Kansas City (Zach Fulton) -10 yards.","(13:13) Alex Smith pass to the right to Tyreek Hill for 5 yards to the Hou39. Tackled by Johnathan Joseph.","(13:49) Spencer Ware rush up the middle for 25 yards to the Hou44. Tackled by Andre Hal.","(13:52) Alex Smith incomplete pass to the right intended for Jeremy Maclin.","(14:00) Shane Lechler punts for 49 yards to KC31. No return.","(14:06) Brock Osweiler incomplete pass to the left intended for Braxton Miller.","(14:45) Lamar Miller rush to the right for 5 yards to the Hou20. Tackled by Nick Williams.","(14:50) Brock Osweiler incomplete pass to the middle intended for Ryan Griffin defensed by Ron Parker.","(14:55) Cairo Santos kicks off to the Hou-4. Tyler Ervin return for 19 yards to Hou15. Tackled by Eric Murray.","(15:00) Cairo Santos 53 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(0:21) Alex Smith sacked at Hou36 for a loss of 4 yards by J.J. Watt.","(1:05) Alex Smith pass to the right to Charcandrick West for 2 yards to the Hou32. Tackled by Kareem Jackson.","(1:12) Alex Smith incomplete pass to the left intended for Jeremy Maclin defensed by Johnathan Joseph.","(1:27) Shane Lechler punts for 48 yards to KC34. Tyreek Hill return for 32 yards to Hou34. Tackled by Alfred Blue.","(2:01) Brock Osweiler sacked at Hou18 for a loss of 8 yards by Derrick Johnson.","(2:41) Brock Osweiler pass to the right to Braxton Miller for 3 yards to the Hou26. Tackled by Marcus Peters.","(3:14) Lamar Miller rush to the left for no gain to the Hou23. Tackled by Jaye Howard.","(3:26) Dustin Colquitt punts for 48 yards to Hou17. Tyler Ervin return for 6 yards to Hou23. Tackled by Daniel Sorensen.","(3:31) Alex Smith incomplete pass to the right intended for Jeremy Maclin.","(3:37) Alex Smith incomplete pass to the right intended for Jeremy Maclin.","(4:16) Tyreek Hill rush to the left for a loss of 1 yard to the KC35. Tackled by Jadeveon Clowney.","(4:33) Shane Lechler punts for 62 yards to KC20. Tyreek Hill return for 16 yards to KC36. Tackled by Brian Peters.","(5:05) Lamar Miller rush up the middle for 4 yards to the Hou18. Tackled by Derrick Johnson.","(5:12) Brock Osweiler incomplete pass to the left intended for Will Fuller defensed by Phillip Gaines.","(5:49) Brock Osweiler pass to the left to DeAndre Hopkins for 6 yards to the Hou14. Tackled by Justin March.","(6:12) Penalty: Holding on Houston (C.J. Fiedorowicz) -7 yards.","(6:21) Dustin Colquitt punts for 48 yards to Hou15. No return.","(6:26) Alex Smith incomplete pass to the right intended for Travis Kelce defensed by A.J. Bouye.","(6:35) Penalty: Offside on Houston (Whitney Mercilus) 5 yards.","(7:15) Spencer Ware rush up the middle for 1 yard to the KC32. Tackled by Andre Hal and J.J. Watt.","(7:55) Spencer Ware rush up the middle for 2 yards to the KC31. Tackled by Quintin Demps.","(8:01) Nick Novak kicks off to the KC0. Knile Davis return for 29 yards to KC29. Tackled by Brian Peters.","(8:01) Nick Novak extra point is good.","(8:08) Brock Osweiler pass to the right to DeAndre Hopkins for 27 yards for a TOUCHDOWN.","(8:15) Alex Smith rush up the middle for no gain to the KC44. FUMBLE, recovered by Hou (J.J. Watt). Tackled by Alex Smith.","(8:57) Spencer Ware rush up the middle for 4 yards to the KC44. Tackled by Andre Hal.","(9:01) Alex Smith incomplete pass to the right intended for Jeremy Maclin defensed by Jadeveon Clowney.","(9:40) Alex Smith pass to the middle to Travis Kelce for 11 yards to the KC40. Tackled by Quintin Demps.","(10:14) Alex Smith pass to the left to Chris Conley for 5 yards to the KC29. Tackled by Kareem Jackson.","(10:44) Alex Smith pass to the right to Travis Kelce for 5 yards to the KC24. Tackled by Johnathan Joseph.","(10:55) Brock Osweiler pass intended for Braxton Miller INTERCEPTED by Marcus Peters and returned for 19 yards. Tackled by Lamar Miller.","(11:36) Lamar Miller rush to the left for 1 yard to the KC2. Tackled by Marcus Peters and Dontari Poe.","(11:40) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(12:30) Brock Osweiler pass to the right to Will Fuller for 53 yards to the KC3. Tackled by Eric Berry and Marcus Peters.","(13:12) Lamar Miller rush to the right for 8 yards to the Hou44. Tackled by Justin March and Dee Ford.","(13:48) Brock Osweiler pass to the left to Will Fuller for 17 yards to the Hou36. Tackled by Phillip Gaines.","(14:28) Lamar Miller rush to the right for 2 yards to the Hou19. Tackled by Derrick Johnson.","(14:55) Brock Osweiler pass to the right to C.J. Fiedorowicz for 1 yard to the Hou17. Tackled by Eric Berry.","(15:00) Cairo Santos kicks off to the Hou-4. Tyler Ervin return for 20 yards to Hou16. Tackled by Dezman Moses."]