["(0:38) Kellen Clemens rush up the middle for no gain to the Jax44.","(1:03) Kellen Clemens rush up the middle for a loss of 1 yard to the Jax44.","(1:04) Jason Myers onside kickoff to the Jax48. No return. Penalty: Offside on Jacksonville (Jarrod Wilson) 5 yards.","(1:04) Jason Myers extra point is good.","(1:12) Blake Bortles pass to the middle to Corey Grant for 15 yards for a TOUCHDOWN.","(1:18) Blake Bortles incomplete pass to the right intended for Allen Hurns.","(1:18) San Diego Chargers timeout.","(1:30) Blake Bortles pass to the right to Marqise Lee for 16 yards to the SD15. Tackled by Pierre Desir.","(1:37) Blake Bortles incomplete pass to the left intended for Arrelious Benn defensed by Pierre Desir.","(1:58) Blake Bortles pass to the right to Marqise Lee for 17 yards to the SD31. Tackled by Dexter McCoil.","(1:58) Two Minute Warning.","(2:01) Blake Bortles incomplete pass to the middle intended for Julius Thomas.","(2:31) Blake Bortles rush up the middle for 7 yards to the SD48. Tackled by Craig Mager.","(3:09) Blake Bortles pass to the left to T.J. Yeldon for a loss of 4 yards to the Jax45. Tackled by Craig Mager.","(3:34) Blake Bortles pass to the right to Arrelious Benn for 9 yards to the Jax49. Tackled by Jatavis Brown.","(3:41) Drew Kaser punts for 30 yards to SD50. No return. Penalty: Holding on Jacksonville (Dan Skuta) -10 yards.","(3:50) Kellen Clemens incomplete pass to the right intended for Tyrell Williams.","(3:52) Penalty: Delay of Game on San Diego (Kellen Clemens) -5 yards.","(4:39) Kenneth Farrow rush up the middle for 4 yards to the SD25. Tackled by Hayes Pullard III.","(4:39) Jacksonville Jaguars timeout.","(4:48) Kenneth Farrow rush up the middle for 4 yards to the SD21. Tackled by Jalen Ramsey and Hayes Pullard III.","(4:52) Blake Bortles incomplete pass to the left intended for Allen Hurns defensed by Dexter McCoil.","(5:01) Blake Bortles incomplete pass to the left intended for Denard Robinson defensed by Jatavis Brown.","(5:27) Blake Bortles pass to the left to Denard Robinson for 7 yards to the SD17. Tackled by Dwight Lowery.","(5:32) Blake Bortles incomplete pass to the right intended for Rashad Greene defensed by Brandon Flowers.","(6:10) Blake Bortles pass to the left to Allen Robinson for 35 yards to the SD24. Tackled by Dwight Lowery.","(6:33) Denard Robinson rush up the middle for 7 yards to the Jax41. Tackled by Denzel Perryman.","(7:00) Blake Bortles pass to the left to Allen Robinson for 9 yards to the Jax34. Tackled by Dwight Lowery and Jason Verrett.","(7:00) Josh Lambo kicks off to the endzone. Touchback.","(7:04) Josh Lambo 25 yard field goal attempt is GOOD. Holder: Drew Kaser.","(7:09) Philip Rivers incomplete pass to the left intended for Dontrelle Inman.","(7:16) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(7:59) Melvin Gordon rush to the right for no gain to the Jax7. Tackled by Dante Fowler Jr. and Johnathan Cyprien.","(8:40) Philip Rivers pass to the right to Tyrell Williams for 5 yards to the Jax7. Tackled by Johnathan Cyprien.","(9:26) Kenneth Farrow rush to the right for 4 yards to the Jax12. Tackled by Davon House and Malik Jackson.","(10:06) Melvin Gordon rush up the middle for 3 yards to the Jax16. Tackled by Myles Jack.","(10:47) Philip Rivers pass to the middle to Melvin Gordon for 11 yards to the Jax19. Tackled by Myles Jack.","(11:26) Kenneth Farrow rush to the left for 1 yard to the Jax30. Tackled by Dante Fowler Jr..","(12:03) Melvin Gordon rush to the left for 11 yards to the Jax31. Tackled by Telvin Smith.","(12:09) Penalty: Holding on Jacksonville (Johnathan Cyprien) 5 yards.","(12:52) Melvin Gordon rush to the left for a loss of 4 yards to the Jax47. Tackled by Sheldon Day.","(12:54) Jason Myers onside kickoff to the Jax43. Onside kick recovered by receiving team by Dontrelle Inman.","(12:54) Jason Myers extra point is good.","(12:59) Blake Bortles pass to the left to Marcedes Lewis for 4 yards for a TOUCHDOWN.","(13:42) Blake Bortles pass to the left to Allen Hurns for 5 yards to the SD4. Tackled by Jatavis Brown.","(14:27) Blake Bortles pass to the left to Marqise Lee for 14 yards to the SD9. Tackled by Jahleel Addae.","(14:55) Blake Bortles pass to the right to Allen Hurns for 7 yards to the SD23. Tackled by Brandon Flowers.","(15:00) Blake Bortles incomplete pass to the left intended for Allen Hurns defensed by Caraun Reid.","(0:11) Blake Bortles pass to the left to T.J. Yeldon for a loss of 1 yard to the SD30. Tackled by Caraun Reid and Manti Te'o.","(0:38) Blake Bortles pass to the left to Allen Robinson for 10 yards to the SD29. Tackled by Caraun Reid and Brandon Flowers.","(0:43) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(1:24) Blake Bortles rush to the left for 24 yards to the SD39. Tackled by Dwight Lowery.","(2:03) Blake Bortles rush to the right for 3 yards to the Jax37. Tackled by Brandon Flowers.","(2:09) Blake Bortles incomplete pass to the right intended for Julius Thomas defensed by Dwight Lowery.","(2:47) Blake Bortles pass to the right to Allen Hurns for 9 yards to the Jax34. Tackled by Jason Verrett.","(2:48) Josh Lambo kicks off to the endzone. Touchback.","(2:48) Josh Lambo extra point is good.","(2:57) Philip Rivers pass to the right to Travis Benjamin for 45 yards for a TOUCHDOWN.","(3:41) Melvin Gordon rush to the right for 2 yards to the Jax45. Tackled by Roy Miller III and Abry Jones.","(4:10) Penalty: Offside on Jacksonville (Jared Odrick) 5 yards. Penalty: Unsports. Conduct on Jacksonville (Jared Odrick) 15 yards.","(4:55) Philip Rivers rush up the middle for 10 yards to the SD33. Tackled by Paul Posluszny.","(4:59) Philip Rivers incomplete pass to the left intended for Tyrell Williams.","(5:38) Melvin Gordon rush up the middle for 5 yards to the SD23. Tackled by Davon House and Telvin Smith.","(5:38) San Diego Chargers timeout.","(6:24) Melvin Gordon rush up the middle for 3 yards to the SD18. Tackled by Johnathan Cyprien.","(7:06) Melvin Gordon rush up the middle for 8 yards to the SD15. Tackled by Davon House.","(7:16) Brad Nortman punts for 41 yards to SD7. No return.","(7:22) Blake Bortles incomplete pass to the middle intended for Allen Hurns defensed by Jahleel Addae.","(7:27) Blake Bortles incomplete pass to the left defensed by Tourek Williams.","(7:33) Blake Bortles incomplete pass to the right intended for Allen Hurns defensed by Jason Verrett.","(7:52) Blake Bortles pass to the left to Allen Hurns for 24 yards to the SD48.","(7:58) Drew Kaser punts for 39 yards to Jax28. No return.","(8:28) Philip Rivers sacked at SD33 for a loss of 6 yards by Dante Fowler Jr..","(8:33) Philip Rivers incomplete pass to the left intended for Kenneth Farrow.","(9:11) Philip Rivers pass to the right to Travis Benjamin for 1 yard to the SD39. Tackled by Dwayne Gratz.","(9:39) Melvin Gordon rush to the left for 19 yards to the SD38. Tackled by Tashaun Gipson.","(9:52) Brad Nortman punts for 56 yards to SD7. Travis Benjamin return for 12 yards to SD19. Tackled by Ben Koyack.","(9:58) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(10:02) Blake Bortles incomplete pass to the left intended for T.J. Yeldon.","(10:02) Penalty: False Start on Jacksonville (Luke Joeckel) -5 yards.","(10:07) Blake Bortles incomplete pass to the right intended for Marcedes Lewis defensed by Denzel Perryman.","(10:45) Blake Bortles pass to the left to Julius Thomas for 17 yards to the Jax42. Tackled by Manti Te'o.","(10:54) Josh Lambo kicks off to the Jax2. Corey Grant return for 23 yards to Jax25. Tackled by Casey Hayward.","(10:54) Josh Lambo extra point is good.","(11:06) Philip Rivers pass to the right to Tyrell Williams for 44 yards for a TOUCHDOWN.","(11:06) San Diego Chargers timeout.","(11:40) Travis Benjamin rush to the left for a loss of 1 yard to the Jax44. Tackled by Jalen Ramsey.","(12:21) Melvin Gordon rush up the middle for a loss of 1 yard to the Jax43. Tackled by Telvin Smith.","(12:27) Penalty: Pass Interference on Jacksonville (Davon House) 13 yards.","(12:35) Brad Nortman punts for 39 yards to SD36. Travis Benjamin return for 9 yards to SD45. Tackled by Neal Sterling.","(13:13) Blake Bortles pass to the right to T.J. Yeldon for 8 yards to the Jax25. Tackled by Jatavis Brown.","(13:39) Penalty: Holding on Jacksonville (Luke Joeckel) -10 yards.","(14:17) T.J. Yeldon rush up the middle for 2 yards to the Jax27. Tackled by Kyle Emanuel.","(14:55) T.J. Yeldon rush to the right for 1 yard to the Jax25. Tackled by Denzel Perryman.","(15:00) Josh Lambo kicks off to the Jax4. Corey Grant return for 20 yards to Jax24. Tackled by Darrell Stuckey and Jatavis Brown.","(0:09) Blake Bortles pass to the right to T.J. Yeldon for a loss of 4 yards to the SD48. Tackled by Jahleel Addae.","(0:09) San Diego Chargers timeout.","(0:09) Jacksonville Jaguars timeout.","(0:16) Blake Bortles sacked at SD44 for a loss of 6 yards by Melvin Ingram.","(0:16) San Diego Chargers timeout.","(0:26) Blake Bortles pass to the left to Marqise Lee for 22 yards to the SD38. Tackled by Casey Hayward.","(0:26) Jacksonville Jaguars timeout.","(0:33) Blake Bortles pass to the left to Julius Thomas for 24 yards to the Jax40. Tackled by Casey Hayward and Jatavis Brown.","(0:51) Blake Bortles pass to the left to Julius Thomas for 8 yards to the Jax16. Tackled by Jahleel Addae.","(1:06) Drew Kaser punts for 56 yards to Jax15. Rashad Greene return for 1 yard to Jax16. Tackled by Jerry Attaochu. Penalty: Holding on Jacksonville (Josh Johnson) -8 yards.","(1:06) Jacksonville Jaguars timeout.","(1:12) Melvin Gordon rush up the middle for 1 yard to the SD29. Tackled by Yannick Ngakoue.","(2:00) Philip Rivers pass to the left to Melvin Gordon for 3 yards to the SD28. Tackled by Jalen Ramsey.","(2:00) Two Minute Warning.","(2:46) Philip Rivers sacked at SD25 for a loss of 6 yards by Dante Fowler Jr..","(3:01) Blake Bortles pass intended for Rashad Greene INTERCEPTED by Casey Hayward and returned for 31 yards. Tackled by A.J. Cann.","(3:31) Blake Bortles pass to the middle to Julius Thomas for 22 yards to the SD39. Tackled by Dwight Lowery.","(3:58) Blake Bortles pass to the left to T.J. Yeldon for 7 yards to the Jax39. Tackled by Jahleel Addae.","(4:31) T.J. Yeldon rush to the left for 5 yards to the Jax32. Tackled by Brandon Flowers.","(5:08) Blake Bortles pass to the middle to T.J. Yeldon for 7 yards to the Jax27. Tackled by Denzel Perryman.","(5:13) Penalty: Pass Interference on San Diego (Denzel Perryman) 14 yards.","(5:22) Philip Rivers sacked at Jax6 for a loss of 1 yard by Yannick Ngakoue. FUMBLE, recovered by Jax (Johnathan Cyprien). Tackled by Dontrelle Inman.","(5:26) Philip Rivers incomplete pass to the middle intended for Tyrell Williams.","(5:26) Penalty: False Start on San Diego (Sean McGrath) -4 yards.","(5:33) Penalty: Holding on Jacksonville (Hayes Pullard III) 0 yards.","(5:52) Penalty: Offside on Jacksonville (Jared Odrick) 0 yards.","(6:45) Melvin Gordon rush up the middle for 2 yards to the Jax1. Tackled by Johnathan Cyprien and Dante Fowler Jr..","(7:29) Melvin Gordon rush up the middle for 8 yards to the Jax3. Tackled by Johnathan Cyprien and Paul Posluszny.","(8:18) Melvin Gordon rush up the middle for 3 yards to the Jax11. Tackled by Roy Miller III and Yannick Ngakoue.","(8:49) Philip Rivers pass to the left to Melvin Gordon for 4 yards to the Jax14. Tackled by Paul Posluszny.","(9:00) Blake Bortles sacked at Jax18 for a loss of 4 yards by Melvin Ingram. FUMBLE, recovered by SD (Corey Liuget). Tackled by Jermey Parnell.","(9:40) Blake Bortles pass to the right to Rashad Greene for 7 yards to the Jax22. Tackled by Brandon Flowers.","(9:46) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(9:54) Penalty: Holding on Jacksonville (Jermey Parnell) -10 yards.","(9:54) Josh Lambo kicks off to the endzone. Touchback.","(9:54) Josh Lambo extra point is good.","(9:58) Philip Rivers pass to the left to Antonio Gates for 2 yards for a TOUCHDOWN.","(10:21) Penalty: Offside on Jacksonville (Sen'Derrick Marks) 2 yards.","(10:45) Philip Rivers pass to the right to Dontrelle Inman for 7 yards to the Jax4. Tackled by Dwayne Gratz and Telvin Smith.","(10:50) Philip Rivers incomplete pass to the left intended for Antonio Gates.","(11:32) Melvin Gordon rush up the middle for 2 yards to the Jax11. Tackled by Dante Fowler Jr..","(12:05) Philip Rivers pass to the right to Travis Benjamin for 43 yards to the Jax13. Tackled by Tashaun Gipson.","(12:11) 54 yard field goal attempt by Jason Myers is NO GOOD. Holder: Brad Nortman.","(12:50) Blake Bortles pass to the left to T.J. Yeldon for a loss of 1 yard to the SD36. Tackled by Jatavis Brown and Manti Te'o.","(12:50) San Diego Chargers timeout.","(13:30) Blake Bortles pass to the left to Marqise Lee for 6 yards to the SD35. Tackled by Dwight Lowery and Brandon Flowers.","(13:37) Blake Bortles incomplete pass to the middle intended for Julius Thomas.","(14:21) T.J. Yeldon rush to the right for 15 yards to the SD41. Tackled by Melvin Ingram.","(14:54) Blake Bortles pass to the left to Allen Hurns for 19 yards to the Jax44. Tackled by Dwight Lowery.","(14:54) Josh Lambo kicks off to the endzone. Touchback.","(14:54) Josh Lambo extra point is good.","(15:00) Philip Rivers pass to the left to Travis Benjamin for 6 yards for a TOUCHDOWN.","(0:22) Philip Rivers pass to the right to Tyrell Williams for 12 yards to the Jax6. Tackled by Jalen Ramsey.","(1:06) Melvin Gordon rush up the middle for a loss of 1 yard to the Jax18. Tackled by Telvin Smith.","(1:40) Melvin Gordon rush to the right for 4 yards to the Jax17. Tackled by Paul Posluszny.","(2:15) Philip Rivers pass to the right to Antonio Gates for 7 yards to the Jax21. Tackled by Paul Posluszny and Davon House.","(2:55) Philip Rivers pass to the right to Danny Woodhead for 4 yards to the Jax28. Tackled by Telvin Smith.","(3:28) Melvin Gordon rush to the right for 2 yards to the Jax32. Tackled by Paul Posluszny and Davon House.","(3:40) Blake Bortles pass intended for Marqise Lee INTERCEPTED by Casey Hayward and returned for a loss of 2 yards. Tackled by Marqise Lee.","(4:25) T.J. Yeldon rush to the left for 2 yards to the Jax20. Tackled by Corey Liuget and Denzel Perryman.","(5:04) T.J. Yeldon rush to the right for 4 yards to the Jax18. Tackled by Casey Hayward.","(5:16) Drew Kaser punts for 48 yards to Jax6. Rashad Greene return for 8 yards to Jax14. Tackled by Craig Mager.","(5:24) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(6:05) Melvin Gordon rush to the right for a loss of 2 yards to the SD46. Tackled by Roy Miller III.","(6:43) Melvin Gordon rush to the left for 4 yards to the SD48. Tackled by Jalen Ramsey and Paul Posluszny.","(7:20) Danny Woodhead rush up the middle for 2 yards to the SD44. Tackled by Malik Jackson and Paul Posluszny.","(8:04) Philip Rivers pass to the right to Travis Benjamin for 9 yards to the SD42. Tackled by Johnathan Cyprien.","(8:16) Brad Nortman punts for 43 yards to SD33. No return.","(8:55) Blake Bortles pass to the middle to Marcedes Lewis for 13 yards to the Jax24. Tackled by Jahleel Addae and Dwight Lowery.","(9:38) Blake Bortles pass to the right to T.J. Yeldon for a loss of 2 yards to the Jax11. Tackled by Brandon Flowers.","(10:09) T.J. Yeldon rush up the middle for a loss of 1 yard to the Jax13. Tackled by Jahleel Addae and Manti Te'o.","(10:09) Penalty: False Start on Jacksonville (Julius Thomas) -5 yards.","(10:14) Josh Lambo kicks off to the Jax-5. Corey Grant return for 24 yards to Jax19. Tackled by Joshua Perry.","(10:14) Josh Lambo extra point is good.","(10:17) Melvin Gordon rush up the middle for 3 yards for a TOUCHDOWN.","(11:07) Danny Woodhead rush to the right for 23 yards to the Jax3. Tackled by Paul Posluszny.","(11:52) Melvin Gordon rush to the right for 21 yards to the Jax26. Tackled by Tashaun Gipson and Johnathan Cyprien.","(12:30) Danny Woodhead rush to the right for 2 yards to the Jax47. Tackled by Telvin Smith.","(13:02) Philip Rivers pass to the left to Travis Benjamin for 11 yards to the Jax49. Tackled by Jalen Ramsey.","(13:40) Melvin Gordon rush up the middle for 7 yards to the SD40. Tackled by Telvin Smith.","(14:25) Philip Rivers pass to the middle to Antonio Gates for 6 yards to the SD33. Tackled by Telvin Smith and Paul Posluszny.","(15:00) Melvin Gordon rush to the right for 2 yards to the SD27. Tackled by Roy Miller III and Paul Posluszny.","(15:00) Jason Myers kicks off to the endzone. Touchback."]