["(0:40) Case Keenum rush up the middle for a loss of 1 yard to the LA42.","(0:40) Seattle Seahawks timeout.","(0:45) Case Keenum rush up the middle for a loss of 1 yard to the LA28. Penalty: Unnecessary Roughness on Seattle (Michael Bennett) 15 yards.","(0:57) Russell Wilson pass to the right to Christine Michael for 6 yards to the LA29. Tackled by Alec Ogletree. FUMBLE, recovered by LA (Alec Ogletree). Tackled by J'Marcus Webb.","(1:27) Russell Wilson pass to the right to Doug Baldwin for 5 yards to the LA35. Tackled by Mark Barron.","(1:27) Penalty: False Start on Seattle (Jimmy Graham) -5 yards.","(1:33) Russell Wilson incomplete pass to the right intended for Christine Michael.","(1:33) Los Angeles Rams timeout.","(1:53) Russell Wilson pass to the left to Tyler Lockett for 53 yards to the LA35. Tackled by Troy Hill.","(2:00) Johnny Hekker punts for 30 yards to Sea12. No return.","(2:00) Two Minute Warning.","(2:11) Case Keenum pass to the left to Lance Kendricks for 5 yards to the Sea42. Tackled by K.J. Wright.","(2:18) Todd Gurley rush to the left for a loss of 4 yards to the Sea47. Tackled by Tony McDaniel.","(2:18) Seattle Seahawks timeout.","(2:33) Todd Gurley rush up the middle for 4 yards to the Sea43. Tackled by Kam Chancellor.","(2:39) Penalty: Face Mask on Seattle (Cassius Marsh) 15 yards.","(2:44) Case Keenum incomplete pass to the middle defensed by Tony McDaniel.","(3:24) Todd Gurley rush to the right for 2 yards to the LA38. Tackled by K.J. Wright.","(4:03) Penalty: Too Many Men on Field on Los Angeles -5 yards.","(4:03) Case Keenum pass to the right to Kenny Britt for 11 yards to the LA41. Tackled by Deshawn Shead.","(4:44) Todd Gurley rush to the right for no gain to the LA30. Tackled by Ahtyba Rubin.","(5:24) Todd Gurley rush to the left for 2 yards to the LA30. Tackled by Deshawn Shead.","(5:52) Case Keenum pass to the left to Kenny Britt for 18 yards to the LA28. Tackled by Earl Thomas.","(6:31) Todd Gurley rush to the right for a loss of 1 yard to the LA10. Tackled by Michael Bennett.","(6:41) Jon Ryan punts for 40 yards to LA21. Tavon Austin - no return. Tackled by Steven Terrell. Penalty: Holding on Los Angeles (Cory Harkey) -10 yards.","(6:47) Russell Wilson incomplete pass to the right intended for Doug Baldwin defensed by Lamarcus Joyner.","(6:51) Russell Wilson incomplete pass to the right intended for Doug Baldwin.","(6:58) Russell Wilson incomplete pass to the left intended for Paul Richardson.","(7:24) Russell Wilson pass to the left to Paul Richardson for 13 yards to the Sea39. Tackled by Troy Hill.","(7:46) Russell Wilson pass to the left to Christine Michael for 13 yards to the Sea26. Tackled by Mark Barron.","(8:14) Penalty: Pass Interference on Seattle (Jermaine Kearse) -10 yards.","(8:41) Russell Wilson pass to the left to Jimmy Graham for 16 yards to the Sea23. Tackled by Lamarcus Joyner and Maurice Alexander.","(9:14) Christine Michael rush to the left for a loss of 2 yards to the Sea7. Tackled by Lamarcus Joyner.","(9:21) Johnny Hekker punts for 37 yards to Sea9. No return.","(9:34) Penalty: Delay of Game on Los Angeles (Johnny Hekker) -5 yards.","(10:24) Case Keenum sacked at Sea41 for a loss of 1 yard by Frank Clark.","(11:02) Case Keenum pass to the left to Tavon Austin for 2 yards to the Sea40. Tackled by K.J. Wright.","(11:44) Case Keenum sacked at Sea42 for a loss of 9 yards by Michael Bennett.","(12:26) Todd Gurley rush to the left for 11 yards to the Sea33. Tackled by Earl Thomas and K.J. Wright.","(12:33) Penalty: Pass Interference on Seattle (Kam Chancellor) 24 yards.","(12:41) Los Angeles Rams timeout.","(12:41) Case Keenum incomplete pass to the left intended for Lance Kendricks.","(12:54) Jon Ryan punts for 39 yards to LA32. Tavon Austin - no return. Tackled by Deshawn Shead.","(13:33) Russell Wilson rush to the left for 2 yards to the Sea29. Tackled by Alec Ogletree.","(13:39) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(14:10) Russell Wilson pass to the left to Jermaine Kearse for 2 yards to the Sea27. Tackled by Lamarcus Joyner.","(14:10) Greg Zuerlein kicks off to the endzone. Touchback.","(14:15) Greg Zuerlein 47 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(14:15) Penalty: False Start on Los Angeles (Rodger Saffold) -5 yards.","(14:20) Case Keenum incomplete pass to the left intended for Benny Cunningham.","(15:00) Case Keenum rush up the middle for 7 yards to the Sea24. Tackled by Bobby Wagner.","(0:29) Tavon Austin rush to the left for a loss of 2 yards to the Sea31. Tackled by K.J. Wright.","(1:00) Case Keenum pass to the left to Kenny Britt for 18 yards to the Sea29.","(1:00) Seattle Seahawks timeout.","(1:33) Todd Gurley rush up the middle for 1 yard to the Sea47. Tackled by Frank Clark.","(2:15) Case Keenum pass to the left to Brian Quick for 8 yards to the Sea48. Tackled by Richard Sherman.","(2:56) Todd Gurley rush to the right for 4 yards to the LA44. Tackled by K.J. Wright and Richard Sherman.","(3:38) Case Keenum pass to the left to Tavon Austin for 27 yards to the LA40. Tackled by Kam Chancellor.","(3:47) Jon Ryan punts for 51 yards to LA13. No return.","(3:55) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(4:40) Alex Collins rush to the right for no gain to the Sea36. Tackled by Eugene Sims and Dominique Easley.","(5:18) Alex Collins rush to the right for no gain to the Sea36. Tackled by Alec Ogletree.","(5:47) Christine Michael rush to the right for 16 yards to the Sea36. Tackled by Alec Ogletree.","(6:20) Christine Michael rush to the left for 10 yards to the Sea20. Tackled by T.J. McDonald.","(6:28) Johnny Hekker punts for 40 yards to Sea10. No return.","(7:08) Case Keenum sacked at LA50 for a loss of 10 yards by Frank Clark.","(7:51) Benny Cunningham rush up the middle for 2 yards to the Sea40. Tackled by Kam Chancellor.","(8:34) Todd Gurley rush up the middle for 1 yard to the Sea42. Tackled by Jarran Reed and Bobby Wagner.","(9:12) Todd Gurley rush up the middle for 4 yards to the Sea43. Tackled by K.J. Wright.","(9:20) Case Keenum incomplete pass to the right intended for Kenny Britt.","(9:52) Todd Gurley rush to the left for 9 yards to the Sea47. Tackled by K.J. Wright.","(10:21) Case Keenum pass to the left to Kenny Britt for 36 yards to the LA44.","(10:52) Todd Gurley rush to the left for 3 yards to the LA8. Tackled by Jarran Reed.","(11:03)  FUMBLE, recovered by Sea (Jon Ryan). Jon Ryan punts for 45 yards to LA5. No return.","(11:44) Russell Wilson rush up the middle for 8 yards to the Sea50. Tackled by Mark Barron.","(12:26) Russell Wilson pass to the right to Luke Willson for 6 yards to the Sea42. Tackled by Trumaine Johnson.","(13:12) Russell Wilson sacked at Sea36 for a loss of 8 yards by William Hayes.","(13:47) Christine Michael rush to the right for 11 yards to the Sea44. Tackled by Trumaine Johnson.","(14:28) Christine Michael rush up the middle for 3 yards to the Sea33. Tackled by Robert Quinn and Alec Ogletree.","(15:00) Christine Michael rush to the left for 5 yards to the Sea30. Tackled by Alec Ogletree.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback.","(0:09) Russell Wilson sacked at Sea50 for a loss of 7 yards by Robert Quinn. FUMBLE, recovered by Sea and advanced for a loss of 1 yard.","(0:14) Russell Wilson incomplete pass to the left intended for Jimmy Graham.","(0:14) Seattle Seahawks timeout.","(0:19) Russell Wilson pass to the left to Paul Richardson for 8 yards to the LA43. Tackled by Troy Hill.","(0:23) Russell Wilson incomplete pass to the left intended for Paul Richardson defensed by Mark Barron.","(0:23) Seattle Seahawks timeout.","(0:28) Russell Wilson pass to the middle to Jermaine Kearse for 9 yards to the Sea49. Tackled by Maurice Alexander and William Hayes.","(0:29) Seattle Seahawks timeout.","(0:33) Russell Wilson pass to the left to Jimmy Graham for 17 yards to the Sea40. Tackled by Cody Davis.","(1:01) Russell Wilson pass to the left to Jimmy Graham for 9 yards to the Sea23. Tackled by Mark Barron.","(1:04) Greg Zuerlein kicks off to the Sea-6. Paul Richardson return for 20 yards to Sea14. Tackled by Benny Cunningham.","(1:08) Greg Zuerlein 28 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(1:13) Case Keenum incomplete pass to the right intended for Kenny Britt.","(1:18) Case Keenum pass to the right to Tavon Austin for a loss of 2 yards to the Sea10. Tackled by Richard Sherman.","(2:00) Todd Gurley rush up the middle for a loss of 4 yards to the Sea8. Tackled by Michael Bennett.","(2:00) Two Minute Warning.","(2:19) Case Keenum pass to the left to Lance Kendricks for 44 yards to the Sea4. Tackled by Mike Morgan.","(2:56) Todd Gurley rush to the left for 8 yards to the Sea48. Tackled by Ahtyba Rubin.","(3:31) Todd Gurley rush up the middle for 5 yards to the LA44. Tackled by Bobby Wagner.","(4:13) Case Keenum pass to the left to Todd Gurley for 19 yards to the LA39. Tackled by Earl Thomas.","(4:19) Case Keenum incomplete pass to the right intended for Tavon Austin.","(4:28) Jon Ryan punts for 50 yards to LA0. Touchback.","(4:34) Russell Wilson incomplete pass to the left intended for Jermaine Kearse defensed by Alec Ogletree.","(5:09) Russell Wilson pass to the left to Thomas Rawls for 2 yards to the Sea50. Tackled by Mark Barron.","(5:55) Thomas Rawls rush up the middle for a loss of 1 yard to the Sea48. Tackled by Dominique Easley.","(6:31) Russell Wilson pass to the right to Paul Richardson for 14 yards to the Sea49. Tackled by Maurice Alexander.","(6:36) Russell Wilson incomplete pass to the left intended for Jermaine Kearse.","(7:17) Thomas Rawls rush to the left for no gain to the Sea35. Tackled by Lamarcus Joyner.","(7:35) Penalty: Pass Interference on Los Angeles (Troy Hill) 18 yards.","(8:20) Thomas Rawls rush up the middle for 1 yard to the Sea17. Tackled by Aaron Donald.","(8:55) Thomas Rawls rush up the middle for 4 yards to the Sea16. Tackled by Eugene Sims.","(9:02) Johnny Hekker punts for 41 yards to Sea12. No return.","(9:42) Case Keenum pass to the middle to Tavon Austin for 6 yards to the LA47. Tackled by Bobby Wagner.","(9:46) Case Keenum incomplete pass to the left intended for Tavon Austin.","(10:23) Todd Gurley rush up the middle for 3 yards to the LA41. Tackled by Bobby Wagner.","(10:34) Jon Ryan punts for 44 yards to LA23. Tavon Austin return for 15 yards to LA38. Tackled by Tyvis Powell.","(10:44) Russell Wilson incomplete pass to the left intended for Paul Richardson defensed by Troy Hill.","(11:35) Christine Michael rush up the middle for 12 yards to the Sea33. Tackled by Mark Barron.","(12:13) Russell Wilson rush up the middle for 1 yard to the Sea21. Tackled by Alec Ogletree.","(12:40) Penalty: Pass Interference on Seattle (Tyler Lockett) -10 yards.","(13:08) Russell Wilson pass to the left to Doug Baldwin for 8 yards to the Sea30. Tackled by Trumaine Johnson.","(13:43) Christine Michael rush to the right for 3 yards to the Sea22. Tackled by Mark Barron and Dominique Easley.","(13:51) Johnny Hekker punts for 52 yards to Sea19. No return.","(13:57) Case Keenum incomplete pass to the left intended for Kenny Britt.","(14:38) Todd Gurley rush up the middle for 4 yards to the LA29. Tackled by Kam Chancellor.","(14:45) Case Keenum incomplete pass to the right intended for Kenny Britt.","(14:45) Steven Hauschka kicks off to the endzone. Touchback.","(14:48) Steven Hauschka 23 yard field goal attempt is GOOD. Holder: Jon Ryan.","(14:54) Russell Wilson incomplete pass to the left intended for Jermaine Kearse defensed by Lamarcus Joyner.","(15:00) Russell Wilson incomplete pass to the right intended for Will Tukuafu.","(0:05) Christine Michael rush to the right for a loss of 1 yard to the LA5. Tackled by Alec Ogletree.","(0:35) Russell Wilson pass to the right to Tyler Lockett for 4 yards to the LA9. Tackled by Trumaine Johnson. Penalty: Face Mask on Los Angeles (Trumaine Johnson) 5 yards.","(0:42) Penalty: Pass Interference on Seattle (Jermaine Kearse) -10 yards.","(1:09) Russell Wilson pass to the left to Thomas Rawls for 11 yards to the LA3. Tackled by Coty Sensabaugh.","(1:47) Thomas Rawls rush up the middle for no gain to the LA14. Tackled by Aaron Donald and William Hayes.","(2:23) Christine Michael rush to the right for 3 yards to the LA14. Tackled by Trumaine Johnson and William Hayes.","(2:57) Russell Wilson pass to the left to Tyler Lockett for 7 yards to the LA17. Tackled by Mark Barron.","(3:26) Russell Wilson rush up the middle for 5 yards to the LA39. Tackled by Alec Ogletree. Penalty: Unnecessary Roughness on Los Angeles (Alec Ogletree) 15 yards.","(3:49) Penalty: False Start on Seattle (Justin Britt) -5 yards.","(4:18) Penalty: False Start on Seattle (Bradley Sowell) -5 yards.","(4:59) Russell Wilson pass to the left to Tyler Lockett for 35 yards to the LA34. Tackled by Maurice Alexander.","(5:29) Russell Wilson pass to the left to Doug Baldwin for 7 yards to the Sea31. Tackled by Lamarcus Joyner.","(5:35) Penalty: Offside on Los Angeles (Ethan Westbrooks) 5 yards.","(6:22) Russell Wilson rush up the middle for a loss of 2 yards to the Sea19. Tackled by Aaron Donald.","(6:53) Russell Wilson pass to the right to Thomas Rawls for 2 yards to the Sea21. Tackled by Mark Barron.","(7:02) Johnny Hekker punts for 37 yards to Sea19. No return.","(7:40) Case Keenum pass to the middle to Benny Cunningham for 7 yards to the LA44. Tackled by Jeremy Lane.","(7:45) Case Keenum incomplete pass to the right intended for Tavon Austin.","(8:14) Penalty: Holding on Los Angeles (Greg Robinson) -10 yards.","(8:53) Tavon Austin rush to the right for 8 yards to the LA47. Tackled by Frank Clark and Kam Chancellor.","(9:00) Jon Ryan punts for 40 yards to LA39. No return.","(9:38) Russell Wilson pass to the left to Christine Michael for 7 yards to the Sea21. Tackled by Mark Barron.","(10:01) Thomas Rawls rush to the left for a loss of 9 yards to the Sea14. Tackled by Aaron Donald.","(10:38) Thomas Rawls rush to the right for a loss of 2 yards to the Sea23. Tackled by Trumaine Johnson and William Hayes.","(10:38) Greg Zuerlein kicks off to the endzone. Touchback.","(10:42) Greg Zuerlein 39 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(10:46) Case Keenum incomplete pass to the left intended for Lance Kendricks.","(11:28) Case Keenum pass to the left to Lance Kendricks for 8 yards to the Sea21. Tackled by Bobby Wagner.","(12:08) Todd Gurley rush up the middle for a loss of 1 yard to the Sea29. Tackled by Michael Bennett and Bobby Wagner.","(12:44) Case Keenum pass to the right to Tavon Austin for 17 yards to the Sea28. Tackled by Deshawn Shead.","(13:08) Penalty: Face Mask on Seattle (Kam Chancellor) 15 yards.","(13:16) Case Keenum incomplete pass to the right intended for Tavon Austin.","(13:51) Case Keenum pass to the left to Kenny Britt for 7 yards to the LA40. Tackled by Deshawn Shead.","(14:30) Case Keenum pass to the left to Kenny Britt for 4 yards to the LA33. Tackled by Bobby Wagner and Cliff Avril.","(15:00) Case Keenum pass to the right to Lance Kendricks for 4 yards to the LA29. Tackled by K.J. Wright.","(15:00) Steven Hauschka kicks off to the endzone. Touchback."]