["(0:09) Jameis Winston pass intended for Mike Evans INTERCEPTED by D.J. Swearinger. No return. Touchback.","(0:52) Jameis Winston sacked at TB50 for a loss of 10 yards by Chandler Jones.","(0:52) Penalty: Delay of Game on Tampa Bay (Jameis Winston) -5 yards.","(0:57) Jameis Winston incomplete pass to the left intended for Mike Evans.","(1:04) Jameis Winston pass to the left to Russell Shepard for 6 yards to the Ari35. Tackled by Tyvon Branch.","(1:18) Drew Butler punts for 44 yards to TB34. Adam Humphries return for 25 yards to Ari41. Tackled by Justin Bethel.","(2:00) Andre Ellington rush up the middle for 2 yards to the Ari22. Tackled by Clinton McDonald.","(2:00) Two Minute Warning.","(2:16) Chris Johnson rush up the middle for 3 yards to the Ari20. Tackled by Akeem Spence.","(2:57) Chris Johnson rush up the middle for 1 yard to the Ari17. Tackled by Clinton McDonald.","(3:05) Bryan Anger punts for 52 yards to Ari16. No return.","(3:12) Jameis Winston incomplete pass to the right intended for Mike Evans.","(3:17) Jameis Winston incomplete pass to the middle intended for Mike Evans.","(3:43) Jameis Winston pass to the right to Cameron Brate for no gain to the TB32. Tackled by Tony Jefferson.","(3:48) Jameis Winston pass to the left to Vincent Jackson for 13 yards to the TB32. Tackled by Marcus Cooper.","(3:56) Drew Butler punts for 41 yards to TB19. No return.","(4:02) Drew Stanton incomplete pass to the right intended for Larry Fitzgerald.","(4:44) Chris Johnson rush to the right for 5 yards to the Ari40. Tackled by Kwon Alexander.","(5:27) Chris Johnson rush to the right for a loss of 1 yard to the Ari35. Tackled by Kwon Alexander.","(6:13) Drew Stanton pass to the middle to Darren Fells for 11 yards to the Ari36. Tackled by Vernon Hargreaves III.","(6:53) Chris Johnson rush to the left for 2 yards to the Ari25. Tackled by Kwon Alexander.","(7:35) Chris Johnson rush to the right for 5 yards to the Ari23. Tackled by Brent Grimes and Kwon Alexander.","(7:44) Bryan Anger punts for 50 yards to Ari18. No return.","(7:49) Jameis Winston incomplete pass to the right intended for Jacquizz Rodgers.","(7:55) Jameis Winston incomplete pass to the right intended for Mike Evans.","(8:02) Jameis Winston incomplete pass to the right intended for Charles Sims.","(8:35) Jameis Winston pass to the right to Mike Evans for 11 yards to the TB32. Tackled by Tony Jefferson.","(8:42) Jameis Winston incomplete pass to the right.","(8:53) Drew Butler punts for 46 yards to TB31. Adam Humphries - no return. Tackled by Alex Okafor. Penalty: Illegal Block on Tampa Bay (Alterraun Verner) -10 yards.","(8:59) Drew Stanton incomplete pass to the left intended for John Brown.","(9:04) Drew Stanton incomplete pass to the right intended for Troy Niklas.","(9:42) Chris Johnson rush to the left for 3 yards to the Ari23. Tackled by Kwon Alexander.","(9:52) Bryan Anger punts for 59 yards to Ari0. Touchback.","(10:01) Jameis Winston incomplete pass to the right intended for Mike Evans.","(10:42) Charles Sims rush to the left for 5 yards to the TB41. Tackled by Calais Campbell.","(10:49) Jameis Winston incomplete pass to the left intended for Mike Evans.","(11:24) Jameis Winston pass to the right to Vincent Jackson for 12 yards to the TB36. Tackled by Marcus Cooper.","(12:11) Charles Sims rush up the middle for a loss of 1 yard to the TB24. Tackled by Tony Jefferson.","(12:11) Chandler Catanzaro kicks off to the endzone. Touchback.","(12:11) Chandler Catanzaro extra point is good.","(12:15) Chris Johnson rush up the middle for 3 yards for a TOUCHDOWN.","(12:53) Chris Johnson rush up the middle for 2 yards to the TB3. Tackled by Keith Tandy.","(13:34) Chris Johnson rush up the middle for 9 yards to the TB5. Tackled by Kwon Alexander.","(14:14) Chris Johnson rush up the middle for 8 yards to the TB14. Tackled by Bradley McDougald.","(15:00) Carson Palmer pass to the left to Larry Fitzgerald for 13 yards to the TB22. Tackled by Brent Grimes.","(0:37) Carson Palmer pass to the left to David Johnson for 24 yards to the TB35. Tackled by Chris Conte.","(1:20) David Johnson rush to the left for 4 yards to the Ari41. Tackled by Alterraun Verner.","(1:58) David Johnson rush to the right for 2 yards to the Ari37. Tackled by Gerald McCoy and William Gholston.","(2:03) 45 yard field goal attempt by Roberto Aguayo is NO GOOD. Holder: Bryan Anger.","(2:12) Jameis Winston incomplete pass to the middle intended for Vincent Jackson defensed by Tyvon Branch.","(2:16) Jameis Winston incomplete pass to the right intended for Mike Evans defensed by Marcus Cooper.","(2:47) Jameis Winston pass to the left to Vincent Jackson for 4 yards to the Ari26. Tackled by Tyvon Branch.","(3:24) Jacquizz Rodgers rush to the right for 24 yards to the Ari30. Tackled by Tyvon Branch.","(3:54) Jameis Winston pass to the left to Adam Humphries for 7 yards to the TB46. Tackled by Tyvon Branch.","(4:27) Jacquizz Rodgers rush up the middle for 5 yards to the TB39. Tackled by Alex Okafor.","(5:03) Charles Sims rush to the right for 9 yards to the TB34. Tackled by Tyvon Branch.","(5:03) Chandler Catanzaro kicks off to the endzone. Touchback.","(5:03) Chandler Catanzaro extra point is NO GOOD.","(5:15) Jameis Winston pass intended for Charles Sims INTERCEPTED by Marcus Cooper defensed by Josh Mauro and returned for 60 yards for a TOUCHDOWN.","(5:59) Jameis Winston pass to the middle to Cecil Shorts III for 12 yards to the Ari41. Tackled by Marcus Cooper.","(6:28) Charles Sims rush up the middle for 7 yards to the TB47. Tackled by Tyvon Branch.","(6:52) Jameis Winston pass to the middle to Mike Evans for 10 yards to the TB40. Tackled by Tyrann Mathieu.","(6:57) Jameis Winston incomplete pass to the right intended for Mike Evans.","(7:35) Jameis Winston pass to the right to Vincent Jackson for 15 yards to the TB30. Tackled by Tony Jefferson and Marcus Cooper.","(7:56) Penalty: Illegal Use of Hands on Tampa Bay (Demar Dotson) -10 yards.","(7:56) Chandler Catanzaro kicks off to the endzone. Touchback.","(8:00) Chandler Catanzaro 40 yard field goal attempt is GOOD. Holder: Drew Butler.","(8:40) Carson Palmer sacked at TB22 for a loss of 4 yards by Noah Spence.","(8:46) Carson Palmer incomplete pass to the right intended for David Johnson.","(9:27) Chris Johnson rush to the left for a loss of 1 yard to the TB18. Tackled by Vernon Hargreaves III.","(10:01) Carson Palmer pass to the right to David Johnson for 58 yards to the TB17. Tackled by Brent Grimes.","(10:01) Roberto Aguayo kicks off to the endzone. Touchback.","(10:01) Roberto Aguayo extra point is good.","(10:06) Jameis Winston pass to the left to Mike Evans for 19 yards for a TOUCHDOWN.","(10:44) Charles Sims rush to the left for a loss of 3 yards to the Ari19. Tackled by Deone Bucannon.","(10:50) Jameis Winston incomplete pass to the left intended for Mike Evans.","(11:31) Jameis Winston pass to the left to Russell Shepard for 10 yards to the Ari16. Tackled by Tyvon Branch.","(12:10) Jameis Winston rush up the middle for 8 yards to the Ari26. Tackled by Deone Bucannon.","(12:46) Jameis Winston pass to the right to Adam Humphries for 24 yards to the Ari34. Tackled by Tony Jefferson.","(12:52) Penalty: Pass Interference on Tampa Bay (Mike Evans) -10 yards.","(13:33) Jameis Winston pass to the left to Austin Seferian-Jenkins for 9 yards to the Ari48. Tackled by Tony Jefferson.","(13:37) Jameis Winston incomplete pass to the left intended for Mike Evans.","(14:07) Jameis Winston pass to the left to Adam Humphries for 5 yards to the TB43. Tackled by Calais Campbell.","(14:35) Charles Sims rush to the right for 4 yards to the TB38. Tackled by Tyvon Branch and Marcus Cooper.","(15:00) Jameis Winston pass to the left to Adam Humphries for 9 yards to the TB34. Tackled by Kevin Minter.","(15:00) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:01) Jameis Winston rush up the middle for a loss of 1 yard to the TB10.","(0:08) Jameis Winston sacked at TB11 for a loss of 9 yards by Markus Golden.","(0:16) Jameis Winston rush to the left for 2 yards to the TB15. Tackled by Kevin Minter. Penalty: Illegal Use of Hands on Arizona (Markus Golden) 5 yards.","(0:20) Chandler Catanzaro kicks off to the TB-6. Cecil Shorts III return for 19 yards to TB13. Tackled by Brandon Williams.","(0:20) Chandler Catanzaro extra point is good.","(0:26) Carson Palmer pass to the left to Jaron Brown for 51 yards for a TOUCHDOWN.","(0:26) Arizona Cardinals timeout.","(0:35) Carson Palmer pass to the right to Darren Fells for 9 yards to the Ari49. Tackled by Brent Grimes.","(0:40) Carson Palmer pass to the left to John Brown for 14 yards to the Ari40.","(0:59) David Johnson rush up the middle for 10 yards to the Ari26. Tackled by Chris Conte.","(1:05) Penalty: Holding on Arizona (Jared Veldheer) -10 yards.","(1:13) Bryan Anger punts for 49 yards to Ari26. No return.","(1:20) Jameis Winston incomplete pass to the left intended for Adam Humphries.","(1:24) Jameis Winston incomplete pass to the right intended for Cameron Brate.","(1:30) Jameis Winston incomplete pass to the right intended for Cecil Shorts III.","(1:30) Chandler Catanzaro kicks off to the endzone. Touchback.","(1:30) Chandler Catanzaro extra point is good.","(1:35) Carson Palmer pass to the left to Michael Floyd for 1 yard for a TOUCHDOWN.","(1:40) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(1:44) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(2:00) Carson Palmer pass to the right to Larry Fitzgerald for 24 yards to the TB1. Tackled by Brent Grimes.","(2:00) Two Minute Warning.","(2:26) Carson Palmer pass to the left to David Johnson for 16 yards to the TB25. Tackled by Vernon Hargreaves III.","(2:54) Carson Palmer pass to the right to Jaron Brown for 27 yards to the TB41. Tackled by Chris Conte.","(3:00) Carson Palmer incomplete pass to the right intended for David Johnson.","(3:06) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(3:12) Jameis Winston sacked at Ari32 for a loss of 3 yards. FUMBLE, recovered by Ari (Tony Jefferson). Tackled by Ali Marpet.","(3:51) Jameis Winston pass to the right to Cameron Brate for 1 yard to the Ari29. Tackled by Deone Bucannon and Tony Jefferson.","(4:12) Jameis Winston pass to the right to Cameron Brate for 15 yards to the Ari30. Tackled by Patrick Peterson.","(4:48) Charles Sims rush to the right for 1 yard to the Ari45. Tackled by Patrick Peterson.","(5:23) Jameis Winston pass to the left to Austin Seferian-Jenkins for 5 yards to the Ari46. Tackled by Marcus Cooper.","(5:23) Arizona Cardinals timeout.","(5:36) Drew Butler punts for 50 yards to TB32. Adam Humphries return for 17 yards to TB49.","(6:12) Carson Palmer pass to the right to Darren Fells for 4 yards to the Ari18. Tackled by Vernon Hargreaves III.","(6:55) Chris Johnson rush up the middle for 2 yards to the Ari14. Tackled by Daryl Smith.","(7:31) Chris Johnson rush to the left for 3 yards to the Ari12. Tackled by Clinton McDonald.","(7:41) Bryan Anger punts for 34 yards to Ari9. No return.","(7:46) Jameis Winston incomplete pass to the right intended for Adam Humphries.","(8:22) Jameis Winston pass to the left to Charles Sims for 3 yards to the Ari43. Tackled by Marcus Cooper.","(9:02) Charles Sims rush to the left for 1 yard to the Ari46. Tackled by Josh Mauro.","(9:08) Penalty: Pass Interference on Arizona (Marcus Cooper) 15 yards.","(9:50) Charles Sims rush up the middle for 1 yard to the TB38. Tackled by Tony Jefferson.","(10:29) Jameis Winston pass to the right to Charles Sims for a loss of 1 yard to the TB37. Tackled by Tony Jefferson and Josh Mauro.","(11:07) Jameis Winston pass to the right to Mike Evans for 11 yards to the TB38. Tackled by Patrick Peterson.","(11:44) Jameis Winston pass to the right to Charles Sims for 2 yards to the TB27. Tackled by Deone Bucannon.","(11:44) Chandler Catanzaro kicks off to the endzone. Touchback.","(11:48) Chandler Catanzaro 22 yard field goal attempt is GOOD. Holder: Drew Butler.","(11:53) Carson Palmer incomplete pass to the left intended for Michael Floyd.","(12:40) David Johnson rush to the left for 4 yards to the TB5. Tackled by Bradley McDougald.","(12:45) Carson Palmer incomplete pass to the left intended for Jermaine Gresham.","(13:25) Chris Johnson rush up the middle for 1 yard to the TB9. Tackled by Robert Ayers Jr..","(14:05) Chris Johnson rush to the left for 9 yards to the TB10. Tackled by Chris Conte.","(14:17) Jameis Winston pass intended for Vincent Jackson INTERCEPTED by Marcus Cooper and returned for 23 yards. Tackled by Kevin Pamphile.","(14:54) Doug Martin rush to the right for 1 yard to the TB26. Tackled by Tony Jefferson.","(14:54) Chandler Catanzaro kicks off to the endzone. Touchback.","(14:54) Chandler Catanzaro extra point is good.","(14:59) Carson Palmer pass to the middle to Larry Fitzgerald for 4 yards for a TOUCHDOWN.","(15:00) Penalty: Encroachment on Tampa Bay (Gerald McCoy) 4 yards.","(0:08) Carson Palmer pass to the left to Darren Fells for 7 yards to the TB8. Tackled by Gerald McCoy.","(0:47) David Johnson rush up the middle for no gain to the TB15. Tackled by Kwon Alexander.","(1:22) Carson Palmer pass to the right to Larry Fitzgerald for 11 yards to the TB15. Tackled by Brent Grimes.","(1:27) Carson Palmer incomplete pass to the left intended for Michael Floyd.","(2:05) David Johnson rush up the middle for 1 yard to the TB26. Tackled by Robert Ayers Jr..","(2:32) Carson Palmer pass to the left to Larry Fitzgerald for 25 yards to the TB27. Tackled by Chris Conte.","(3:08) David Johnson rush up the middle for no gain to the Ari48. Tackled by William Gholston.","(3:49) Carson Palmer pass to the middle to Andre Ellington for 9 yards to the Ari48. Tackled by Bradley McDougald.","(4:26) David Johnson rush to the right for 1 yard to the Ari39. Tackled by William Gholston.","(5:06) David Johnson rush up the middle for 5 yards to the Ari38. Tackled by Bradley McDougald.","(5:17) Bryan Anger punts for 38 yards to Ari26. John Brown return for 7 yards to Ari33. Tackled by Brandon Myers.","(5:22) Jameis Winston incomplete pass to the left intended for Vincent Jackson.","(5:27) Jameis Winston incomplete pass to the middle intended for Vincent Jackson defensed by Calais Campbell.","(6:10) Doug Martin rush to the right for a loss of 2 yards to the TB36. Tackled by Markus Golden and Calais Campbell.","(6:49) Jameis Winston pass to the right to Adam Humphries for 15 yards to the TB38. Tackled by Tyvon Branch.","(6:54) Jameis Winston incomplete pass to the right intended for Vincent Jackson.","(7:32) Doug Martin rush up the middle for 3 yards to the TB23. Tackled by Xavier Williams.","(8:08) Jameis Winston pass to the left to Mike Evans for 11 yards to the TB20. Tackled by Patrick Peterson.","(8:49) Doug Martin rush up the middle for 2 yards to the TB9. Tackled by Ed Stinson.","(8:58) Drew Butler punts for 50 yards to TB7. Adam Humphries - no return. Tackled by Justin Bethel.","(9:04) Carson Palmer incomplete pass to the middle intended for Darren Fells defensed by Bradley McDougald.","(9:38) David Johnson rush to the right for 8 yards to the Ari43. Tackled by Chris Conte.","(9:44) Carson Palmer incomplete pass to the right intended for Michael Floyd.","(10:20) David Johnson rush to the left for 10 yards to the Ari35. Tackled by Chris Conte.","(10:28) Carson Palmer incomplete pass to the left intended for John Brown.","(10:44) Jameis Winston pass intended for Mike Evans INTERCEPTED by Patrick Peterson and returned for 25 yards. Tackled by Joe Hawley.","(11:14) Jameis Winston pass to the right to Adam Humphries for 7 yards to the Ari49. Tackled by Brandon Williams.","(11:41) Doug Martin rush up the middle for 4 yards to the TB44. Tackled by Tyvon Branch.","(12:11) Doug Martin rush up the middle for 12 yards to the TB40. Tackled by Tyrann Mathieu.","(12:38) Doug Martin rush up the middle for 3 yards to the TB28. Tackled by Brandon Williams.","(13:10) Jameis Winston pass to the left to Mike Evans for 8 yards to the TB25. Tackled by Tony Jefferson.","(13:20) Drew Butler punts for 48 yards to TB16. Adam Humphries return for 1 yard to TB17. Tackled by Justin Bethel.","(13:26) Carson Palmer incomplete pass to the left intended for Michael Floyd defensed by Alterraun Verner.","(13:32) Carson Palmer incomplete pass to the left intended for Larry Fitzgerald defensed by Alterraun Verner.","(14:06) David Johnson rush to the left for no gain to the Ari36. Tackled by Gerald McCoy.","(14:34) Carson Palmer pass to the right to Michael Floyd for 7 yards to the Ari36. Tackled by Brent Grimes.","(15:00) Larry Fitzgerald rush to the right for 4 yards to the Ari29. Tackled by Vernon Hargreaves III.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback."]