["(0:25) Andrew Luck sacked at Ind50 for a loss of 5 yards by Von Miller.","(0:25) Penalty: Too Many Men on Field on Denver 5 yards.","(0:41) Andrew Luck pass to the middle to Dwayne Allen for 12 yards to the Ind50. Tackled by Will Parks.","(1:12) Andrew Luck sacked at Ind38 for a loss of 2 yards by Derek Wolfe.","(1:19) Andrew Luck pass to the left to Josh Ferguson for 6 yards to the Ind40. Tackled by T.J. Ward.","(1:26) Andrew Luck pass to the left to Josh Ferguson for 8 yards to the Ind34. Tackled by Brandon Marshall.","(1:35) Penalty: Holding on Indianapolis (Jonotthan Harrison) -10 yards.","(1:42) Andrew Luck pass to the left to Josh Ferguson for 11 yards to the Ind36. Tackled by Justin Simmons.","(1:42) Brandon McManus kicks off to the endzone. Touchback.","(1:42) Trevor Siemian 2 pt conversion pass to Demaryius Thomas is GOOD.","(1:51) Andrew Luck sacked at Ind15 for a loss of 10 yards by Von Miller. FUMBLE, recovered by Den (Shane Ray) and returned for 15 yards for a TOUCHDOWN.","(1:51) Brandon McManus kicks off to the endzone. Touchback.","(1:54) Brandon McManus 35 yard field goal attempt is GOOD. Holder: Riley Dixon.","(1:55) Indianapolis Colts timeout.","(2:00) C.J. Anderson rush to the left for no gain to the Ind17. Tackled by D'Qwell Jackson.","(2:00) Two Minute Warning.","(2:18) C.J. Anderson rush to the right for 13 yards to the Ind17. Tackled by Rashaan Melvin.","(2:18) Penalty: False Start on Denver -5 yards.","(2:18) Indianapolis Colts timeout.","(2:22) C.J. Anderson rush up the middle for 1 yard to the Ind25. Tackled by David Parry.","(3:05) Trevor Siemian pass to the left to Demaryius Thomas for 11 yards to the Ind26. Tackled by Antonio Cromartie.","(3:09) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(3:10) Indianapolis Colts timeout.","(3:15) C.J. Anderson rush to the left for a loss of 1 yard to the Ind37. Tackled by Zach Kerr.","(3:56) Trevor Siemian pass to the middle to Virgil Green for 18 yards to the Ind36. Tackled by Erik Walden.","(4:02) Penalty: Pass Interference on Indianapolis (Winston Guy) 21 yards.","(4:02) Pat McAfee kicks off to the endzone. Touchback.","(4:02) Adam Vinatieri extra point is good.","(4:09) Andrew Luck pass to the left to Frank Gore for 7 yards for a TOUCHDOWN.","(4:16) Andrew Luck incomplete pass to the left.","(4:55) Andrew Luck pass to the middle to T.Y. Hilton for 10 yards to the Den7. Tackled by Chris Harris Jr..","(5:33) Andrew Luck pass to the middle to Jack Doyle for 7 yards to the Den17. Tackled by Justin Simmons.","(5:33) Penalty: Delay of Game on Indianapolis (Andrew Luck) -5 yards.","(5:43) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(6:19) Andrew Luck pass to the right to T.Y. Hilton for 7 yards to the Den19.","(7:06) Andrew Luck pass to the right to Frank Gore for 6 yards to the Den26. Tackled by T.J. Ward.","(7:45) Andrew Luck pass to the left to Jack Doyle for 22 yards to the Den32. Tackled by T.J. Ward.","(7:54) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(8:16) Andrew Luck rush to the right for 2 yards to the Ind31. Penalty: Unnecessary Roughness on Denver (Darian Stewart) 15 yards.","(8:58) Frank Gore rush up the middle for 3 yards to the Ind29. Tackled by Von Miller.","(9:30) Andrew Luck pass to the right to Frank Gore for 6 yards to the Ind26. Tackled by Todd Davis.","(9:39) Riley Dixon punts for 53 yards to Ind0. Touchback.","(10:24) Trevor Siemian pass to the left to C.J. Anderson for 6 yards to the Den47. Tackled by Matthias Farley.","(10:30) Trevor Siemian incomplete pass to the left intended for C.J. Anderson.","(11:08) Devontae Booker rush to the right for no gain to the Den41. Tackled by Erik Walden.","(11:13) Penalty: Pass Interference on Indianapolis (Antonio Cromartie) 18 yards.","(11:55) Devontae Booker rush to the right for 2 yards to the Den23. Tackled by Sio Moore.","(12:32) C.J. Anderson rush up the middle for 5 yards to the Den21. Tackled by David Parry.","(12:40) Pat McAfee punts for 50 yards to Den16. No return.","(13:15) Andrew Luck pass to the left to Josh Ferguson for 4 yards to the Ind34. Tackled by T.J. Ward.","(13:19) Andrew Luck incomplete pass to the right intended for Chester Rogers defensed by Derek Wolfe.","(13:19) Denver Broncos timeout.","(13:52) Andrew Luck pass to the left to Jack Doyle for 5 yards to the Ind30. Tackled by Brandon Marshall.","(13:52) Brandon McManus kicks off to the endzone. Touchback.","(13:52) Brandon McManus extra point is good.","(14:06) Andrew Luck pass intended for Phillip Dorsett INTERCEPTED by Aqib Talib and returned for 46 yards for a TOUCHDOWN.","(14:52) Andrew Luck pass to the right to Josh Ferguson for no gain to the Ind35. Tackled by Chris Harris Jr..","(14:56) Andrew Luck incomplete pass to the middle intended for T.Y. Hilton.","(14:56) Penalty: False Start on Indianapolis (Joe Reitz) -5 yards.","(15:00) Penalty: Holding on Denver (Aqib Talib) 5 yards.","(0:24) Josh Ferguson rush to the right for 1 yard to the Ind35. Tackled by Von Miller.","(1:00) Josh Ferguson rush up the middle for 6 yards to the Ind34. Tackled by Jared Crick.","(1:09) Brandon McManus kicks off to the Ind1. Quan Bray return for 27 yards to Ind28. Tackled by Zaire Anderson.","(1:13) Brandon McManus 33 yard field goal attempt is GOOD. Holder: Riley Dixon.","(1:47) C.J. Anderson rush up the middle for a loss of 1 yard to the Ind15. Tackled by D'Qwell Jackson.","(2:26) C.J. Anderson rush to the left for no gain to the Ind14. Tackled by Zach Kerr.","(2:59) C.J. Anderson rush to the left for 9 yards to the Ind14. Tackled by Erik Walden.","(3:38) Devontae Booker rush to the right for 5 yards to the Ind23. Tackled by David Parry.","(4:16) Devontae Booker rush up the middle for 6 yards to the Ind28. Tackled by Darryl Morris.","(4:54) Devontae Booker rush to the right for 12 yards to the Ind34. Tackled by Mike Adams.","(5:20) Trevor Siemian rush to the right for 7 yards to the Ind46.","(5:27) Penalty: Pass Interference on Indianapolis (Darryl Morris) 9 yards.","(6:07) C.J. Anderson rush up the middle for a loss of 1 yard to the Den38. Tackled by Zach Kerr.","(6:46) Trevor Siemian pass to the middle to Cody Latimer for 4 yards to the Den39. Tackled by D'Qwell Jackson.","(7:29) Trevor Siemian pass to the left to Virgil Green for 12 yards to the Den35. Tackled by Akeem Ayers.","(7:33) Trevor Siemian incomplete pass to the right intended for C.J. Anderson.","(8:06) C.J. Anderson rush up the middle for a loss of 2 yards to the Den23. Tackled by Robert Mathis.","(8:06) Pat McAfee kicks off to the endzone. Touchback.","(8:06) Adam Vinatieri extra point is good.","(8:11) Robert Turbin rush to the left for 5 yards for a TOUCHDOWN.","(8:15) Andrew Luck incomplete pass to the left intended for Robert Turbin defensed by Brandon Marshall.","(8:56) Andrew Luck pass to the right to Jack Doyle for 3 yards to the Den5. Tackled by T.J. Ward.","(9:40) Frank Gore rush to the left for 1 yard to the Den8. Tackled by Todd Davis.","(10:13) Robert Turbin rush up the middle for 2 yards to the Den9. Tackled by Shaquil Barrett.","(10:28) Penalty: Offside on Denver (T.J. Ward) 5 yards.","(10:42) Andrew Luck pass to the left to Phillip Dorsett for 30 yards to the Den16. Tackled by Chris Harris Jr..","(11:24) Frank Gore rush up the middle for 4 yards to the Den46. Tackled by Billy Winn.","(11:36) Penalty: Holding on Denver (T.J. Ward) 4 yards.","(12:22) Robert Turbin rush up the middle for 3 yards to the Ind46. Tackled by T.J. Ward.","(13:02) Frank Gore rush up the middle for 3 yards to the Ind43. Tackled by Kayvon Webster and Todd Davis.","(13:36) Andrew Luck rush to the left for 21 yards to the Ind40. Tackled by Justin Simmons.","(13:41) Andrew Luck incomplete pass to the middle intended for T.Y. Hilton defensed by Aqib Talib.","(13:49) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(14:09) Penalty: Holding on Indianapolis (Jack Doyle) -10 yards.","(14:13) Penalty: Holding on Denver (Brandon Marshall) 5 yards.","(14:52) Frank Gore rush up the middle for 3 yards to the Ind24. Tackled by Todd Davis.","(15:00) Brandon McManus kicks off to the Ind1. Quan Bray return for 20 yards to Ind21. Tackled by Cody Latimer.","(0:05) Andrew Luck rush up the middle for a loss of 1 yard to the Ind24.","(0:05) Brandon McManus kicks off to the endzone. Touchback.","(0:09) Brandon McManus 43 yard field goal attempt is GOOD. Holder: Riley Dixon.","(0:13) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(0:17) Trevor Siemian pass to the left to Demaryius Thomas for 9 yards to the Ind25. Tackled by Antonio Cromartie.","(0:17) Denver Broncos timeout.","(0:22) Trevor Siemian pass to the left to Cody Latimer for 8 yards to the Ind34. Tackled by Antonio Cromartie.","(0:39) Trevor Siemian pass to the middle to Jordan Norwood for 6 yards to the Ind42. Tackled by Mike Adams.","(0:47) Trevor Siemian pass to the left to C.J. Anderson for 11 yards to the Ind48. Tackled by Antonio Cromartie.","(0:54) Trevor Siemian incomplete pass to the left intended for Jordan Norwood.","(0:59) Trevor Siemian incomplete pass to the right intended for Kapri Bibbs defensed by D'Qwell Jackson.","(1:24) Kapri Bibbs rush up the middle for 7 yards to the Den41. Tackled by Winston Guy.","(2:00) Trevor Siemian pass to the middle to Jordan Norwood for 9 yards to the Den34. Tackled by Sio Moore.","(2:00) Two Minute Warning.","(2:17) C.J. Anderson rush to the left for 10 yards to the Den25. Tackled by Darryl Morris and D'Qwell Jackson.","(2:43) Penalty: Holding on Denver (Max Garcia) -10 yards.","(2:43) Pat McAfee kicks off to the endzone. Touchback.","(2:47) Adam Vinatieri 52 yard field goal attempt is GOOD. Holder: Pat McAfee.","(3:25) Andrew Luck sacked at Den34 for a loss of 7 yards by DeMarcus Ware and Von Miller.","(3:30) Andrew Luck incomplete pass to the middle intended for Dwayne Allen.","(4:12) Frank Gore rush up the middle for 2 yards to the Den27. Tackled by Von Miller.","(4:52) Andrew Luck pass to the middle to Dwayne Allen for 13 yards to the Den29. Tackled by T.J. Ward.","(4:52) Indianapolis Colts timeout.","(4:57) Andrew Luck incomplete pass to the middle intended for Phillip Dorsett defensed by Jared Crick.","(5:02) Andrew Luck incomplete pass to the left intended for Dwayne Allen.","(5:43) Frank Gore rush up the middle for 6 yards to the Den42. Tackled by Justin Simmons.","(6:19) Andrew Luck pass to the right to Quan Bray for 7 yards to the Den48. Tackled by Aqib Talib.","(6:28) Trevor Siemian pass intended for Emmanuel Sanders INTERCEPTED by Darius Butler and returned for 19 yards. Tackled by Russell Okung.","(7:12) Trevor Siemian pass to the right to Jordan Norwood for 9 yards to the Ind20. Tackled by D'Qwell Jackson.","(7:12) Denver Broncos timeout.","(7:44) Trevor Siemian pass to the left to C.J. Anderson for 2 yards to the Ind29. Tackled by Clayton Geathers.","(8:14) Trevor Siemian pass to the right to Virgil Green for 16 yards to the Ind31. Tackled by Darius Butler.","(8:14) Denver Broncos timeout.","(8:18) Trevor Siemian incomplete pass to the right intended for Emmanuel Sanders.","(8:58) Devontae Booker rush to the left for 2 yards to the Ind47. Tackled by Hassan Ridgeway.","(9:24) Trevor Siemian pass to the left to Demaryius Thomas for 17 yards to the Ind49. Tackled by Darryl Morris.","(9:54) Devontae Booker rush to the right for 3 yards to the Den34. Tackled by Rashaan Melvin.","(10:07) Pat McAfee punts for 53 yards to Den17. Jordan Norwood return for 14 yards to Den31. Tackled by Edwin Jackson.","(10:48) Andrew Luck sacked at Ind30 for a loss of 3 yards by Derek Wolfe and Von Miller.","(11:34) Frank Gore rush up the middle for 8 yards to the Ind33. Tackled by T.J. Ward.","(11:41) Andrew Luck incomplete pass to the right intended for Phillip Dorsett.","(11:41) Brandon McManus kicks off to the endzone. Touchback.","(11:41) Brandon McManus extra point is good.","(11:45) C.J. Anderson rush up the middle for 4 yards for a TOUCHDOWN.","(12:26) Devontae Booker rush up the middle for 5 yards to the Ind4. Tackled by Robert Mathis and Clayton Geathers.","(12:32) Penalty: Pass Interference on Indianapolis (Rashaan Melvin) 16 yards.","(13:12) C.J. Anderson rush to the right for 11 yards to the Ind25. Tackled by Clayton Geathers and Josh McNary.","(13:47) Trevor Siemian pass to the left to Jordan Taylor for 20 yards to the Ind36. Tackled by Darryl Morris.","(14:23) C.J. Anderson rush to the left for 4 yards to the Den44. Tackled by David Parry.","(15:00) Trevor Siemian pass to the left to Demaryius Thomas for 9 yards to the Den40. Tackled by Darryl Morris.","(0:02) Pat McAfee punts for 51 yards to Den19. Jordan Norwood return for 12 yards to Den31. Tackled by Matthias Farley.","(0:06) Andrew Luck incomplete pass to the right intended for T.Y. Hilton defensed by Von Miller.","(0:14) Andrew Luck incomplete pass to the left intended for Phillip Dorsett defensed by T.J. Ward defensed by Chris Harris Jr..","(0:58) Frank Gore rush up the middle for 2 yards to the Ind30. Tackled by Derek Wolfe.","(1:27) Andrew Luck pass to the left to T.Y. Hilton for 16 yards to the Ind28. Tackled by Aqib Talib.","(1:31) Andrew Luck incomplete pass to the middle intended for Donte Moncrief.","(1:38) Riley Dixon punts for 45 yards to Ind12. No return.","(1:43) Trevor Siemian incomplete pass to the left intended for Demaryius Thomas.","(2:21) C.J. Anderson rush to the right for 2 yards to the Den43. Tackled by David Parry.","(2:59) C.J. Anderson rush to the left for 5 yards to the Den41. Tackled by Clayton Geathers.","(3:38) Devontae Booker rush to the left for 11 yards to the Den36. Tackled by Sio Moore.","(4:24) Trevor Siemian pass to the left to Devontae Booker for 5 yards to the Den25. Tackled by Clayton Geathers.","(4:34) Pat McAfee punts for 72 yards to Den0. Touchback.","(4:40) Andrew Luck incomplete pass to the left intended for Donte Moncrief.","(5:23) Frank Gore rush to the right for 3 yards to the Ind28. Tackled by Derek Wolfe.","(5:30) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(5:30) Brandon McManus kicks off to the endzone. Touchback.","(5:33) Brandon McManus 23 yard field goal attempt is GOOD. Holder: Riley Dixon.","(5:36) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(5:42) Trevor Siemian incomplete pass to the left intended for Emmanuel Sanders.","(6:19) C.J. Anderson rush up the middle for 5 yards to the Ind5. Tackled by Mike Adams.","(7:00) Trevor Siemian pass to the left to Demaryius Thomas for 44 yards to the Ind10. Tackled by Mike Adams.","(7:40) C.J. Anderson rush to the right for 2 yards to the Den46. Tackled by Sio Moore and D'Qwell Jackson.","(8:17) Trevor Siemian pass to the middle to Emmanuel Sanders for 19 yards to the Den44. Tackled by Antonio Cromartie.","(8:17) Pat McAfee kicks off to the endzone. Touchback.","(8:21) Adam Vinatieri 48 yard field goal attempt is GOOD. Holder: Pat McAfee.","(9:02) Frank Gore rush to the left for no gain to the Den30. Tackled by Shane Ray and Darius Kilgo.","(9:41) Frank Gore rush to the right for 5 yards to the Den30. Tackled by Brandon Marshall.","(10:19) Frank Gore rush up the middle for 4 yards to the Den35. Tackled by Jared Crick and Todd Davis.","(10:58) Andrew Luck pass to the right to Donte Moncrief for 9 yards to the Den39. Tackled by Darian Stewart.","(11:37) Andrew Luck pass to the right to T.Y. Hilton for 8 yards to the Den48. Tackled by Brandon Marshall.","(11:41) Andrew Luck incomplete pass to the left intended for Jack Doyle.","(11:47) 54 yard field goal attempt by Brandon McManus is NO GOOD. Holder: Riley Dixon.","(12:23) Trevor Siemian sacked at Ind36 for no gain by Zach Kerr.","(13:06) C.J. Anderson rush to the right for 7 yards to the Ind36. Tackled by Mike Adams and Hassan Ridgeway.","(13:43) C.J. Anderson rush to the left for 1 yard to the Ind43. Tackled by Zach Kerr.","(14:12) Trevor Siemian pass to the left to Andy Janovich for 11 yards to the Ind44. Tackled by Sio Moore.","(14:36) Trevor Siemian pass to the left to Emmanuel Sanders for 14 yards to the Den45. Tackled by Antonio Cromartie.","(15:00) Trevor Siemian pass to the right to Emmanuel Sanders for 6 yards to the Den31. Tackled by Rashaan Melvin.","(15:00) Pat McAfee kicks off to the endzone. Touchback."]