["(0:16) Blaine Gabbert pass to the left to Mike Davis for 10 yards to the SF46. Tackled by A.J. Klein.","(0:21) Blaine Gabbert pass to the left to Quinton Patton for 5 yards to the SF36. Tackled by Daryl Worley.","(0:45) Blaine Gabbert pass to the middle to Blake Bell for 6 yards to the SF31. Tackled by Bene Benwikere.","(1:06) Blaine Gabbert sacked at SF25 for no gain by Mario Addison.","(1:06) Graham Gano kicks off to the endzone. Touchback.","(1:11) Graham Gano 41 yard field goal attempt is GOOD. Holder: Andy Lee.","(2:00) Penalty: Delay of Game on Carolina (Cam Newton) -5 yards.","(2:00) Fozzy Whittaker rush to the left for 6 yards to the SF18. Tackled by NaVorro Bowman.","(2:00) Two Minute Warning.","(2:17) Fozzy Whittaker rush to the left for 2 yards to the SF24. Tackled by Gerald Hodges Jr. and NaVorro Bowman.","(3:02) Fozzy Whittaker rush to the left for 1 yard to the SF26. Tackled by Eric Reid.","(3:15) Blaine Gabbert pass intended for Torrey Smith INTERCEPTED by James Bradberry and returned for 16 yards. Tackled by Torrey Smith.","(3:21) Blaine Gabbert incomplete pass to the right intended for Blake Bell.","(3:26) Blaine Gabbert incomplete pass to the left intended for Shaun Draughn.","(3:31) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(3:31) Graham Gano kicks off to the endzone. Touchback.","(3:31) Graham Gano extra point is BLOCKED.","(3:36) Cam Newton pass to the right to Devin Funchess for 16 yards for a TOUCHDOWN.","(3:36) San Francisco 49ers timeout.","(3:41) Cam Newton rush to the right for no gain to the SF16. Tackled by Quinton Dial.","(3:47) Mike Tolbert rush to the left for 6 yards to the SF16. Tackled by Gerald Hodges Jr..","(3:47) San Francisco 49ers timeout.","(3:57) Cam Newton pass to the right to Greg Olsen for 12 yards to the SF22. Tackled by Eric Reid.","(4:03) Blaine Gabbert pass intended for Jeremy Kerley INTERCEPTED by Luke Kuechly and returned for 1 yard. Tackled by Jeremy Kerley.","(4:08) Blaine Gabbert incomplete pass to the middle intended for Vance McDonald.","(4:08) Graham Gano kicks off to the endzone. Touchback.","(4:13) Graham Gano 49 yard field goal attempt is GOOD. Holder: Andy Lee.","(4:18) Cam Newton incomplete pass to the right intended for Kelvin Benjamin defensed by Tramaine Brock.","(5:02) Fozzy Whittaker rush to the left for 3 yards to the SF31. Tackled by Mike Purcell.","(5:40) Mike Tolbert rush up the middle for no gain to the SF34. Tackled by DeForest Buckner and Eli Harold.","(5:40) Carolina Panthers timeout.","(6:28) Cam Newton pass to the right to Greg Olsen for 11 yards to the SF34. Tackled by Antoine Bethea.","(6:52) Fozzy Whittaker rush to the right for 1 yard to the SF45. Tackled by NaVorro Bowman.","(7:38) Cam Newton pass to the right to Kelvin Benjamin for 25 yards to the SF46. Tackled by Chris Davis and Eric Reid.","(7:42) Cam Newton incomplete pass to the left intended for Kelvin Benjamin.","(7:45) Cam Newton incomplete pass to the middle intended for Corey Brown.","(7:51) Phil Dawson kicks off to the Car5. Ted Ginn Jr. return for 24 yards to Car29. Tackled by Keith Reaser.","(7:51) Phil Dawson extra point is good.","(8:03) Blaine Gabbert pass to the left to Vance McDonald for 75 yards for a TOUCHDOWN.","(8:07) Blaine Gabbert incomplete pass to the left intended for Quinton Patton defensed by Lavar Edwards.","(8:07) Graham Gano kicks off to the endzone. Touchback.","(8:11) Graham Gano 31 yard field goal attempt is GOOD. Holder: Andy Lee.","(8:14) Penalty: Delay of Game on Carolina (Andy Lee) -5 yards.","(8:18) Cam Newton incomplete pass to the right intended for Corey Brown defensed by Ahmad Brooks.","(8:18) Carolina Panthers timeout.","(9:05) Mike Tolbert rush up the middle for 5 yards to the SF8. Tackled by Eric Reid.","(9:48) Mike Tolbert rush to the right for 2 yards to the SF13. Tackled by Antoine Bethea.","(10:33) Mike Tolbert rush to the left for 2 yards to the SF15. Tackled by Gerald Hodges Jr. and NaVorro Bowman.","(11:19) Cam Newton pass to the right to Greg Olsen for 9 yards to the SF17. Tackled by Jimmie Ward.","(11:47) Cam Newton pass to the right to Corey Brown for 4 yards to the SF26. Tackled by Antoine Bethea.","(12:22) Fozzy Whittaker rush to the left for 8 yards to the SF30. Tackled by Antoine Bethea and Gerald Hodges Jr..","(12:22) Carolina Panthers timeout.","(12:31) Phil Dawson kicks off to the Car3. Ted Ginn Jr. return for 59 yards to SF38. Tackled by Aaron Burbridge.","(12:31) Phil Dawson extra point is good.","(12:35) Blaine Gabbert rush up the middle for 1 yard for a TOUCHDOWN.","(12:38) Phil Dawson kicks off to the Car3. Ted Ginn Jr. - no return. FUMBLE, recovered by SF (Shaun Draughn). Tackled by Ted Ginn Jr.. Penalty: Unsports. Conduct on Carolina (Gino Gradkowski) 1 yards.","(12:43) Phil Dawson 39 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(13:24) Blaine Gabbert sacked at Car21 for a loss of 6 yards by Star Lotulelei.","(13:29) Blaine Gabbert incomplete pass to the left intended for Quinton Patton defensed by Bene Benwikere.","(14:01) Carlos Hyde rush to the right for 2 yards to the Car15. Tackled by Charles Johnson.","(14:17) Cam Newton sacked at Car34 for no gain by Gerald Hodges Jr.. FUMBLE, recovered by SF (Eli Harold) and returned for 19 yards. Tackled by Andrew Norwell.","(15:00) Fozzy Whittaker rush up the middle for 5 yards to the Car34. Tackled by Gerald Hodges Jr. and Jimmie Ward.","(0:45) Fozzy Whittaker rush up the middle for 3 yards to the Car29. Tackled by Eric Reid and NaVorro Bowman.","(1:32) Cam Newton rush to the left for 14 yards to the Car26. Tackled by Antoine Bethea.","(1:38) Cam Newton incomplete pass to the left intended for Greg Olsen.","(2:13) Mike Tolbert rush to the left for 3 yards to the Car12. Tackled by Mike Purcell and DeForest Buckner.","(2:26) Bradley Pinion punts for 37 yards to Car9. No return.","(2:31) Blaine Gabbert incomplete pass to the right intended for Torrey Smith defensed by James Bradberry.","(2:36) Penalty: Holding on San Francisco (Andrew Tiller) -10 yards.","(2:41) Blaine Gabbert incomplete pass to the right intended for Jeremy Kerley.","(3:17) Shaun Draughn rush up the middle for 5 yards to the Car36. Tackled by Luke Kuechly.","(3:35) Blaine Gabbert pass to the left to Quinton Patton for 11 yards to the Car41. Tackled by Daryl Worley.","(3:56) Blaine Gabbert pass to the right to Torrey Smith for 7 yards to the SF48. Tackled by James Bradberry.","(4:23) Blaine Gabbert pass to the left to Carlos Hyde for 6 yards to the SF41. Tackled by Daryl Worley.","(4:49) Blaine Gabbert pass to the left to Carlos Hyde for 13 yards to the SF35. Tackled by Thomas Davis.","(4:56) Graham Gano kicks off to the SF-2. Chris Davis return for 24 yards to SF22. Tackled by Ryan Delaire.","(4:56) Graham Gano extra point is good.","(4:56) Cam Newton pass to the left to Kelvin Benjamin for 9 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Carolina (Devin Funchess) -15 yards.","(5:38) Mike Tolbert rush to the right for no gain to the SF9. Tackled by Gerald Hodges Jr. and Tank Carradine.","(6:13) Cam Newton pass to the left to Greg Olsen for 12 yards to the SF9.","(6:52) Fozzy Whittaker rush to the left for a loss of 1 yard to the SF21. Tackled by NaVorro Bowman.","(7:30) Cam Newton pass to the right to Devin Funchess for 3 yards to the SF20. Tackled by Gerald Hodges Jr. and Jimmie Ward.","(7:50) San Francisco 49ers timeout.","(7:50) Cam Newton pass to the right to Ted Ginn Jr. for 52 yards to the SF23. Tackled by Tramaine Brock.","(8:02) Bradley Pinion punts for 54 yards to Car19. Ted Ginn Jr. return for 6 yards to Car25. Tackled by Nick Bellore.","(8:07) Blaine Gabbert incomplete pass to the left intended for Quinton Patton defensed by Daryl Worley.","(8:11) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(8:38) Carlos Hyde rush to the left for 2 yards to the SF27. Tackled by Kawann Short and Luke Kuechly.","(8:38) Graham Gano kicks off to the endzone. Touchback.","(8:38) Graham Gano extra point is good.","(8:44) Cam Newton pass to the right to Kelvin Benjamin for 10 yards for a TOUCHDOWN.","(9:21) Fozzy Whittaker rush to the right for 1 yard to the SF10. Tackled by Eli Harold.","(10:09) Cam Newton pass to the right to Kelvin Benjamin for 25 yards to the SF11. Tackled by Jimmie Ward.","(10:41) Cam Newton pass to the right to Corey Brown for 3 yards to the SF36.","(10:47) Cam Newton incomplete pass to the left intended for Ted Ginn Jr..","(11:28) Penalty: Illegal Contact on San Francisco (Keith Reaser) 5 yards.","(12:00) Cam Newton pass to the left to Fozzy Whittaker for 2 yards to the SF44. Tackled by Ray-Ray Armstrong.","(12:37) Cam Newton pass to the left to Kelvin Benjamin for 13 yards to the SF46. Tackled by Jimmie Ward.","(13:04) Penalty: Holding on Carolina (Ryan Kalil) -10 yards.","(13:29) Ted Ginn Jr. rush to the left for 5 yards to the Car36. Tackled by Antoine Bethea. Penalty: Face Mask on San Francisco (NaVorro Bowman) 15 yards.","(13:43) Bradley Pinion punts for 54 yards to Car15. Ted Ginn Jr. return for 16 yards to Car31. Tackled by Vance McDonald and Jaquiski Tartt.","(14:16) Blaine Gabbert pass to the left to Carlos Hyde for a loss of 1 yard to the SF31. Tackled by Bene Benwikere.","(14:23) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(14:54) Carlos Hyde rush up the middle for 2 yards to the SF32. Tackled by Kony Ealy and Luke Kuechly.","(15:00) Graham Gano kicks off to the SF5. Chris Davis return for 25 yards to SF30. Tackled by David Mayo.","(0:01) Graham Gano kicks off to the SF21. Mike Davis return for 6 yards to SF27.","(0:06) Graham Gano 39 yard field goal attempt is GOOD. Holder: Andy Lee.","(0:06) San Francisco 49ers timeout.","(0:11) Cam Newton incomplete pass to the left intended for Devin Funchess.","(0:17) Cam Newton incomplete pass to the left intended for Greg Olsen defensed by Keith Reaser.","(0:17) Cam Newton incomplete pass to the middle.","(0:33) Cam Newton rush to the left for 16 yards to the SF21. Tackled by Antoine Bethea.","(0:33) San Francisco 49ers timeout.","(0:42) Cam Newton pass to the middle to Kelvin Benjamin for 17 yards to the SF37. Tackled by Jimmie Ward and Rashard Robinson.","(0:53) Bradley Pinion punts for 54 yards to Car40. Ted Ginn Jr. return for 6 yards to Car46. Tackled by Shaun Draughn.","(0:53) Carolina Panthers timeout.","(0:57) Shaun Draughn rush up the middle for 3 yards to the SF6. Tackled by Vernon Butler and Kony Ealy.","(0:57) Carolina Panthers timeout.","(1:01) Shaun Draughn rush to the left for no gain to the SF3. Tackled by Luke Kuechly.","(1:01) Carolina Panthers timeout.","(1:04) Shaun Draughn rush up the middle for 1 yard to the SF3. Tackled by Luke Kuechly and Kony Ealy.","(1:13) Andy Lee punts for 49 yards to SF2. No return.","(1:13) San Francisco 49ers timeout.","(1:21) Fozzy Whittaker rush up the middle for 16 yards to the Car49. Tackled by Jaquiski Tartt.","(1:21) Cam Newton pass to the left to Ted Ginn Jr. for a loss of 1 yard to the Car33. Tackled by Jimmie Ward.","(1:34) Penalty: Holding on Carolina (Trai Turner) -10 yards.","(1:38) Cam Newton incomplete pass to the right intended for Mike Tolbert.","(1:45) Fozzy Whittaker rush to the right for 25 yards to the Car44. Tackled by Tramaine Brock.","(1:48) Cam Newton incomplete pass to the middle intended for Ted Ginn Jr..","(1:56) Bradley Pinion punts for 36 yards to Car19. No return.","(2:00) Blaine Gabbert incomplete pass to the left intended for Rod Streater.","(2:00) Two Minute Warning.","(2:35) Shaun Draughn rush up the middle for no gain to the SF45. Tackled by Kurt Coleman.","(2:41) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(3:15) Blaine Gabbert pass to the right to Jeremy Kerley for 13 yards to the SF45. Tackled by Luke Kuechly.","(3:55) Carlos Hyde rush to the left for 2 yards to the SF32. Tackled by Bene Benwikere and Luke Kuechly.","(4:21) Blaine Gabbert rush to the left for 6 yards to the SF30. Tackled by Thomas Davis.","(4:49) Blaine Gabbert pass to the left to Garrett Celek for 12 yards to the SF24. Tackled by Kurt Coleman.","(5:03) Andy Lee punts for 37 yards to SF12. No return.","(5:06) Cam Newton incomplete pass to the right intended for Devin Funchess.","(5:17) Cam Newton incomplete pass to the left intended for Corey Brown.","(5:55) Mike Tolbert rush to the right for 3 yards to the SF49. Tackled by Gerald Hodges Jr. and NaVorro Bowman.","(6:29) Cam Newton rush up the middle for 2 yards to the Car48. Tackled by Gerald Hodges Jr. and Mike Purcell.","(7:03) Cam Newton rush to the right for 4 yards to the Car46. Tackled by Ray-Ray Armstrong.","(7:49) Cam Newton pass to the middle to Fozzy Whittaker for 5 yards to the Car42. Tackled by DeForest Buckner.","(8:19) Fozzy Whittaker rush to the left for 19 yards to the Car37. Tackled by Jimmie Ward.","(8:27) Bradley Pinion punts for 55 yards to Car18. No return.","(8:32) Blaine Gabbert incomplete pass to the left intended for Jeremy Kerley.","(9:05) Blaine Gabbert pass to the right to Jeremy Kerley for 4 yards to the SF27. Tackled by Kurt Coleman.","(9:40) Carlos Hyde rush to the right for a loss of 2 yards to the SF23. Tackled by Robert McClain and Luke Kuechly.","(9:40) Graham Gano kicks off to the endzone. Touchback.","(9:40) Graham Gano extra point is good.","(9:52) Cam Newton pass to the right to Greg Olsen for 78 yards for a TOUCHDOWN.","(10:02) Phil Dawson kicks off to the Car5. Ted Ginn Jr. return for 17 yards to Car22. Tackled by Jaquiski Tartt.","(10:02) Phil Dawson extra point is good.","(10:10) Blaine Gabbert pass to the right to Torrey Smith for 28 yards for a TOUCHDOWN.","(10:43) Carlos Hyde rush to the left for 1 yard to the Car28. Tackled by Daryl Worley and Mario Addison.","(11:23) Shaun Draughn rush up the middle for 18 yards to the Car29. Tackled by Tre Boston.","(11:55) Blaine Gabbert pass to the left to Rod Streater for 13 yards to the Car47. Tackled by Daryl Worley.","(12:25) Shaun Draughn rush to the left for 2 yards to the SF50. Tackled by Luke Kuechly. Penalty: Holding on San Francisco (Garrett Celek) -10 yards.","(13:11) Carlos Hyde rush to the left for 8 yards to the SF48. Tackled by Tre Boston.","(13:40) Carlos Hyde rush to the right for a loss of 1 yard to the SF40. Tackled by James Bradberry.","(13:46) Fozzy Whittaker rush up the middle for 4 yards to the SF43. Tackled by Antoine Bethea. FUMBLE, recovered by SF (Ray-Ray Armstrong). Tackled by Greg Olsen.","(13:51) Cam Newton incomplete pass to the middle intended for Fozzy Whittaker.","(14:26) Cam Newton pass to the right to Fozzy Whittaker for 24 yards to the SF47. Tackled by Ahmad Brooks.","(15:00) Cam Newton pass to the left to Kelvin Benjamin for 9 yards to the Car29. Tackled by Eric Reid and NaVorro Bowman.","(0:27) Mike Tolbert rush up the middle for 4 yards to the Car20. Tackled by Arik Armstead and Quinton Dial.","(0:34) Bradley Pinion punts for 28 yards to Car16. No return.","(0:39) Blaine Gabbert incomplete pass to the right intended for Aaron Burbridge.","(1:25) Shaun Draughn rush to the right for a loss of 3 yards to the Car44. Tackled by Tre Boston.","(1:31) Blaine Gabbert incomplete pass to the right intended for Garrett Celek.","(2:07) Blaine Gabbert pass to the right to Quinton Patton for 9 yards to the Car41. Tackled by Shaq Thompson.","(2:47) Carlos Hyde rush to the left for 4 yards to the SF50. Tackled by Shaq Thompson and Mario Addison.","(3:24) Blaine Gabbert pass to the left to Torrey Smith for 20 yards to the SF46. Tackled by Bene Benwikere.","(3:59) Blaine Gabbert pass to the right to Jeremy Kerley for 12 yards to the SF26. Tackled by Luke Kuechly and Shaq Thompson.","(4:04) Graham Gano kicks off to the SF3. Quinton Patton return for 11 yards to SF14. Tackled by Daryl Worley.","(4:04) Graham Gano extra point is good.","(4:14) Carlos Hyde rush up the middle for no gain to the SF15. Tackled by Charles Johnson. FUMBLE, recovered by Car (Shaq Thompson) and returned for 9 yards for a TOUCHDOWN.","(4:40) Blaine Gabbert rush to the right for 3 yards to the SF15. Tackled by Charles Johnson.","(4:48) Andy Lee punts for 37 yards to SF12. No return.","(4:55) Cam Newton incomplete pass to the right intended for Greg Olsen.","(5:31) Cam Newton rush to the right for 1 yard to the SF49. Tackled by Ray-Ray Armstrong.","(6:01) Jonathan Stewart rush to the right for a loss of 3 yards to the Car50. Tackled by Tramaine Brock.","(6:08) Penalty: Pass Interference on Carolina (Kelvin Benjamin) -10 yards.","(6:16) Jonathan Stewart rush up the middle for no gain to the SF42. Tackled by Ray-Ray Armstrong. Penalty: Illegal Contact on San Francisco (Jimmie Ward) 5 yards.","(7:27) Fozzy Whittaker rush to the right for no gain to the SF42. Tackled by NaVorro Bowman.","(8:11) Fozzy Whittaker rush to the left for 7 yards to the SF42. Tackled by Ahmad Brooks.","(9:03) Penalty: Encroachment on San Francisco (Glenn Dorsey) 5 yards.","(9:03) Cam Newton pass to the right to Corey Brown for 8 yards to the Car46. Tackled by Antoine Bethea.","(9:39) Cam Newton pass to the left to Jonathan Stewart for no gain to the Car38. Tackled by Ahmad Brooks.","(10:03) Cam Newton pass to the left to Jonathan Stewart for 7 yards to the Car38. Tackled by DeForest Buckner and Jimmie Ward.","(10:40) Jonathan Stewart rush to the right for 2 yards to the Car31. Tackled by DeForest Buckner and NaVorro Bowman.","(11:16) Jonathan Stewart rush up the middle for 9 yards to the Car29. Tackled by Tramaine Brock.","(11:21) Phil Dawson kicks off to the Car3. Ted Ginn Jr. return for 17 yards to Car20. Tackled by Keith Reaser.","(11:24) Phil Dawson 29 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(11:31) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(12:17) Shaun Draughn rush to the left for a loss of 5 yards to the Car11. Tackled by Kawann Short.","(12:48) Carlos Hyde rush to the right for 5 yards to the Car6. Tackled by Kawann Short.","(13:21) Carlos Hyde rush up the middle for 2 yards to the Car11. Tackled by Thomas Davis.","(13:49) Carlos Hyde rush to the left for 6 yards to the Car13. Tackled by Luke Kuechly and Kony Ealy.","(14:17) Carlos Hyde rush to the left for 3 yards to the Car19. Tackled by Tre Boston.","(14:25) Cam Newton pass intended for Ed Dickson INTERCEPTED by Antoine Bethea defensed by NaVorro Bowman. No return. Tackled by Ed Dickson.","(14:54) Jonathan Stewart rush up the middle for 1 yard to the Car10. Tackled by NaVorro Bowman and Quinton Dial.","(15:00) Phil Dawson kicks off to the Car5. Ted Ginn Jr. return for 13 yards to Car18. Tackled by Aaron Burbridge. Penalty: Holding on Carolina (Shaq Thompson) -9 yards."]