["(0:02) Jacoby Brissett rush up the middle for a loss of 1 yard to the NE19.","(0:09) Ryan Tannehill pass intended for DeVante Parker INTERCEPTED by Duron Harmon. No return. Touchback.","(0:15) Ryan Tannehill incomplete pass to the right intended for Kenny Stills.","(0:19) Ryan Tannehill pass to the right to Jarvis Landry for 5 yards to the NE29.","(0:21) Ryan Tannehill incomplete pass to the middle.","(0:38) Ryan Tannehill rush to the right for 17 yards to the NE34. Tackled by Logan Ryan.","(0:42) Ryan Tannehill incomplete pass to the left intended for Jarvis Landry defensed by Chris Long.","(1:04) Ryan Tannehill pass to the left to DeVante Parker for 20 yards to the Mia49. Tackled by Devin McCourty.","(1:08) 39 yard field goal attempt by Stephen Gostkowski is NO GOOD. Holder: Ryan Allen.","(1:52) LeGarrette Blount rush to the left for 6 yards to the Mia21. Tackled by Neville Hewitt.","(1:52) Miami Dolphins timeout.","(1:55) LeGarrette Blount rush up the middle for no gain to the Mia27. Tackled by Ndamukong Suh and Isa Abdul-Quddus.","(1:55) Miami Dolphins timeout.","(2:00) LeGarrette Blount rush to the left for a loss of 3 yards to the Mia27. Tackled by Kiko Alonso.","(2:00) Two Minute Warning.","(2:17) Jacoby Brissett rush up the middle for 2 yards to the Mia24. Tackled by Koa Misi.","(2:17) Miami Dolphins timeout.","(2:35) LeGarrette Blount rush up the middle for 9 yards to the Mia26. Tackled by Kiko Alonso and Byron Maxwell.","(3:17) Jacoby Brissett pass to the right to Martellus Bennett for 16 yards to the Mia35. Tackled by Kiko Alonso and Isa Abdul-Quddus.","(3:53) LeGarrette Blount rush to the left for 1 yard to the NE49. Tackled by Kiko Alonso and Koa Misi.","(4:25) Jacoby Brissett rush up the middle for 1 yard to the NE48. Tackled by Ndamukong Suh.","(4:45) LeGarrette Blount rush to the left for 9 yards to the NE47. Tackled by Byron Maxwell. FUMBLE, recovered by NE.","(4:52) Jacoby Brissett incomplete pass to the right intended for Chris Hogan.","(5:30) LeGarrette Blount rush to the left for 7 yards to the NE38. Tackled by Kiko Alonso.","(6:06) LeGarrette Blount rush to the left for 6 yards to the NE31. Tackled by Ndamukong Suh.","(6:06) Andrew Franks kicks off to the endzone. Touchback.","(6:06) Andrew Franks extra point is good.","(6:10) Kenyan Drake rush to the right for 7 yards for a TOUCHDOWN.","(6:11) New England Patriots timeout.","(6:46) Ryan Tannehill rush to the right for 6 yards to the NE7. Tackled by Alan Branch.","(7:24) Ryan Tannehill pass to the left to Kenny Stills for 15 yards to the NE13. Tackled by Duron Harmon.","(8:01) Ryan Tannehill pass to the right to Jay Ajayi for 5 yards to the NE28. Tackled by Jamie Collins.","(8:46) Ryan Tannehill pass to the left to Jarvis Landry for 15 yards to the NE33. Tackled by Malcolm Butler.","(9:18) Ryan Tannehill pass to the middle to DeVante Parker for 13 yards to the NE48. Tackled by Malcolm Butler.","(9:44) Ryan Tannehill pass to the left to Jarvis Landry for 5 yards to the Mia39. Tackled by Justin Coleman.","(10:22) Jay Ajayi rush up the middle for 1 yard to the Mia34. Tackled by Malcom Brown and Shea McClellin.","(10:49) Ryan Tannehill pass to the middle to Jordan Cameron for 7 yards to the Mia33. Tackled by Jamie Collins.","(10:58) Ryan Allen punts for 28 yards to Mia26. No return.","(11:18) James White rush to the right for 5 yards to the NE46. Tackled by Ndamukong Suh.","(12:03) Jacoby Brissett sacked at NE41 for a loss of 14 yards by Michael Thomas. FUMBLE, recovered by NE (James White).","(12:33) Penalty: Holding on New England (Joe Thuney) -10 yards.","(13:09) LeGarrette Blount rush to the left for 5 yards to the Mia35. Tackled by Koa Misi.","(13:34) Jacoby Brissett pass to the left to Chris Hogan for 12 yards to the Mia40. Tackled by Xavien Howard.","(14:00) LeGarrette Blount rush up the middle for 3 yards to the NE48. Tackled by Reshad Jones.","(14:45) LeGarrette Blount rush to the left for 26 yards to the NE45. Tackled by Ndamukong Suh and Jelani Jenkins.","(14:51) Andrew Franks kicks off to the NE1. Matthew Slater return for 18 yards to NE19. Tackled by Mike Hull.","(14:51) Andrew Franks extra point is good.","(14:55) Ryan Tannehill pass to the left to Jordan Cameron for 12 yards for a TOUCHDOWN.","(15:00) Penalty: Pass Interference on New England (Logan Ryan) 20 yards.","(0:23) Ryan Tannehill pass to the left to Jarvis Landry for 14 yards to the NE32. Tackled by Malcolm Butler.","(0:52) Ryan Tannehill pass to the left to Jarvis Landry for 33 yards to the NE46. Tackled by Malcolm Butler.","(1:30) Ryan Tannehill pass to the right to DeVante Parker for 4 yards to the Mia21. Tackled by Jonathan Freeny.","(2:04) Kenyan Drake rush to the right for 5 yards to the Mia17. Tackled by Jonathan Freeny and Alan Branch.","(2:18) Ryan Allen punts for 37 yards to Mia22. No return. Penalty: Illegal Block on Miami (Michael Thomas) -10 yards.","(2:43) Jacoby Brissett pass to the left to James White for 5 yards to the NE41. Tackled by Reshad Jones.","(3:17) James White rush up the middle for a loss of 4 yards to the NE36. Tackled by Ndamukong Suh.","(3:58) Jacoby Brissett sacked at NE40 for a loss of 8 yards by Jason Jones.","(4:39) LeGarrette Blount rush to the right for 12 yards to the NE48. Tackled by Andre Branch and Reshad Jones.","(5:16) Jacoby Brissett rush to the right for 10 yards to the NE36. Tackled by Kiko Alonso.","(5:45) LeGarrette Blount rush up the middle for 1 yard to the NE26. Tackled by Kiko Alonso and Koa Misi.","(5:45) Andrew Franks kicks off to the endzone. Touchback.","(5:45) Andrew Franks extra point is good.","(5:52) Ryan Tannehill pass to the left to Kenny Stills for 24 yards for a TOUCHDOWN.","(6:27) Ryan Tannehill pass to the right to DeVante Parker for 5 yards to the NE24. Tackled by Logan Ryan.","(6:46) Ryan Tannehill pass to the right to Jay Ajayi for 11 yards to the NE29. Tackled by Jamie Collins.","(6:49) Ryan Tannehill incomplete pass to the left intended for Jarvis Landry.","(7:31) Ryan Tannehill pass to the right to Kenyan Drake for 2 yards to the NE40. Tackled by Chris Long.","(8:08) Ryan Tannehill pass to the right to DeVante Parker for 28 yards to the NE42. Tackled by Logan Ryan.","(8:44) Ryan Tannehill pass to the right to DeVante Parker for 5 yards to the Mia30. Tackled by Malcolm Butler and Elandon Roberts.","(8:44) Stephen Gostkowski kicks off to the endzone. Touchback.","(8:44) Stephen Gostkowski extra point is good.","(8:46) LeGarrette Blount rush to the right for 9 yards for a TOUCHDOWN.","(9:16) Jacoby Brissett pass to the right to Julian Edelman for 7 yards to the Mia18. Tackled by Bobby McCain. Penalty: Unsports. Conduct on Miami (Bobby McCain) 9 yards.","(9:57) Jacoby Brissett pass to the right to Martellus Bennett for 15 yards to the Mia25. Tackled by Isa Abdul-Quddus.","(10:22) Penalty: Holding on New England (Joe Thuney) -10 yards.","(10:53) LeGarrette Blount rush to the right for 1 yard to the Mia30. Tackled by Kiko Alonso.","(11:35) Jacoby Brissett pass to the left to Martellus Bennett for 37 yards to the Mia31. Tackled by Isa Abdul-Quddus and Kiko Alonso.","(11:41) Jay Ajayi rush to the left for no gain to the NE34. Tackled by Jonathan Freeny. FUMBLE, recovered by NE (Trey Flowers).","(12:21) Ryan Tannehill pass to the right to DeVante Parker for 13 yards to the NE34. Tackled by Logan Ryan.","(12:52) Jay Ajayi rush up the middle for 1 yard to the NE47. Tackled by Alan Branch and Trey Flowers.","(13:17) Ryan Tannehill pass to the left to DeVante Parker for 18 yards to the NE48.","(13:58) Ryan Tannehill pass to the middle to Jarvis Landry for 7 yards to the Mia34. Tackled by Malcolm Butler.","(14:44) Ryan Tannehill pass to the right to Jordan Cameron for 12 yards to the Mia27. Tackled by Patrick Chung.","(15:00) Penalty: Holding on Miami (Kenny Stills) -10 yards.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback.","(0:05) Andrew Franks 27 yard field goal attempt is GOOD. Holder: Matt Darr.","(0:11) Ryan Tannehill incomplete pass to the right intended for DeVante Parker.","(0:11) Miami Dolphins timeout.","(0:18) Ryan Tannehill pass to the right to Jarvis Landry for 25 yards to the NE9. Tackled by Malcolm Butler.","(0:18) Miami Dolphins timeout.","(0:26) Ryan Tannehill pass to the left to Dion Sims for 21 yards to the NE34. Tackled by Patrick Chung.","(0:34) Ryan Tannehill rush to the left for 8 yards to the Mia45.","(0:41) Ryan Tannehill pass to the right to Jordan Cameron for 5 yards to the Mia37. Tackled by Patrick Chung.","(0:49) Ryan Tannehill pass to the left to Jarvis Landry for 6 yards to the Mia32. Tackled by Justin Coleman.","(0:53) Ryan Tannehill incomplete pass to the right intended for DeVante Parker defensed by Malcolm Butler.","(0:58) Ryan Tannehill pass to the right to Jay Ajayi for 7 yards to the Mia26. Tackled by Logan Ryan.","(0:58) Penalty: Too Many Men on Field on New England 5 yards.","(1:05) Ryan Allen punts for 30 yards to Mia14. No return.","(1:09) Jacoby Brissett incomplete pass to the left intended for Julian Edelman.","(1:09) Miami Dolphins timeout.","(1:19) LeGarrette Blount rush up the middle for 2 yards to the Mia44. Tackled by Mario Williams.","(1:49) LeGarrette Blount rush to the left for 3 yards to the Mia46. Tackled by Reshad Jones and Ndamukong Suh.","(1:58) Ryan Tannehill pass intended for Jarvis Landry INTERCEPTED by Jamie Collins and returned for 13 yards. Tackled by Jarvis Landry and Jay Ajayi.","(1:58) Two Minute Warning.","(2:05) Ryan Tannehill pass to the right to Jay Ajayi for 8 yards to the NE46. Tackled by Logan Ryan.","(2:20) Ryan Tannehill pass to the left to Jordan Cameron for 13 yards to the Mia46. Tackled by Patrick Chung.","(2:48) Jay Ajayi rush to the right for 8 yards to the Mia33. Tackled by Jamie Collins.","(2:48) Stephen Gostkowski kicks off to the endzone. Touchback.","(2:52) Stephen Gostkowski 34 yard field goal attempt is GOOD. Holder: Ryan Allen.","(2:56) Jacoby Brissett incomplete pass to the right intended for Julian Edelman.","(3:32) LeGarrette Blount rush to the right for 1 yard to the Mia16. Tackled by Koa Misi and Jordan Phillips.","(4:02) LeGarrette Blount rush to the right for 4 yards to the Mia17. Tackled by Koa Misi and Jason Jones.","(4:04) New England Patriots timeout.","(4:57) Jimmy Garoppolo pass to the right to Malcolm Mitchell for 15 yards to the Mia21. Tackled by Reshad Jones.","(5:38) LeGarrette Blount rush to the right for 1 yard to the Mia36. Tackled by Ndamukong Suh and Jason Jones.","(5:41) Jimmy Garoppolo incomplete pass to the right intended for Martellus Bennett.","(5:45) Penalty: Unnecessary Roughness on Miami (Isa Abdul-Quddus) 15 yards.","(5:49) Jimmy Garoppolo incomplete pass to the right intended for D.J. Foster.","(5:58) Ryan Tannehill pass to the left to Jarvis Landry for 4 yards to the Mia46. Tackled by Logan Ryan. FUMBLE, recovered by NE (Chris Long). Tackled by Kenny Stills.","(6:02) Ryan Tannehill incomplete pass to the right intended for DeVante Parker.","(6:14) Jimmy Garoppolo pass to the middle to Danny Amendola for 13 yards to the Mia44. Tackled by Bobby McCain. FUMBLE, recovered by Mia (Kiko Alonso). Tackled by Danny Amendola.","(6:20) Jimmy Garoppolo incomplete pass to the right intended for Julian Edelman defensed by Xavien Howard.","(7:00) LeGarrette Blount rush up the middle for 2 yards to the NE43. Tackled by Ndamukong Suh and Chris Jones.","(7:24) Penalty: Illegal Use of Hands on Miami (Xavien Howard) 5 yards.","(8:04) Jimmy Garoppolo pass to the left to James White for 5 yards to the NE36. Tackled by Byron Maxwell and Kiko Alonso.","(8:09) Jimmy Garoppolo incomplete pass to the left intended for Malcolm Mitchell.","(8:19) Matt Darr punts for 56 yards to NE24. Danny Amendola return for 7 yards to NE31. Tackled by Mike Hull.","(8:58) Ryan Tannehill rush up the middle for no gain to the Mia39. FUMBLE, recovered by Mia (Ryan Tannehill).","(9:23) Jay Ajayi rush to the left for 4 yards to the Mia39. Tackled by Barkevious Mingo.","(9:29) Ryan Tannehill incomplete pass to the left intended for DeVante Parker defensed by Devin McCourty.","(10:02) Ryan Tannehill pass to the right to Jarvis Landry for 21 yards to the Mia35. Tackled by Malcolm Butler.","(10:13) Ryan Allen punts for 33 yards to Mia14. No return.","(10:18) Penalty: False Start on New England (Barkevious Mingo) -5 yards.","(10:18) Jimmy Garoppolo incomplete pass to the left intended for James White.","(10:59) James White rush up the middle for 2 yards to the Mia42. Tackled by Ndamukong Suh and Jelani Jenkins.","(11:33) Jimmy Garoppolo pass to the left to Chris Hogan for 4 yards to the Mia44. Tackled by Jelani Jenkins.","(11:44) Matt Darr punts for 52 yards to NE33. Danny Amendola return for 19 yards to Mia48. Tackled by Spencer Paysinger and MarQueis Gray.","(11:50) Ryan Tannehill incomplete pass to the left intended for Jordan Cameron.","(12:28) Ryan Tannehill pass to the left to Kenyan Drake for 4 yards to the Mia15. Tackled by Jamie Collins.","(13:07) Arian Foster rush to the right for 1 yard to the Mia11. Tackled by Vincent Valentine.","(13:10) Stephen Gostkowski kicks off to the Mia-5. Kenyan Drake return for 15 yards to Mia10. Tackled by Matthew Slater.","(13:10) Stephen Gostkowski extra point is good.","(13:14) Jimmy Garoppolo pass to the middle to Danny Amendola for 10 yards for a TOUCHDOWN.","(13:48) Jimmy Garoppolo pass to the left to Julian Edelman for 8 yards to the Mia10. Tackled by Michael Thomas.","(14:27) LeGarrette Blount rush to the left for a loss of 2 yards to the Mia18. Tackled by Ndamukong Suh and Jordan Phillips.","(15:00) James White rush up the middle for 16 yards to the Mia16. Tackled by Isa Abdul-Quddus and Kiko Alonso.","(0:42) D.J. Foster rush to the left for 7 yards to the Mia32. Tackled by Reshad Jones.","(1:12) Penalty: Holding on New England (Marcus Cannon) -10 yards.","(1:54) Jimmy Garoppolo pass to the middle to Julian Edelman for 19 yards to the Mia29. Tackled by Koa Misi.","(2:02) Jimmy Garoppolo incomplete pass to the left intended for Chris Hogan.","(2:35) LeGarrette Blount rush up the middle for 3 yards to the Mia48. Tackled by Terrence Fede and Xavien Howard.","(3:12) Jimmy Garoppolo pass to the left to Danny Amendola for 13 yards to the NE49. Tackled by Isa Abdul-Quddus.","(3:19) Jimmy Garoppolo incomplete pass to the middle intended for Matthew Slater.","(3:55) LeGarrette Blount rush to the right for 3 yards to the NE36. Tackled by Julius Warmsley.","(4:31) Jimmy Garoppolo pass to the left to Julian Edelman for 9 yards to the NE33. Tackled by Byron Maxwell and Jelani Jenkins.","(4:38) Matt Darr punts for 42 yards to NE24. No return.","(5:12) Ryan Tannehill rush up the middle for no gain to the Mia34. Tackled by Patrick Chung.","(5:41) Ryan Tannehill rush to the left for 4 yards to the Mia34. Tackled by Shea McClellin.","(6:22) Arian Foster rush to the left for 5 yards to the Mia30. Tackled by Jabaal Sheard.","(6:22) Stephen Gostkowski kicks off to the endzone. Touchback.","(6:22) Stephen Gostkowski extra point is good.","(6:27) Jimmy Garoppolo pass to the right to Martellus Bennett for 20 yards for a TOUCHDOWN.","(6:31) Jimmy Garoppolo incomplete pass to the left intended for James White defensed by Jelani Jenkins.","(7:08) LeGarrette Blount rush to the left for 1 yard to the Mia20. Tackled by Koa Misi and Ndamukong Suh.","(7:51) Jimmy Garoppolo pass to the left to Chris Hogan for 24 yards to the Mia21. Tackled by Isa Abdul-Quddus.","(8:24) LeGarrette Blount rush to the right for 2 yards to the Mia45. Tackled by Koa Misi.","(9:02) Jimmy Garoppolo pass to the left to Julian Edelman for 9 yards to the Mia47. Tackled by Isa Abdul-Quddus.","(9:32) Jimmy Garoppolo pass to the right to Chris Hogan for 19 yards to the NE44. Tackled by Xavien Howard.","(9:42) Matt Darr punts for 49 yards to NE18. Danny Amendola return for 7 yards to NE25. Tackled by Neville Hewitt.","(9:47) Ryan Tannehill incomplete pass to the right intended for Jordan Cameron defensed by Duron Harmon.","(9:53) Ryan Tannehill incomplete pass to the right intended for Kenny Stills.","(10:27) Arian Foster rush to the right for 3 yards to the Mia33. Tackled by Patrick Chung.","(10:53) Penalty: Holding on New England (Jonathan Freeny) 5 yards.","(10:53) Stephen Gostkowski kicks off to the endzone. Touchback.","(10:53) Stephen Gostkowski extra point is good.","(11:02) Jimmy Garoppolo pass to the left to Danny Amendola for 12 yards for a TOUCHDOWN.","(11:39) LeGarrette Blount rush to the left for 2 yards to the Mia12. Tackled by Julius Warmsley and Chris Jones.","(12:15) Jimmy Garoppolo pass to the right to Martellus Bennett for 26 yards to the Mia14. Tackled by Terrence Fede.","(12:40) Jimmy Garoppolo pass to the left to Julian Edelman for 11 yards to the Mia40. Tackled by Byron Maxwell.","(13:22) Jimmy Garoppolo pass to the right to D.J. Foster for 2 yards to the NE49. Tackled by Xavien Howard and Reshad Jones.","(13:59) LeGarrette Blount rush up the middle for a loss of 1 yard to the NE47. Tackled by Jelani Jenkins.","(14:30) LeGarrette Blount rush up the middle for 10 yards to the NE48. Tackled by Reshad Jones and Michael Thomas.","(15:00) Jimmy Garoppolo pass to the left to Julian Edelman for 13 yards to the NE38. Tackled by Reshad Jones and Xavien Howard.","(15:00) Andrew Franks kicks off to the endzone. Touchback."]