["(0:13) Joe Flacco rush to the right for 1 yard to the Bal2. Tackled by Jamie Meder.","(0:20) Josh McCown pass intended for Terrelle Pryor Sr. INTERCEPTED by C.J. Mosley. No return. Tackled by Terrelle Pryor Sr..","(0:34) Josh McCown pass to the right to Corey Coleman for 11 yards to the Bal30. Tackled by Lardarius Webb.","(0:55) Josh McCown pass to the left to Gary Barnidge for 7 yards to the Bal41. Tackled by Tavon Young.","(0:55) Cleveland Browns timeout.","(1:04) Josh McCown pass to the right to Duke Johnson Jr. for a loss of 1 yard to the Bal48. Tackled by Timmy Jernigan.","(1:31) Josh McCown pass to the right to Terrelle Pryor Sr. for 1 yard to the Bal47. Tackled by Tavon Young.","(2:00) Josh McCown pass to the middle to Andrew Hawkins for 16 yards to the Bal48. Tackled by Eric Weddle.","(2:00) Two Minute Warning.","(2:27) Josh McCown pass to the middle to Gary Barnidge for 6 yards to the Cle36. Tackled by Zachary Orr.","(2:53) Josh McCown pass to the right to Duke Johnson Jr. for 5 yards to the Cle30. Tackled by Lardarius Webb.","(2:53) Justin Tucker kicks off to the endzone. Touchback.","(2:57) Justin Tucker 41 yard field goal attempt is GOOD. Holder: Sam Koch.","(3:00) Joe Flacco incomplete pass to the right intended for Justin Forsett.","(3:00) Baltimore Ravens timeout.","(3:06) Justin Forsett rush to the left for 4 yards to the Cle23. Tackled by Christian Kirksey.","(3:48) Justin Forsett rush to the right for a loss of 1 yard to the Cle27. Tackled by Nate Orchard and Demario Davis.","(4:27) Terrance West rush to the left for 9 yards to the Cle26. Tackled by Stephen Paea.","(5:01) Terrance West rush to the right for 3 yards to the Cle35. Tackled by Danny Shelton and Jordan Poyer.","(5:41) Joe Flacco pass to the right to Dennis Pitta for 4 yards to the Cle38. Tackled by Derrick Kindred.","(5:41) Baltimore Ravens timeout.","(6:22) Justin Forsett rush to the left for 1 yard to the Cle42. Tackled by Nate Orchard.","(6:59) Terrance West rush to the right for 6 yards to the Cle43. Tackled by Joe Haden.","(7:28) Joe Flacco pass to the left to Terrance West for 15 yards to the Cle49. Tackled by Jordan Poyer.","(8:01) Terrance West rush to the right for no gain to the Bal36. Tackled by Christian Kirksey and Danny Shelton.","(8:11) Britton Colquitt punts for 41 yards to Bal29. Devin Hester return for 7 yards to Bal36. Tackled by Jordan Poyer.","(8:15) Josh McCown incomplete pass to the right intended for Duke Johnson Jr..","(8:50) Penalty: Illegal Plyr Downfld on Cleveland (Cameron Erving) -5 yards.","(9:33) Josh McCown sacked at Cle35 for a loss of 6 yards by Michael Pierce.","(10:09) Isaiah Crowell rush to the right for a loss of 3 yards to the Cle41. Tackled by Terrell Suggs and Lawrence Guy.","(10:42) Josh McCown pass to the right to Terrelle Pryor Sr. for 15 yards to the Cle44. Tackled by Lardarius Webb.","(11:19) Isaiah Crowell rush to the left for 4 yards to the Cle29. Tackled by Eric Weddle.","(11:19) Justin Tucker kicks off to the endzone. Touchback.","(11:23) Justin Tucker 49 yard field goal attempt is GOOD. Holder: Sam Koch.","(11:28) Joe Flacco incomplete pass to the middle intended for Crockett Gillmore defensed by Derrick Kindred.","(11:56) Penalty: Illegal Shift on Baltimore (Dennis Pitta) -5 yards.","(12:39) Justin Forsett rush to the right for 2 yards to the Cle26. Tackled by Demario Davis and Nate Orchard.","(13:19) Justin Forsett rush to the right for 2 yards to the Cle28. Tackled by Emmanuel Ogbah.","(13:54) Joe Flacco pass to the left to Dennis Pitta for 28 yards to the Cle30. Tackled by Jordan Poyer and Christian Kirksey.","(13:58) 52 yard field goal attempt by Patrick Murray is NO GOOD. Holder: Britton Colquitt.","(14:04) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(14:32) Isaiah Crowell rush to the right for 2 yards to the Bal19. Tackled by Timmy Jernigan. Penalty: Unsports. Conduct on Cleveland (Corey Coleman) -15 yards.","(15:00) Isaiah Crowell rush to the right for a loss of 5 yards to the Bal21. Tackled by Lawrence Guy.","(0:10) Josh McCown pass to the right to Corey Coleman for 47 yards to the Bal16. Tackled by Shareece Wright.","(0:52) Isaiah Crowell rush to the right for 2 yards to the Cle37. Tackled by Eric Weddle.","(1:32) Isaiah Crowell rush to the right for 3 yards to the Cle35. Tackled by Zachary Orr.","(1:42) Sam Koch punts for 60 yards to Cle19. Joe Haden return for 13 yards to Cle32. Tackled by Zachary Orr.","(1:48) Joe Flacco incomplete pass to the left intended for Breshad Perriman defensed by Jordan Poyer.","(2:31) Joe Flacco pass to the left to Breshad Perriman for 12 yards to the Bal21. Tackled by Jamar Taylor.","(3:18) Joe Flacco pass to the left to Justin Forsett for a loss of 5 yards to the Bal9. Tackled by Demario Davis.","(3:43) Penalty: Illegal Block on Baltimore (Rick Wagner) -14 yards.","(4:05) Penalty: Illegal Shift on Baltimore -5 yards.","(4:35) Joe Flacco pass to the left to Dennis Pitta for 9 yards to the Bal33. Tackled by Tank Carder.","(5:20) Terrance West rush to the right for 3 yards to the Bal24. Tackled by Danny Shelton.","(6:00) Terrance West rush to the left for 4 yards to the Bal21. Tackled by Danny Shelton.","(6:07) Britton Colquitt punts for 48 yards to Bal17. No return.","(6:12) Josh McCown incomplete pass to the left intended for Terrelle Pryor Sr..","(6:18) Josh McCown incomplete pass to the left intended for Gary Barnidge.","(6:50) Josh McCown incomplete pass to the right intended for Corey Coleman. Penalty: Illegal Touch on Cleveland (Corey Coleman) 0 yards.","(6:50) Cleveland Browns timeout.","(7:29) Isaiah Crowell rush to the left for 15 yards to the Cle35. Tackled by Lardarius Webb.","(7:35) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(7:42) Joe Flacco pass intended for Breshad Perriman INTERCEPTED by Joe Haden. No return. Touchback.","(7:47) Penalty: Illegal Contact on Cleveland (Joe Haden) 5 yards.","(8:22) Cleveland Browns timeout.","(8:22) Joe Flacco pass to the left to Breshad Perriman for 20 yards to the Cle34. Tackled by Derrick Kindred.","(8:22) Baltimore Ravens timeout.","(8:28) Joe Flacco incomplete pass to the middle intended for Justin Forsett.","(9:10) Justin Forsett rush to the left for 1 yard to the Bal46. Tackled by Danny Shelton and Emmanuel Ogbah.","(9:20) Britton Colquitt punts for 52 yards to Bal30. Devin Hester return for 15 yards to Bal45.","(9:59) Josh McCown sacked at Cle18 for a loss of 5 yards by Timmy Jernigan.","(10:44) Isaiah Crowell rush to the left for 1 yard to the Cle23. Tackled by Timmy Jernigan and Zachary Orr.","(10:50) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(11:23) Josh McCown pass to the right to Duke Johnson Jr. for 12 yards to the Cle22. Tackled by Timmy Jernigan.","(12:04) Isaiah Crowell rush to the right for a loss of 1 yard to the Cle10. Tackled by C.J. Mosley.","(12:10) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(12:17) Justin Tucker kicks off to the Cle5. George Atkinson III return for 13 yards to Cle18. Tackled by Kendrick Lewis. FUMBLE, recovered by Cle (Ricardo Louis) and advanced for 1 yard. Penalty: Holding on Cleveland (Don Jones) -10 yards.","(12:17) Justin Tucker extra point is good.","(12:22) Joe Flacco pass to the left to Mike Wallace for 17 yards for a TOUCHDOWN.","(13:00) Terrance West rush to the right for 3 yards to the Cle17. Tackled by Danny Shelton and Demario Davis.","(13:36) Joe Flacco pass to the right to Steve Smith Sr. for 31 yards to the Cle20. Tackled by Joe Haden.","(14:14) Joe Flacco pass to the right to Steve Smith Sr. for 19 yards to the Bal49. Tackled by Tramon Williams.","(14:18) Joe Flacco incomplete pass to the right intended for Dennis Pitta.","(14:56) Terrance West rush to the left for 5 yards to the Bal30. Tackled by Demario Davis.","(15:00) Patrick Murray kicks off to the Bal-7. Devin Hester return for 32 yards to Bal25. Tackled by Tyrone Holmes.","(0:05) Justin Tucker 52 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:10) Joe Flacco incomplete pass to the right intended for Steve Smith Sr..","(0:10) Baltimore Ravens timeout.","(0:16) Joe Flacco pass to the right to Steve Smith Sr. for 14 yards to the Cle34. Tackled by Joe Haden and Jordan Poyer.","(0:23) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(0:23) Baltimore Ravens timeout.","(0:29) Joe Flacco pass to the left to Kyle Juszczyk for 8 yards to the Cle48. Tackled by Demario Davis.","(0:29) Baltimore Ravens timeout.","(0:37) Joe Flacco pass to the left to Dennis Pitta for 5 yards to the Bal44. Tackled by Tramon Williams and Demario Davis.","(0:42) Joe Flacco incomplete pass to the right intended for Steve Smith Sr. defensed by Joe Haden.","(0:49) Josh McCown pass intended for Rashard Higgins INTERCEPTED by Eric Weddle. No return.","(1:10) Josh McCown pass to the right to Gary Barnidge for 10 yards to the Cle30. Tackled by Zachary Orr.","(1:15) Justin Tucker kicks off to the Cle1. Duke Johnson Jr. return for 19 yards to Cle20. Tackled by Kendrick Lewis.","(1:15) Justin Tucker extra point is good.","(1:19) Joe Flacco pass to the right to Mike Wallace for 7 yards for a TOUCHDOWN.","(2:00) Justin Forsett rush to the left for 2 yards to the Cle7. Tackled by Joe Schobert.","(2:00) Two Minute Warning.","(2:05) Joe Flacco pass to the middle to Crockett Gillmore for 22 yards to the Cle18. Tackled by Jordan Poyer. Penalty: Roughing Passer on Cleveland (Stephen Paea) 9 yards.","(2:44) Joe Flacco pass to the left to Dennis Pitta for 30 yards to the Cle40. Tackled by Derrick Kindred.","(2:51) Joe Flacco incomplete pass to the right intended for Breshad Perriman defensed by Joe Haden.","(3:14) Justin Forsett rush to the right for 5 yards to the Bal30. Tackled by Jamar Taylor.","(3:22) Britton Colquitt punts for 47 yards to Bal25. No return.","(4:01) Duke Johnson Jr. rush to the left for 8 yards to the Cle28. Tackled by Eric Weddle.","(4:49) Josh McCown sacked at Cle20 for a loss of 7 yards by Brent Urban.","(5:18) Isaiah Crowell rush to the left for 5 yards to the Cle27. Tackled by Matt Judon.","(5:50) Josh McCown pass to the right to Andrew Hawkins for 4 yards to the Cle22. Tackled by Jimmy Smith.","(6:33) Josh McCown pass to the left to Corey Coleman for 4 yards to the Cle18. Tackled by Za'Darius Smith.","(7:14) Isaiah Crowell rush to the right for 4 yards to the Cle14. Tackled by Zachary Orr.","(7:23) Sam Koch punts for 54 yards to Cle10. Tramon Williams - no return. FUMBLE, recovered by Cle (Tramon Williams).","(7:28) Joe Flacco incomplete pass to the left intended for Dennis Pitta defensed by Derrick Kindred.","(8:02) Joe Flacco pass to the left to Dennis Pitta for 3 yards to the Bal36. Tackled by Tramon Williams.","(8:06) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(8:42) Justin Forsett rush to the right for 7 yards to the Bal33. Tackled by Derrick Kindred.","(9:20) Joe Flacco pass to the middle to Dennis Pitta for 4 yards to the Bal26. Tackled by Corey Lemonier.","(9:54) Joe Flacco pass to the middle to Dennis Pitta for 13 yards to the Bal22. Tackled by Derrick Kindred.","(9:58) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(10:31) Joe Flacco pass to the right to Justin Forsett for 6 yards to the Bal9. Tackled by Christian Kirksey.","(10:40) Britton Colquitt punts for 38 yards to Bal3. No return.","(10:40) Penalty: False Start on Cleveland (Cameron Erving) -5 yards.","(10:40) Cleveland Browns timeout.","(11:14) Josh McCown rush to the right for no gain to the Bal36. Tackled by C.J. Mosley and Zachary Orr.","(11:18) Penalty: Offside on Baltimore (C.J. Mosley) 5 yards.","(11:18) Josh McCown incomplete pass to the right intended for Corey Coleman.","(12:01) Isaiah Crowell rush to the right for 3 yards to the Bal41.","(12:41) Josh McCown pass to the right to Isaiah Crowell for 15 yards to the Bal44. Tackled by Lardarius Webb.","(13:24) Josh McCown pass to the right to Terrelle Pryor Sr. for 16 yards to the Cle41. Tackled by Jimmy Smith.","(14:07) Duke Johnson Jr. rush to the right for 2 yards to the Cle25. Tackled by Brandon Williams and Zachary Orr.","(14:07) Cleveland Browns timeout.","(14:50) Josh McCown rush up the middle for no gain to the Cle27. FUMBLE, recovered by Cle (Josh McCown).","(15:00) Justin Forsett rush to the left for 1 yard to the Cle27. Tackled by Demario Davis and Tramon Williams.","(0:20) Terrance West rush to the left for no gain to the Cle28. Tackled by Christian Kirksey.","(0:56) Joe Flacco pass to the left to Justin Forsett for 8 yards to the Cle28. Tackled by Christian Kirksey.","(1:01) Joe Flacco incomplete pass to the left intended for Chris Moore.","(1:33) Justin Forsett rush to the left for 11 yards to the Cle36. Tackled by Ibraheim Campbell.","(1:37) Joe Flacco incomplete pass to the middle intended for Terrance West.","(2:12) Joe Flacco pass to the right to Mike Wallace for 12 yards to the Cle47. Tackled by Tramon Williams.","(3:01) Justin Forsett rush to the right for 2 yards to the Bal41. Tackled by Tramon Williams.","(3:12) Joe Flacco incomplete pass to the left intended for Kamar Aiken.","(3:49) Joe Flacco pass to the right to Chris Moore for 9 yards to the Bal39. Tackled by Tramon Williams.","(4:31) Terrance West rush to the right for 5 yards to the Bal30. Tackled by Demario Davis.","(4:33) Joe Flacco incomplete pass to the left intended for Terrance West.","(4:34) Patrick Murray kicks off to the endzone. Touchback.","(4:34) Patrick Murray extra point is BLOCKED. Return of blocked extra point by Tavon Young for 2 pts.","(4:40) Josh McCown pass to the left to Corey Coleman for 11 yards for a TOUCHDOWN.","(5:11) Josh McCown pass to the left to Gary Barnidge for 14 yards to the Bal11. Tackled by Zachary Orr.","(5:52) Isaiah Crowell rush to the left for 2 yards to the Bal25. Tackled by Timmy Jernigan and Eric Weddle.","(5:59) Josh McCown incomplete pass to the right intended for Terrelle Pryor Sr..","(6:10) Joe Flacco pass intended for Steve Smith Sr. INTERCEPTED by Joe Haden and returned for 9 yards. Tackled by Alex Lewis.","(6:46) Terrance West rush to the right for 4 yards to the Bal29. Tackled by Danny Shelton and Jamie Meder.","(6:47) Patrick Murray kicks off to the endzone. Touchback.","(6:47) Patrick Murray extra point is good.","(6:58) Isaiah Crowell rush to the left for 85 yards for a TOUCHDOWN.","(6:58) Sam Koch punts for 27 yards to Cle15. No return.","(7:08) Joe Flacco incomplete pass to the right intended for Kyle Juszczyk.","(7:50) Justin Forsett rush to the right for a loss of 1 yard to the Cle42. Tackled by Christian Kirksey.","(7:54) Joe Flacco incomplete pass to the middle intended for Crockett Gillmore.","(8:30) Joe Flacco pass to the right to Mike Wallace for 5 yards to the Cle41. Tackled by Joe Haden.","(9:04) Joe Flacco pass to the left to Dennis Pitta for 6 yards to the Cle46. Tackled by Jamar Taylor.","(9:37) Justin Forsett rush to the right for 1 yard to the Bal48. Tackled by Danny Shelton and Jamie Meder.","(9:45) Patrick Murray kicks off to the Bal-1. Devin Hester return for 48 yards to Bal47. Tackled by Patrick Murray.","(9:45) Patrick Murray extra point is good.","(9:51) Josh McCown pass to the left to Corey Coleman for 31 yards for a TOUCHDOWN.","(10:36) Isaiah Crowell rush to the left for 8 yards to the Bal31. Tackled by C.J. Mosley.","(11:20) Duke Johnson Jr. rush to the left for 2 yards to the Bal39. Tackled by Eric Weddle.","(11:42) Penalty: Pass Interference on Cleveland (Terrelle Pryor Sr.) -10 yards.","(12:25) Josh McCown pass to the right to Duke Johnson Jr. for 28 yards to the Bal31. Tackled by C.J. Mosley.","(12:30) Josh McCown incomplete pass to the left intended for Corey Coleman.","(13:11) Isaiah Crowell rush to the right for 5 yards to the Cle41. Tackled by Terrell Suggs.","(13:42) Josh McCown pass to the right to Andrew Hawkins for 8 yards to the Cle36. Tackled by Zachary Orr.","(14:24) Isaiah Crowell rush to the right for 4 yards to the Cle28. Tackled by Terrell Suggs and C.J. Mosley.","(15:00) Isaiah Crowell rush to the right for a loss of 1 yard to the Cle24. Tackled by C.J. Mosley.","(15:00) Justin Tucker kicks off to the endzone. Touchback."]