["(0:04) Kirk Cousins incomplete pass to the left intended for Josh Doctson defensed by J.J. Wilcox.","(0:37) Penalty: False Start on Washington (Kory Lichtensteiger) -5 yards.","(0:37) Kirk Cousins pass to the left to Chris Thompson for 10 yards to the Dal36. Tackled by Barry Church.","(0:40) Kirk Cousins pass to the left to Jamison Crowder for 6 yards to the Dal46. Tackled by Brandon Carr.","(0:43) Kirk Cousins incomplete pass to the middle.","(1:05) Kirk Cousins pass to the left to Chris Thompson for 38 yards to the Was48. Tackled by Orlando Scandrick.","(1:25) Kirk Cousins sacked at Was10 for a loss of 8 yards by Tyrone Crawford.","(1:30) Kirk Cousins pass to the left to Jordan Reed for 8 yards to the Was18. Tackled by Brandon Carr.","(1:40) Chris Jones punts for 32 yards to Was10. No return.","(1:40) Washington Redskins timeout.","(1:46) Dak Prescott sacked at Was42 for a loss of 2 yards by David Bruton Jr..","(1:46) Washington Redskins timeout.","(1:51) Alfred Morris rush to the right for a loss of 2 yards to the Was40. Tackled by Bashaud Breeland and Preston Smith.","(1:51) Washington Redskins timeout.","(1:56) Alfred Morris rush to the right for 5 yards to the Was38. Tackled by Ricky Jean Francois.","(2:00) Kirk Cousins incomplete pass to the right intended for Pierre Garcon defensed by Justin Durant.","(2:00) Two Minute Warning.","(2:38) Chris Thompson rush to the left for no gain to the Was44. Tackled by Sean Lee.","(3:07) Kirk Cousins pass to the left to Jamison Crowder for 9 yards to the Was44. Tackled by Orlando Scandrick.","(3:09) Kirk Cousins incomplete pass to the left intended for Chris Thompson.","(3:38) Kirk Cousins pass to the left to Jamison Crowder for 2 yards to the Was35. Tackled by Justin Durant.","(4:12) Kirk Cousins pass to the right to Jamison Crowder for 5 yards to the Was33. Tackled by Orlando Scandrick.","(4:45) Matt Jones rush to the left for 3 yards to the Was28. Tackled by Maliek Collins.","(4:45) Dan Bailey kicks off to the endzone. Touchback.","(4:45) Dan Bailey extra point is good.","(4:49) Alfred Morris rush to the right for 4 yards for a TOUCHDOWN.","(5:24) Dak Prescott pass to the left to Jason Witten for 8 yards to the Was4. Tackled by Will Compton.","(6:04) Dak Prescott pass to the left to Cole Beasley for 12 yards to the Was12. Tackled by Josh Norman.","(6:10) Dak Prescott incomplete pass to the right intended for Dez Bryant defensed by Josh Norman.","(6:56) Ezekiel Elliott rush up the middle for a loss of 1 yard to the Was24. Tackled by Trent Murphy. FUMBLE, recovered by Dal (Doug Free).","(7:12) Penalty: Illegal Use of Hands on Washington (Josh Norman) 5 yards.","(7:52) Ezekiel Elliott rush up the middle for 1 yard to the Was28. Tackled by Trent Murphy and Will Compton.","(8:15) Dak Prescott pass to the right to Geoff Swaim for 1 yard to the Was44. Tackled by DeAngelo Hall. Penalty: Roughing Passer on Washington (Mason Foster) 15 yards.","(8:52) Ezekiel Elliott rush to the left for 4 yards to the Was45. Tackled by David Bruton Jr. and Dashaun Phillips.","(9:28) Dak Prescott pass to the right to Cole Beasley for 14 yards to the Was49. Tackled by Dashaun Phillips.","(9:56) Dak Prescott pass to the right to Dez Bryant for 21 yards to the Dal37. Tackled by Mason Foster.","(10:35) Ezekiel Elliott rush to the left for a loss of 4 yards to the Dal16. Tackled by Trent Murphy and Su'a Cravens.","(10:43) Kirk Cousins pass intended for Pierre Garcon INTERCEPTED by Barry Church. No return. Touchback.","(10:48) Kirk Cousins incomplete pass to the right intended for Jordan Reed.","(10:53) Kirk Cousins incomplete pass to the right intended for Josh Doctson.","(11:36) Kirk Cousins pass to the right to Jordan Reed for 13 yards to the Dal6. Tackled by Orlando Scandrick.","(12:14) Matt Jones rush to the right for 3 yards to the Dal19. Tackled by Anthony Hitchens.","(12:46) Kirk Cousins pass to the left to Josh Doctson for 57 yards to the Dal22. Tackled by Byron Jones.","(13:00) Chris Jones punts for 54 yards to Was12. Jamison Crowder return for 9 yards to Was21. Tackled by Jeff Heath.","(13:36) Dak Prescott pass to the left to Cole Beasley for 10 yards to the Dal34. Tackled by Su'a Cravens.","(14:20) Lance Dunbar rush up the middle for a loss of 1 yard to the Dal24. Tackled by Dashaun Phillips and Trent Murphy.","(15:00) Dak Prescott sacked at Dal25 for a loss of 5 yards by Trent Murphy.","(0:04) Dustin Hopkins kicks off to the Dal-3. Lucky Whitehead return for 33 yards to Dal30. Tackled by Greg Toler and Dashaun Phillips.","(0:07) Dustin Hopkins 22 yard field goal attempt is GOOD. Holder: Tress Way.","(0:12) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(0:16) Kirk Cousins incomplete pass to the left intended for Josh Doctson defensed by Brandon Carr.","(0:27) Penalty: Encroachment on Dallas (Cedric Thornton) 5 yards.","(1:06) Matt Jones rush to the right for no gain to the Dal9. Tackled by Jack Crawford and Cedric Thornton.","(1:39) Kirk Cousins pass to the middle to Niles Paul for 16 yards to the Dal18. Tackled by Cedric Thornton. Penalty: Roughing Passer on Dallas (Anthony Hitchens) 9 yards.","(1:46) Ezekiel Elliott rush to the right for no gain to the Dal34. Tackled by Josh Norman. FUMBLE, recovered by Was (Dashaun Phillips). Tackled by Ezekiel Elliott.","(2:06) Dak Prescott pass to the left to Dez Bryant for 9 yards to the Dal34. Tackled by Bashaud Breeland.","(2:06) Dustin Hopkins kicks off to the endzone. Touchback.","(2:10) Dustin Hopkins 29 yard field goal attempt is GOOD. Holder: Tress Way.","(2:20) Kirk Cousins incomplete pass to the right.","(3:04) Kirk Cousins pass to the right to Vernon Davis for a loss of 1 yard to the Dal11. Tackled by Morris Claiborne.","(3:45) Matt Jones rush to the right for 5 yards to the Dal10. Tackled by Maliek Collins and Jack Crawford.","(4:25) Kirk Cousins rush to the left for 10 yards to the Dal15. Tackled by Terrell McClain.","(5:03) Matt Jones rush up the middle for 7 yards to the Dal25. Tackled by Barry Church.","(5:40) Kirk Cousins pass to the right to Vernon Davis for 6 yards to the Dal32. Tackled by Sean Lee.","(5:41) Dan Bailey onside kickoff to the Dal43. Onside kick recovered by kicking team by Barry Church. Penalty: Illegal Touch on Dallas (Barry Church) -5 yards.","(5:41) Dan Bailey extra point is good.","(5:47) Dak Prescott rush up the middle for 6 yards for a TOUCHDOWN.","(5:52) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Bashaud Breeland.","(6:33) Dak Prescott pass to the left to Dez Bryant for 16 yards to the Was6. Tackled by Bashaud Breeland.","(7:14) Dak Prescott sacked at Was22 for a loss of 5 yards by Trent Murphy.","(7:54) Ezekiel Elliott rush to the right for 4 yards to the Was17. Tackled by Chris Baker and Mason Foster.","(8:41) Ezekiel Elliott rush to the left for 21 yards to the Was21. Tackled by Bashaud Breeland and Mason Foster.","(9:20) Dak Prescott pass to the left to Keith Smith for 5 yards to the Was42. Tackled by Will Compton and Josh Norman.","(10:00) Ezekiel Elliott rush to the right for 5 yards to the Was47. Tackled by Josh Norman.","(10:40) Ezekiel Elliott rush to the left for 9 yards to the Dal48. Tackled by Mason Foster and Chris Baker.","(11:16) Dak Prescott pass to the right to Jason Witten for 14 yards to the Dal39. Tackled by Will Compton.","(11:16) Dustin Hopkins kicks off to the endzone. Touchback.","(11:16) Dustin Hopkins extra point is good.","(11:23) Kirk Cousins pass to the right to Jamison Crowder for 11 yards for a TOUCHDOWN.","(11:28) Kirk Cousins incomplete pass to the right intended for Josh Doctson.","(11:59) Kirk Cousins pass to the right to Ryan Grant for 5 yards to the Dal11.","(12:48) Matt Jones rush to the right for 7 yards to the Dal16. Tackled by Sean Lee and Justin Durant.","(13:31) Kirk Cousins pass to the left to DeSean Jackson for no gain to the Dal23. Tackled by Byron Jones.","(14:10) Kirk Cousins pass to the left to Vernon Davis for 32 yards to the Dal23. Tackled by Morris Claiborne and Sean Lee.","(14:39) Kirk Cousins pass to the left to Pierre Garcon for 16 yards to the Was45. Tackled by Brandon Carr.","(15:00) Matt Jones rush to the left for 4 yards to the Was29. Tackled by Andrew Gachkar.","(15:00) Dan Bailey kicks off to the endzone. Touchback.","(0:26) Lance Dunbar rush to the right for 4 yards to the Dal29. Tackled by Dashaun Phillips and DeAngelo Hall.","(0:26) Dustin Hopkins kicks off to the endzone. Touchback.","(0:31) Dustin Hopkins 36 yard field goal attempt is GOOD. Holder: Tress Way.","(0:31) Washington Redskins timeout.","(0:49) Kirk Cousins pass to the middle to Chris Thompson for 9 yards to the Dal18. Tackled by Maliek Collins.","(0:54) Kirk Cousins incomplete pass to the left intended for Jordan Reed defensed by Sean Lee.","(1:00) Kirk Cousins incomplete pass to the right intended for Jamison Crowder defensed by David Irving.","(1:26) Kirk Cousins pass to the left to Vernon Davis for 10 yards to the Dal27. Tackled by Sean Lee and Brandon Carr.","(1:31) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(2:00) Kirk Cousins pass to the left to Jordan Reed for 9 yards to the Dal37. Tackled by Barry Church.","(2:00) Two Minute Warning.","(2:18) Kirk Cousins pass to the right to Jamison Crowder for 6 yards to the Dal46. Tackled by J.J. Wilcox and Morris Claiborne.","(2:56) Matt Jones rush to the right for 2 yards to the Was48. Tackled by Byron Jones.","(3:05) Penalty: False Start on Washington (Vernon Davis) -5 yards.","(3:44) Kirk Cousins pass to the middle to Jordan Reed for 15 yards to the Dal49. Tackled by Byron Jones.","(3:52) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(4:27) Kirk Cousins rush to the right for 10 yards to the Was36. Tackled by Sean Lee.","(4:34) Dan Bailey kicks off to the Was12. Niles Paul return for 14 yards to Was26. Tackled by Andrew Gachkar and Byron Jones.","(4:39) Dan Bailey 31 yard field goal attempt is GOOD. Holder: Chris Jones.","(4:43) Dak Prescott incomplete pass to the middle intended for Jason Witten defensed by DeAngelo Hall.","(5:21) Ezekiel Elliott rush to the left for 2 yards to the Was13. Tackled by Mason Foster.","(5:58) Lance Dunbar rush to the right for 3 yards to the Was15. Tackled by Will Compton and Ricky Jean Francois.","(6:26) Ezekiel Elliott rush to the left for 7 yards to the Was18. Tackled by Bashaud Breeland.","(7:13) Dak Prescott pass to the middle to Ezekiel Elliott for 3 yards to the Was25. Tackled by Mason Foster and Will Compton.","(7:50) Ezekiel Elliott rush to the left for 6 yards to the Was28. Tackled by Will Compton and Mason Foster.","(8:22) Dak Prescott pass to the left to Lance Dunbar for 16 yards to the Was34. Tackled by Bashaud Breeland.","(8:28) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Will Compton.","(8:33) Penalty: Offside on Washington (Preston Smith) 5 yards.","(8:33) Washington Redskins timeout.","(9:05) Ezekiel Elliott rush to the right for 1 yard to the Dal45. Tackled by DeAngelo Hall and Ricky Jean Francois.","(9:14) Tress Way punts for 43 yards to Dal37. Lucky Whitehead return for 7 yards to Dal44. Tackled by Deshazor Everett.","(9:22) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(10:02) Kirk Cousins sacked at Was20 for a loss of 6 yards by Jack Crawford.","(10:38) Chris Thompson rush to the right for 1 yard to the Was26. Tackled by Terrell McClain.","(10:52) Chris Jones punts for 56 yards to Was4. Jamison Crowder return for 21 yards to Was25. Tackled by Keith Smith.","(11:29) Dak Prescott pass to the middle to Lance Dunbar for 10 yards to the Dal40. Tackled by Su'a Cravens and Will Blackmon.","(11:52) Penalty: Holding on Dallas (Travis Frederick) -10 yards.","(11:57) Dak Prescott incomplete pass to the left intended for Cole Beasley.","(12:34) Alfred Morris rush to the left for no gain to the Dal40. Tackled by David Bruton Jr. and Will Compton.","(13:08) Dak Prescott pass to the left to Dez Bryant for 15 yards to the Dal40. Tackled by Bashaud Breeland.","(13:08) Dustin Hopkins kicks off to the endzone. Touchback.","(13:08) Dustin Hopkins extra point is good.","(13:16) Matt Jones rush to the left for 14 yards for a TOUCHDOWN.","(13:48) Kirk Cousins pass to the left to DeSean Jackson for 12 yards to the Dal14. Tackled by Brandon Carr.","(13:54) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(14:34) Kirk Cousins pass to the middle to Matt Jones for 4 yards to the Dal26. Tackled by Sean Lee.","(15:00) Matt Jones rush to the right for 7 yards to the Dal30. Tackled by Morris Claiborne and Barry Church.","(0:13) Kirk Cousins pass to the right to Pierre Garcon for 9 yards to the Dal37. Tackled by Sean Lee.","(0:42) Kirk Cousins pass to the right to Vernon Davis for 4 yards to the Dal46. Tackled by Sean Lee.","(0:49) Penalty: Holding on Dallas (Morris Claiborne) 5 yards.","(1:01) Penalty: Illegal Formation on Washington (Niles Paul) -5 yards.","(1:39) Kirk Cousins pass to the middle to Jordan Reed for 25 yards to the Was50. Tackled by Anthony Hitchens.","(1:39) Dan Bailey kicks off to the endzone. Touchback.","(1:39) Dan Bailey extra point is good.","(1:45) Ezekiel Elliott rush up the middle for 1 yard for a TOUCHDOWN.","(1:45) Washington Redskins timeout.","(1:52) Penalty: Pass Interference on Washington (Bashaud Breeland) 6 yards.","(2:10) Penalty: Delay of Game on Dallas (Dak Prescott) -5 yards.","(2:49) Dak Prescott pass to the right to Geoff Swaim for 28 yards to the Was2. Tackled by David Bruton Jr..","(3:04) Alfred Morris rush to the left for no gain to the Was30. Tackled by Ryan Kerrigan.","(3:41) Dak Prescott pass to the left to Dez Bryant for 6 yards to the Was30. Tackled by Will Compton.","(4:23) Ezekiel Elliott rush up the middle for 3 yards to the Was36. Tackled by Mason Foster and Chris Baker.","(5:06) Ezekiel Elliott rush to the left for 9 yards to the Was39. Tackled by Bashaud Breeland.","(5:16) Penalty: Offside on Washington (Ryan Kerrigan) 5 yards.","(5:50) Ezekiel Elliott rush to the right for 3 yards to the Dal47. Tackled by Cullen Jenkins and Will Compton.","(6:26) Ezekiel Elliott rush to the left for 9 yards to the Dal44. Tackled by Bashaud Breeland and Mason Foster.","(6:52) Dak Prescott pass to the left to Jason Witten for 29 yards to the Dal35. Tackled by David Bruton Jr..","(7:01) Tress Way punts for 32 yards to Dal6. No return.","(7:08) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(7:49) Matt Jones rush to the right for no gain to the Dal38. Tackled by Terrell McClain and Barry Church.","(8:21) Matt Jones rush up the middle for 3 yards to the Dal38. Tackled by Jack Crawford.","(8:52) Kirk Cousins pass to the right to DeSean Jackson for 28 yards to the Dal41. Tackled by Morris Claiborne.","(9:17) Matt Jones rush to the left for 6 yards to the Was31. Tackled by Anthony Hitchens and Sean Lee.","(9:25) Dan Bailey kicks off to the Was-3. Chris Thompson return for 28 yards to Was25. Tackled by Damien Wilson.","(9:29) Dan Bailey 22 yard field goal attempt is GOOD. Holder: Chris Jones.","(9:36) Dak Prescott incomplete pass to the right intended for Brice Butler defensed by Josh Norman.","(10:16) Dak Prescott pass to the middle to Ezekiel Elliott for 1 yard to the Was4. Tackled by Mason Foster.","(10:22) Dak Prescott incomplete pass to the left intended for Dez Bryant defensed by Bashaud Breeland.","(10:57) Dak Prescott pass to the right to Cole Beasley for 28 yards to the Was5. Tackled by DeAngelo Hall.","(11:42) Dak Prescott sacked at Was33 for a loss of 2 yards by Ryan Kerrigan and Ricky Jean Francois.","(11:57) Dak Prescott pass to the left to Dez Bryant for 17 yards to the Was31. Tackled by Bashaud Breeland.","(12:40) Ezekiel Elliott rush to the left for a loss of 1 yard to the Was48. Tackled by Ryan Kerrigan.","(13:11) Ezekiel Elliott rush to the left for 2 yards to the Was47. Tackled by Ziggy Hood.","(13:59) Dak Prescott pass to the middle to Dez Bryant for 18 yards to the Was49. Tackled by David Bruton Jr. and DeAngelo Hall.","(14:04) Dak Prescott incomplete pass to the right intended for Dez Bryant defensed by Josh Norman.","(14:36) Ezekiel Elliott rush to the right for 2 yards to the Dal33. Tackled by Ricky Jean Francois and Chris Baker.","(14:54) Dak Prescott pass to the right to Cole Beasley for 11 yards to the Dal31. Tackled by Josh Norman.","(15:00) Dustin Hopkins kicks off to the Dal1. Rod Smith return for 19 yards to Dal20. Tackled by Su'a Cravens."]