["(0:03) Sam Bradford incomplete pass to the right intended for Stefon Diggs.","(0:03) Penalty: Delay of Game on Minnesota (Sam Bradford) -5 yards.","(0:48) Sam Bradford rush up the middle for a loss of 3 yards to the GB43.","(0:48) Minnesota Vikings timeout.","(1:33) Matt Asiata rush up the middle for 1 yard to the GB40. Tackled by Kenny Clark.","(1:36) Matt Asiata rush to the left for a loss of 2 yards to the GB41. Tackled by Blake Martinez.","(1:40) Penalty: Pass Interference on Green Bay (Damarious Randall) 12 yards.","(1:40) Green Bay Packers timeout.","(1:44) Matt Asiata rush to the left for 1 yard to the Min49. Tackled by Blake Martinez.","(1:44) Green Bay Packers timeout.","(1:50) Matt Asiata rush to the right for 3 yards to the Min48. Tackled by Micah Hyde.","(1:56) Aaron Rodgers pass intended for Davante Adams INTERCEPTED by Trae Waynes and returned for 4 yards. Tackled by Davante Adams.","(2:00) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson defensed by Terence Newman.","(2:00) Two Minute Warning.","(2:33) Aaron Rodgers sacked at GB45 for a loss of 4 yards by Linval Joseph.","(3:14) Aaron Rodgers pass to the left to Davante Adams for 13 yards to the GB49. Tackled by Trae Waynes.","(3:19) Aaron Rodgers incomplete pass to the right intended for Randall Cobb defensed by Captain Munnerlyn.","(3:25) Aaron Rodgers rush to the left for 10 yards to the GB36. Tackled by Andrew Sendejo.","(3:51) Aaron Rodgers pass to the middle to Randall Cobb for 14 yards to the GB26. Tackled by Captain Munnerlyn.","(4:32) Aaron Rodgers pass to the left to Jared Cook for 3 yards to the GB12. Tackled by Trae Waynes.","(4:38) Aaron Rodgers incomplete pass to the right intended for Jared Cook.","(4:53) Jeff Locke punts for 50 yards to GB9. No return.","(4:53) Penalty: False Start on Minnesota (Mackensie Alexander) -5 yards.","(5:35) Sam Bradford sacked at Min46 for a loss of 9 yards by Julius Peppers and Nick Perry.","(5:39) Sam Bradford incomplete pass to the left intended for Stefon Diggs defensed by Kenny Clark.","(6:12) Matt Asiata rush to the right for a loss of 1 yard to the GB45. Tackled by Jake Ryan and Morgan Burnett.","(6:53) Matt Asiata rush to the left for 12 yards to the GB44. Tackled by Ha Ha Clinton-Dix and Jake Ryan.","(7:00) Aaron Rodgers sacked at Min44 for a loss of 4 yards by Brian Robison. FUMBLE, recovered by Min (Shamar Stephen). Tackled by JC Tretter.","(7:24) Aaron Rodgers pass to the middle to Richard Rodgers for 15 yards to the Min40. Tackled by Andrew Sendejo.","(8:04) Eddie Lacy rush to the left for no gain to the GB45. Tackled by Anthony Barr.","(8:43) Aaron Rodgers pass to the left to Davante Adams for 10 yards to the GB45. Tackled by Trae Waynes.","(9:26) Eddie Lacy rush up the middle for 1 yard to the GB35. Tackled by Harrison Smith.","(9:56) Aaron Rodgers pass to the right to Jordy Nelson for 6 yards to the GB34. Tackled by Terence Newman.","(10:28) Eddie Lacy rush up the middle for 13 yards to the GB28. Tackled by Andrew Sendejo.","(10:32) Aaron Rodgers incomplete pass to the right intended for Eddie Lacy.","(10:39) Jeff Locke punts for 43 yards to GB15. No return.","(11:19) Sam Bradford pass to the middle to Stefon Diggs for 15 yards to the Min42. Tackled by Joe Thomas.","(11:55) Jerick McKinnon rush to the right for no gain to the Min27. Tackled by Joe Thomas.","(12:35) Cordarrelle Patterson rush to the right for a loss of 2 yards to the Min42. Tackled by Datone Jones. Penalty: Unnecessary Roughness on Minnesota (Stefon Diggs) -15 yards.","(12:41) Mason Crosby kicks off to the Min7. Cordarrelle Patterson return for 37 yards to Min44. Tackled by Damarious Randall.","(12:41) Mason Crosby extra point is good.","(12:41) Aaron Rodgers rush up the middle for 10 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Green Bay (JC Tretter) -15 yards.","(13:24) James Starks rush to the right for a loss of 6 yards to the Min10. Tackled by Captain Munnerlyn.","(13:28) Aaron Rodgers incomplete pass to the right intended for Davante Adams defensed by Terence Newman.","(14:18) Aaron Rodgers pass to the left to Jordy Nelson for 39 yards to the Min4. Tackled by Andrew Sendejo.","(15:00) Aaron Rodgers sacked at Min43 for a loss of 10 yards by Everson Griffen.","(0:22) James Starks rush to the right for 2 yards to the Min33. Tackled by Linval Joseph.","(1:00) Aaron Rodgers pass to the middle to James Starks for 16 yards to the Min35. Tackled by Andrew Sendejo.","(1:05) Aaron Rodgers incomplete pass to the middle intended for Jordy Nelson.","(1:12) Penalty: Pass Interference on Minnesota (Trae Waynes) 28 yards.","(1:36) James Starks rush to the left for 5 yards to the GB31. Tackled by Andrew Sendejo. Penalty: Holding on Green Bay (T.J. Lang) -10 yards.","(2:11) James Starks rush to the right for 1 yard to the GB26. Tackled by Linval Joseph.","(2:11) Blair Walsh kicks off to the endzone. Touchback.","(2:11) Blair Walsh extra point is good.","(2:16) Sam Bradford pass to the right to Stefon Diggs for 25 yards for a TOUCHDOWN.","(2:42) Sam Bradford pass to the right to Adam Thielen for 5 yards to the GB25. Tackled by Joe Thomas.","(3:05) Jerick McKinnon rush up the middle for 2 yards to the GB30. Tackled by Ha Ha Clinton-Dix.","(3:31) Adrian Peterson rush to the right for 5 yards to the GB32. Tackled by Kyler Fackrell.","(3:31) Minnesota Vikings timeout.","(4:22) Sam Bradford pass to the right to Stefon Diggs for 46 yards to the GB37. Tackled by Jake Ryan.","(4:57) Adrian Peterson rush up the middle for 4 yards to the Min17. Tackled by Jake Ryan.","(5:04) James Starks rush to the left for 1 yard to the Min13. Tackled by Linval Joseph and Brian Robison.","(5:08) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(5:49) Aaron Rodgers pass to the left to Richard Rodgers for 10 yards to the Min14. Tackled by Harrison Smith and Andrew Sendejo.","(6:18) James Starks rush to the right for a loss of 2 yards to the Min24. Tackled by Chad Greenway.","(7:15) Aaron Rodgers rush to the left for 9 yards to the Min32. Tackled by Everson Griffen. FUMBLE, recovered by GB (Jared Cook).","(7:51) Aaron Rodgers pass to the left to Jared Cook for 4 yards to the Min41. Tackled by Trae Waynes.","(8:34) Aaron Rodgers sacked at Min45 for a loss of 2 yards by Tom Johnson.","(9:18) Eddie Lacy rush to the left for 12 yards to the Min43. Tackled by Chad Greenway and Harrison Smith.","(9:25) Penalty: Holding on Minnesota (Trae Waynes) 5 yards.","(10:00) Eddie Lacy rush to the left for a loss of 1 yard to the GB40. Tackled by Linval Joseph.","(10:28) Aaron Rodgers pass to the left to Jared Cook for 14 yards to the GB41. Tackled by Harrison Smith.","(10:34) Penalty: Pass Interference on Minnesota (Trae Waynes) 13 yards.","(10:40) Jeff Locke punts for 37 yards to GB14. No return.","(11:22) Sam Bradford sacked at Min49 for a loss of 7 yards by Clay Matthews.","(11:58) Sam Bradford pass to the left to Charles Johnson for 10 yards to the GB44. Tackled by Ladarius Gunter.","(12:38) Adrian Peterson rush to the left for a loss of 2 yards to the Min46. Tackled by Jake Ryan.","(13:02) Sam Bradford pass to the left to Stefon Diggs for 10 yards to the Min33. Tackled by Quinten Rollins. Penalty: Roughing Passer on Green Bay (Mike Daniels) 15 yards.","(13:09) Jacob Schum punts for 44 yards to Min23. No return.","(13:49) Aaron Rodgers pass to the left to Jared Cook for 10 yards to the GB33. Tackled by Harrison Smith.","(13:52) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(14:19) Penalty: Holding on Green Bay (Richard Rodgers) -10 yards.","(14:55) Eddie Lacy rush to the left for 9 yards to the GB33. Tackled by Harrison Smith.","(15:00) Blair Walsh kicks off to the GB3. Ty Montgomery return for 21 yards to GB24. Tackled by Anthony Harris.","(0:18) Aaron Rodgers pass to the right to Randall Cobb for 9 yards to the GB29. Tackled by Captain Munnerlyn and Andrew Sendejo.","(0:27) Penalty: Offside on Minnesota (Brian Robison) 5 yards.","(0:27) Penalty: Pass Interference on Green Bay (Davante Adams) -10 yards.","(0:27) Blair Walsh kicks off to the endzone. Touchback.","(0:31) Blair Walsh 46 yard field goal attempt is GOOD. Holder: Jeff Locke.","(1:21) Penalty: Delay of Game on Minnesota (Sam Bradford) -5 yards.","(1:21) Sam Bradford pass to the right to Kyle Rudolph for 4 yards to the GB23. Tackled by Micah Hyde.","(1:56) Sam Bradford pass to the left to Charles Johnson for 5 yards to the GB27. Tackled by Ladarius Gunter.","(1:56) Two Minute Warning.","(2:01) Sam Bradford incomplete pass to the right intended for Adrian Peterson.","(2:36) Sam Bradford pass to the right to Stefon Diggs for 44 yards to the GB32. Tackled by Damarious Randall.","(3:20) Adrian Peterson rush to the right for 2 yards to the Min24. Tackled by Nick Perry and Jake Ryan.","(4:01) Adrian Peterson rush to the right for 4 yards to the Min22. Tackled by Clay Matthews.","(4:41) Adrian Peterson rush to the left for 5 yards to the Min18. Tackled by Clay Matthews.","(4:48) Jacob Schum punts for 34 yards to Min13. No return.","(4:52) Aaron Rodgers incomplete pass to the right intended for Randall Cobb.","(5:00) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(5:00) Green Bay Packers timeout.","(5:44) Randall Cobb rush to the right for 1 yard to the Min47. Tackled by Danielle Hunter.","(6:12) Aaron Rodgers pass to the left to Jordy Nelson for 21 yards to the Min48. Tackled by Andrew Sendejo.","(6:54) Aaron Rodgers pass to the right to Randall Cobb for 7 yards to the GB31. Tackled by Harrison Smith.","(6:58) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(7:05) Jeff Locke punts for 45 yards to GB24. No return.","(7:48) Sam Bradford sacked at Min31 for a loss of 7 yards by Julius Peppers.","(7:48) Minnesota Vikings timeout.","(7:52) Sam Bradford incomplete pass to the right intended for Kyle Rudolph defensed by Jake Ryan.","(8:34) Adrian Peterson rush up the middle for 4 yards to the Min38. Tackled by Kenny Clark.","(8:41) Jacob Schum punts for 35 yards to Min34. No return.","(8:49) Aaron Rodgers incomplete pass to the right intended for Trevor Davis.","(9:35) Eddie Lacy rush to the left for 4 yards to the GB31. Tackled by Tom Johnson and Danielle Hunter.","(10:14) Eddie Lacy rush to the right for 2 yards to the GB27. Tackled by Eric Kendricks and Captain Munnerlyn.","(10:14) Blair Walsh kicks off to the endzone. Touchback.","(10:14) Blair Walsh extra point is good.","(10:18) Sam Bradford pass to the right to Kyle Rudolph for 8 yards for a TOUCHDOWN.","(10:59) Sam Bradford pass to the middle to Stefon Diggs for 9 yards to the GB8. Tackled by Quinten Rollins.","(11:35) Sam Bradford pass to the left to Adrian Peterson for 7 yards to the GB17. Tackled by Ha Ha Clinton-Dix.","(12:18) Penalty: False Start on Minnesota (Brandon Fusco) -5 yards.","(12:18) Penalty: False Start on Minnesota (Andre Smith) -5 yards.","(12:46) Sam Bradford pass to the middle to Stefon Diggs for 4 yards to the GB14. Tackled by Damarious Randall.","(13:35) Sam Bradford pass to the left to Adam Thielen for 9 yards to the GB18. Tackled by Ladarius Gunter. FUMBLE, recovered by Min (Adam Thielen).","(13:38) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(13:43) Sam Bradford incomplete pass to the left intended for Adam Thielen.","(14:01) Sam Bradford pass to the right to Adam Thielen for 12 yards to the GB27. Tackled by Damarious Randall.","(14:21) Sam Bradford pass to the left to Kyle Rudolph for 19 yards to the GB39. Tackled by Ladarius Gunter.","(15:00) Adrian Peterson rush to the left for a loss of 4 yards to the Min42. Tackled by Letroy Guion.","(0:04) Jacob Schum punts for 42 yards to Min46. No return.","(0:44) Aaron Rodgers sacked at GB12 for a loss of 13 yards by Danielle Hunter. FUMBLE, recovered by GB (JC Tretter).","(0:48) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(1:30) James Starks rush to the right for 2 yards to the GB25. Tackled by Danielle Hunter.","(2:02) Aaron Rodgers pass to the left to Randall Cobb for 7 yards to the GB23. Tackled by Andrew Sendejo.","(2:31) Aaron Rodgers pass to the right to Jordy Nelson for 6 yards to the GB16. Tackled by Terence Newman.","(2:39) Jeff Locke punts for 47 yards to GB10. No return.","(3:21) Sam Bradford pass to the left to Matt Asiata for 11 yards to the Min43. Tackled by Ladarius Gunter.","(4:17) Penalty: False Start on Minnesota (Matt Kalil) -5 yards.","(4:17) Adrian Peterson rush to the left for no gain to the Min37. Tackled by Mike Daniels.","(4:22) Sam Bradford incomplete pass to the right intended for Kyle Rudolph defensed by Morgan Burnett.","(4:59) Sam Bradford pass to the right to Stefon Diggs for 15 yards to the Min37. Tackled by Blake Martinez.","(5:33) Adrian Peterson rush up the middle for a loss of 1 yard to the Min22. Tackled by Mike Daniels.","(5:39) Mason Crosby kicks off to the Min-2. Cordarrelle Patterson return for 25 yards to Min23. Tackled by Marwin Evans.","(5:39) Mason Crosby extra point is good.","(5:44) Aaron Rodgers pass to the left to Jordy Nelson for 1 yard for a TOUCHDOWN.","(5:44) Green Bay Packers timeout.","(6:33) Eddie Lacy rush up the middle for no gain to the Min1. Tackled by Eric Kendricks and Shamar Stephen.","(6:38) Penalty: Holding on Minnesota (Terence Newman) 1 yards.","(7:24) Eddie Lacy rush to the right for 2 yards to the Min2. Tackled by Anthony Barr and Shamar Stephen.","(7:33) Penalty: Pass Interference on Minnesota (Terence Newman) 40 yards.","(8:12) Eddie Lacy rush to the left for 3 yards to the Min44. Tackled by Shamar Stephen.","(8:47) Aaron Rodgers pass to the left to Randall Cobb for 5 yards to the Min47. Tackled by Eric Kendricks.","(8:57) Jeff Locke punts for 3 yards to GB46. Damarious Randall return for 2 yards to GB48. Tackled by Zach Line.","(9:37) Sam Bradford pass to the left to Stefon Diggs for 14 yards to the GB49. Tackled by Joe Thomas.","(10:23) Sam Bradford sacked at Min37 for a loss of 9 yards by Mike Daniels.","(11:04) Sam Bradford pass to the right to Jerick McKinnon for a loss of 1 yard to the Min46. Tackled by Joe Thomas.","(11:17) Jacob Schum punts for 38 yards to Min47. No return.","(11:22) Aaron Rodgers incomplete pass to the left intended for Jordy Nelson.","(11:25) Aaron Rodgers incomplete pass to the right intended for Jared Cook defensed by Eric Kendricks.","(12:03) Eddie Lacy rush up the middle for 5 yards to the GB15. Tackled by Linval Joseph.","(12:11) Aaron Rodgers pass to the left to Davante Adams for 3 yards to the GB13. Tackled by Eric Kendricks. FUMBLE, recovered by Min (Andrew Sendejo) and returned for 3 yards. Tackled by Randall Cobb. FUMBLE, recovered by GB (Randall Cobb). Tackled by Andrew Sendejo.","(12:18) Jeff Locke punts for 48 yards to GB10. No return.","(12:23) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(12:28) Sam Bradford incomplete pass to the left intended for Kyle Rudolph.","(13:05) Adrian Peterson rush to the left for no gain to the Min42. Tackled by Letroy Guion and Nick Perry.","(13:37) Sam Bradford pass to the right to Adam Thielen for 15 yards to the Min42. Tackled by Damarious Randall.","(14:21) Adrian Peterson rush to the left for 2 yards to the Min27. Tackled by Mike Daniels and Blake Martinez.","(15:00) Sam Bradford pass to the right to Adrian Peterson for no gain to the Min25. Tackled by Blake Martinez.","(15:00) Mason Crosby kicks off to the endzone. Touchback."]