["(0:37) Carson Wentz rush up the middle for a loss of 1 yard to the Chi25.","(1:18) Carson Wentz rush up the middle for a loss of 3 yards to the Chi24.","(2:00) Carson Wentz rush up the middle for a loss of 2 yards to the Chi21.","(2:00) Two Minute Warning.","(2:13) Carson Wentz pass to the left to Jordan Matthews for 7 yards to the Chi19. Tackled by Sherrick McManis.","(2:13) Philadelphia Eagles timeout.","(3:01) Darren Sproles rush to the right for a loss of 3 yards to the Chi26. Tackled by Jerrell Freeman.","(3:49) Darren Sproles rush to the right for 6 yards to the Chi23. Tackled by Sam Acho.","(3:49) Chicago Bears timeout.","(3:55) Darren Sproles rush to the left for 1 yard to the Chi29. Tackled by Danny Trevathan.","(4:45) Darren Sproles rush to the right for 5 yards to the Chi30. Tackled by Jerrell Freeman.","(4:45) Penalty: Offside on Chicago (Willie Young) 5 yards.","(5:08) Ryan Mathews rush to the left for a loss of 4 yards to the Phi45. Tackled by Will Sutton and Willie Young. Penalty: Unnecessary Roughness on Chicago (Deiondre' Hall) 15 yards.","(5:09) Connor Barth onside kickoff to the Phi49. Onside kick recovered by receiving team by Brent Celek.","(5:09) Philadelphia Eagles timeout.","(5:09) Connor Barth extra point is good.","(5:30) Donnie Jones punts for 53 yards to Chi35. Eddie Royal return for 65 yards for a TOUCHDOWN.","(5:30) Chicago Bears timeout.","(5:37) Darren Sproles rush to the left for no gain to the Phi12. Tackled by Danny Trevathan.","(5:37) Chicago Bears timeout.","(5:44) Carson Wentz pass to the right to Josh Huff for a loss of 1 yard to the Phi12. Tackled by Jerrell Freeman.","(6:06) Penalty: False Start on Philadelphia (Matt Tobin) -5 yards.","(6:47) Ryan Mathews rush to the left for a loss of 1 yard to the Phi18. Tackled by Akiem Hicks.","(6:58) Brian Hoyer incomplete pass to the right intended for Kevin White defensed by Malcolm Jenkins.","(7:03) Brian Hoyer incomplete pass to the right intended for Kevin White.","(7:09) Brian Hoyer incomplete pass to the right intended for Alshon Jeffery defensed by Jalen Mills.","(7:31) Brian Hoyer pass to the right to Zach Miller for 9 yards to the Phi19. Tackled by Nigel Bradham.","(8:01) Brian Hoyer pass to the right to Alshon Jeffery for 12 yards to the Phi28. Tackled by Jalen Mills.","(8:29) Brian Hoyer pass to the middle to Jordan Howard for 7 yards to the Phi40. Tackled by Ron Brooks.","(8:56) Brian Hoyer pass to the left to Kevin White for 19 yards to the Phi47. Tackled by Jordan Hicks.","(9:20) Jordan Howard rush to the left for 4 yards to the Chi34. Tackled by Fletcher Cox.","(9:46) Brian Hoyer pass to the left to Jordan Howard for 2 yards to the Chi30. Tackled by Rodney McLeod.","(10:29) Brian Hoyer pass to the right to Zach Miller for 7 yards to the Chi28. Tackled by Ron Brooks.","(10:36) Caleb Sturgis kicks off to the Chi6. Joshua Bellamy return for 15 yards to Chi21. Tackled by Josh Huff.","(10:36) Caleb Sturgis extra point is good.","(10:41) Ryan Mathews rush to the left for 1 yard for a TOUCHDOWN.","(11:07) Penalty: Offside on Chicago (Akiem Hicks) 1 yards.","(11:50) Darren Sproles rush to the left for 4 yards to the Chi2. Tackled by Leonard Floyd.","(11:55) Carson Wentz incomplete pass to the right intended for Nelson Agholor defensed by Tracy Porter.","(12:17) Ryan Mathews rush to the left for a loss of 4 yards to the Chi6. Tackled by Jerrell Freeman.","(12:55) Darren Sproles rush to the right for 14 yards to the Chi2. Tackled by Chris Prosinski.","(13:41) Ryan Mathews rush to the left for 30 yards to the Chi16. Tackled by Tracy Porter.","(13:47) Jeremy Langford rush to the right for a loss of 1 yard to the Chi46. Tackled by Bennie Logan. FUMBLE, recovered by Phi (Ron Brooks). Tackled by Eddie Royal.","(14:25) Brian Hoyer pass to the left to Alshon Jeffery for 11 yards to the Chi47. Tackled by Stephen Tulloch.","(15:00) Brian Hoyer pass to the right to Eddie Royal for 6 yards to the Chi36. Tackled by Ron Brooks.","(0:09) Jeremy Langford rush to the left for no gain to the Chi30. Tackled by Fletcher Cox.","(0:32) Brian Hoyer pass to the middle to Kevin White for 5 yards to the Chi30. Tackled by Stephen Tulloch.","(0:32) Caleb Sturgis kicks off to the endzone. Touchback.","(0:32) Caleb Sturgis extra point is NO GOOD.","(0:36) Carson Wentz pass to the right to Trey Burton for 2 yards for a TOUCHDOWN.","(0:47) Jay Cutler pass intended for Alshon Jeffery INTERCEPTED by Nigel Bradham and returned for 28 yards. Tackled by Cody Whitehair.","(0:53) Caleb Sturgis kicks off to the Chi1. Deonte Thompson return for 23 yards to Chi24. Tackled by Najee Goode.","(0:53) Caleb Sturgis extra point is good.","(0:59) Ryan Mathews rush to the right for 3 yards for a TOUCHDOWN.","(1:45) Kenjon Barner rush to the right for 3 yards to the Chi3. Tackled by Leonard Floyd.","(2:22) Carson Wentz pass to the left to Nelson Agholor for 8 yards to the Chi6. Tackled by Tracy Porter.","(3:02) Carson Wentz pass to the left to Trey Burton for 11 yards to the Chi14. Tackled by Chris Prosinski.","(3:30) Wendell Smallwood rush to the left for 5 yards to the Chi25. Tackled by Willie Young.","(4:06) Wendell Smallwood rush to the right for 11 yards to the Chi30. Tackled by Harold Jones-Quartey.","(4:46) Carson Wentz rush to the right for 5 yards to the Chi41. Tackled by Jonathan Bullard.","(5:24) Carson Wentz pass to the right to Jordan Matthews for 22 yards to the Chi46. Tackled by Chris Prosinski.","(5:35) Patrick O'Donnell punts for 32 yards to Phi22. No return. Penalty: Holding on Chicago (DeAndre Houston-Carson) 10 yards.","(5:38) Jay Cutler incomplete pass to the left intended for Zach Miller.","(6:24) Jeremy Langford rush to the right for a loss of 4 yards to the Chi46. Tackled by Brandon Graham.","(6:56) Jordan Howard rush to the left for 8 yards to the Chi50. Tackled by Ron Brooks.","(7:30) Jordan Howard rush to the right for 10 yards to the Chi42. Tackled by Rodney McLeod.","(8:08) Kevin White rush to the left for 9 yards to the Chi32. Tackled by Malcolm Jenkins.","(8:43) Jeremy Langford rush to the left for 3 yards to the Chi23. Tackled by Beau Allen.","(9:07) Jeremy Langford rush to the left for 3 yards to the Chi20. Tackled by Brandon Graham.","(9:36) Jeremy Langford rush to the left for 6 yards to the Chi17. Tackled by Vinny Curry.","(9:44) Donnie Jones punts for 35 yards to Chi11. No return.","(10:33) Carson Wentz rush to the right for 7 yards to the Chi46. Tackled by Sherrick McManis.","(10:38) Carson Wentz incomplete pass to the middle intended for Trey Burton defensed by Eddie Goldman.","(10:46) Carson Wentz incomplete pass to the right intended for Nelson Agholor defensed by Jacoby Glenn.","(10:56) Jay Cutler sacked at Phi47 for a loss of 4 yards by Destiny Vaeao. FUMBLE, recovered by Phi (Jordan Hicks). Tackled by Jeremy Langford.","(11:32) Jay Cutler pass to the right to Eddie Royal for 7 yards to the Phi43. Tackled by Jalen Mills.","(12:09) Jay Cutler pass to the left to Zach Miller for 5 yards to the Chi50. Tackled by Nolan Carroll.","(12:44) Jeremy Langford rush to the left for 16 yards to the Chi45. Tackled by Nolan Carroll.","(12:52) Donnie Jones punts for 55 yards to Chi29. No return.","(13:00) Carson Wentz incomplete pass to the right intended for Nelson Agholor defensed by Jacoby Glenn.","(13:48) Carson Wentz sacked at Phi16 for a loss of 7 yards by Willie Young.","(14:10) Penalty: Illegal Formation on Philadelphia (Brent Celek) -5 yards.","(14:54) Ryan Mathews rush to the left for 2 yards to the Phi28. Tackled by Eddie Goldman.","(15:00) Connor Barth kicks off to the Phi-1. Josh Huff return for 27 yards to Phi26. Tackled by Bryce Callahan.","(0:03) Caleb Sturgis kicks off to the Chi17. Bryce Callahan return for 17 yards to Chi34. Tackled by Malcolm Jenkins.","(0:08) Caleb Sturgis 53 yard field goal attempt is GOOD. Holder: Donnie Jones.","(0:08) Chicago Bears timeout.","(0:13) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(0:19) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(0:19) Carson Wentz incomplete pass to the middle.","(0:35) Carson Wentz pass to the right to Trey Burton for 14 yards to the Chi35. Tackled by Jerrell Freeman.","(0:39) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(1:08) Carson Wentz pass to the left to Nelson Agholor for 18 yards to the Chi49. Tackled by Adrian Amos.","(1:38) Carson Wentz pass to the right to Darren Sproles for 6 yards to the Phi33. Tackled by Jacoby Glenn.","(1:46) Patrick O'Donnell punts for 51 yards to Phi27. No return.","(1:46) Philadelphia Eagles timeout.","(1:52) Jay Cutler pass to the right to Jeremy Langford for 6 yards to the Chi22. Tackled by Jalen Mills.","(1:52) Philadelphia Eagles timeout.","(2:00) Jay Cutler pass to the right to Kevin White for 3 yards to the Chi16. Tackled by Ron Brooks.","(2:00) Penalty: False Start on Chicago (Cody Whitehair) -5 yards.","(2:00) Two Minute Warning.","(2:22) Jeremy Langford rush to the right for 4 yards to the Chi18. Tackled by Beau Allen.","(2:27) Caleb Sturgis kicks off to the Chi-5. Deonte Thompson return for 19 yards to Chi14. Tackled by Mychal Kendricks.","(2:31) Caleb Sturgis 29 yard field goal attempt is GOOD. Holder: Donnie Jones.","(2:34) Carson Wentz incomplete pass to the middle intended for Trey Burton defensed by Deiondre' Hall.","(3:18) Kenjon Barner rush to the left for a loss of 1 yard to the Chi11. Tackled by Willie Young.","(3:54) Carson Wentz rush to the left for 4 yards to the Chi10. Tackled by Danny Trevathan.","(4:24) Carson Wentz pass to the left to Trey Burton for 14 yards to the Chi28. Tackled by Danny Trevathan. Penalty: Roughing Passer on Chicago (Akiem Hicks) 14 yards.","(5:09) Darren Sproles rush to the left for 1 yard to the Chi42. Tackled by Akiem Hicks.","(5:14) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(5:44) Carson Wentz pass to the right to Jordan Matthews for 32 yards to the Chi43. Tackled by Tracy Porter.","(6:21) Carson Wentz pass to the left to Trey Burton for 8 yards to the Phi25. Tackled by Jacoby Glenn.","(7:02) Ryan Mathews rush to the left for 5 yards to the Phi17. Tackled by Jacoby Glenn.","(7:38) Josh Huff rush to the left for no gain to the Phi12. Tackled by Jacoby Glenn.","(7:45) Patrick O'Donnell punts for 28 yards to Phi12. No return.","(7:49) Jay Cutler incomplete pass to the right intended for Eddie Royal.","(8:31) Jay Cutler pass to the right to Kevin White for 9 yards to the Phi40. Tackled by Jalen Mills.","(9:17) Jay Cutler sacked at Phi49 for a loss of 1 yard by Brandon Graham.","(9:29) Donnie Jones punts for 32 yards to Phi48. No return.","(10:03) Darren Sproles rush to the left for no gain to the Phi16. Tackled by Sam Acho and Willie Young.","(10:09) Carson Wentz incomplete pass to the right intended for Wendell Smallwood defensed by Jerrell Freeman.","(10:35) Penalty: Holding on Philadelphia (Jason Kelce) -10 yards.","(11:11) Ryan Mathews rush to the left for no gain to the Phi26. Tackled by Willie Young.","(11:16) Connor Barth kicks off to the Phi-4. Wendell Smallwood return for 30 yards to Phi26. Tackled by Deiondre' Hall.","(11:16) Connor Barth extra point is good.","(11:19) Jeremy Langford rush to the left for 1 yard for a TOUCHDOWN.","(11:25) Penalty: Pass Interference on Philadelphia (Nolan Carroll) 4 yards.","(12:02) Jeremy Langford rush to the left for no gain to the Phi5. Tackled by Mychal Kendricks.","(12:52) Jay Cutler pass to the right to Alshon Jeffery for 49 yards to the Phi5. Tackled by Jalen Mills.","(13:37) Paul Lasike rush to the right for 2 yards to the Chi46. Tackled by Vinny Curry.","(14:20) Ka'Deem Carey rush to the right for 1 yard to the Chi44. Tackled by Stephen Tulloch.","(15:00) Jay Cutler pass to the right to Eddie Royal for 8 yards to the Chi43. Tackled by Rodney McLeod.","(0:01) Donnie Jones punts for 43 yards to Chi35. No return.","(0:06) Carson Wentz incomplete pass to the right intended for Dorial Green-Beckham.","(0:50) Darren Sproles rush to the left for 7 yards to the Phi22. Tackled by Bryce Callahan.","(1:20) Penalty: Holding on Philadelphia (Jason Peters) -10 yards.","(2:01) Carson Wentz pass to the right to Jordan Matthews for 4 yards to the Phi25. Tackled by Tracy Porter.","(2:06) 31 yard field goal attempt by Connor Barth is NO GOOD. Holder: Patrick O'Donnell.","(2:11) Jay Cutler incomplete pass to the right intended for Eddie Royal defensed by Ron Brooks.","(2:57) Jay Cutler pass to the right to Alshon Jeffery for 2 yards to the Phi13. Tackled by Jalen Mills.","(3:32) Jay Cutler pass to the middle to Ka'Deem Carey for 3 yards to the Phi15. Tackled by Mychal Kendricks.","(4:14) Jay Cutler pass to the left to Zach Miller for 12 yards to the Phi18. Tackled by Mychal Kendricks.","(4:54) Jay Cutler pass to the left to Alshon Jeffery for 22 yards to the Phi30. Tackled by Nolan Carroll and Malcolm Jenkins.","(5:33) Jay Cutler pass to the left to Eddie Royal for 31 yards to the Chi48. Tackled by Rodney McLeod.","(5:39) Penalty: Holding on Chicago (Josh Sitton) -10 yards.","(6:11) Ka'Deem Carey rush to the left for 2 yards to the Chi27. Tackled by Malcolm Jenkins.","(6:11) Caleb Sturgis kicks off to the endzone. Touchback.","(6:15) Caleb Sturgis 25 yard field goal attempt is GOOD. Holder: Donnie Jones.","(6:52) Carson Wentz sacked at Chi7 for a loss of 3 yards by Sam Acho.","(7:33) Carson Wentz pass to the left to Ryan Mathews for 3 yards to the Chi4. Tackled by Adrian Amos.","(8:19) Darren Sproles rush to the left for 2 yards to the Chi7. Tackled by Willie Young.","(8:51) Carson Wentz pass to the left to Nelson Agholor for 7 yards to the Chi9. Tackled by Tracy Porter.","(8:55) Carson Wentz incomplete pass to the right intended for Brent Celek defensed by Bryce Callahan.","(9:35) Darren Sproles rush to the right for 3 yards to the Chi16. Tackled by Jacoby Glenn.","(10:12) Carson Wentz pass to the right to Dorial Green-Beckham for 9 yards to the Chi19. Tackled by Harold Jones-Quartey.","(10:59) Carson Wentz pass to the right to Darren Sproles for 2 yards to the Chi28. Tackled by Jacoby Glenn.","(11:43) Carson Wentz pass to the right to Jordan Matthews for 2 yards to the Chi30. Tackled by Harold Jones-Quartey.","(12:19) Carson Wentz pass to the left to Jordan Matthews for 4 yards to the Chi32. Tackled by Harold Jones-Quartey.","(12:58) Carson Wentz pass to the right to Dorial Green-Beckham for 9 yards to the Chi36. Tackled by Jacoby Glenn.","(13:37) Carson Wentz pass to the left to Nelson Agholor for 9 yards to the Chi45. Tackled by Tracy Porter.","(13:46) Patrick O'Donnell punts for 40 yards to Phi46. No return.","(13:50) Jay Cutler incomplete pass to the left intended for Jeremy Langford.","(14:26) Jay Cutler sacked at Chi14 for a loss of 10 yards by Malcolm Jenkins.","(14:54) Jeremy Langford rush to the left for no gain to the Chi24. Tackled by Brandon Graham.","(15:00) Caleb Sturgis kicks off to the Chi8. Ka'Deem Carey return for 16 yards to Chi24. Tackled by Rodney McLeod."]