["(0:04) Landry Jones rush up the middle for no gain to the Pit25.","(0:04) Cairo Santos kicks off to the endzone. Touchback.","(0:04) Cairo Santos extra point is good.","(0:08) Alex Smith pass to the left to Travis Kelce for 3 yards for a TOUCHDOWN.","(0:08) Kansas City Chiefs timeout.","(0:54) Spencer Ware rush up the middle for no gain to the Pit3. Tackled by Daniel McCullers and Javon Hargrave.","(1:32) Spencer Ware rush to the right for 2 yards to the Pit3. Tackled by Vince Williams and William Gay.","(1:58) Spencer Ware rush up the middle for 3 yards to the Pit5. Tackled by Vince Williams and Javon Hargrave.","(1:58) Two Minute Warning.","(2:03) Penalty: Illegal Contact on Pittsburgh (Artie Burns) 5 yards.","(2:39) Jamaal Charles rush to the left for 1 yard to the Pit13. Tackled by Lawrence Timmons.","(3:18) Spencer Ware rush up the middle for 46 yards to the Pit14. Tackled by Vince Williams.","(3:45) Alex Smith pass to the right to Albert Wilson for 2 yards to the KC40. Tackled by Jordan Dangerfield and Arthur Moats.","(3:53) Jordan Berry punts for 37 yards to KC38. No return.","(4:33) Landry Jones rush up the middle for no gain to the Pit32. FUMBLE, recovered by Pit (Landry Jones).","(5:18) DeAngelo Williams rush to the left for 1 yard to the Pit32. Tackled by Eric Berry.","(5:57) Le'Veon Bell rush to the right for 5 yards to the Pit31. Tackled by Nick Williams.","(6:03) Dustin Colquitt punts for 44 yards to Pit26. No return.","(6:11) Alex Smith incomplete pass to the right intended for Chris Conley.","(6:48) Spencer Ware rush to the right for 5 yards to the KC30. Tackled by Cameron Heyward.","(7:16) Alex Smith sacked at KC25 for a loss of 5 yards by Cameron Heyward.","(7:22) Chris Boswell kicks off to the KC-3. Tyreek Hill return for 33 yards to KC30. Tackled by Shamarko Thomas.","(7:22) Chris Boswell extra point is good.","(7:22) Pittsburgh Steelers timeout.","(7:26) DeAngelo Williams rush to the left for 2 yards for a TOUCHDOWN.","(7:29) Ben Roethlisberger incomplete pass to the left intended for Xavier Grimble.","(7:29) Pittsburgh Steelers timeout.","(8:10) Le'Veon Bell rush to the left for 44 yards to the KC2. Tackled by Daniel Sorensen.","(8:54) Ben Roethlisberger pass to the middle to DeAngelo Williams for 2 yards to the KC46. Tackled by Derrick Johnson.","(9:38) Le'Veon Bell rush to the left for 4 yards to the KC48. Tackled by Eric Berry and Jaye Howard.","(9:38) Kansas City Chiefs timeout.","(10:23) Ben Roethlisberger pass to the right to Sammie Coates for 18 yards to the Pit48. Tackled by Daniel Sorensen.","(11:07) Le'Veon Bell rush to the right for 5 yards to the Pit30. Tackled by Justin March and Tamba Hali.","(11:11) Ben Roethlisberger incomplete pass to the left intended for Sammie Coates.","(11:11) Cairo Santos kicks off to the endzone. Touchback.","(11:11) Cairo Santos extra point is good.","(11:17) Alex Smith pass to the left to Tyreek Hill for 10 yards for a TOUCHDOWN.","(11:45) Alex Smith pass to the right to Tyreek Hill for 6 yards to the Pit10. Tackled by William Gay.","(12:15) Spencer Ware rush up the middle for 5 yards to the Pit16. Tackled by James Harrison and Lawrence Timmons.","(12:18) Alex Smith incomplete pass to the left intended for Tyreek Hill.","(12:51) Alex Smith pass to the middle to Travis Kelce for 9 yards to the Pit21. Tackled by James Harrison and Artie Burns.","(13:25) Alex Smith pass to the left to Albert Wilson for 17 yards to the Pit30. Tackled by Mike Mitchell.","(13:28) Alex Smith incomplete pass to the left intended for Travis Kelce defensed by Cameron Heyward.","(13:36) Jordan Berry punts for 38 yards to Pit47. No return.","(14:15) Ben Roethlisberger pass to the right to Sammie Coates for 3 yards to the Pit9. Tackled by Ron Parker.","(15:00) Le'Veon Bell rush up the middle for no gain to the Pit6. Tackled by Derrick Johnson.","(0:25) Le'Veon Bell rush to the left for 3 yards to the Pit6. Tackled by Jaye Howard.","(0:28) Alex Smith incomplete pass to the left intended for Ross Travis.","(0:32) Alex Smith incomplete pass to the middle intended for Albert Wilson defensed by Artie Burns.","(0:36) Alex Smith incomplete pass to the right intended for Travis Kelce.","(1:12) Alex Smith pass to the right to Travis Kelce for 4 yards to the Pit3. Tackled by Mike Mitchell and Lawrence Timmons.","(1:19) Pittsburgh Steelers timeout.","(1:19) Alex Smith pass to the left to Chris Conley for 13 yards to the Pit7. Tackled by Artie Burns.","(1:23) Alex Smith incomplete pass to the right intended for Jeremy Maclin.","(1:45) Alex Smith pass to the right to Albert Wilson for 6 yards to the Pit20. Tackled by Mike Mitchell.","(2:18) Alex Smith pass to the right to Jeremy Maclin for 14 yards to the Pit26. Tackled by Vince Williams and Jordan Dangerfield.","(2:44) Alex Smith pass to the right to Chris Conley for 10 yards to the Pit40. Tackled by Ross Cockrell.","(2:50) Alex Smith incomplete pass to the left intended for Tyreek Hill defensed by Artie Burns.","(3:16) Spencer Ware rush up the middle for 2 yards to the KC50. Tackled by Vince Williams.","(3:37) Alex Smith pass to the left to Jeremy Maclin for 13 yards to the KC48. Tackled by Mike Mitchell.","(3:41) Alex Smith incomplete pass to the middle intended for Travis Kelce.","(3:58) Penalty: False Start on Kansas City (Eric Fisher) -5 yards.","(4:22) Alex Smith pass to the left to Chris Conley for 9 yards to the KC40. Tackled by William Gay and Lawrence Timmons.","(4:25) Alex Smith incomplete pass to the right intended for Knile Davis.","(4:51) Alex Smith pass to the middle to Knile Davis for 11 yards to the KC31. Tackled by William Gay and Lawrence Timmons.","(4:53) Alex Smith incomplete pass to the left intended for Jeremy Maclin.","(5:17) Alex Smith pass to the right to Knile Davis for 3 yards to the KC20. Tackled by Jordan Dangerfield.","(5:25) Jordan Berry punts for 44 yards to KC17. No return.","(6:02) Le'Veon Bell rush to the left for 12 yards to the Pit39. Tackled by Tamba Hali and Dee Ford.","(6:27) Penalty: False Start on Pittsburgh (Xavier Grimble) -5 yards.","(7:03) Ben Roethlisberger pass to the right to Sammie Coates for a loss of 1 yard to the Pit32. Tackled by Daniel Sorensen.","(7:44) Le'Veon Bell rush up the middle for a loss of 1 yard to the Pit33. Tackled by Dee Ford and Chris Jones.","(8:27) Le'Veon Bell rush to the left for 18 yards to the Pit34. Tackled by Nick Williams.","(9:02) Le'Veon Bell rush to the right for 8 yards to the Pit16. Tackled by Justin March and Ron Parker.","(9:09) Dustin Colquitt punts for 47 yards to Pit8. No return.","(9:53) Alex Smith pass to the left to Spencer Ware for 14 yards to the KC45. Tackled by Cameron Heyward.","(9:53) Penalty: False Start on Kansas City (Laurent Duvernay-Tardif) -5 yards.","(9:58) Alex Smith incomplete pass to the left intended for Spencer Ware.","(10:39) Alex Smith sacked at KC36 for a loss of 6 yards by Cameron Heyward. FUMBLE, recovered by KC (Alex Smith).","(11:05)  FUMBLE, recovered by KC (Alex Smith). Alex Smith pass to the middle to Albert Wilson for 12 yards to the KC42. Tackled by Ross Cockrell.","(11:19) Penalty: Holding on Pittsburgh (Artie Burns) 5 yards.","(11:19) Chris Boswell kicks off to the endzone. Touchback.","(11:19) Chris Boswell extra point is good. Penalty: Offside on Kansas City (Chris Jones) 5 yards.","(11:26) Ben Roethlisberger pass to the left to Markus Wheaton for 30 yards for a TOUCHDOWN.","(12:14) Ben Roethlisberger pass to the left to Le'Veon Bell for 2 yards to the KC30. Tackled by D.J. White and Derrick Johnson.","(12:53) Le'Veon Bell rush to the left for 4 yards to the KC32. Tackled by Jaye Howard.","(13:39) Ben Roethlisberger pass to the right to Xavier Grimble for 19 yards to the KC36. Tackled by Marcus Peters.","(14:19) Le'Veon Bell rush to the right for 3 yards to the Pit45. Tackled by Justin March and Chris Jones.","(15:00) Ben Roethlisberger pass to the right to Le'Veon Bell for 17 yards to the Pit42. Tackled by Allen Bailey.","(15:00) Cairo Santos kicks off to the endzone. Touchback.","(0:04) Ben Roethlisberger rush up the middle for a loss of 1 yard to the Pit38.","(0:08) 49 yard field goal attempt by Cairo Santos is NO GOOD. Holder: Dustin Colquitt.","(0:08) Pittsburgh Steelers timeout.","(0:08) Kansas City Chiefs timeout.","(0:15) Alex Smith pass to the middle to Jeremy Maclin for 16 yards to the Pit31. Tackled by Vince Williams.","(0:15) Kansas City Chiefs timeout.","(0:22) Alex Smith pass to the right to Jeremy Maclin for 20 yards to the Pit47. Tackled by Jordan Dangerfield.","(0:25) Alex Smith incomplete pass to the middle intended for Albert Wilson.","(0:44) Alex Smith pass to the right to Travis Kelce for 8 yards to the KC33. Tackled by Vince Williams and Lawrence Timmons.","(0:44) Chris Boswell kicks off to the endzone. Touchback.","(0:44) Chris Boswell extra point is good.","(0:49) Ben Roethlisberger pass to the right to Jesse James for 9 yards for a TOUCHDOWN.","(0:54) Ben Roethlisberger pass to the right to Sammie Coates for 3 yards to the KC9. Tackled by Marcus Peters.","(0:59) Ben Roethlisberger pass to the left to Sammie Coates for 9 yards to the KC12.","(1:20) Ben Roethlisberger pass to the middle to Jesse James for 6 yards to the KC21. Tackled by Daniel Sorensen.","(1:45) Le'Veon Bell rush up the middle for 5 yards to the KC27. Tackled by Derrick Johnson and Allen Bailey.","(1:45) Pittsburgh Steelers timeout.","(2:00) Le'Veon Bell rush to the right for 9 yards to the KC32. Tackled by Dee Ford.","(2:00) Two Minute Warning.","(2:27) Ben Roethlisberger pass to the right to Antonio Brown for 4 yards to the KC41. Tackled by Steven Nelson.","(3:05) DeAngelo Williams rush to the left for 4 yards to the KC45. Tackled by Tamba Hali and Jaye Howard.","(3:46) Le'Veon Bell rush to the left for 5 yards to the KC49. Tackled by Dee Ford.","(4:28) Ben Roethlisberger pass to the right to David Johnson for 26 yards to the Pit46. Tackled by Frank Zombo.","(4:38) Dustin Colquitt punts for 44 yards to Pit0. Touchback.","(4:44) Alex Smith incomplete pass to the right intended for Albert Wilson defensed by Stephon Tuitt.","(5:23) Alex Smith pass to the right to Tyreek Hill for 1 yard to the Pit44. Tackled by Vince Williams.","(6:01) Knile Davis rush to the right for a loss of 2 yards to the Pit45. Tackled by Vince Williams.","(6:25) Alex Smith pass to the left to Chris Conley for 13 yards to the Pit43.","(6:25) Pittsburgh Steelers timeout.","(7:01) Alex Smith pass to the right to Travis Kelce for a loss of 1 yard to the KC44. Tackled by William Gay.","(7:44) Alex Smith sacked at KC45 for a loss of 1 yard by Vince Williams.","(8:25) Spencer Ware rush up the middle for 5 yards to the KC46. Tackled by Cameron Heyward.","(9:09) Spencer Ware rush to the right for 4 yards to the KC41. Tackled by Jordan Dangerfield and Jarvis Jones.","(9:42) Alex Smith pass to the middle to Tyreek Hill for 1 yard to the KC37. Tackled by Jarvis Jones and Vince Williams.","(10:25) Alex Smith pass to the right to Albert Wilson for 15 yards to the KC36. Tackled by Jarvis Jones.","(11:00) Spencer Ware rush up the middle for 3 yards to the KC21. Tackled by Ross Cockrell and Arthur Moats.","(11:20) Jordan Berry punts for 52 yards to KC22. Tyreek Hill return for 6 yards to KC28. Penalty: Illegal Block on Kansas City (Demetrius Harris) -10 yards.","(11:58) Le'Veon Bell rush to the right for 14 yards to the Pit26. Tackled by Marcus Peters and Daniel Sorensen.","(12:15) Penalty: False Start on Pittsburgh (David DeCastro) -5 yards.","(12:43) Penalty: Holding on Pittsburgh (Marcus Gilbert) -10 yards.","(13:43) Ben Roethlisberger sacked at Pit27 for a loss of 8 yards by Jaye Howard.","(14:24) Le'Veon Bell rush up the middle for 4 yards to the Pit35. Tackled by Justin March and Frank Zombo.","(14:55) Ben Roethlisberger pass to the left to Antonio Brown for 18 yards to the Pit31. Tackled by Eric Berry.","(15:00) Ben Roethlisberger incomplete pass to the right intended for Sammie Coates defensed by Marcus Peters.","(0:21) Ben Roethlisberger pass to the left to Le'Veon Bell for 5 yards to the Pit13. Tackled by Steven Nelson.","(0:32) Dustin Colquitt punts for 58 yards to Pit12. Antonio Brown return for 4 yards to Pit16. Tackled by Eric Murray. Penalty: Illegal Block on Pittsburgh (Artie Burns) -8 yards.","(0:37) Alex Smith incomplete pass to the right intended for Spencer Ware.","(1:09) Alex Smith rush to the right for 2 yards to the KC30. Tackled by Lawrence Timmons.","(1:13) Alex Smith incomplete pass to the right intended for Spencer Ware.","(1:20) Chris Boswell kicks off to the KC7. Tyreek Hill return for 21 yards to KC28. Tackled by Shamarko Thomas.","(1:20) Chris Boswell extra point is good.","(1:20) Ben Roethlisberger pass to the left to Antonio Brown for 38 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Pittsburgh (Antonio Brown) -15 yards.","(2:07) Le'Veon Bell rush to the right for 2 yards to the KC38. Tackled by Frank Zombo.","(2:14) Dustin Colquitt punts for 23 yards to KC40. No return.","(2:19) Penalty: False Start on Kansas City (Demarcus Robinson) -5 yards.","(2:24) Alex Smith incomplete pass to the left intended for Jeremy Maclin.","(3:08) Tyreek Hill rush to the left for a loss of 2 yards to the KC22. Tackled by Lawrence Timmons.","(3:49) Alex Smith pass to the right to Chris Conley for 8 yards to the KC24. Tackled by Ross Cockrell.","(4:25) Alex Smith pass to the left to Demetrius Harris for 12 yards to the KC16. Tackled by Vince Williams.","(5:03) Spencer Ware rush up the middle for 2 yards to the KC4. Tackled by Vince Williams.","(5:10) Chris Boswell kicks off to the KC-2. Knile Davis return for 4 yards to KC2. Tackled by Darrius Heyward-Bey.","(5:10) Chris Boswell extra point is good.","(5:10) Penalty: Encroachment on Kansas City (Dontari Poe) 5 yards.","(5:14) Ben Roethlisberger pass to the left to Antonio Brown for 4 yards for a TOUCHDOWN.","(5:23) Alex Smith pass intended for Spencer Ware INTERCEPTED by Jarvis Jones defensed by Cameron Heyward and returned for 20 yards. Tackled by Alex Smith.","(6:09) Alex Smith pass to the left to Tyreek Hill for 6 yards to the KC26. Tackled by Artie Burns.","(6:49) Jamaal Charles rush up the middle for 6 yards to the KC20. Tackled by Vince Williams.","(7:23) Spencer Ware rush up the middle for 2 yards to the KC14. Tackled by Vince Williams.","(7:27) Chris Boswell kicks off to the KC-5. Knile Davis return for 17 yards to KC12. Tackled by Steven Johnson.","(7:27) Ben Roethlisberger 2 pt conversion pass to Markus Wheaton is GOOD.","(7:34) Ben Roethlisberger pass to the left to Darrius Heyward-Bey for 31 yards for a TOUCHDOWN.","(8:13) Sammie Coates rush to the left for a loss of 1 yard to the KC31. Tackled by Frank Zombo.","(8:50) Ben Roethlisberger pass to the middle to Le'Veon Bell for 2 yards to the KC30. Tackled by Jaye Howard and Dee Ford.","(8:55) Spencer Ware rush up the middle for 3 yards to the KC27. Tackled by Stephon Tuitt. FUMBLE, recovered by Pit (Ross Cockrell). Tackled by Albert Wilson.","(9:06) Jordan Berry punts for 40 yards to KC10. Tyreek Hill return for 14 yards to KC24. Tackled by Vince Williams.","(9:42) Ben Roethlisberger sacked at Pit50 for a loss of 5 yards by Dontari Poe and Dee Ford.","(9:47) Ben Roethlisberger incomplete pass to the middle intended for Le'Veon Bell.","(10:30) DeAngelo Williams rush to the right for no gain to the KC45. Tackled by Justin March.","(10:52) Penalty: Holding on Pittsburgh (David DeCastro) -10 yards.","(10:58) Penalty: Offside on Kansas City (Dee Ford) 5 yards.","(11:36) Ben Roethlisberger pass to the right to Le'Veon Bell for 8 yards to the KC40. Tackled by Derrick Johnson.","(11:39) Ben Roethlisberger incomplete pass to the left intended for Antonio Brown.","(12:28) Ben Roethlisberger pass to the right to Sammie Coates for 47 yards to the KC48. Tackled by Marcus Peters.","(12:40) Dustin Colquitt punts for 41 yards to Pit5. No return.","(12:45) Alex Smith incomplete pass to the right.","(12:50) Penalty: Offside on Pittsburgh (Cameron Heyward) 5 yards.","(13:34) Alex Smith sacked at KC49 for a loss of 5 yards by Cameron Heyward.","(13:38) Alex Smith incomplete pass to the left intended for Jamaal Charles.","(14:18) Alex Smith pass to the right to Chris Conley for 17 yards to the Pit46. Tackled by Mike Mitchell.","(14:56) Alex Smith pass to the middle to Jeremy Maclin for 15 yards to the KC37. Tackled by Mike Mitchell.","(15:00) Chris Boswell kicks off to the KC-8. Knile Davis return for 30 yards to KC22. Tackled by Artie Burns and Anthony Chickillo."]