["(1:55) Derek Carr pass to the middle to Seth Roberts for 41 yards for a TOUCHDOWN.","(1:55) Tampa Bay Buccaneers timeout.","(2:00) Derek Carr incomplete pass to the right intended for Amari Cooper.","(2:00) Two Minute Warning.","(2:31) Derek Carr pass to the middle to Michael Crabtree for 7 yards to the TB41. Tackled by Kwon Alexander.","(2:35) Derek Carr incomplete pass to the left intended for Amari Cooper.","(3:21) Derek Carr pass to the right to Latavius Murray for 12 yards to the TB48. Tackled by Brent Grimes.","(3:29) Bryan Anger punts for 42 yards to Oak40. Jalen Richard - no return. Tackled by Josh Robinson.","(3:35) Jameis Winston incomplete pass to the left intended for Antone Smith.","(3:35) Tampa Bay Buccaneers timeout.","(4:11) Antone Smith rush up the middle for 5 yards to the TB18. Tackled by Khalil Mack. FUMBLE, recovered by TB (Antone Smith).","(4:43) Antone Smith rush up the middle for 2 yards to the TB13. Tackled by Khalil Mack.","(4:44) Marquette King punts for 32 yards to TB11. No return.","(5:37) Derek Carr pass to the right to Michael Crabtree for 10 yards to the TB43. Tackled by Kwon Alexander.","(5:58) Derek Carr pass to the middle to Clive Walford for 13 yards to the TB43. Tackled by Jude Adjei-Barimah. Penalty: Illegal Block on Oakland (Seth Roberts) -10 yards.","(6:28) Derek Carr sacked at Oak44 for a loss of 4 yards by Jude Adjei-Barimah.","(6:48) Penalty: Illegal Formation on Oakland (Vadal Alexander) -5 yards.","(7:31) DeAndre Washington rush up the middle for a loss of 1 yard to the TB47. Tackled by William Gholston.","(8:12) Derek Carr pass to the left to Amari Cooper for 20 yards to the TB46. Tackled by Jude Adjei-Barimah.","(8:16) Derek Carr incomplete pass to the left intended for Seth Roberts defensed by Chris Conte.","(9:20) Latavius Murray rush up the middle for 19 yards to the Oak34. Tackled by Chris Conte.","(10:01) Derek Carr pass to the left to Michael Crabtree for 5 yards to the Oak15. Tackled by Vernon Hargreaves III.","(10:10) Bryan Anger punts for 53 yards to Oak0. Touchback. Penalty: Holding on Oakland (DJ Hayden) -10 yards.","(10:14) Jameis Winston incomplete pass to the left intended for Mike Evans defensed by David Amerson.","(10:51) Jameis Winston pass to the right to Mike Evans for 5 yards to the TB47. Tackled by David Amerson.","(10:59) Jameis Winston incomplete pass to the left intended for Mike Evans defensed by DJ Hayden.","(11:03) 52 yard field goal attempt by Sebastian Janikowski is NO GOOD. Holder: Marquette King.","(11:46) Derek Carr pass to the right to Andre Holmes for no gain to the TB34. Tackled by Brent Grimes.","(11:46) Penalty: False Start on Oakland (Donald Penn) -5 yards.","(11:53) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(12:35) Jalen Richard rush up the middle for 5 yards to the TB29. Tackled by Keith Tandy.","(13:00) Derek Carr pass to the left to Amari Cooper for 4 yards to the TB19. Tackled by Vernon Hargreaves III. Penalty: Unnecessary Roughness on Oakland (Amari Cooper) -15 yards.","(13:50) Derek Carr pass to the left to Michael Crabtree for 45 yards to the TB23. Tackled by Vernon Hargreaves III.","(14:30) Latavius Murray rush up the middle for 1 yard to the Oak32. Tackled by William Gholston.","(15:00) Derek Carr pass to the right to Latavius Murray for 6 yards to the Oak31. Tackled by Kwon Alexander.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback.","(0:04) 50 yard field goal attempt by Sebastian Janikowski is NO GOOD. Holder: Marquette King.","(0:04) Tampa Bay Buccaneers timeout.","(0:11) Derek Carr rush to the left for 13 yards to the TB32. Tackled by Kwon Alexander.","(0:17) Derek Carr incomplete pass to the left intended for Amari Cooper.","(0:17) Tampa Bay Buccaneers timeout.","(0:20) Derek Carr incomplete pass to the left intended for Latavius Murray.","(0:44) Derek Carr pass to the left to Michael Crabtree for 10 yards to the TB45. Tackled by Kwon Alexander.","(0:58) Bryan Anger punts for 46 yards to Oak25. Jalen Richard return for 20 yards to Oak45. Tackled by Bryan Anger.","(1:06) Jameis Winston incomplete pass to the left intended for Mike Evans defensed by Karl Joseph.","(1:10) Jameis Winston incomplete pass to the right intended for Mike Evans.","(1:38) Jacquizz Rodgers rush up the middle for 4 yards to the TB29. Tackled by Khalil Mack.","(1:38) Sebastian Janikowski kicks off to the endzone. Touchback.","(1:38) Sebastian Janikowski extra point is good.","(1:43) Derek Carr pass to the left to Mychal Rivera for 7 yards for a TOUCHDOWN.","(1:43) Penalty: False Start on Oakland (Rodney Hudson) -5 yards.","(1:49) Penalty: Holding on Tampa Bay (Jude Adjei-Barimah) 3 yards.","(1:55) Derek Carr pass to the left to Amari Cooper for 7 yards to the TB5. Tackled by Vernon Hargreaves III.","(2:00) Derek Carr incomplete pass to the right intended for Michael Crabtree defensed by Brent Grimes.","(2:00) Two Minute Warning.","(2:06) Derek Carr incomplete pass to the left intended for Seth Roberts.","(2:44) Derek Carr pass to the left to Amari Cooper for 31 yards to the TB12. Tackled by Vernon Hargreaves III.","(3:11) Derek Carr pass to the left to Clive Walford for 17 yards to the TB43. Tackled by Bradley McDougald.","(3:16) Derek Carr incomplete pass to the right intended for Michael Crabtree defensed by Brent Grimes.","(3:40) Derek Carr pass to the left to Seth Roberts for 15 yards to the Oak40. Tackled by Kwon Alexander.","(3:48) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(3:48) Roberto Aguayo kicks off to the endzone. Touchback.","(3:48) Jameis Winston 2 pt conversion pass to Mike Evans is GOOD.","(3:53) Jacquizz Rodgers rush to the left for 1 yard for a TOUCHDOWN.","(4:39) Jameis Winston rush to the left for 6 yards to the Oak1. Tackled by Perry Riley Jr..","(5:26) Penalty: Too Many Men on Field on Oakland 5 yards.","(5:26) Jacquizz Rodgers rush up the middle for 4 yards to the Oak12. Tackled by Bruce Irvin.","(6:04) Jameis Winston pass to the left to Russell Shepard for 5 yards to the Oak16. Tackled by Jihad Ward.","(6:11) Penalty: Pass Interference on Oakland (DJ Hayden) 19 yards.","(6:52) Jameis Winston pass to the right to Luke Stocker for 10 yards to the Oak40. Tackled by Darius Latham.","(7:44) Penalty: Too Many Men on Field on Oakland 5 yards.","(7:44) Jameis Winston pass to the right to Jacquizz Rodgers for 9 yards to the TB45. Tackled by Karl Joseph.","(7:52) Jameis Winston incomplete pass to the right intended for Mike Evans.","(7:58) Penalty: Unnecessary Roughness on Oakland (Karl Joseph) 15 yards.","(8:03) Jameis Winston incomplete pass to the left intended for Adam Humphries defensed by DJ Hayden.","(8:33) Antone Smith rush to the right for 3 yards to the TB21. Tackled by Malcolm Smith.","(8:41) Marquette King punts for 24 yards to TB18. No return.","(8:47) Derek Carr incomplete pass to the left intended for Michael Crabtree.","(9:32) Derek Carr pass to the right to Jalen Richard for a loss of 3 yards to the TB42. Tackled by Kwon Alexander.","(10:12) DeAndre Washington rush to the left for no gain to the TB39. Tackled by Vernon Hargreaves III.","(10:54) Derek Carr pass to the right to Michael Crabtree for 13 yards to the TB39. Tackled by Brent Grimes.","(11:01) Derek Carr incomplete pass to the left intended for Clive Walford defensed by Bradley McDougald.","(11:48) Latavius Murray rush to the right for 2 yards to the Oak48. Tackled by Kwon Alexander.","(12:32) Jalen Richard rush up the middle for 3 yards to the Oak46. Tackled by Kwon Alexander.","(13:17) Jalen Richard rush up the middle for 6 yards to the Oak43. Tackled by Bradley McDougald.","(14:01) Derek Carr pass to the left to Amari Cooper for 10 yards to the Oak37. Tackled by Bradley McDougald.","(14:48) Johnny Holton rush to the left for 2 yards to the Oak27. Tackled by Vernon Hargreaves III.","(14:55) Roberto Aguayo kicks off to the Oak0. Jalen Richard return for 25 yards to Oak25. Tackled by Alterraun Verner.","(14:55) Roberto Aguayo extra point is NO GOOD.","(15:00) Jameis Winston pass to the left to Cameron Brate for 5 yards for a TOUCHDOWN.","(0:30) Jameis Winston pass to the middle to Adam Humphries for 42 yards to the Oak5. Tackled by DJ Hayden.","(1:07) Jacquizz Rodgers rush to the right for no gain to the Oak47. Tackled by Malcolm Smith.","(1:20) Marquette King punts for 42 yards to TB48. No return. Penalty: Illegal Plyr Downfld on Oakland (Cory James) 5 yards.","(2:02) Derek Carr pass to the left to Mychal Rivera for 2 yards to the Oak10. Tackled by Lavonte David.","(2:08) Derek Carr incomplete pass to the right intended for Seth Roberts defensed by Kwon Alexander.","(2:12) Penalty: Illegal Use of Hands on Oakland (Vadal Alexander) -8 yards.","(2:12) Oakland Raiders timeout.","(2:47) Derek Carr pass to the left to Amari Cooper for 9 yards to the Oak16. Tackled by Chris Conte.","(3:09) Penalty: Unnecessary Roughness on Oakland (Donald Penn) -7 yards.","(3:21) Bryan Anger punts for 55 yards to Oak10. Jalen Richard return for 4 yards to Oak14. Tackled by Russell Shepard.","(3:27) Jameis Winston incomplete pass to the middle intended for Cameron Brate.","(3:33) Jameis Winston incomplete pass to the right intended for Cameron Brate defensed by Karl Joseph.","(4:13) Jacquizz Rodgers rush to the right for a loss of 2 yards to the TB35. Tackled by Shilique Calhoun.","(4:49) Jacquizz Rodgers rush to the right for 9 yards to the TB37. Tackled by Malcolm Smith.","(5:30) Jacquizz Rodgers rush to the right for 3 yards to the TB28. Tackled by Justin Ellis.","(5:30) Sebastian Janikowski kicks off to the endzone. Touchback.","(5:30) Sebastian Janikowski extra point is good.","(5:38) Derek Carr pass to the right to Amari Cooper for 34 yards for a TOUCHDOWN.","(6:15) DeAndre Washington rush to the right for 3 yards to the TB34. Tackled by Kwon Alexander.","(6:58) Derek Carr pass to the left to Jamize Olawale for 1 yard to the TB37. Tackled by Lavonte David.","(7:43) Derek Carr pass to the left to Amari Cooper for 16 yards to the TB38. Tackled by Jude Adjei-Barimah.","(7:47) Derek Carr incomplete pass to the left intended for Michael Crabtree.","(8:32) Latavius Murray rush to the right for 6 yards to the Oak46. Tackled by Kwon Alexander.","(9:13) Latavius Murray rush up the middle for 7 yards to the Oak40. Tackled by Bradley McDougald.","(9:22) Bryan Anger punts for 48 yards to Oak33. No return.","(9:29) Jameis Winston incomplete pass to the left intended for Russell Shepard.","(9:35) Jameis Winston incomplete pass to the right intended for Cecil Shorts III.","(10:18) Jameis Winston sacked at TB19 for a loss of 5 yards by Khalil Mack.","(10:24) Sebastian Janikowski kicks off to the TB0. Ryan Smith return for 24 yards to TB24. Tackled by Jamize Olawale.","(10:24) Sebastian Janikowski extra point is good.","(10:30) Derek Carr pass to the right to Donald Penn for 1 yard for a TOUCHDOWN.","(10:38) Penalty: Pass Interference on Tampa Bay (Brent Grimes) 31 yards.","(11:18) Latavius Murray rush to the left for a loss of 2 yards to the TB32. Tackled by Daryl Smith.","(11:41) Derek Carr pass to the left to Seth Roberts for 13 yards to the TB30. Tackled by Jude Adjei-Barimah.","(12:19) Derek Carr pass to the left to Amari Cooper for 3 yards to the TB43. Tackled by Kwon Alexander.","(13:00) Derek Carr pass to the right to Latavius Murray for 1 yard to the TB46. Tackled by Noah Spence.","(13:44) Derek Carr pass to the middle to Amari Cooper for 28 yards to the TB47. Tackled by Chris Conte.","(14:21) Jamize Olawale rush to the left for a loss of 1 yard to the Oak25. Tackled by William Gholston.","(15:00) Derek Carr pass to the right to Clive Walford for 1 yard to the Oak26. Tackled by Bradley McDougald.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback.","(0:29) Jacquizz Rodgers rush up the middle for 5 yards to the TB21. Tackled by Karl Joseph.","(1:06) Jacquizz Rodgers rush to the right for 4 yards to the TB16. Tackled by Denico Autry.","(1:15) Marquette King punts for 32 yards to TB12. No return.","(2:00) Jalen Richard rush up the middle for no gain to the TB44. Tackled by Robert Ayers Jr..","(2:00) Two Minute Warning.","(2:07) Derek Carr pass to the middle to Latavius Murray for 5 yards to the TB44. Tackled by Kwon Alexander.","(2:51) Latavius Murray rush to the left for 4 yards to the TB49. Tackled by Kwon Alexander.","(3:27) Penalty: Illegal Formation on Oakland (Vadal Alexander) -5 yards.","(4:13) DeAndre Washington rush to the right for 28 yards to the TB48. Tackled by Brent Grimes.","(4:52) Latavius Murray rush to the right for 6 yards to the Oak24. Tackled by Vernon Hargreaves III.","(5:37) Derek Carr pass to the left to Michael Crabtree for 17 yards to the Oak18. Tackled by Lavonte David.","(5:47) Bryan Anger punts for 41 yards to Oak1. No return. Penalty: Illegal Use of Hands on Oakland (Darius Latham) 0 yards.","(5:53) Jameis Winston incomplete pass to the right intended for Cecil Shorts III defensed by TJ Carrie.","(6:19) Jacquizz Rodgers rush to the right for 5 yards to the Oak42. Tackled by Karl Joseph.","(6:52) Jameis Winston pass to the right to Adam Humphries for a loss of 1 yard to the Oak47. Tackled by DJ Hayden.","(7:11) Jameis Winston rush to the right for 9 yards to the TB39. Penalty: Unnecessary Roughness on Oakland (Malcolm Smith) 15 yards.","(7:28) Jameis Winston pass to the left to Mike Evans for 14 yards to the TB30. Tackled by David Amerson.","(7:33) Jameis Winston incomplete pass to the right intended for Cecil Shorts III.","(8:08) Peyton Barber rush to the left for 1 yard to the TB16. Tackled by Khalil Mack.","(8:15) Sebastian Janikowski kicks off to the TB1. Ryan Smith return for 12 yards to TB15. Tackled by Keith McGill.","(8:19) Sebastian Janikowski 31 yard field goal attempt is GOOD. Holder: Marquette King.","(8:26) Derek Carr incomplete pass to the left intended for Michael Crabtree defensed by Vernon Hargreaves III.","(9:07) Derek Carr pass to the right to Jalen Richard for 6 yards to the TB13. Tackled by Lavonte David.","(9:13) Penalty: Pass Interference on Oakland (Michael Crabtree) -10 yards.","(9:56) Derek Carr pass to the right to Latavius Murray for a loss of 1 yard to the TB9. Tackled by Lavonte David and William Gholston.","(10:21) Penalty: Delay of Game on Oakland (Derek Carr) -5 yards.","(10:21) Derek Carr pass to the right to Jamize Olawale for 68 yards to the TB3. Tackled by Bradley McDougald.","(10:35) Bryan Anger punts for 49 yards to Oak30. Jalen Richard return for 9 yards to Oak39. Tackled by Cameron Lynch. Penalty: Holding on Oakland (DJ Hayden) -10 yards.","(10:40) Jameis Winston incomplete pass to the left intended for Mike Evans.","(11:02) Penalty: Illegal Plyr Downfld on Tampa Bay (Kevin Pamphile) -5 yards.","(11:43) Jacquizz Rodgers rush up the middle for 7 yards to the TB26. Tackled by TJ Carrie.","(11:48) Jameis Winston incomplete pass to the left intended for Mike Evans.","(11:56) Marquette King punts for 43 yards to TB19. No return.","(12:00) Derek Carr incomplete pass to the left. Penalty: Intentional Grounding on Oakland (Derek Carr) -14 yards.","(12:44) Derek Carr pass to the right to Amari Cooper for 3 yards to the TB48. Tackled by Jude Adjei-Barimah.","(12:50) Derek Carr incomplete pass to the left intended for Michael Crabtree defensed by Vernon Hargreaves III.","(13:33) Jalen Richard rush to the right for 20 yards to the Oak49. Tackled by Bradley McDougald.","(14:15) Latavius Murray rush to the left for no gain to the Oak29. Tackled by Noah Spence.","(14:54) Latavius Murray rush to the left for 4 yards to the Oak29. Tackled by Gerald McCoy.","(14:54) Roberto Aguayo kicks off to the endzone. Touchback.","(14:54) Roberto Aguayo extra point is good.","(15:00) Jameis Winston pass to the right to Russell Shepard for 19 yards for a TOUCHDOWN.","(0:40) Jameis Winston pass to the left to Cameron Brate for 17 yards to the Oak19. Tackled by Karl Joseph.","(1:15) Jacquizz Rodgers rush to the left for a loss of 2 yards to the Oak36. Tackled by Bruce Irvin.","(1:23) Derek Carr sacked at Oak34 for a loss of 11 yards by Noah Spence. FUMBLE, recovered by TB (Howard Jones). Tackled by Austin Howard.","(1:29) Derek Carr incomplete pass to the left intended for Latavius Murray.","(2:08) Latavius Murray rush up the middle for 1 yard to the Oak45. Tackled by Lavonte David.","(2:50) Derek Carr pass to the right to Mychal Rivera for 27 yards to the Oak44. Tackled by Bradley McDougald.","(3:18) Penalty: Holding on Oakland (Gabe Jackson) -10 yards.","(3:53) DeAndre Washington rush up the middle for 2 yards to the Oak27. Tackled by Daryl Smith.","(3:53) Roberto Aguayo kicks off to the endzone. Touchback.","(3:59) Roberto Aguayo 41 yard field goal attempt is GOOD. Holder: Bryan Anger.","(4:44) Jameis Winston pass to the right to Luke Stocker for a loss of 2 yards to the Oak23. Tackled by Malcolm Smith.","(5:19) Jameis Winston sacked at Oak21 for a loss of 7 yards by Khalil Mack.","(5:51) Jacquizz Rodgers rush to the left for 2 yards to the Oak14. Tackled by Malcolm Smith and Bruce Irvin.","(6:03) Oakland Raiders timeout.","(6:03) Jameis Winston pass to the left to Adam Humphries for 17 yards to the Oak16.","(6:40) Jameis Winston pass to the left to Antone Smith for 9 yards to the Oak33. Tackled by Reggie Nelson.","(7:03) Penalty: Illegal Shift on Tampa Bay -5 yards.","(7:36) Jacquizz Rodgers rush to the left for 2 yards to the Oak37. Tackled by DJ Hayden and Perry Riley Jr..","(8:03) Jacquizz Rodgers rush to the right for 12 yards to the Oak39. Tackled by Karl Joseph.","(8:40) Jacquizz Rodgers rush to the left for 9 yards to the TB49. Tackled by Karl Joseph.","(8:46) Penalty: Holding on Oakland (David Amerson) 5 yards.","(9:23) Jameis Winston pass to the right to Mike Evans for 18 yards to the TB35. Tackled by David Amerson.","(10:02) Jacquizz Rodgers rush to the right for 6 yards to the TB17. Tackled by Denico Autry.","(10:24) Jacquizz Rodgers rush to the left for 1 yard to the TB11. Tackled by TJ Carrie.","(10:38) Marquette King punts for 67 yards to TB20. Adam Humphries - no return. Tackled by Jon Condo. Penalty: Holding on Tampa Bay (Adarius Glanton) -10 yards.","(10:43) Derek Carr incomplete pass to the right intended for Seth Roberts.","(11:11) Derek Carr pass to the left to Michael Crabtree for 1 yard to the Oak25. Tackled by Chris Conte. Penalty: Taunting on Oakland (Michael Crabtree) -12 yards.","(11:43) Derek Carr pass to the left to Amari Cooper for 8 yards to the Oak24. Tackled by Daryl Smith.","(11:53) Bryan Anger punts for 50 yards to Oak16. No return.","(12:31) Jameis Winston rush to the right for 1 yard to the TB34. Tackled by Bruce Irvin and Khalil Mack.","(12:57) Penalty: Holding on Tampa Bay (Donovan Smith) -10 yards.","(13:27) Antone Smith rush to the left for 6 yards to the TB43. Tackled by DJ Hayden.","(13:57) Jameis Winston pass to the right to Cameron Brate for no gain to the TB37. Tackled by Malcolm Smith. FUMBLE, recovered by TB.","(14:19) Jameis Winston pass to the right to Mike Evans for 13 yards to the TB37. Tackled by David Amerson.","(14:23) Jameis Winston incomplete pass to the right intended for Cecil Shorts III defensed by Sean Smith.","(15:00) Jacquizz Rodgers rush to the right for a loss of 1 yard to the TB24. Tackled by Karl Joseph.","(15:00) Sebastian Janikowski kicks off to the endzone. Touchback."]