["(0:12) Derek Carr rush up the middle for a loss of 1 yard to the Oak49.","(0:43) Derek Carr rush up the middle for no gain to the Oak50.","(0:48) Joe Flacco incomplete pass to the middle intended for Kamar Aiken defensed by Reggie Nelson.","(0:53) Joe Flacco incomplete pass to the left intended for Dennis Pitta.","(0:58) Joe Flacco incomplete pass to the right intended for Breshad Perriman defensed by Reggie Nelson.","(1:02) Joe Flacco incomplete pass to the left intended for Chris Moore.","(1:02) Baltimore Ravens timeout.","(1:08) Joe Flacco pass to the right to Steve Smith Sr. for 5 yards to the Bal50. Tackled by DJ Hayden.","(1:36) Joe Flacco pass to the middle to Steve Smith Sr. for 5 yards to the Bal45. Tackled by Cory James.","(1:59) Terrance West rush to the right for 1 yard to the Bal40. Tackled by Cory James.","(1:59) Two Minute Warning.","(2:07) Terrance West rush to the left for 18 yards to the Bal39. Tackled by Karl Joseph.","(2:12) Sebastian Janikowski kicks off to the Bal0. Devin Hester return for 21 yards to Bal21. Tackled by Brynden Trawick.","(2:12) Sebastian Janikowski extra point is good.","(2:12) Derek Carr pass to the right to Michael Crabtree for 23 yards for a TOUCHDOWN.","(2:25) Derek Carr incomplete pass to the right intended for Clive Walford defensed by Eric Weddle.","(2:49) Derek Carr pass to the right to Clive Walford for 17 yards to the Bal23. Tackled by Zachary Orr.","(2:53) Derek Carr incomplete pass to the right intended for Jalen Richard.","(2:59) Derek Carr pass to the right to Michael Crabtree for 11 yards to the Bal40.","(3:31) Derek Carr pass to the right to Michael Crabtree for 15 yards to the Oak49. Tackled by C.J. Mosley.","(3:36) Justin Tucker kicks off to the Oak8. Jalen Richard return for 26 yards to Oak34. Tackled by Kyle Juszczyk.","(3:36) Penalty: Taunting on Baltimore (Mike Wallace) -15 yards.","(3:41) Terrance West rush to the right for 3 yards for a TOUCHDOWN.","(4:26) Joe Flacco pass to the right to Kyle Juszczyk for 7 yards to the Oak3. Tackled by Reggie Nelson.","(4:53) Terrance West rush to the left for 2 yards to the Oak10. Tackled by Stacy McGee and Daren Bates.","(5:35) Terrance West rush to the right for 5 yards to the Oak12. Tackled by Daren Bates.","(5:42) DeAndre Washington rush up the middle for no gain to the Oak17. Tackled by Lawrence Guy. FUMBLE, recovered by Bal (Tavon Young). Tackled by Kelechi Osemele.","(5:50) Penalty: Holding on Oakland (Vadal Alexander) -10 yards.","(6:27) Latavius Murray rush to the right for 2 yards to the Oak27. Tackled by C.J. Mosley.","(6:27) Justin Tucker kicks off to the endzone. Touchback.","(6:27) Justin Tucker extra point is good.","(6:38) Joe Flacco pass to the right to Steve Smith Sr. for 52 yards for a TOUCHDOWN.","(6:50) Marquette King punts for 53 yards to Bal23. Devin Hester return for 20 yards to Bal43. Tackled by Andre Holmes. Penalty: Illegal Return OOB on Oakland (Andre Holmes) 5 yards.","(6:54) Derek Carr incomplete pass to the right intended for Michael Crabtree defensed by Shareece Wright.","(7:01) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(7:20) Penalty: Delay of Game on Oakland (Derek Carr) -5 yards.","(8:08) Derek Carr pass to the right to Mychal Rivera for 1 yard to the Oak29. Tackled by Zachary Orr.","(8:14) Sam Koch punts for 34 yards to Oak28. No return.","(8:43) Joe Flacco pass to the right to Kamar Aiken for 8 yards to the Bal38. Tackled by DJ Hayden and Karl Joseph.","(9:24) Joe Flacco sacked at Bal30 for a loss of 7 yards by Khalil Mack.","(9:33) Penalty: Holding on Baltimore (Ryan Jensen) -10 yards.","(9:58) Javorius Allen rush to the left for 4 yards to the Bal47. Tackled by Stacy McGee.","(10:21) Joe Flacco pass to the right to Dennis Pitta for 10 yards to the Bal43. Tackled by Karl Joseph.","(10:44) Joe Flacco pass to the left to Mike Wallace for 6 yards to the Bal33.","(11:11) Terrance West rush to the left for 2 yards to the Bal27. Tackled by Cory James.","(11:11) Sebastian Janikowski kicks off to the endzone. Touchback.","(11:11) Sebastian Janikowski extra point is good.","(11:19) Derek Carr pass to the middle to Michael Crabtree for 13 yards for a TOUCHDOWN.","(12:01) Latavius Murray rush to the left for 1 yard to the Bal13. Tackled by Terrell Suggs.","(12:42) Derek Carr pass to the left to Latavius Murray for 1 yard to the Bal14. Tackled by Terrell Suggs.","(12:42) Penalty: Offside on Baltimore (Brandon Williams) 5 yards.","(13:06) Derek Carr pass to the left to Amari Cooper for 16 yards to the Bal20. Tackled by Tavon Young.","(13:29) Penalty: Unnecessary Roughness on Oakland (Gabe Jackson) -16 yards.","(14:12) DeAndre Washington rush to the left for 2 yards to the Bal20. Tackled by Zachary Orr.","(14:48) Derek Carr pass to the right to DeAndre Washington for 7 yards to the Bal22. Tackled by C.J. Mosley.","(14:57) Joe Flacco sacked at Bal29 for a loss of 9 yards by Bruce Irvin. FUMBLE, recovered by Oak (Denico Autry). Tackled by Ryan Jensen.","(15:00) Joe Flacco incomplete pass to the left intended for Chris Moore.","(0:30) Terrance West rush to the right for 4 yards to the Bal38. Tackled by Ben Heeney.","(1:14) Joe Flacco pass to the right to Kyle Juszczyk for 11 yards to the Bal34. Tackled by Cory James.","(1:22) Marquette King punts for 52 yards to Bal23. No return.","(1:55) Derek Carr pass to the right to Seth Roberts for a loss of 1 yard to the Oak25. Tackled by Zachary Orr.","(2:00) Derek Carr incomplete pass to the right intended for Michael Crabtree defensed by Shareece Wright.","(2:41) Latavius Murray rush to the left for 1 yard to the Oak26. Tackled by Albert McClellan.","(2:41) Justin Tucker kicks off to the endzone. Touchback.","(2:41) Joe Flacco 2 pt conversion pass is NO GOOD - intended for Steve Smith Sr..","(2:46) Joe Flacco rush to the right for 1 yard for a TOUCHDOWN.","(3:22) Joe Flacco pass to the right to Kyle Juszczyk for 1 yard to the Oak1. Tackled by Jihad Ward and Khalil Mack.","(3:28) Joe Flacco incomplete pass to the left intended for Kyle Juszczyk.","(4:04) Terrance West rush to the right for no gain to the Oak2. Tackled by Dan Williams.","(4:04) Baltimore Ravens timeout.","(4:48) Terrance West rush to the right for 9 yards to the Oak2. Tackled by Ben Heeney.","(4:48) Oakland Raiders timeout.","(5:25) Javorius Allen rush to the left for 5 yards to the Oak11. Tackled by Jihad Ward and Karl Joseph.","(6:01) Joe Flacco pass to the middle to Crockett Gillmore for 10 yards to the Oak16. Tackled by Malcolm Smith.","(6:44) Terrance West rush to the right for 2 yards to the Oak26. Tackled by Khalil Mack.","(7:20) Joe Flacco pass to the left to Crockett Gillmore for 6 yards to the Oak28. Tackled by Karl Joseph.","(7:56) Terrance West rush up the middle for 5 yards to the Oak34. Tackled by Reggie Nelson.","(8:26) Penalty: Holding on Oakland (Sean Smith) 5 yards.","(8:56) Terrance West rush up the middle for 14 yards to the Oak46. Tackled by Cory James. FUMBLE, recovered by Bal (Jeremy Zuttah).","(9:36) Terrance West rush to the right for 12 yards to the Bal40. Tackled by David Amerson and Cory James.","(9:41) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(9:53) Marquette King punts for 62 yards to Bal15. Devin Hester return for 13 yards to Bal28. Tackled by Andre Holmes.","(10:27) Derek Carr pass to the left to Jalen Richard for 5 yards to the Oak23. Tackled by Tavon Young.","(10:27) Penalty: False Start on Oakland (Vadal Alexander) -5 yards.","(10:33) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(10:38) Derek Carr incomplete pass to the right intended for Clive Walford.","(10:47) Sam Koch punts for 42 yards to Oak8. No return. Penalty: FC Interference on Baltimore (Kamar Aiken) 15 yards.","(11:13) Joe Flacco pass to the middle to Kyle Juszczyk for 5 yards to the Bal50. Tackled by Cory James.","(11:21) Joe Flacco incomplete pass to the left intended for Mike Wallace.","(11:59) Joe Flacco pass to the right to Breshad Perriman for 1 yard to the Bal45. Tackled by David Amerson.","(12:24) Terrance West rush to the right for 4 yards to the Oak46. Tackled by David Amerson. Penalty: Holding on Baltimore (Jeremy Zuttah) -10 yards.","(13:01) Joe Flacco pass to the right to Javorius Allen for 8 yards to the Bal50. Tackled by Reggie Nelson and Khalil Mack.","(13:45) Terrance West rush to the right for 5 yards to the Bal42. Tackled by Malcolm Smith.","(14:19) Joe Flacco pass to the left to Mike Wallace for 12 yards to the Bal37. Tackled by Malcolm Smith.","(14:51) Terrance West rush to the right for 1 yard to the Bal25. Tackled by Bruce Irvin.","(15:00) Sebastian Janikowski kicks off to the Bal0. Devin Hester return for 24 yards to Bal24. Tackled by TJ Carrie. FUMBLE, recovered by Bal (Devin Hester).","(0:03) Derek Carr rush up the middle for a loss of 1 yard to the Oak24.","(0:03) Justin Tucker kicks off to the endzone. Touchback.","(0:08) Justin Tucker 43 yard field goal attempt is GOOD. Holder: Sam Koch.","(0:12) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(0:18) Joe Flacco incomplete pass to the right intended for Chris Moore defensed by Karl Joseph.","(0:18) Joe Flacco incomplete pass to the middle.","(0:37) Joe Flacco pass to the middle to Steve Smith Sr. for 20 yards to the Oak25. Tackled by Reggie Nelson.","(0:37) Baltimore Ravens timeout.","(0:44) Joe Flacco pass to the middle to Kyle Juszczyk for 17 yards to the Oak45. Tackled by Cory James and Karl Joseph.","(1:02) Joe Flacco pass to the right to Breshad Perriman for 8 yards to the Bal38. Tackled by David Amerson.","(1:02) Baltimore Ravens timeout.","(1:10) Joe Flacco pass to the left to Breshad Perriman for 15 yards to the Bal30. Tackled by Sean Smith.","(1:32) Joe Flacco pass to the right to Steve Smith Sr. for 3 yards to the Bal15. Tackled by DJ Hayden.","(1:37) Joe Flacco incomplete pass to the left intended for Breshad Perriman defensed by Sean Smith.","(1:43) Marquette King punts for 42 yards to Bal12. No return.","(1:43) Baltimore Ravens timeout.","(1:52) Jalen Richard rush up the middle for 9 yards to the Oak46. Tackled by C.J. Mosley and Eric Weddle.","(2:00) Penalty: Holding on Oakland (Vadal Alexander) -10 yards.","(2:00) Two Minute Warning.","(2:25) DeAndre Washington rush to the right for a loss of 1 yard to the Oak47. Tackled by Brent Urban.","(3:05) Derek Carr pass to the right to Michael Crabtree for 5 yards to the Oak48. Tackled by Lardarius Webb.","(3:11) Sam Koch punts for 56 yards to Oak25. TJ Carrie return for 18 yards to Oak43. Tackled by Albert McClellan.","(3:23) Joe Flacco incomplete pass to the left intended for Mike Wallace defensed by Sean Smith.","(4:02) Joe Flacco pass to the left to Steve Smith Sr. for 3 yards to the Bal19. Tackled by Malcolm Smith.","(4:02) Oakland Raiders timeout.","(4:05) Joe Flacco incomplete pass to the left intended for Javorius Allen.","(4:09) Sebastian Janikowski kicks off to the Bal-2. Devin Hester return for 18 yards to Bal16. Tackled by Ben Heeney.","(4:09) Sebastian Janikowski extra point is good.","(4:14) Derek Carr pass to the right to Michael Crabtree for 5 yards for a TOUCHDOWN.","(4:38) DeAndre Washington rush to the left for 28 yards to the Bal5. Tackled by Lardarius Webb.","(5:14) Derek Carr pass to the middle to Amari Cooper for 11 yards to the Bal33. Tackled by Jimmy Smith.","(6:00) Derek Carr pass to the left to Latavius Murray for 4 yards to the Bal44. Tackled by Albert McClellan and C.J. Mosley.","(6:21) Derek Carr pass to the left to Seth Roberts for 7 yards to the Bal48. Tackled by Jerraud Powers.","(6:38) Latavius Murray rush to the right for 4 yards to the Oak45. Tackled by Zachary Orr and Timmy Jernigan.","(7:03) Derek Carr pass to the middle to Michael Crabtree for 16 yards to the Oak41. Tackled by Shareece Wright.","(7:40) Derek Carr pass to the left to Lee Smith for 1 yard to the Oak25. Tackled by Jimmy Smith.","(8:09) Latavius Murray rush to the left for 4 yards to the Oak24. Tackled by Zachary Orr.","(8:17) Sam Koch punts for 48 yards to Oak0. Touchback.","(8:23) Joe Flacco incomplete pass to the left intended for Steve Smith Sr..","(8:28) Penalty: Holding on Baltimore (James Hurst) -10 yards.","(9:04) Joe Flacco pass to the middle to Chris Moore for 6 yards to the Oak38. Tackled by Karl Joseph.","(9:08) Joe Flacco incomplete pass to the left intended for Steve Smith Sr..","(9:15) Penalty: Pass Interference on Oakland (Malcolm Smith) 7 yards.","(9:50) Joe Flacco pass to the right to Kamar Aiken for a loss of 1 yard to the Bal49. Tackled by Cory James.","(10:28) Terrance West rush to the left for 2 yards to the Bal50. Tackled by Malcolm Smith.","(11:01) Terrance West rush to the right for 21 yards to the Bal48. Tackled by DJ Hayden.","(11:12) Marquette King punts for 55 yards to Bal18. Devin Hester return for 9 yards to Bal27. Tackled by Ben Heeney.","(11:17) Derek Carr incomplete pass to the middle intended for Jalen Richard.","(11:58) Derek Carr pass to the right to DeAndre Washington for 1 yard to the Oak27. Tackled by Zachary Orr.","(12:40) DeAndre Washington rush to the left for 1 yard to the Oak26. Tackled by C.J. Mosley.","(12:46) Penalty: Holding on Oakland (Vadal Alexander) -10 yards.","(12:51) Justin Tucker kicks off to the Oak0. Jalen Richard return for 20 yards to Oak20. Tackled by Chris Carter. Penalty: Unnecessary Roughness on Baltimore (Maxx Williams) 15 yards.","(12:55) Justin Tucker 24 yard field goal attempt is GOOD. Holder: Sam Koch.","(13:00) Joe Flacco incomplete pass to the left intended for Steve Smith Sr..","(13:05) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(13:39) Joe Flacco pass to the right to Steve Smith Sr. for 6 yards to the Oak5. Tackled by Cory James.","(14:21) Joe Flacco pass to the right to Javorius Allen for 7 yards to the Oak11. Tackled by DJ Hayden and Cory James.","(15:00) Joe Flacco pass to the left to Dennis Pitta for 5 yards to the Oak18. Tackled by Cory James.","(0:19) Joe Flacco pass to the left to Steve Smith Sr. for 17 yards to the Oak23. Tackled by Sean Smith.","(0:52) Javorius Allen rush to the right for 4 yards to the Oak40. Tackled by Malcolm Smith.","(1:16) Mike Wallace rush to the left for 3 yards to the Oak44. Tackled by Khalil Mack.","(1:25) Sebastian Janikowski kicks off to the Bal-7. Devin Hester return for 60 yards to Oak47. Tackled by Brynden Trawick.","(1:25) Sebastian Janikowski extra point is good.","(1:32) Derek Carr pass to the right to Seth Roberts for 6 yards for a TOUCHDOWN.","(1:49) Sam Koch punts for 47 yards to Oak47. Jalen Richard return for 47 yards to Bal6. Tackled by Sam Koch.","(1:55) Joe Flacco incomplete pass to the left intended for Dennis Pitta defensed by DJ Hayden.","(2:04) Joe Flacco incomplete pass to the right intended for Mike Wallace.","(2:37) Terrance West rush to the right for 1 yard to the Bal6. Tackled by Cory James.","(2:47) Marquette King punts for 49 yards to Bal5. No return.","(3:54) Jamize Olawale rush to the left for no gain to the Oak46. Tackled by Brandon Williams.","(3:54) Derek Carr pass to the right to Clive Walford for 6 yards to the Oak46. Tackled by C.J. Mosley.","(4:35) Latavius Murray rush to the left for 3 yards to the Oak40. Tackled by Brandon Williams.","(4:58) Derek Carr pass to the left to Amari Cooper for 13 yards to the Oak37. Tackled by Jimmy Smith.","(5:38) Jalen Richard rush to the left for 6 yards to the Oak24. Tackled by C.J. Mosley.","(6:20) Derek Carr pass to the right to DeAndre Washington for 8 yards to the Oak18. Tackled by Terrell Suggs.","(6:46) Penalty: Pass Interference on Oakland (Amari Cooper) -10 yards.","(6:46) Penalty: False Start on Oakland (Lee Smith) -5 yards.","(6:58) Sam Koch punts for 59 yards to Oak20. Jalen Richard return for 5 yards to Oak25. Tackled by Chris Moore.","(7:35) Joe Flacco pass to the left to Kamar Aiken for 2 yards to the Bal21. Tackled by DJ Hayden.","(8:06) Joe Flacco pass to the middle to Dennis Pitta for 2 yards to the Bal19. Tackled by Karl Joseph.","(8:27) Penalty: False Start on Baltimore (Ryan Jensen) -5 yards.","(8:50) Joe Flacco pass to the left to Mike Wallace for 9 yards to the Bal22. Tackled by Sean Smith.","(8:58) Penalty: Holding on Oakland (Sean Smith) 5 yards.","(9:05) Marquette King punts for 55 yards to Bal8. No return.","(9:13) Derek Carr incomplete pass to the left intended for Amari Cooper.","(9:50) Latavius Murray rush to the left for 3 yards to the Oak37. Tackled by Zachary Orr and Michael Pierce.","(10:23) Derek Carr pass to the right to Amari Cooper for 3 yards to the Oak34. Tackled by Shareece Wright.","(10:37) Sam Koch punts for 56 yards to Oak11. Jalen Richard return for 20 yards to Oak31. Tackled by Anthony Levine Sr..","(11:08) Joe Flacco pass to the right to Kyle Juszczyk for 15 yards to the Bal33. Tackled by Cory James.","(11:20) Penalty: Pass Interference on Baltimore (Kamar Aiken) -10 yards.","(11:54) Terrance West rush to the right for no gain to the Bal28. Tackled by Cory James.","(12:19) Penalty: Holding on Baltimore (Jeremy Zuttah) -10 yards.","(12:47) Terrance West rush to the left for 2 yards to the Bal38. Tackled by Stacy McGee.","(13:16) Joe Flacco pass to the left to Mike Wallace for 17 yards to the Bal36. Tackled by Reggie Nelson.","(13:24) Marquette King punts for 46 yards to Bal19. No return.","(13:28) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(14:11) Derek Carr pass to the left to Amari Cooper for 5 yards to the Oak35. Tackled by C.J. Mosley.","(14:55) Latavius Murray rush to the right for 1 yard to the Oak30. Tackled by Timmy Jernigan and Zachary Orr.","(15:00) Justin Tucker kicks off to the Oak9. Jalen Richard return for 20 yards to Oak29. Tackled by Kendrick Lewis."]