["(0:36) Brian Hoyer rush up the middle for a loss of 1 yard to the Det39.","(1:10) Brian Hoyer rush up the middle for a loss of 1 yard to the Det38.","(1:51) Brian Hoyer rush up the middle for a loss of 1 yard to the Det37.","(1:52) Sam Martin onside kickoff to the Det41. Onside kick recovered by receiving team by Sam Acho. Penalty: Illegal Touch on Detroit (Don Carey) 5 yards.","(1:52) Chicago Bears timeout.","(1:52) Two Minute Warning.","(1:52) Matthew Stafford 2 pt conversion pass to Golden Tate is GOOD.","(2:12) Patrick O'Donnell punts for 48 yards to Det15. Andre Roberts return for 85 yards for a TOUCHDOWN.","(2:12) Chicago Bears timeout.","(3:00) Jordan Howard rush to the right for 3 yards to the Chi37. Tackled by Haloti Ngata.","(3:00) Detroit Lions timeout.","(3:05) Jordan Howard rush to the right for 4 yards to the Chi34. Tackled by Tahir Whitehead.","(3:05) Detroit Lions timeout.","(3:09) Jordan Howard rush to the right for a loss of 1 yard to the Chi30. Tackled by Tahir Whitehead.","(3:56) Jordan Howard rush to the left for 10 yards to the Chi31. Tackled by Glover Quin.","(3:56) Detroit Lions timeout.","(4:03) Jordan Howard rush to the left for 7 yards to the Chi21. Tackled by Rafael Bush.","(4:10) Matthew Stafford pass intended for Anquan Boldin INTERCEPTED by Deiondre' Hall. No return.","(4:39) Matthew Stafford pass to the left to Anquan Boldin for no gain to the Chi23. Tackled by Bryce Callahan.","(5:07) Matthew Stafford pass to the right to Anquan Boldin for 5 yards to the Chi23. Tackled by Jerrell Freeman.","(5:43) Matthew Stafford pass to the left to Theo Riddick for 10 yards to the Chi28. Tackled by Harold Jones-Quartey.","(6:03) Penalty: Holding on Detroit (Eric Ebron) -10 yards.","(6:31) Matthew Stafford pass to the left to Eric Ebron for 8 yards to the Chi28. Tackled by Jerrell Freeman.","(6:36) Penalty: Holding on Chicago (Jacoby Glenn) 5 yards.","(7:35) Matthew Stafford pass to the right to Eric Ebron for 13 yards to the Chi41. Tackled by Adrian Amos.","(8:11) Matthew Stafford sacked at Det46 for a loss of 9 yards by Cornelius Washington.","(8:41) Matthew Stafford pass to the middle to Marvin Jones Jr. for 19 yards to the Chi45. Tackled by Harold Jones-Quartey.","(9:20) Theo Riddick rush to the right for a loss of 5 yards to the Det36. Tackled by Harold Jones-Quartey.","(9:25) Matthew Stafford incomplete pass to the left intended for Marvin Jones Jr..","(9:51) Theo Riddick rush to the left for 8 yards to the Det41. Tackled by Jerrell Freeman.","(10:09) Matthew Stafford pass to the right to Andre Roberts for 8 yards to the Det33. Tackled by Jacoby Glenn.","(10:09) Connor Barth kicks off to the endzone. Touchback.","(10:13) Connor Barth 25 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(10:57) Brian Hoyer pass to the left to Cameron Meredith for 5 yards to the Det7. Tackled by Rafael Bush.","(11:01) Brian Hoyer incomplete pass to the left intended for Jordan Howard.","(11:48) Jordan Howard rush to the right for 2 yards to the Det12. Tackled by Kyle Van Noy and Rafael Bush.","(12:32) Jordan Howard rush to the left for 4 yards to the Det14. Tackled by Tahir Whitehead.","(13:15) Brian Hoyer pass to the right to Jordan Howard for 9 yards to the Det18. Tackled by Tyrunn Walker.","(13:55) Brian Hoyer pass to the middle to Cameron Meredith for 6 yards to the Det27. Tackled by Quandre Diggs.","(14:33) Jordan Howard rush to the right for 5 yards to the Det33. Tackled by Darius Slay.","(15:00) Brian Hoyer pass to the right to Eddie Royal for 13 yards to the Det38. Tackled by Darius Slay.","(0:21) Jordan Howard rush to the left for 17 yards to the Chi49. Tackled by Nevin Lawson and Tahir Whitehead.","(1:00) Brian Hoyer pass to the right to Cameron Meredith for 12 yards to the Chi32. Tackled by Tahir Whitehead.","(1:07) Sam Martin punts for 34 yards to Chi20. No return.","(1:13) Matthew Stafford incomplete pass to the left intended for Theo Riddick defensed by Adrian Amos.","(2:00) Zach Zenner rush to the right for 4 yards to the Det46. Tackled by Jerrell Freeman.","(2:06) Matthew Stafford incomplete pass to the left intended for Anquan Boldin.","(2:45) Zach Zenner rush to the right for 10 yards to the Det42. Tackled by Akiem Hicks.","(3:28) Matthew Stafford pass to the left to Zach Zenner for 22 yards to the Det32. Tackled by John Timu.","(3:34) Connor Barth kicks off to the Det-4. Andre Roberts return for 24 yards to Det20. Tackled by Adrian Amos. Penalty: Illegal Block on Detroit (Johnson Bademosi) -10 yards.","(3:34) Connor Barth extra point is good.","(3:39) Brian Hoyer pass to the right to Zach Miller for 6 yards for a TOUCHDOWN.","(4:17) Jordan Howard rush to the left for 1 yard to the Det6. Tackled by Khyri Thornton.","(4:59) Brian Hoyer pass to the right to Kevin White for 5 yards to the Det7. Tackled by Glover Quin.","(5:42) Brian Hoyer pass to the middle to Eddie Royal for 64 yards to the Det12. Tackled by Glover Quin.","(6:24) Brian Hoyer pass to the left to Kevin White for 1 yard to the Chi24. Tackled by Quandre Diggs.","(6:50) Penalty: Holding on Chicago (Cody Whitehair) -10 yards.","(7:18) Brian Hoyer pass to the middle to Jordan Howard for 8 yards to the Chi33. Tackled by Kyle Van Noy and Tahir Whitehead.","(7:18) Sam Martin kicks off to the endzone. Touchback.","(7:21) Matt Prater 21 yard field goal attempt is GOOD. Holder: Sam Martin.","(8:03) Zach Zenner rush to the right for a loss of 2 yards to the Chi3. Tackled by John Timu.","(8:44) Theo Riddick rush to the right for no gain to the Chi1. Tackled by Will Sutton.","(9:24) Theo Riddick rush to the right for 4 yards to the Chi1. Tackled by Harold Jones-Quartey.","(10:08) Matthew Stafford pass to the middle to Anquan Boldin for 10 yards to the Chi5. Tackled by Bryce Callahan.","(10:48) Matthew Stafford pass to the left to Theo Riddick for 4 yards to the Chi15. Tackled by Bryce Callahan.","(11:20) Theo Riddick rush to the right for 2 yards to the Chi19. Tackled by Harold Jones-Quartey.","(11:59) Matthew Stafford pass to the left to Eric Ebron for 9 yards to the Chi21. Tackled by Adrian Amos.","(12:38) Theo Riddick rush to the right for 11 yards to the Chi30. Tackled by Mitch Unrein and Adrian Amos.","(13:03) Matthew Stafford pass to the right to Marvin Jones Jr. for 15 yards to the Chi41. Tackled by Adrian Amos.","(13:32) Matthew Stafford rush to the right for 15 yards to the Det44. Tackled by Adrian Amos.","(13:49) Penalty: False Start on Detroit (Larry Warford) -5 yards.","(14:24) Theo Riddick rush to the right for no gain to the Det34. Tackled by Mitch Unrein.","(14:52) Theo Riddick rush to the right for 3 yards to the Det34. Tackled by Will Sutton.","(15:00) Connor Barth kicks off to the Det0. Andre Roberts return for 31 yards to Det31. Tackled by Ben Braunecker.","(0:02) Brian Hoyer incomplete pass to the left intended for Kevin White defensed by Darius Slay.","(0:02) Penalty: False Start on Chicago (Charles Leno Jr.) -5 yards.","(0:02) Chicago Bears timeout.","(0:08) Brian Hoyer pass to the middle to Alshon Jeffery for 22 yards to the Det44. Tackled by Miles Killebrew.","(0:16) Matthew Stafford pass intended for Golden Tate INTERCEPTED by Jacoby Glenn and returned for 21 yards. Tackled by Matthew Stafford.","(0:16) Detroit Lions timeout.","(0:21) Matthew Stafford pass to the middle to Theo Riddick for 9 yards to the Chi22. Tackled by Jerrell Freeman.","(0:27) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(0:33) Matthew Stafford pass to the right to Eric Ebron for 12 yards to the Chi31. Tackled by Harold Jones-Quartey.","(0:33) Detroit Lions timeout.","(0:39) Matthew Stafford pass to the left to Marvin Jones Jr. for 17 yards to the Chi43. Tackled by Tracy Porter.","(0:44) 50 yard field goal attempt by Connor Barth is NO GOOD. Holder: Patrick O'Donnell.","(0:44) Detroit Lions timeout.","(0:51) Brian Hoyer pass to the left to Eddie Royal for 4 yards to the Det32. Tackled by Nevin Lawson.","(0:51) Penalty: False Start on Chicago (Bobby Massie) -5 yards.","(0:51) Chicago Bears timeout.","(0:54) Brian Hoyer sacked at Det31 for a loss of 1 yard by Kerry Hyder.","(1:37) Brian Hoyer pass to the right to Jordan Howard for 4 yards to the Det30. Tackled by Tyrunn Walker and Haloti Ngata.","(2:00) Brian Hoyer pass to the right to Kevin White for 19 yards to the Det34. Tackled by Quandre Diggs.","(2:00) Two Minute Warning.","(2:15) Jordan Howard rush to the right for 17 yards to the Chi47. Tackled by Rafael Bush.","(2:19) Brian Hoyer incomplete pass to the right intended for Kevin White.","(2:19) Sam Martin kicks off to the endzone. Touchback. Penalty: Offside on Detroit (Orson Charles) 5 yards.","(2:24) Matt Prater 50 yard field goal attempt is GOOD. Holder: Sam Martin.","(2:28) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(2:53) Penalty: Offside on Chicago (Willie Young) 5 yards.","(3:25) Theo Riddick rush to the right for 2 yards to the Chi36. Tackled by Jerrell Freeman.","(3:53) Matthew Stafford pass to the left to Marvin Jones Jr. for 6 yards to the Chi38. Tackled by Jerrell Freeman.","(4:10) Penalty: Illegal Shift on Detroit -5 yards.","(4:33) Matthew Stafford pass to the right to Anquan Boldin for 10 yards to the Chi39. Tackled by Cre'von LeBlanc.","(4:38) Matthew Stafford incomplete pass to the left intended for Khari Lee.","(5:09) Theo Riddick rush to the right for no gain to the Chi49. Tackled by Will Sutton.","(5:14) Penalty: Offside on Chicago (Cornelius Washington) 5 yards.","(5:44) Matthew Stafford pass to the right to Golden Tate for 1 yard to the Det46. Tackled by Bryce Callahan.","(6:14) Matthew Stafford pass to the left to Marvin Jones Jr. for 17 yards to the Det45. Tackled by Harold Jones-Quartey.","(6:30) Penalty: Holding on Detroit (Taylor Decker) -10 yards.","(6:35) Joique Bell rush to the left for a loss of 2 yards to the Det38. Tackled by A'Shawn Robinson.","(7:21) Brian Hoyer pass to the right to Eddie Royal for 7 yards to the Det36. Tackled by Glover Quin.","(7:49) Jordan Howard rush to the left for 2 yards to the Det43. Tackled by Kyle Van Noy.","(7:54) Brian Hoyer incomplete pass to the right intended for Alshon Jeffery defensed by Darius Slay.","(8:35) Brian Hoyer pass to the left to Kevin White for 9 yards to the Det45. Tackled by Nevin Lawson.","(9:14) Jordan Howard rush to the left for 3 yards to the Chi46. Tackled by Tahir Whitehead.","(9:21) Chicago Bears timeout.","(9:21) Brian Hoyer incomplete pass to the right intended for Kevin White defensed by Darius Slay.","(9:53) Brian Hoyer pass to the left to Kevin White for 13 yards to the Chi43. Tackled by Nevin Lawson and Antwione Williams.","(10:33) Jordan Howard rush to the left for 2 yards to the Chi30. Tackled by Antwione Williams.","(10:56) Brian Hoyer pass to the right to Kevin White for 8 yards to the Chi28. Tackled by Glover Quin.","(11:06) Sam Martin punts for 50 yards to Chi12. Eddie Royal return for 8 yards to Chi20. Tackled by Brandon Copeland.","(11:14) Matthew Stafford incomplete pass to the right intended for Theo Riddick.","(11:42) Matthew Stafford pass to the left to Theo Riddick for 4 yards to the Det38. Tackled by Bryce Callahan.","(11:50) Matthew Stafford incomplete pass to the right intended for Cole Wick.","(12:01) Patrick O'Donnell punts for 51 yards to Det19. Andre Roberts return for 15 yards to Det34. Tackled by Chris Prosinski.","(12:43) Brian Hoyer pass to the left to Zach Miller for 8 yards to the Chi30. Tackled by Glover Quin and Tahir Whitehead.","(13:19) Jordan Howard rush to the right for 2 yards to the Chi22. Tackled by Haloti Ngata.","(13:47) Jordan Howard rush to the left for 4 yards to the Chi30. Tackled by Glover Quin. Penalty: Holding on Chicago (Deonte Thompson) -10 yards.","(14:21) Jordan Howard rush to the left for 5 yards to the Chi26. Tackled by Kyle Van Noy and Tyrunn Walker.","(15:00) Brian Hoyer pass to the right to Eddie Royal for 6 yards to the Chi21. Tackled by Quandre Diggs.","(0:41) Jordan Howard rush to the left for 4 yards to the Chi15. Tackled by Kyle Van Noy.","(0:50) Sam Martin punts for 57 yards to Chi11. No return.","(1:15) Matthew Stafford pass to the right to Dwayne Washington for 8 yards to the Det32. Tackled by Cre'von LeBlanc.","(1:54) Matthew Stafford sacked at Det24 for a loss of 7 yards by Akiem Hicks.","(2:30) Dwayne Washington rush to the left for 1 yard to the Det31. Tackled by Nick Kwiatkoski.","(3:01) Matthew Stafford pass to the left to Anquan Boldin for 5 yards to the Det30. Tackled by Adrian Amos.","(3:28) Dwayne Washington rush to the left for 5 yards to the Det25. Tackled by Nick Kwiatkoski and Akiem Hicks.","(3:37) Patrick O'Donnell punts for 46 yards to Det0. Touchback.","(4:14) Brian Hoyer sacked at Det46 for a loss of 7 yards by Darius Slay.","(4:24) Brian Hoyer incomplete pass to the left intended for Cameron Meredith.","(5:00) Brian Hoyer pass to the right to Cameron Meredith for 5 yards to the Det39. Tackled by Antwione Williams.","(5:30) Brian Hoyer pass to the left to Logan Paulsen for 7 yards to the Det44. Tackled by Tahir Whitehead.","(5:58) Joique Bell rush to the right for 6 yards to the Chi49. Tackled by Brandon Copeland and Wallace Gilberry.","(6:10) Sam Martin punts for 51 yards to Chi41. Eddie Royal return for 2 yards to Chi43. Tackled by Don Carey.","(6:14) Matthew Stafford incomplete pass to the middle intended for Marvin Jones Jr..","(6:22) Matthew Stafford incomplete pass to the right intended for Theo Riddick.","(6:31) Matthew Stafford rush to the right for 2 yards to the Det13. Penalty: Illegal Forward Pass on Detroit (Matthew Stafford) -5 yards.","(6:31) Penalty: False Start on Detroit (Eric Ebron) -5 yards.","(6:35) Connor Barth kicks off to the Det0. Andre Roberts return for 16 yards to Det16. Tackled by Sherrick McManis.","(6:35) Connor Barth extra point is good.","(6:43) Brian Hoyer pass to the right to Eddie Royal for 4 yards for a TOUCHDOWN.","(6:49) Penalty: Pass Interference on Detroit (Tahir Whitehead) 16 yards.","(7:32) Jordan Howard rush to the right for 5 yards to the Det20. Tackled by Rafael Bush.","(8:08) Brian Hoyer pass to the left to Alshon Jeffery for 8 yards to the Det25. Tackled by Nevin Lawson.","(8:49) Brian Hoyer pass to the right to Logan Paulsen for 3 yards to the Det33. Tackled by Darius Slay.","(9:23) Jordan Howard rush to the right for 4 yards to the Det36. Tackled by Rafael Bush.","(9:53) Brian Hoyer pass to the left to Eddie Royal for 13 yards to the Det40. Tackled by Quandre Diggs.","(10:32) Joique Bell rush to the right for 2 yards to the Chi47. Tackled by Tahir Whitehead.","(10:37) Brian Hoyer incomplete pass to the left intended for Logan Paulsen.","(11:04) Jordan Howard rush to the left for 12 yards to the Chi45. Tackled by Tahir Whitehead.","(11:37) Brian Hoyer pass to the right to Alshon Jeffery for 16 yards to the Chi33. Tackled by Nevin Lawson.","(11:50) Sam Martin punts for 53 yards to Chi20. Eddie Royal return for 7 yards to Chi27. Tackled by Thurston Armbrister. Penalty: Illegal Block on Chicago (DeAndre Houston-Carson) -10 yards.","(11:54) Matthew Stafford incomplete pass to the left intended for Eric Ebron.","(12:27) Matthew Stafford pass to the left to Anquan Boldin for 1 yard to the Det27. Tackled by Sam Acho.","(13:01) Theo Riddick rush to the left for 6 yards to the Det26. Tackled by Mitch Unrein.","(13:10) Patrick O'Donnell punts for 51 yards to Det0. Touchback.","(13:16) Brian Hoyer incomplete pass to the left intended for Alshon Jeffery.","(13:56) Jordan Howard rush to the left for a loss of 1 yard to the Chi49. Tackled by Tyrunn Walker.","(14:23) Jordan Howard rush to the left for no gain to the Chi50. Tackled by Kyle Van Noy.","(14:53) Brian Hoyer pass to the right to Zach Miller for 17 yards to the Chi50. Tackled by Kyle Van Noy.","(15:00) Sam Martin kicks off to the Chi4. Deonte Thompson return for 29 yards to Chi33. Tackled by Nevin Lawson."]