["(0:03) James White rush to the right for 7 yards to the Buf37. Tackled by Preston Brown.","(0:27) Jacoby Brissett pass to the right to James White for 16 yards to the Buf44. Tackled by Zach Brown.","(0:57) Jacoby Brissett pass to the left to James White for 14 yards to the NE40. Tackled by Jerry Hughes.","(1:06) Colton Schmidt punts for 37 yards to NE25. Cyrus Jones - no return. FUMBLE, recovered by NE (Cyrus Jones).","(1:06) New England Patriots timeout.","(1:12) Mike Gillislee rush up the middle for 3 yards to the Buf38. Tackled by Dont'a Hightower and Chris Long.","(1:12) New England Patriots timeout.","(1:20) Mike Gillislee rush to the left for no gain to the Buf35. Tackled by Patrick Chung and Chris Long.","(2:00) LeSean McCoy rush up the middle for 3 yards to the Buf35. Tackled by Malcom Brown.","(2:00) Two Minute Warning.","(2:41) LeSean McCoy rush to the right for 7 yards to the Buf32. Tackled by Trey Flowers.","(2:41) New England Patriots timeout.","(2:46) LeSean McCoy rush up the middle for 4 yards to the Buf25. Tackled by Alan Branch.","(2:51) Jacoby Brissett incomplete pass to the right intended for Rob Gronkowski defensed by Aaron Williams.","(2:56) Jacoby Brissett incomplete pass to the right intended for Julian Edelman defensed by Ronald Darby.","(2:56) Buffalo Bills timeout.","(3:01) Jacoby Brissett pass to the left to LeGarrette Blount for 4 yards to the Buf21. Tackled by Zach Brown.","(3:05) Jacoby Brissett incomplete pass to the left intended for Chris Hogan.","(3:25) James White rush up the middle for 2 yards to the Buf25. Tackled by Leger Douzable and Jerry Hughes.","(3:51) Jacoby Brissett rush up the middle for 1 yard to the Buf27. FUMBLE, recovered by NE (Jacoby Brissett).","(4:22) Jacoby Brissett pass to the left to LeGarrette Blount for 4 yards to the Buf28. Tackled by Zach Brown.","(4:51) LeGarrette Blount rush up the middle for 4 yards to the Buf32. Tackled by Preston Brown.","(5:03) Jacoby Brissett pass to the right to Brandon Bolden for 13 yards to the Buf36. Tackled by Aaron Williams.","(5:34) Jacoby Brissett pass to the left to Martellus Bennett for 16 yards to the Buf49. Tackled by Robert Blanton.","(6:16) Jacoby Brissett pass to the right to James White for 5 yards to the NE35. Tackled by Zach Brown.","(6:43) Penalty: Holding on New England (Marcus Cannon) -10 yards.","(7:02) LeGarrette Blount rush to the left for 16 yards to the NE40. Tackled by Preston Brown.","(7:13) Colton Schmidt punts for 35 yards to NE24. Danny Amendola - no return. FUMBLE, recovered by NE (Danny Amendola).","(7:46) Tyrod Taylor rush to the left for 3 yards to the Buf41. Tackled by Devin McCourty.","(8:31) Tyrod Taylor pass to the right to Walt Powell for 2 yards to the Buf38. Tackled by Shea McClellin.","(8:58) Penalty: Holding on Buffalo (Richie Incognito) -10 yards.","(9:42) LeSean McCoy rush to the left for 8 yards to the Buf46. Tackled by Devin McCourty.","(10:20) Tyrod Taylor pass to the right to Walt Powell for 11 yards to the Buf38. Tackled by Justin Coleman.","(11:02) Tyrod Taylor pass to the left to Charles Clay for 14 yards to the Buf27. Tackled by Devin McCourty.","(11:30) Penalty: Holding on Buffalo (Cordy Glenn) -10 yards.","(12:04) LeSean McCoy rush to the right for a loss of 4 yards to the Buf23. Tackled by Logan Ryan.","(12:40) Tyrod Taylor pass to the right to Walt Powell for 9 yards to the Buf27. Tackled by Malcolm Butler.","(13:03) LeSean McCoy rush to the left for 3 yards to the Buf18. Tackled by Alan Branch.","(13:09) Ryan Allen punts for 56 yards to Buf15. No return.","(13:18) Jacoby Brissett sacked at NE29 for a loss of 4 yards by Zach Brown.","(13:22) Jacoby Brissett incomplete pass to the right intended for Julian Edelman.","(13:32) Jacoby Brissett incomplete pass to the right intended for Chris Hogan defensed by Aaron Williams.","(13:55) Penalty: False Start on New England (Julian Edelman) -5 yards.","(14:27) Jacoby Brissett pass to the left to Rob Gronkowski for 11 yards to the NE38. Tackled by Nickell Robey-Coleman.","(15:00) LeGarrette Blount rush to the left for a loss of 2 yards to the NE27. Tackled by Nickell Robey-Coleman.","(0:28) Jacoby Brissett rush up the middle for 4 yards to the NE29. Tackled by Zach Brown.","(0:28) Dan Carpenter kicks off to the endzone. Touchback.","(0:33) Dan Carpenter 44 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(0:41) Tyrod Taylor incomplete pass to the right.","(0:47) Tyrod Taylor incomplete pass to the left intended for Robert Woods.","(0:52) Tyrod Taylor incomplete pass to the left intended for Mike Gillislee.","(1:28) LeSean McCoy rush to the right for 2 yards to the NE26. Tackled by Malcom Brown.","(2:30) LeSean McCoy rush to the right for 9 yards to the NE28. Tackled by Trey Flowers and Patrick Chung.","(2:30) Penalty: Roughing Passer on New England (Chris Long) 15 yards.","(3:07) Tyrod Taylor rush to the left for 4 yards to the Buf45. Tackled by Logan Ryan.","(3:42) Jerome Felton rush up the middle for 2 yards to the Buf41. Tackled by Trey Flowers and Dont'a Hightower.","(4:17) Tyrod Taylor pass to the left to Jerome Felton for 5 yards to the Buf39. Tackled by Jamie Collins.","(4:55) Brandon Tate rush to the left for 4 yards to the Buf34. Tackled by Logan Ryan.","(5:06) Ryan Allen punts for 49 yards to Buf12. Brandon Tate return for 18 yards to Buf30. Tackled by Barkevious Mingo.","(5:06) Penalty: False Start on New England (Brandon King) -5 yards.","(5:15) Jacoby Brissett incomplete pass to the left intended for Danny Amendola.","(5:52) Jacoby Brissett rush to the left for 10 yards to the NE44. Tackled by Zach Brown.","(6:32) Jacoby Brissett pass to the left to LeGarrette Blount for a loss of 4 yards to the NE34. Tackled by Zach Brown and Preston Brown.","(6:40) Penalty: Illegal Block on New England (Nate Solder) -15 yards.","(7:15) Jacoby Brissett pass to the right to Julian Edelman for 16 yards to the Buf47. Tackled by Ronald Darby and Preston Brown.","(7:20) 47 yard field goal attempt by Dan Carpenter is NO GOOD. Holder: Colton Schmidt.","(7:27) Tyrod Taylor incomplete pass to the left intended for Walt Powell.","(8:04) Tyrod Taylor pass to the right to Walt Powell for no gain to the NE29. Tackled by Logan Ryan.","(8:42) Mike Gillislee rush to the left for a loss of 2 yards to the NE29. Tackled by Jamie Collins and Logan Ryan.","(9:15) Tyrod Taylor pass to the right to Marquise Goodwin for 12 yards to the NE27. Tackled by Malcolm Butler.","(9:18) Tyrod Taylor incomplete pass to the left intended for Robert Woods defensed by Dont'a Hightower.","(9:52) LeSean McCoy rush up the middle for no gain to the NE39. Tackled by Chris Long.","(10:27) Tyrod Taylor pass to the right to Robert Woods for 23 yards to the NE39. Tackled by Logan Ryan.","(10:32) 48 yard field goal attempt by Stephen Gostkowski is NO GOOD. Holder: Ryan Allen.","(10:38) Jacoby Brissett incomplete pass to the middle intended for Danny Amendola defensed by Aaron Williams.","(10:46) Jacoby Brissett incomplete pass to the right intended for Brandon Bolden.","(11:28) Jacoby Brissett sacked at Buf30 for no gain by Lorenzo Alexander.","(12:03) Jacoby Brissett pass to the left to James White for 8 yards to the Buf30. Tackled by Corey Graham.","(12:37) Jacoby Brissett pass to the left to Brandon Bolden for 2 yards to the Buf38. Tackled by Zach Brown and Leger Douzable.","(13:02) Jacoby Brissett pass to the right to Martellus Bennett for 6 yards to the Buf40. Tackled by Stephon Gilmore.","(13:06) Jacoby Brissett incomplete pass to the left intended for Julian Edelman.","(13:34) LeGarrette Blount rush to the left for 11 yards to the Buf46. Tackled by Kevon Seymour.","(13:40) Jacoby Brissett incomplete pass to the right intended for Martellus Bennett.","(14:07) Jacoby Brissett pass to the right to Martellus Bennett for 19 yards to the NE43.","(14:18) Colton Schmidt punts for 48 yards to NE25. Danny Amendola return for a loss of 1 yard to NE24. Tackled by Ramon Humber.","(14:23) Tyrod Taylor incomplete pass to the right intended for Charles Clay.","(14:54) Tyrod Taylor pass to the right to LeSean McCoy for 2 yards to the Buf27. Tackled by Logan Ryan.","(15:00) Tyrod Taylor incomplete pass to the right intended for Marquise Goodwin.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback.","(0:08) Ryan Allen punts for 56 yards to Buf35. No return.","(0:08) Buffalo Bills timeout.","(0:13) LeGarrette Blount rush up the middle for 4 yards to the NE9. Tackled by Kyle Williams and Corbin Bryant.","(0:13) Buffalo Bills timeout.","(0:20) LeGarrette Blount rush to the left for a loss of 1 yard to the NE5. Tackled by Zach Brown.","(1:00) Jacoby Brissett sacked at NE6 for a loss of 14 yards by Jerry Hughes.","(1:13) Colton Schmidt punts for 43 yards to NE15. Danny Amendola return for 5 yards to NE20. Tackled by Lorenzo Alexander and Garrison Sanborn.","(1:13) New England Patriots timeout.","(1:21) Tyrod Taylor rush to the right for 2 yards to the Buf42. Tackled by Jabaal Sheard.","(1:21) New England Patriots timeout.","(1:30) LeSean McCoy rush up the middle for 1 yard to the Buf40. Tackled by Dont'a Hightower and Vincent Valentine.","(1:57) LeSean McCoy rush to the right for 6 yards to the Buf39. Tackled by Cyrus Jones and Malcom Brown.","(1:57) Two Minute Warning.","(2:08) Tyrod Taylor pass to the right to Robert Woods for 22 yards to the Buf33. Tackled by Devin McCourty.","(2:44) Tyrod Taylor sacked at Buf11 for no gain by Alan Branch.","(3:09) Penalty: Holding on Buffalo (Richie Incognito) -10 yards.","(3:43) Tyrod Taylor pass to the left to LeSean McCoy for 4 yards to the Buf21. Tackled by Jabaal Sheard.","(4:26) Tyrod Taylor pass to the left to LeSean McCoy for 1 yard to the Buf17. Tackled by Dont'a Hightower.","(5:00) LeSean McCoy rush to the left for 7 yards to the Buf16. Tackled by Jamie Collins and Patrick Chung.","(5:11) Jacoby Brissett rush to the left for 8 yards to the Buf10. Tackled by Zach Brown. FUMBLE, recovered by Buf (Preston Brown). Tackled by Marcus Cannon.","(5:38) Penalty: Holding on New England (David Andrews) -10 yards.","(6:20) LeGarrette Blount rush up the middle for 5 yards to the Buf8. Tackled by Zach Brown and Preston Brown.","(7:03) LeGarrette Blount rush to the left for 4 yards to the Buf13. Tackled by Zach Brown and Preston Brown.","(7:46) Jacoby Brissett pass to the right to Martellus Bennett for 58 yards to the Buf17. Tackled by Ronald Darby.","(7:46) Dan Carpenter kicks off to the endzone. Touchback.","(7:51) Dan Carpenter 43 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(7:55) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(8:00) Tyrod Taylor incomplete pass to the right intended for Robert Woods.","(8:40) Tyrod Taylor pass to the left to Nick O'Leary for 3 yards to the NE24. Tackled by Malcolm Butler.","(9:13) Mike Gillislee rush to the right for 11 yards to the NE27.","(9:43) Tyrod Taylor rush to the right for 5 yards to the NE43. Tackled by Chris Long. Penalty: Holding on New England (Justin Coleman) 5 yards.","(9:48) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(10:23) Tyrod Taylor pass to the right to Robert Woods for 6 yards to the NE48. Tackled by Logan Ryan and Vincent Valentine.","(10:58) Tyrod Taylor pass to the right to Nick O'Leary for 17 yards to the Buf46.","(11:26) LeSean McCoy rush to the right for 2 yards to the Buf29. Tackled by Logan Ryan.","(11:55) Tyrod Taylor pass to the right to Robert Woods for 14 yards to the Buf27. Tackled by Logan Ryan.","(12:26) LeSean McCoy rush to the right for 8 yards to the Buf13. Tackled by Patrick Chung.","(12:34) Ryan Allen punts for 56 yards to Buf10. Brandon Tate - no return. Tackled by Matthew Slater and Nate Ebner. Penalty: Unsports. Conduct on Buffalo (Stephon Gilmore) -5 yards.","(13:01) James White rush to the left for 4 yards to the NE34. Tackled by Lorenzo Alexander.","(13:23) Penalty: False Start on New England (Joe Thuney) -5 yards.","(13:44) LeGarrette Blount rush to the left for a loss of 2 yards to the NE35. Tackled by Zach Brown.","(14:16) LeGarrette Blount rush up the middle for 2 yards to the NE37. Tackled by Corey Graham and Corbin Bryant.","(14:49) Jacoby Brissett pass to the right to Martellus Bennett for 10 yards to the NE35. Tackled by Aaron Williams.","(14:49) Dan Carpenter kicks off to the endzone. Touchback.","(14:53) Dan Carpenter 34 yard field goal attempt is GOOD. Holder: Colton Schmidt.","(15:00) Tyrod Taylor pass to the right to Mike Gillislee for 13 yards to the NE16. Tackled by Shea McClellin and Jamie Collins.","(0:03) LeSean McCoy rush to the right for 4 yards to the NE29. Tackled by Patrick Chung and Dont'a Hightower.","(0:10) Tyrod Taylor incomplete pass to the right intended for Charles Clay. Penalty: Unnecessary Roughness on Buffalo (Richie Incognito) -15 yards.","(0:49) Tyrod Taylor rush to the left for 14 yards to the NE18. Tackled by Devin McCourty.","(1:20) Tyrod Taylor pass to the right to Charles Clay for 5 yards to the NE32. Tackled by Dont'a Hightower.","(1:58) Tyrod Taylor pass to the left to Charles Clay for 8 yards to the NE37. Tackled by Logan Ryan.","(2:38) Tyrod Taylor pass to the right to Robert Woods for 10 yards to the NE45. Tackled by Logan Ryan and Jamie Collins.","(3:13) Mike Gillislee rush to the left for 2 yards to the Buf45. Tackled by Dont'a Hightower.","(3:47) Tyrod Taylor pass to the left to LeSean McCoy for 11 yards to the Buf43.","(3:54) Ryan Allen punts for 47 yards to Buf32. No return.","(4:28) James White rush to the right for a loss of 1 yard to the NE21. Tackled by Kyle Williams and Zach Brown.","(4:52) Julian Edelman rush to the left for 1 yard to the NE22. Tackled by Zach Brown. FUMBLE, recovered by NE.","(5:27) Jacoby Brissett pass to the right to James White for 7 yards to the NE21. Tackled by Zach Brown.","(5:31) Dan Carpenter kicks off to the NE-4. Cyrus Jones return for 18 yards to NE14. Tackled by Lorenzo Alexander.","(5:31) Dan Carpenter extra point is good.","(5:35) Tyrod Taylor pass to the right to LeSean McCoy for 7 yards for a TOUCHDOWN.","(6:18) LeSean McCoy rush to the right for 2 yards to the NE7. Tackled by Alan Branch and Dont'a Hightower.","(7:00) LeSean McCoy rush to the right for a loss of 1 yard to the NE9. Tackled by Alan Branch.","(7:31) Tyrod Taylor pass to the left to Robert Woods for 11 yards to the NE8. Tackled by Logan Ryan.","(7:31) Buffalo Bills timeout.","(8:05) Tyrod Taylor pass to the left to Charles Clay for 5 yards to the NE19. Tackled by Logan Ryan.","(8:35) Penalty: Holding on Buffalo (Eric Wood) -10 yards.","(9:17) LeSean McCoy rush to the right for 8 yards to the NE14. Tackled by Devin McCourty.","(9:54) Mike Gillislee rush to the left for 16 yards to the NE22. Tackled by Devin McCourty.","(10:29) Tyrod Taylor sacked at NE38 for a loss of 2 yards by Jabaal Sheard.","(11:06) Tyrod Taylor pass to the middle to LeSean McCoy for 13 yards to the NE36. Tackled by Logan Ryan.","(11:34) Tyrod Taylor incomplete pass to the left intended for Marquise Goodwin.","(12:12) Tyrod Taylor pass to the right to Charles Clay for 15 yards to the NE49. Tackled by Jamie Collins.","(12:42) LeSean McCoy rush to the right for 1 yard to the Buf36. Tackled by Logan Ryan.","(12:48) Ryan Allen punts for 47 yards to Buf35. Brandon Tate - no return. Tackled by Matthew Slater.","(13:17) LeGarrette Blount rush up the middle for 4 yards to the NE18. Tackled by Lorenzo Alexander and Kyle Williams.","(13:49) LeGarrette Blount rush to the right for 9 yards to the NE14. Tackled by Ronald Darby.","(14:23) LeGarrette Blount rush to the right for no gain to the NE5. Tackled by Lorenzo Alexander.","(14:56) Penalty: Pass Interference on New England (Chris Hogan) -4 yards.","(15:00) Dan Carpenter kicks off to the NE-3. Cyrus Jones return for 12 yards to NE9. Tackled by Robert Blanton."]