["(0:35) Andy Dalton rush up the middle for a loss of 1 yard to the Mia33.","(1:11) Andy Dalton rush up the middle for a loss of 1 yard to the Mia32.","(1:54) Andy Dalton rush up the middle for a loss of 1 yard to the Mia31.","(2:00) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry defensed by Chris Lewis-Harris.","(2:00) Two Minute Warning.","(2:23) Ryan Tannehill pass to the left to Jarvis Landry for 8 yards to the Mia30. Tackled by Chris Lewis-Harris.","(3:03) Ryan Tannehill pass to the middle to Jarvis Landry for 3 yards to the Mia22. Tackled by Vontaze Burfict.","(3:40) Ryan Tannehill sacked at Mia19 for a loss of 6 yards by Geno Atkins.","(3:53) Kevin Huber punts for 46 yards to Mia24. Jakeem Grant return for 1 yard to Mia25. Tackled by Marquis Flowers.","(3:53) Miami Dolphins timeout.","(4:02) Giovani Bernard rush to the left for no gain to the Cin30. Tackled by Neville Hewitt.","(4:02) Penalty: False Start on Cincinnati (Jake Fisher) -5 yards.","(4:02) Miami Dolphins timeout.","(4:08) Giovani Bernard rush to the right for 2 yards to the Cin35. Tackled by Ndamukong Suh.","(4:53) Giovani Bernard rush up the middle for 2 yards to the Cin33. Tackled by Tony Lippett and Jason Jones.","(5:03) Ryan Tannehill pass intended for Leonte Carroo INTERCEPTED by Chris Lewis-Harris and returned for 11 yards. Tackled by Kenyan Drake. Penalty: Holding on Cincinnati (Michael Johnson) -10 yards.","(5:43) Kenyan Drake rush to the right for 12 yards to the Cin39. Tackled by Darqueze Dennard.","(6:16) Ryan Tannehill pass to the right to DeVante Parker for 15 yards to the Mia49. Tackled by Darqueze Dennard.","(7:00) Ryan Tannehill pass to the left to Jarvis Landry for 24 yards to the Mia34. Tackled by Darqueze Dennard and Carlos Dunlap.","(7:44) Ryan Tannehill sacked at Mia10 for no gain by Will Clarke.","(8:03) Penalty: Holding on Miami (Jermon Bushrod) -8 yards.","(8:29) Ryan Tannehill pass to the right to Dion Sims for 9 yards to the Mia18. Tackled by Karlos Dansby and Darqueze Dennard.","(8:36) Kevin Huber punts for 40 yards to Mia9. No return.","(9:21) Andy Dalton rush up the middle for a loss of 8 yards to the Mia49. Tackled by Andre Branch. FUMBLE, recovered by Cin (Andy Dalton).","(9:59) Jeremy Hill rush to the right for no gain to the Mia41. Tackled by Spencer Paysinger.","(10:42) Jeremy Hill rush to the right for 9 yards to the Mia41. Tackled by Reshad Jones.","(11:24) Andy Dalton pass to the right to Tyler Boyd for 10 yards to the Cin50. Tackled by Reshad Jones and Michael Thomas.","(11:29) Andy Dalton incomplete pass to the right intended for A.J. Green defensed by Reshad Jones.","(12:07) Jeremy Hill rush to the left for 2 yards to the Cin40. Tackled by Jason Jones.","(12:19) Matt Darr punts for 44 yards to Cin35. Alex Erickson return for 3 yards to Cin38. Tackled by Michael Thomas and Walt Aikens.","(12:23) Ryan Tannehill incomplete pass to the right intended for Kenny Stills defensed by Carlos Dunlap.","(12:54) Ryan Tannehill pass to the left to Damien Williams for 6 yards to the Mia21. Tackled by Adam Jones and Josh Shaw.","(13:25) Ryan Tannehill pass to the right to Jarvis Landry for a loss of 1 yard to the Mia15. Tackled by George Iloka.","(13:30) Mike Nugent kicks off to the Mia-2. Jakeem Grant return for 18 yards to Mia16. Tackled by Chykie Brown.","(13:35) Mike Nugent 47 yard field goal attempt is GOOD. Holder: Kevin Huber.","(14:14) Andy Dalton pass to the right to A.J. Green for 7 yards to the Mia29. Tackled by Bobby McCain.","(15:00) Andy Dalton pass to the left to Brandon LaFell for 3 yards to the Mia36. Tackled by Kiko Alonso.","(15:00) Penalty: False Start on Cincinnati (Kevin Zeitler) -5 yards.","(0:21) Andy Dalton rush up the middle for no gain to the Mia20. FUMBLE, recovered by Cin (Andy Dalton).","(0:59) Andy Dalton pass to the right to Brandon LaFell for 23 yards to the Mia20.","(1:22) Jeremy Hill rush to the left for no gain to the Mia43. Tackled by Ndamukong Suh and Jason Jones.","(1:39) Penalty: Encroachment on Miami (Jordan Phillips) 5 yards.","(2:16) Jeremy Hill rush to the left for 19 yards to the Mia48. Tackled by Reshad Jones.","(2:27) Penalty: Unnecessary Roughness on Miami (Terrence Fede) 15 yards.","(3:13) Andy Dalton sacked at Cin18 for a loss of 11 yards by Bobby McCain.","(3:17) Andy Dalton incomplete pass to the left intended for Jeremy Hill.","(3:55) Jeremy Hill rush to the left for 3 yards to the Cin29. Tackled by Reshad Jones.","(4:09) Matt Darr punts for 57 yards to Cin18. Alex Erickson return for 8 yards to Cin26. Tackled by Michael Thomas.","(4:47) Ryan Tannehill pass to the right to DeVante Parker for 5 yards to the Mia25. Tackled by Vincent Rey.","(5:33) Ryan Tannehill sacked at Mia20 for a loss of 8 yards by Carlos Dunlap and Domata Peko.","(6:09) Kenyan Drake rush to the left for 3 yards to the Mia28. Tackled by Rey Maualuga and Vontaze Burfict.","(6:09) Mike Nugent kicks off to the endzone. Touchback.","(6:13) Mike Nugent 22 yard field goal attempt is GOOD. Holder: Kevin Huber.","(6:17) Andy Dalton incomplete pass to the left intended for Tyler Boyd defensed by Bobby McCain.","(6:53) Jeremy Hill rush to the left for a loss of 2 yards to the Mia4. Tackled by Donald Butler.","(7:35) Jeremy Hill rush to the left for no gain to the Mia2. Tackled by Reshad Jones and Kiko Alonso.","(8:00) Andy Dalton pass to the middle to Giovani Bernard for 13 yards to the Mia2. Tackled by Michael Thomas.","(8:41) Giovani Bernard rush to the right for 1 yard to the Mia15. Tackled by Mario Williams and Julius Warmsley.","(9:28) Andy Dalton pass to the left to A.J. Green for 43 yards to the Mia16. Tackled by Tony Lippett and Reshad Jones.","(9:46) Jeremy Hill rush up the middle for 9 yards to the Cin26. Tackled by Neville Hewitt. Penalty: Horse Collar Tackle on Miami (Neville Hewitt) 15 yards.","(10:25) Jeremy Hill rush to the left for 1 yard to the Cin17. Tackled by Isa Abdul-Quddus and Jason Jones.","(10:25) Penalty: Encroachment on Miami (Ndamukong Suh) 5 yards.","(10:33) Matt Darr punts for 34 yards to Cin11. No return.","(11:15) Ryan Tannehill sacked at Cin45 for a loss of 9 yards by Geno Atkins and Michael Johnson.","(11:15) Miami Dolphins timeout.","(12:00) Isaiah Pead rush to the right for a loss of 1 yard to the Cin36. Tackled by Rey Maualuga and Will Clarke.","(12:40) Ryan Tannehill pass to the left to Isaiah Pead for 6 yards to the Cin35. Tackled by Vontaze Burfict.","(13:19) Ryan Tannehill pass to the middle to Jarvis Landry for 15 yards to the Cin41. Tackled by Shawn Williams.","(13:57) Jay Ajayi rush to the right for 3 yards to the Mia44. Tackled by Josh Shaw and Pat Sims.","(14:17) Ryan Tannehill pass to the left to Jay Ajayi for 11 yards to the Mia41. Tackled by Adam Jones.","(14:54) Ryan Tannehill pass to the right to Jarvis Landry for 5 yards to the Mia30. Tackled by George Iloka.","(15:00) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry.","(15:00) Mike Nugent kicks off to the endzone. Touchback.","(0:17) Andy Dalton rush up the middle for a loss of 1 yard to the Cin26.","(0:29) Matt Darr punts for 53 yards to Cin15. Alex Erickson return for 12 yards to Cin27. Tackled by MarQueis Gray.","(0:35) Ryan Tannehill incomplete pass to the right intended for Dion Sims defensed by Carlos Dunlap.","(0:41) Ryan Tannehill incomplete pass to the left intended for DeVante Parker.","(1:06) Damien Williams rush to the right for 7 yards to the Mia32. Tackled by Karlos Dansby.","(1:06) Mike Nugent kicks off to the endzone. Touchback.","(1:11) Mike Nugent 43 yard field goal attempt is GOOD. Holder: Kevin Huber.","(1:16) Andy Dalton incomplete pass to the left intended for C.J. Uzomah defensed by Spencer Paysinger.","(1:54) Andy Dalton pass to the left to C.J. Uzomah for 10 yards to the Mia25. Tackled by Ndamukong Suh.","(2:00) Penalty: Pass Interference on Cincinnati (Tyler Boyd) -10 yards.","(2:00) Two Minute Warning.","(2:07) Jeremy Hill rush to the left for 2 yards to the Mia25. Tackled by Reshad Jones.","(2:14) Ryan Tannehill sacked at Mia27 for a loss of 6 yards by Carlos Dunlap. FUMBLE, recovered by Cin (Domata Peko). Tackled by Kenny Stills.","(2:57) Jay Ajayi rush to the right for 3 yards to the Mia33. Tackled by Carlos Dunlap.","(3:31) Jay Ajayi rush to the left for 3 yards to the Mia30. Tackled by George Iloka and Karlos Dansby.","(4:05) Jay Ajayi rush to the left for 11 yards to the Mia27. Tackled by Carlos Dunlap.","(4:12) Mike Nugent kicks off to the Mia1. Damien Williams return for 15 yards to Mia16. Tackled by Vincent Rey.","(4:16) Mike Nugent 22 yard field goal attempt is GOOD. Holder: Kevin Huber.","(5:00) Andy Dalton pass to the right to C.J. Uzomah for 6 yards to the Mia4. Tackled by Kiko Alonso.","(5:39) Giovani Bernard rush to the right for no gain to the Mia10. Tackled by Jason Jones and Bobby McCain.","(6:11) Giovani Bernard rush to the right for 1 yard to the Mia10. Tackled by Mario Williams.","(6:54) Andy Dalton pass to the right to C.J. Uzomah for 19 yards to the Mia11. Tackled by Xavien Howard and Kiko Alonso.","(7:41) Jeremy Hill rush to the left for 1 yard to the Mia30. Tackled by Donald Butler and Isa Abdul-Quddus.","(8:19) Jeremy Hill rush to the right for no gain to the Mia31. Tackled by Andre Branch.","(9:02) Andy Dalton pass to the left to C.J. Uzomah for 10 yards to the Mia31. Tackled by Neville Hewitt.","(9:38) Jeremy Hill rush to the left for a loss of 1 yard to the Mia41. Tackled by Kiko Alonso.","(10:22) Andy Dalton pass to the left to A.J. Green for 21 yards to the Mia40. Tackled by Reshad Jones.","(11:01) Jeremy Hill rush to the right for 2 yards to the Cin39. Tackled by Isa Abdul-Quddus and Tony Lippett.","(11:38) Andy Dalton pass to the middle to A.J. Green for 15 yards to the Cin37. Tackled by Michael Thomas.","(12:17) Jeremy Hill rush to the left for a loss of 1 yard to the Cin22. Tackled by Donald Butler.","(12:37) Andy Dalton pass to the left to A.J. Green for 7 yards to the Cin23. Tackled by Tony Lippett.","(12:45) Matt Darr punts for 35 yards to Cin16. No return.","(13:23) Isaiah Pead rush to the left for 2 yards to the Mia49. Tackled by Karlos Dansby.","(14:08) Isaiah Pead rush to the left for 4 yards to the Mia47. Tackled by Shawn Williams.","(14:11) Ryan Tannehill incomplete pass to the middle intended for Jarvis Landry defensed by Vontaze Burfict.","(14:24) Kevin Huber punts for 50 yards to Mia32. Jakeem Grant return for 11 yards to Mia43. Tackled by Clark Harris and Nick Vigil.","(14:28) Andy Dalton incomplete pass to the left intended for A.J. Green defensed by Tony Lippett.","(15:00) Giovani Bernard rush up the middle for a loss of 1 yard to the Cin18. Tackled by Jordan Phillips.","(0:20) Penalty: False Start on Cincinnati (Kevin Zeitler) -5 yards.","(1:02) Jeremy Hill rush to the right for 4 yards to the Cin24. Tackled by Ndamukong Suh.","(1:10) Matt Darr punts for 55 yards to Cin0. Touchback.","(1:15) Ryan Tannehill incomplete pass to the right intended for MarQueis Gray.","(1:30) Penalty: Offside on Cincinnati (Michael Johnson) 5 yards.","(2:14) Ryan Tannehill pass to the right to Jay Ajayi for 2 yards to the Mia40. Tackled by Darqueze Dennard.","(2:47) Jay Ajayi rush to the right for 2 yards to the Mia38. Tackled by Pat Sims and Domata Peko.","(3:19) Jay Ajayi rush to the right for 11 yards to the Mia36. Tackled by Shawn Williams.","(3:19) Mike Nugent kicks off to the endzone. Touchback.","(3:19) Mike Nugent extra point is good.","(3:24) Andy Dalton pass to the left to A.J. Green for 7 yards for a TOUCHDOWN.","(3:31) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(4:10) Andy Dalton pass to the left to A.J. Green for 19 yards to the Mia7. Tackled by Xavien Howard.","(4:49) Giovani Bernard rush to the right for no gain to the Mia26. Tackled by Mario Williams.","(5:23) Giovani Bernard rush to the right for 6 yards to the Mia26. Tackled by Reshad Jones and Isa Abdul-Quddus.","(6:06) Andy Dalton pass to the right to A.J. Green for 51 yards to the Mia32. Tackled by Xavien Howard.","(6:43) Giovani Bernard rush to the left for 7 yards to the Cin17. Tackled by Tony Lippett and Kiko Alonso.","(6:52) Matt Darr punts for 66 yards to Cin10. No return.","(6:56) Ryan Tannehill incomplete pass to the left intended for Kenny Stills defensed by Vincent Rey.","(7:01) Ryan Tannehill incomplete pass to the middle intended for Damien Williams defensed by Domata Peko.","(7:35) Damien Williams rush to the right for 2 yards to the Mia24. Tackled by Darqueze Dennard.","(7:45) Kevin Huber punts for 48 yards to Mia21. Jakeem Grant return for 1 yard to Mia22. Tackled by Josh Shaw.","(8:22) Andy Dalton pass to the left to Giovani Bernard for a loss of 1 yard to the Cin31. Tackled by Kiko Alonso.","(9:02) Jeremy Hill rush to the left for 7 yards to the Cin32. Tackled by Jordan Phillips.","(9:04) Andy Dalton incomplete pass to the middle intended for Tyler Boyd defensed by Mario Williams.","(9:04) Andrew Franks kicks off to the endzone. Touchback.","(9:04) Andrew Franks extra point is good.","(9:15) Ryan Tannehill pass to the left to Kenny Stills for 74 yards for a TOUCHDOWN.","(9:45) Ryan Tannehill pass to the right to Jarvis Landry for 7 yards to the Mia26. Tackled by Josh Shaw.","(9:51) Mike Nugent kicks off to the Mia2. Kenyan Drake return for 17 yards to Mia19. Tackled by Josh Shaw.","(9:51) Mike Nugent 42 yard field goal attempt is GOOD. Holder: Kevin Huber. Penalty: Unnecessary Roughness on Miami (Andre Branch) 15 yards.","(10:01) Andy Dalton incomplete pass to the left intended for Brandon LaFell defensed by Tony Lippett.","(10:06) Andy Dalton incomplete pass to the right intended for Giovani Bernard.","(10:43) Andy Dalton pass to the right to A.J. Green for no gain to the Mia24. Tackled by Xavien Howard.","(11:16) Jeremy Hill rush to the right for 6 yards to the Mia24. Tackled by Kiko Alonso.","(11:56) Jeremy Hill rush to the left for 7 yards to the Mia30. Tackled by Bobby McCain and Spencer Paysinger.","(12:26) Andy Dalton pass to the right to Brandon LaFell for 8 yards to the Mia37. Tackled by Xavien Howard.","(13:05) Jeremy Hill rush to the left for 3 yards to the Mia45. Tackled by Isa Abdul-Quddus.","(13:43) Andy Dalton pass to the right to Giovani Bernard for 12 yards to the Mia48. Tackled by Xavien Howard.","(14:20) Andy Dalton pass to the left to A.J. Green for 3 yards to the Cin40. Tackled by Jason Jones.","(14:55) Andy Dalton pass to the left to Brandon LaFell for 10 yards to the Cin37. Tackled by Neville Hewitt and Tony Lippett.","(14:55) Penalty: Encroachment on Miami (Jordan Phillips) 5 yards.","(15:00) Andrew Franks kicks off to the Cin1. Adam Jones return for 21 yards to Cin22. Tackled by Kenyan Drake."]