["(0:04) Penalty: Illegal Forward Pass on Tennessee (DeMarco Murray) 0 yards.","(0:04) Marcus Mariota pass to the right to DeMarco Murray for 10 yards to the Ten35.","(0:14) Shane Lechler punts for 58 yards to Ten8. Marc Mariani return for 17 yards to Ten25. Tackled by Alfred Blue.","(0:14) Houston Texans timeout.","(0:58) Lamar Miller rush to the right for 2 yards to the Hou34. Tackled by Avery Williamson.","(1:42) Lamar Miller rush to the right for 3 yards to the Hou32. Tackled by DaQuan Jones and Avery Williamson.","(1:42) Tennessee Titans timeout.","(1:47) Lamar Miller rush to the right for 1 yard to the Hou29. Tackled by DaQuan Jones and Karl Klug.","(1:52) Marcus Mariota incomplete pass to the right intended for Andre Johnson.","(1:56) Marcus Mariota incomplete pass to the left intended for Andre Johnson defensed by Johnathan Joseph.","(1:56) Two Minute Warning.","(2:02) Marcus Mariota incomplete pass to the right intended for Anthony Fasano defensed by Andre Hal.","(2:40) DeMarco Murray rush to the left for 4 yards to the Hou28. Tackled by Quintin Demps.","(3:11) Marcus Mariota pass to the right to Kendall Wright for 11 yards to the Hou32. Tackled by A.J. Bouye.","(3:51) Marcus Mariota pass to the middle to Tajae Sharpe for 10 yards to the Hou43. Tackled by Benardrick McKinney.","(3:51) Penalty: False Start on Tennessee (Jack Conklin) -5 yards.","(3:57) Marcus Mariota incomplete pass to the middle intended for Delanie Walker.","(4:34) DeMarco Murray rush to the left for 10 yards to the Hou48. Tackled by Johnathan Joseph.","(4:38) Jay Prosch rush up the middle for no gain to the Ten42. Tackled by David Bass.","(4:44) Brock Osweiler pass to the left to Jaelen Strong for 6 yards to the Ten42. Tackled by Jason McCourty.","(5:25) Brock Osweiler pass to the middle to Will Fuller for 1 yard to the Ten48. Tackled by Sean Spence.","(6:04) Alfred Blue rush up the middle for 2 yards to the Ten49. Tackled by DaQuan Jones and Brian Orakpo.","(6:52) Brock Osweiler rush to the right for 14 yards to the Hou49. Tackled by Jason McCourty.","(6:57) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by Jurrell Casey.","(7:35) Lamar Miller rush up the middle for no gain to the Hou35. Tackled by Wesley Woodyard.","(8:19) Lamar Miller rush up the middle for 14 yards to the Hou35. Tackled by Daimion Stafford.","(8:57) Brock Osweiler pass to the right to DeAndre Hopkins for 4 yards to the Hou21. Tackled by Perrish Cox.","(9:35) Lamar Miller rush up the middle for 2 yards to the Hou17. Tackled by Rashad Johnson.","(10:05) Lamar Miller rush up the middle for 6 yards to the Hou15. Tackled by Jurrell Casey.","(10:12) Brett Kern punts for 40 yards to Hou9. No return.","(10:19) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe defensed by Andre Hal.","(10:24) Marcus Mariota incomplete pass to the left intended for Tajae Sharpe defensed by A.J. Bouye.","(11:05) DeMarco Murray rush to the right for 2 yards to the Hou49. Tackled by Benardrick McKinney. FUMBLE, recovered by Ten (DeMarco Murray).","(11:10) Penalty: Holding on Tennessee (Taylor Lewan) -10 yards.","(11:17) Penalty: Pass Interference on Houston (Charles James) 24 yards.","(11:59) DeMarco Murray rush to the left for a loss of 4 yards to the Ten35. Tackled by Whitney Mercilus.","(12:35) DeMarco Murray rush to the right for 6 yards to the Ten39. Tackled by Brian Cushing.","(12:46) Shane Lechler punts for 47 yards to Ten24. Marc Mariani return for 9 yards to Ten33. Tackled by Jon Weeks and Eddie Pleasant.","(12:52) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins defensed by Perrish Cox.","(13:33) Brock Osweiler pass to the right to Jaelen Strong for 3 yards to the Hou29. Tackled by Avery Williamson.","(14:10) Brock Osweiler pass to the left to Jaelen Strong for 8 yards to the Hou26. Tackled by Wesley Woodyard and Avery Williamson.","(14:10) Penalty: False Start on Houston (Jeff Allen) -5 yards.","(14:19) Brett Kern punts for 46 yards to Hou22. Tyler Ervin return for 1 yard to Hou23. Tackled by Valentino Blake.","(15:00) Tennessee Titans timeout.","(15:00) Marcus Mariota rush to the right for 2 yards to the Ten32. Tackled by Benardrick McKinney.","(0:15) DeMarco Murray rush to the right for 5 yards to the Ten30. Tackled by Benardrick McKinney.","(0:50) DeMarco Murray rush up the middle for 2 yards to the Ten25. Tackled by Brian Cushing.","(0:56) Nick Novak kicks off to the Ten1. Marc Mariani return for 22 yards to Ten23. Tackled by Brian Peters and Corey Moore.","(0:56) Nick Novak extra point is good.","(1:12) Brett Kern punts for 45 yards to Hou33. Will Fuller return for 67 yards for a TOUCHDOWN.","(1:51) Marcus Mariota pass to the right to Delanie Walker for 10 yards to the Ten22. Tackled by Jadeveon Clowney.","(2:16) Penalty: False Start on Tennessee (Josh Kline) -5 yards.","(2:59) Derrick Henry rush up the middle for 1 yard to the Ten17. Tackled by Vince Wilfork.","(3:44) Marcus Mariota sacked at Ten16 for a loss of 6 yards by Jadeveon Clowney.","(3:51) Brock Osweiler pass intended for DeAndre Hopkins INTERCEPTED by Perrish Cox. No return. Tackled by DeAndre Hopkins.","(4:26) Lamar Miller rush to the right for a loss of 2 yards to the Ten44. Tackled by Rashad Johnson.","(4:55) Lamar Miller rush to the right for 11 yards to the Ten42. Tackled by Daimion Stafford.","(5:38) Brock Osweiler pass to the left to Will Fuller for 6 yards to the Hou47. Tackled by Kevin Byard.","(6:14) Lamar Miller rush to the left for 4 yards to the Hou41. Tackled by Avery Williamson.","(6:37) Brock Osweiler pass to the right to Jay Prosch for 6 yards to the Hou37. Tackled by Wesley Woodyard and Jason McCourty.","(7:04) Lamar Miller rush up the middle for 6 yards to the Hou31. Tackled by Rashad Johnson.","(7:04) Ryan Succop kicks off to the endzone. Touchback.","(7:07) Ryan Succop 26 yard field goal attempt is GOOD. Holder: Brett Kern.","(7:11) Marcus Mariota incomplete pass to the right intended for Delanie Walker defensed by A.J. Bouye.","(7:56) DeMarco Murray rush to the right for 1 yard to the Hou8. Tackled by Whitney Mercilus.","(8:38) DeMarco Murray rush to the right for 1 yard to the Hou9. Tackled by D.J. Reader and Devon Still.","(9:18) Marcus Mariota pass to the left to Andre Johnson for 20 yards to the Hou10. Tackled by Quintin Demps.","(9:18) Tennessee Titans timeout.","(10:01) DeMarco Murray rush to the right for 4 yards to the Hou30. Tackled by Quintin Demps.","(10:06) Marcus Mariota incomplete pass to the right intended for Kendall Wright.","(11:00) Marcus Mariota pass to the middle to Rishard Matthews for 22 yards to the Hou34. Tackled by Kevin Johnson.","(11:20) Penalty: False Start on Tennessee (Quinton Spain) -5 yards.","(12:05) DeMarco Murray rush up the middle for 4 yards to the Ten49. Tackled by Andre Hal and Vince Wilfork.","(12:39) Marcus Mariota pass to the left to Andre Johnson for 7 yards to the Ten45. Tackled by Quintin Demps.","(12:56) Penalty: Offside on Houston (Jadeveon Clowney) 5 yards.","(13:03) Penalty: Holding on Tennessee (Ben Jones) -10 yards.","(13:43) DeMarco Murray rush to the left for 1 yard to the Ten43. Tackled by Whitney Mercilus.","(14:19) DeMarco Murray rush to the left for 3 yards to the Ten42. Tackled by Whitney Mercilus and Quintin Demps.","(14:51) Marcus Mariota pass to the right to Andre Johnson for 6 yards to the Ten39. Tackled by Johnathan Joseph.","(15:00) Nick Novak kicks off to the Ten0. Marc Mariani return for 33 yards to Ten33. Tackled by Kevin Johnson and A.J. Bouye.","(0:07) Marcus Mariota rush up the middle for 6 yards to the Ten46. Tackled by Whitney Mercilus.","(0:07) Nick Novak kicks off to the Ten17, out of bounds. No return.","(0:11) Nick Novak 45 yard field goal attempt is GOOD. Holder: Shane Lechler.","(0:15) Penalty: Pass Interference on Tennessee (Perrish Cox) 13 yards.","(0:15) Tennessee Titans timeout.","(0:15) Penalty: Delay of Game on Houston (Jon Weeks) -5 yards.","(0:15) Houston Texans timeout.","(0:35) Brock Osweiler pass to the right to Ryan Griffin for 3 yards to the Ten35. Tackled by Perrish Cox and Daimion Stafford.","(0:35) Houston Texans timeout.","(0:42) Brock Osweiler pass to the left to Ryan Griffin for 6 yards to the Ten38. Tackled by Brice McCain.","(0:46) Brock Osweiler incomplete pass to the right intended for Ryan Griffin.","(0:58) Brett Kern punts for 55 yards to Hou30. Tyler Ervin return for 16 yards to Hou46. Tackled by Aaron Wallace. Penalty: Holding on Tennessee (Valentino Blake) 10 yards.","(1:05) Marcus Mariota incomplete pass to the left intended for Delanie Walker defensed by A.J. Bouye.","(1:09) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe.","(1:09) Houston Texans timeout.","(1:15) Marcus Mariota pass to the right to Kendall Wright for 3 yards to the Ten15. Tackled by Kareem Jackson.","(1:25) Shane Lechler punts for 45 yards to Ten11. Marc Mariani return for 1 yard to Ten12. Tackled by Charles James.","(1:30) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(1:55) Lamar Miller rush up the middle for 6 yards to the Hou44. Tackled by Rashad Johnson and Avery Williamson.","(2:00) Brock Osweiler incomplete pass to the right intended for Ryan Griffin defensed by Rashad Johnson.","(2:00) Two Minute Warning.","(2:07) Lamar Miller rush up the middle for 4 yards to the Hou38. Tackled by Avery Williamson and Karl Klug.","(2:28) Brock Osweiler pass to the left to Jaelen Strong for 9 yards to the Hou34. Tackled by Daimion Stafford and Sean Spence.","(2:28) Ryan Succop kicks off to the endzone. Touchback.","(2:28) Ryan Succop extra point is good.","(2:32) DeMarco Murray rush to the left for 1 yard for a TOUCHDOWN.","(3:10) DeMarco Murray rush to the left for 6 yards to the Hou1. Tackled by Vince Wilfork and John Simon.","(3:17) Marcus Mariota incomplete pass to the right intended for Tajae Sharpe.","(4:01) Marcus Mariota pass to the left to DeMarco Murray for 14 yards to the Hou7. Tackled by A.J. Bouye and Benardrick McKinney.","(4:41) Derrick Henry rush up the middle for 6 yards to the Hou21. Tackled by Brian Cushing.","(4:48) Marcus Mariota incomplete pass to the middle intended for Tajae Sharpe defensed by Kareem Jackson.","(5:28) Marcus Mariota rush to the right for 3 yards to the Hou27. Tackled by Andre Hal.","(6:12) DeMarco Murray rush up the middle for 2 yards to the Hou30. Tackled by Devon Still and John Simon.","(6:44) DeMarco Murray rush to the right for 7 yards to the Hou32. Tackled by Benardrick McKinney.","(6:55) Brock Osweiler pass intended for DeAndre Hopkins INTERCEPTED by Jason McCourty and returned for 6 yards. Tackled by DeAndre Hopkins.","(7:06) Marcus Mariota pass intended for Delanie Walker INTERCEPTED by Quintin Demps and returned for 6 yards. Tackled by Delanie Walker.","(7:49) Derrick Henry rush to the left for 2 yards to the Ten49. Tackled by Whitney Mercilus.","(8:25) Marcus Mariota rush to the right for 9 yards to the Ten47. Tackled by Benardrick McKinney.","(8:29) 48 yard field goal attempt by Nick Novak is NO GOOD. Holder: Shane Lechler.","(8:34) Brock Osweiler incomplete pass to the right intended for Jaelen Strong.","(9:17) Brock Osweiler pass to the left to Alfred Blue for 4 yards to the Ten30. Tackled by David Bass.","(9:51) Alfred Blue rush to the left for no gain to the Ten34. Tackled by Avery Williamson and Karl Klug.","(10:28) Brock Osweiler pass to the left to C.J. Fiedorowicz for 18 yards to the Ten34. Tackled by Daimion Stafford.","(10:34) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins.","(11:14) Alfred Blue rush up the middle for 17 yards to the Hou48. Tackled by Rashad Johnson and Angelo Blackson.","(11:21) Ryan Succop kicks off to the Hou3. Tyler Ervin return for 28 yards to Hou31. Tackled by LeShaun Sims.","(11:21) Ryan Succop extra point is good.","(11:21) DeMarco Murray rush up the middle for 2 yards for a TOUCHDOWN. Penalty: Taunting on Tennessee (Ben Jones) -15 yards.","(11:32) Marcus Mariota incomplete pass to the middle.","(12:13) DeMarco Murray rush up the middle for 14 yards to the Hou2. Tackled by Andre Hal.","(13:00) Marcus Mariota pass to the left to Rishard Matthews for 60 yards to the Hou16. Tackled by Kareem Jackson.","(13:37) DeMarco Murray rush to the right for 2 yards to the Ten24. Tackled by Devon Still and Whitney Mercilus.","(13:42) Nick Novak kicks off to the Ten5. Antonio Andrews return for 17 yards to Ten22. Tackled by Brian Peters and Max Bullough.","(13:47) Nick Novak 53 yard field goal attempt is GOOD. Holder: Shane Lechler.","(13:47) Penalty: Too Many Men on Field on Tennessee 5 yards.","(13:52) Brock Osweiler incomplete pass to the left. Penalty: Intentional Grounding on Houston (Brock Osweiler) -10 yards.","(13:56) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(14:31) Lamar Miller rush to the right for a loss of 3 yards to the Ten30. Tackled by Wesley Woodyard.","(15:00) Brock Osweiler pass to the right to Will Fuller for 20 yards to the Ten27. Tackled by Perrish Cox and Rashad Johnson.","(0:10) Brock Osweiler pass to the right to Lamar Miller for 10 yards to the Ten47. Tackled by Avery Williamson.","(0:36) Penalty: Holding on Houston (Chris Clark) -10 yards.","(1:15) Brock Osweiler pass to the left to Will Fuller for 28 yards to the Ten47. Tackled by Karl Klug.","(1:53) Brock Osweiler pass to the middle to C.J. Fiedorowicz for 10 yards to the Hou25. Tackled by Avery Williamson.","(2:36) Brock Osweiler sacked at Hou15 for a loss of 10 yards by Brian Orakpo.","(2:36) Ryan Succop kicks off to the endzone. Touchback.","(2:40) Ryan Succop 48 yard field goal attempt is GOOD. Holder: Brett Kern.","(2:46) Marcus Mariota incomplete pass to the right intended for Delanie Walker.","(3:27) DeMarco Murray rush to the left for 5 yards to the Hou30. Tackled by Christian Covington.","(3:32) Marcus Mariota incomplete pass to the left intended for Delanie Walker.","(4:16) Marcus Mariota pass to the right to Delanie Walker for 24 yards to the Hou35. Tackled by Andre Hal.","(4:56) DeMarco Murray rush to the left for 10 yards to the Ten41. Tackled by Kareem Jackson.","(5:26) DeMarco Murray rush to the right for 3 yards to the Ten31. Tackled by John Simon and Benardrick McKinney.","(5:34) Nick Novak kicks off to the Ten3. Marc Mariani return for 25 yards to Ten28. Tackled by Akeem Dent.","(5:34) Nick Novak extra point is good.","(5:38) Brock Osweiler pass to the middle to Will Fuller for 5 yards for a TOUCHDOWN.","(6:20) Lamar Miller rush to the left for 4 yards to the Ten5. Tackled by Avery Williamson.","(6:54) Brock Osweiler pass to the left to Ryan Griffin for 45 yards to the Ten9. Tackled by Jason McCourty.","(7:22) Brock Osweiler pass to the right to C.J. Fiedorowicz for 6 yards to the Hou31. Tackled by Daimion Stafford. Penalty: Horse Collar Tackle on Tennessee (Daimion Stafford) 15 yards.","(7:51) Lamar Miller rush to the left for no gain to the Hou25. Tackled by Al Woods and Brian Orakpo.","(8:21) Brock Osweiler pass to the middle to Jaelen Strong for 5 yards to the Hou25. Tackled by Avery Williamson.","(8:31) Brett Kern punts for 71 yards to Hou0. Touchback.","(9:10) DeMarco Murray rush to the left for 2 yards to the Ten29. Tackled by Benardrick McKinney.","(9:55) DeMarco Murray rush to the right for 2 yards to the Ten27. Tackled by Johnathan Joseph and Brian Cushing.","(10:24) Marcus Mariota pass to the right to Tajae Sharpe for 5 yards to the Ten25. Tackled by Johnathan Joseph.","(10:31) Nick Novak kicks off to the Ten1. Marc Mariani return for 19 yards to Ten20. Tackled by Jay Prosch and Keith Mumphery.","(10:31) Nick Novak extra point is good.","(10:37) Brock Osweiler pass to the right to C.J. Fiedorowicz for 14 yards for a TOUCHDOWN.","(11:17) Lamar Miller rush to the right for 13 yards to the Ten14. Tackled by Rashad Johnson.","(11:56) Brock Osweiler pass to the right to Will Fuller for 7 yards to the Ten27. Tackled by Perrish Cox and Daimion Stafford.","(12:03) Brock Osweiler incomplete pass to the right intended for Will Fuller.","(12:45) Lamar Miller rush to the right for 6 yards to the Ten34. Tackled by Karl Klug and Brian Orakpo.","(13:24) Brock Osweiler pass to the right to Lamar Miller for 11 yards to the Ten40. Tackled by Sean Spence and Perrish Cox.","(14:00) Lamar Miller rush to the right for 5 yards to the Hou49. Tackled by Jurrell Casey.","(14:27) Brock Osweiler pass to the right to Will Fuller for 14 yards to the Hou44. Tackled by Rashad Johnson.","(15:00) Brock Osweiler pass to the middle to Lamar Miller for 5 yards to the Hou30. Tackled by Al Woods.","(15:00) Ryan Succop kicks off to the endzone. Touchback."]