["(0:09) Dak Prescott rush up the middle for a loss of 1 yard to the SF31.","(0:48) Dak Prescott rush up the middle for a loss of 2 yards to the SF30.","(1:31) Dak Prescott rush up the middle for a loss of 4 yards to the SF28.","(1:31) San Francisco 49ers timeout.","(1:45) Dak Prescott pass to the right to Cole Beasley for 47 yards to the SF24. Tackled by Michael Wilhoite.","(1:45) San Francisco 49ers timeout.","(1:49) Ezekiel Elliott rush to the left for 2 yards to the Dal29. Tackled by Nick Bellore.","(1:49) Penalty: False Start on Dallas (Geoff Swaim) -5 yards.","(1:56) Blaine Gabbert pass to the right to Torrey Smith for 3 yards to the Dal32. Tackled by Morris Claiborne.","(1:56) San Francisco 49ers timeout.","(2:00) Blaine Gabbert incomplete pass to the left intended for Jeremy Kerley.","(2:00) Two Minute Warning.","(2:23) Blaine Gabbert pass to the left to Jeremy Kerley for 5 yards to the Dal35. Tackled by Brandon Carr.","(2:53) Blaine Gabbert rush to the right for a loss of 1 yard to the Dal40. Tackled by Morris Claiborne.","(3:16) Blaine Gabbert pass to the right to Jeremy Kerley for 20 yards to the Dal39. Tackled by Barry Church.","(3:46) Blaine Gabbert pass to the right to Jeremy Kerley for 7 yards to the SF41. Tackled by Anthony Brown.","(4:11) Blaine Gabbert pass to the left to Garrett Celek for 9 yards to the SF34. Tackled by Sean Lee.","(4:11) Dan Bailey kicks off to the endzone. Touchback.","(4:15) Dan Bailey 22 yard field goal attempt is GOOD. Holder: Chris Jones.","(4:19) Dak Prescott incomplete pass to the right intended for Brice Butler defensed by Rashard Robinson.","(4:19) Dallas Cowboys timeout.","(5:04) Ezekiel Elliott rush to the right for a loss of 3 yards to the SF4. Tackled by Mike Purcell.","(5:41) Ezekiel Elliott rush to the left for 1 yard to the SF1. Tackled by Quinton Dial and DeForest Buckner.","(6:10) Ezekiel Elliott rush to the right for 5 yards to the SF4. Tackled by Antoine Bethea. Penalty: Illegal Use of Hands on San Francisco (Ahmad Brooks) 2 yards.","(6:27) Penalty: Offside on San Francisco (Ahmad Brooks) 5 yards.","(7:14) Dak Prescott pass to the right to Jason Witten for 5 yards to the SF14. Tackled by Michael Wilhoite.","(7:53) Alfred Morris rush to the right for 3 yards to the SF19. Tackled by Mike Purcell and Tank Carradine.","(8:33) Alfred Morris rush to the left for 7 yards to the SF22. Tackled by DeForest Buckner.","(9:14) Ezekiel Elliott rush to the left for 4 yards to the SF29. Tackled by Nick Bellore.","(10:00) Ezekiel Elliott rush to the left for 26 yards to the SF33. Tackled by Rashard Robinson.","(10:00) Dallas Cowboys timeout.","(10:38) Cole Beasley rush to the right for 7 yards to the Dal41. Tackled by Antoine Bethea.","(10:52) Blaine Gabbert pass intended for Torrey Smith INTERCEPTED by Morris Claiborne and returned for 27 yards. Tackled by Joe Staley.","(11:05) Chris Jones punts for 57 yards to SF19. Jeremy Kerley return for 26 yards to SF45. Tackled by Chris Jones.","(11:09) Dak Prescott incomplete pass to the right intended for Brice Butler defensed by Rashard Robinson.","(11:54) Alfred Morris rush to the left for 8 yards to the Dal24. Tackled by Michael Wilhoite.","(12:14) Dak Prescott pass to the right to Brice Butler for 9 yards to the Dal31. Tackled by Rashard Robinson. Penalty: Taunting on Dallas (Brice Butler) -15 yards.","(12:51) Alfred Morris rush to the right for 3 yards to the Dal22. Tackled by Michael Wilhoite.","(13:29) Alfred Morris rush up the middle for 9 yards to the Dal19. Tackled by Michael Wilhoite.","(13:36) Bradley Pinion punts for 45 yards to Dal10. No return.","(13:41) Blaine Gabbert incomplete pass to the right intended for Jeremy Kerley defensed by J.J. Wilcox.","(14:21) Carlos Hyde rush up the middle for 4 yards to the SF45. Tackled by Anthony Hitchens.","(15:00) Carlos Hyde rush to the left for 4 yards to the SF41. Tackled by Barry Church.","(0:04) Blaine Gabbert rush to the right for 7 yards to the SF37. Tackled by Barry Church.","(0:40) Blaine Gabbert rush to the left for 2 yards to the SF30. Tackled by Anthony Hitchens.","(1:02) Blaine Gabbert pass to the right to Jeremy Kerley for 6 yards to the SF28. Tackled by Morris Claiborne.","(1:08) Dan Bailey kicks off to the SF-1. Chris Davis return for 23 yards to SF22. Tackled by Jeff Heath.","(1:08) Dan Bailey extra point is good.","(1:11) Ezekiel Elliott rush to the right for 1 yard for a TOUCHDOWN.","(1:53) Ezekiel Elliott rush to the right for 17 yards to the SF1. Tackled by Jaquiski Tartt.","(2:29) Dak Prescott pass to the right to Jason Witten for 8 yards to the SF18. Tackled by Antoine Bethea.","(3:02) Ezekiel Elliott rush up the middle for 4 yards to the SF26. Tackled by Nick Bellore and Ahmad Brooks.","(3:34) Dak Prescott pass to the left to Brice Butler for 14 yards to the SF30. Tackled by Nick Bellore.","(4:17) Ezekiel Elliott rush to the left for 4 yards to the SF44. Tackled by Mike Purcell.","(4:55) Ezekiel Elliott rush to the left for 1 yard to the SF48. Tackled by Jaquiski Tartt and Michael Wilhoite.","(5:32) Ezekiel Elliott rush to the right for 23 yards to the SF49. Tackled by Antoine Bethea.","(5:52) Penalty: False Start on Dallas (Jason Witten) -5 yards.","(6:27) Dak Prescott pass to the middle to Brice Butler for 11 yards to the Dal33. Tackled by Keith Reaser.","(6:57) Ezekiel Elliott rush to the left for no gain to the Dal22. Tackled by Jaquiski Tartt.","(7:09) Bradley Pinion punts for 65 yards to Dal8. Lucky Whitehead return for 14 yards to Dal22. Tackled by Dontae Johnson and Shayne Skov.","(7:39) Blaine Gabbert pass to the middle to Carlos Hyde for 5 yards to the SF27. Tackled by Sean Lee.","(8:15) Carlos Hyde rush to the left for 1 yard to the SF22. Tackled by Cedric Thornton.","(8:46) Carlos Hyde rush up the middle for 1 yard to the SF21. Tackled by Anthony Hitchens.","(8:55) Chris Jones punts for 50 yards to SF0. Touchback.","(9:38) Dak Prescott pass to the right to Jason Witten for 8 yards to the Dal50. Tackled by Antoine Bethea.","(9:44) Dak Prescott incomplete pass to the right intended for Jason Witten.","(10:17) Dak Prescott rush to the left for 1 yard to the Dal42. Tackled by DeForest Buckner.","(10:56) Ezekiel Elliott rush to the right for 7 yards to the Dal41. Tackled by Michael Wilhoite.","(11:39) Dak Prescott pass to the middle to Cole Beasley for 10 yards to the Dal34. Tackled by Eric Reid.","(12:18) Ezekiel Elliott rush up the middle for 4 yards to the Dal24. Tackled by NaVorro Bowman and Antoine Bethea.","(12:18) Penalty: False Start on Dallas (Geoff Swaim) -5 yards.","(12:18) Bradley Pinion kicks off to the endzone. Touchback.","(12:23) Phil Dawson 36 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(12:27) Blaine Gabbert incomplete pass to the left intended for Aaron Burbridge.","(12:46) Penalty: False Start on San Francisco (Trenton Brown) -5 yards.","(13:20) Carlos Hyde rush up the middle for 2 yards to the Dal13. Tackled by Tyrone Crawford and Terrell McClain.","(13:53) Blaine Gabbert rush to the right for a loss of 1 yard to the Dal15. Tackled by Barry Church.","(14:23) Blaine Gabbert pass to the right to Garrett Celek for 29 yards to the Dal14. Tackled by Barry Church.","(15:00) Carlos Hyde rush to the left for 32 yards to the Dal43. Tackled by Morris Claiborne.","(15:00) Dan Bailey kicks off to the endzone. Touchback.","(0:04) Blaine Gabbert rush up the middle for a loss of 1 yard to the SF28.","(0:12) Dan Bailey kicks off to the SF17. Mike Davis return for 12 yards to SF29. Tackled by Anthony Brown and Jeff Heath.","(0:12) Dan Bailey extra point is good.","(0:16) Dak Prescott pass to the left to Brice Butler for 4 yards for a TOUCHDOWN.","(0:16) Dallas Cowboys timeout.","(0:20) Lance Dunbar rush to the right for 2 yards to the SF4. Tackled by Antoine Bethea.","(0:24) Dak Prescott pass to the right to Lance Dunbar for 9 yards to the SF6. Tackled by Michael Wilhoite.","(0:28) Dak Prescott incomplete pass to the right intended for Jason Witten.","(0:28) Dallas Cowboys timeout.","(0:38) Dak Prescott pass to the middle to Terrance Williams for 10 yards to the SF15. Tackled by Tramaine Brock.","(0:44) Dak Prescott incomplete pass to the right intended for Brice Butler.","(0:44) Dallas Cowboys timeout.","(0:48) Dak Prescott pass to the left to Jason Witten for 4 yards to the SF25. Tackled by NaVorro Bowman.","(0:53) Dak Prescott pass to the right to Terrance Williams for 7 yards to the SF29. Tackled by Tramaine Brock.","(0:58) Dak Prescott pass to the right to Jason Witten for 7 yards to the SF36. Tackled by Antoine Bethea.","(1:23) Dak Prescott pass to the right to Jason Witten for 7 yards to the SF43. Tackled by NaVorro Bowman.","(1:50) Dak Prescott pass to the left to Jason Witten for 8 yards to the Dal50. Tackled by Rashard Robinson.","(1:55) Bradley Pinion punts for 26 yards to Dal42. No return.","(2:00) Blaine Gabbert incomplete pass to the right intended for Jeremy Kerley defensed by Anthony Brown.","(2:00) Two Minute Warning.","(2:29) Carlos Hyde rush to the left for a loss of 2 yards to the SF32. Tackled by Benson Mayowa.","(2:58) Carlos Hyde rush to the right for 9 yards to the SF34. Tackled by J.J. Wilcox and Anthony Hitchens.","(2:58) Dan Bailey kicks off to the endzone. Touchback.","(2:58) Dan Bailey extra point is good.","(3:04) Dak Prescott pass to the right to Terrance Williams for 20 yards for a TOUCHDOWN.","(3:40) Ezekiel Elliott rush up the middle for 10 yards to the SF20. Tackled by DeForest Buckner.","(4:23) Ezekiel Elliott rush to the left for 9 yards to the SF30. Tackled by Eric Reid.","(4:50) Dak Prescott sacked at Dal46 for a loss of 3 yards by Chris Davis and Ronald Blair. Penalty: Unnecessary Roughness on San Francisco (Jaquiski Tartt) 15 yards.","(4:55) Dak Prescott incomplete pass to the right intended for Terrance Williams.","(5:29) Ezekiel Elliott rush to the right for 4 yards to the Dal49. Tackled by Mike Purcell.","(6:06) Ezekiel Elliott rush to the right for 2 yards to the Dal45. Tackled by NaVorro Bowman.","(6:32) Dak Prescott pass to the right to Ezekiel Elliott for 19 yards to the Dal43. Tackled by Eric Reid and Tramaine Brock.","(6:52) Penalty: Holding on Dallas (Doug Free) -10 yards.","(7:06) Bradley Pinion punts for 60 yards to Dal23. Lucky Whitehead return for 11 yards to Dal34. Tackled by Gerald Hodges Jr..","(7:41) Blaine Gabbert pass to the right to Shaun Draughn for 3 yards to the SF17. Tackled by Morris Claiborne.","(8:12) Shaun Draughn rush to the right for 4 yards to the SF14. Tackled by Sean Lee.","(8:56) Blaine Gabbert sacked at SF10 for a loss of 7 yards by Tyrone Crawford.","(9:41) Carlos Hyde rush up the middle for 2 yards to the SF17. Tackled by Tyrone Crawford and Cedric Thornton.","(10:09) Blaine Gabbert rush to the right for 5 yards to the SF15. Tackled by Anthony Hitchens.","(10:37) Carlos Hyde rush up the middle for 4 yards to the SF10. Tackled by Tyrone Crawford.","(10:47) Chris Jones punts for 51 yards to SF6. No return.","(10:50) Dak Prescott incomplete pass to the right intended for Brice Butler defensed by Rashard Robinson.","(11:31) Alfred Morris rush to the right for 2 yards to the Dal43. Tackled by Antoine Bethea.","(11:51) Penalty: Offside on San Francisco (Eric Reid) 5 yards.","(12:00) Dak Prescott incomplete pass to the right intended for Terrance Williams defensed by Antoine Bethea.","(12:40) Keith Smith rush up the middle for 2 yards to the Dal36. Tackled by NaVorro Bowman and DeForest Buckner.","(13:22) Dak Prescott pass to the right to Terrance Williams for 7 yards to the Dal34. Tackled by Antoine Bethea.","(13:55) Alfred Morris rush to the right for 2 yards to the Dal27. Tackled by NaVorro Bowman and Quinton Dial.","(13:55) Bradley Pinion kicks off to the endzone. Touchback.","(13:55) Phil Dawson extra point is good.","(14:02) Carlos Hyde rush to the right for 3 yards for a TOUCHDOWN.","(14:29) Carlos Hyde rush to the right for 3 yards to the Dal3. Tackled by Sean Lee and Ryan Davis.","(15:00) Blaine Gabbert rush to the left for 6 yards to the Dal6. Tackled by Brandon Carr and Sean Lee.","(0:19) Blaine Gabbert pass to the left to Jeremy Kerley for 17 yards to the Dal12. Tackled by Anthony Brown.","(0:46) Blaine Gabbert rush to the left for a loss of 2 yards to the Dal29. Tackled by Barry Church.","(1:15) Blaine Gabbert pass to the left to Garrett Celek for 25 yards to the Dal27. Tackled by Barry Church.","(1:47) Blaine Gabbert pass to the right to Garrett Celek for 13 yards to the SF48. Tackled by Sean Lee.","(1:52) Blaine Gabbert incomplete pass to the left intended for Quinton Patton.","(2:24) Shaun Draughn rush to the right for 1 yard to the SF35. Tackled by Terrell McClain and Morris Claiborne.","(2:54) Blaine Gabbert rush to the right for 7 yards to the SF34. Tackled by Morris Claiborne.","(3:27) Carlos Hyde rush to the right for 7 yards to the SF27. Tackled by Sean Lee and Jack Crawford.","(3:58) Carlos Hyde rush to the right for no gain to the SF20. Tackled by Maliek Collins.","(4:12) Chris Jones punts for 63 yards to SF0. Touchback.","(4:53) Dak Prescott sacked at Dal37 for a loss of 8 yards by NaVorro Bowman.","(5:35) Ezekiel Elliott rush to the left for 1 yard to the Dal45. Tackled by NaVorro Bowman and Michael Wilhoite.","(6:17) Ezekiel Elliott rush to the left for 5 yards to the Dal44. Tackled by Quinton Dial.","(6:41) Dak Prescott pass to the left to Keith Smith for 14 yards to the Dal39. Tackled by Eric Reid.","(6:41) Bradley Pinion kicks off to the endzone. Touchback.","(6:41) Phil Dawson extra point is good.","(6:49) Blaine Gabbert pass to the left to Jeremy Kerley for 33 yards for a TOUCHDOWN.","(7:30) Blaine Gabbert pass to the left to Garrett Celek for 3 yards to the Dal33. Tackled by Barry Church.","(8:04) Blaine Gabbert rush to the left for no gain to the Dal36. Tackled by Sean Lee.","(8:19) Blaine Gabbert pass to the left to Quinton Patton for 13 yards to the Dal36. Tackled by Brandon Carr.","(8:24) Blaine Gabbert incomplete pass to the right intended for Quinton Patton defensed by Anthony Brown.","(8:56) Blaine Gabbert rush to the left for a loss of 2 yards to the Dal49. Tackled by Sean Lee.","(9:16) Blaine Gabbert rush to the left for 7 yards to the Dal47. Tackled by Sean Lee.","(9:52) Blaine Gabbert pass to the middle to Aaron Burbridge for 5 yards to the SF46. Tackled by Brandon Carr.","(10:20) Carlos Hyde rush to the right for 4 yards to the SF41. Tackled by Anthony Hitchens and Terrell McClain.","(10:25) 47 yard field goal attempt by Dan Bailey is NO GOOD. Holder: Chris Jones.","(11:07) Dak Prescott pass to the left to Lance Dunbar for 5 yards to the SF29. Tackled by Antoine Bethea.","(11:07) Penalty: False Start on Dallas (Keith Smith) -5 yards.","(11:10) Dak Prescott incomplete pass to the right intended for Cole Beasley defensed by Eric Reid.","(11:51) Lucky Whitehead rush to the left for 8 yards to the SF29. Tackled by Michael Wilhoite.","(12:28) Dak Prescott pass to the middle to Cole Beasley for 9 yards to the SF37. Tackled by Michael Wilhoite.","(13:07) Dak Prescott pass to the left to Brice Butler for 3 yards to the SF46. Tackled by Rashard Robinson.","(13:44) Ezekiel Elliott rush to the left for 3 yards to the SF49. Tackled by Michael Wilhoite.","(14:20) Ezekiel Elliott rush to the right for 8 yards to the Dal48. Tackled by Antoine Bethea.","(14:52) Dak Prescott rush to the left for 9 yards to the Dal40. Tackled by Rashard Robinson.","(15:00) Phil Dawson kicks off to the Dal3. Lucky Whitehead return for 28 yards to Dal31. Tackled by Gerald Hodges Jr. and Nick Bellore."]