["(0:20) Sam Bradford rush up the middle for a loss of 1 yard to the NYG37.","(0:57) Sam Bradford rush up the middle for a loss of 1 yard to the NYG36.","(1:40) Zach Line rush up the middle for 2 yards to the NYG35. Tackled by Andrew Adams.","(1:40) New York Giants timeout.","(1:46) Jerick McKinnon rush to the left for 3 yards to the NYG37. Tackled by Kelvin Sheppard.","(1:46) Penalty: Offside on New York (Johnathan Hankins) 5 yards.","(1:56) Eli Manning incomplete pass to the right intended for Paul Perkins.","(2:00) Eli Manning incomplete pass to the left intended for Will Tye defensed by Eric Kendricks.","(2:00) Two Minute Warning.","(2:08) Eli Manning pass to the middle to Bobby Rainey for 6 yards to the NYG45. Tackled by Captain Munnerlyn.","(2:28) Eli Manning pass to the left to Bobby Rainey for no gain to the NYG39. Tackled by Captain Munnerlyn.","(2:49) Eli Manning pass to the right to Victor Cruz for 14 yards to the NYG39. Tackled by Harrison Smith.","(3:05) Eli Manning pass to the middle to Bobby Rainey for 1 yard to the NYG25. Tackled by Eric Kendricks.","(3:22) Eli Manning pass to the middle to Bobby Rainey for 6 yards to the NYG24. Tackled by Eric Kendricks.","(3:28) Eli Manning pass to the right to Bobby Rainey for 9 yards to the NYG18. Tackled by Anthony Barr.","(3:35) Jeff Locke punts for 33 yards to NYG9. No return.","(3:35) New York Giants timeout.","(3:44) Sam Bradford pass to the right to Stefon Diggs for 8 yards to the NYG42. Tackled by Andrew Adams and Romeo Okwara.","(3:44) New York Giants timeout.","(3:51) Jerick McKinnon rush to the left for 5 yards to the Min50. Tackled by Jonathan Casillas and Olivier Vernon.","(3:57) Penalty: Holding on Minnesota (Kyle Rudolph) -10 yards.","(4:37) Jerick McKinnon rush up the middle for 3 yards to the NYG45. Tackled by Kelvin Sheppard.","(4:43) Sam Bradford pass to the right to Stefon Diggs for 10 yards to the NYG48. Tackled by Michael Hunter.","(5:29) Sam Bradford rush to the right for 3 yards to the Min42. Tackled by Landon Collins.","(6:11) Jerick McKinnon rush to the left for 3 yards to the Min39. Tackled by Landon Collins.","(6:14) Eli Manning incomplete pass to the middle intended for Sterling Shepard defensed by Anthony Barr.","(7:00) Eli Manning pass to the left to Paul Perkins for 5 yards to the Min36. Tackled by Eric Kendricks.","(7:04) Eli Manning incomplete pass to the left intended for Victor Cruz.","(7:11) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(7:41) Bobby Rainey rush up the middle for 8 yards to the Min41. Tackled by Harrison Smith.","(8:14) Bobby Rainey rush to the left for 8 yards to the Min49. Tackled by Andrew Sendejo.","(8:16) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(8:43) Eli Manning pass to the left to Will Tye for 15 yards to the NYG43. Tackled by Captain Munnerlyn.","(9:15) Orleans Darkwa rush to the left for 3 yards to the NYG28. Tackled by Danielle Hunter.","(9:20) Blair Walsh kicks off to the NYG-5. Dwayne Harris return for 30 yards to NYG25. Tackled by Audie Cole.","(9:20) Blair Walsh extra point is good.","(9:23) Jerick McKinnon rush up the middle for 4 yards for a TOUCHDOWN.","(9:56) Sam Bradford pass to the left to Charles Johnson for 40 yards to the NYG4. Tackled by Trevin Wade.","(10:20) Sam Bradford pass to the left to Matt Asiata for 5 yards to the NYG44. Tackled by Jonathan Casillas.","(11:02) Matt Asiata rush to the left for 1 yard to the NYG49. Tackled by Johnathan Hankins.","(11:43) Sam Bradford pass to the right to Cordarrelle Patterson for 4 yards to the Min50. Tackled by Jonathan Casillas and Andrew Adams.","(12:12) Sam Bradford pass to the middle to Kyle Rudolph for 16 yards to the Min46. Tackled by Landon Collins.","(12:53) Sam Bradford pass to the left to Cordarrelle Patterson for 3 yards to the Min30. Tackled by Leon Hall.","(13:31) Jerick McKinnon rush to the right for 3 yards to the Min27. Tackled by Keenan Robinson.","(13:38) Josh Brown kicks off to the Min-5. Cordarrelle Patterson return for 29 yards to Min24. Tackled by Leon Hall.","(13:38) Josh Brown extra point is good.","(13:42) Orleans Darkwa rush to the left for 1 yard for a TOUCHDOWN.","(13:46) Penalty: Pass Interference on Minnesota (Trae Waynes) 2 yards.","(14:24) Orleans Darkwa rush up the middle for 1 yard to the Min3. Tackled by Danielle Hunter.","(15:00) Eli Manning pass to the right to Paul Perkins for 67 yards to the Min4. Tackled by Andrew Sendejo.","(0:02) Eli Manning pass to the right to Sterling Shepard for 2 yards to the NYG29. Tackled by Captain Munnerlyn.","(0:25) Eli Manning pass to the left to Will Tye for 18 yards to the NYG27. Tackled by Harrison Smith.","(0:32) Jeff Locke punts for 29 yards to NYG9. No return.","(0:37) Sam Bradford incomplete pass to the right intended for Stefon Diggs.","(0:37) Minnesota Vikings timeout.","(0:41) Sam Bradford incomplete pass to the left intended for Jerick McKinnon.","(1:27) Sam Bradford pass to the right to Jerick McKinnon for 1 yard to the NYG38. Tackled by Trevin Wade.","(2:07) Sam Bradford pass to the right to Kyle Rudolph for 15 yards to the NYG39. Tackled by Trevin Wade.","(2:43) Sam Bradford rush to the right for 5 yards to the Min46. Tackled by Keenan Robinson.","(3:23) Matt Asiata rush up the middle for 1 yard to the Min41. Tackled by Trevin Wade.","(4:05) Sam Bradford pass to the left to Cordarrelle Patterson for 4 yards to the Min40. Tackled by Janoris Jenkins.","(4:47) Matt Asiata rush up the middle for no gain to the Min36. Tackled by Olivier Vernon.","(5:25) Sam Bradford pass to the right to MyCole Pruitt for 7 yards to the Min36. Tackled by Damon Harrison.","(5:30) Penalty: Pass Interference on New York (Trevin Wade) 6 yards.","(6:11) Jerick McKinnon rush to the right for no gain to the Min23. Tackled by Devon Kennard and Jay Bromley.","(6:54) Jerick McKinnon rush to the right for 4 yards to the Min23. Tackled by Landon Collins.","(6:59) Brad Wing punts for 49 yards to Min19. No return.","(7:07) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(7:10) Eli Manning incomplete pass to the right intended for Victor Cruz defensed by Trae Waynes.","(7:39) Eli Manning pass to the right to Will Tye for 7 yards to the NYG32. Tackled by Eric Kendricks.","(7:39) Blair Walsh kicks off to the endzone. Touchback.","(7:43) Blair Walsh 44 yard field goal attempt is GOOD. Holder: Jeff Locke.","(7:49) Sam Bradford incomplete pass to the right intended for Cordarrelle Patterson.","(7:52) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(8:36) Jerick McKinnon rush to the left for 2 yards to the NYG26. Tackled by Jason Pierre-Paul.","(9:13) Sam Bradford pass to the left to Kyle Rudolph for 12 yards to the NYG28. Tackled by Landon Collins.","(9:55) Jerick McKinnon rush to the right for 3 yards to the NYG40. Tackled by Damon Harrison and Jason Pierre-Paul.","(10:09) Eli Manning pass intended for Odell Beckham Jr. INTERCEPTED by Xavier Rhodes and returned for 29 yards. Tackled by Weston Richburg.","(10:55) Orleans Darkwa rush to the right for 3 yards to the NYG39. Tackled by Harrison Smith.","(10:59) Eli Manning incomplete pass to the right intended for Odell Beckham Jr..","(11:02) 46 yard field goal attempt by Blair Walsh is NO GOOD. Holder: Jeff Locke.","(11:08) Sam Bradford incomplete pass to the left intended for Jerick McKinnon defensed by Andrew Adams.","(11:49) Jerick McKinnon rush to the left for a loss of 1 yard to the NYG28. Tackled by Landon Collins.","(12:32) Sam Bradford pass to the left to Matt Asiata for 7 yards to the NYG27. Tackled by Jonathan Casillas.","(13:11) Sam Bradford pass to the left to Stefon Diggs for 6 yards to the NYG34. Tackled by Janoris Jenkins.","(13:45) Sam Bradford pass to the right to Cordarrelle Patterson for 6 yards to the NYG40. Tackled by Leon Hall and Keenan Robinson.","(14:25) Stefon Diggs rush to the left for a loss of 1 yard to the NYG46. Tackled by Jonathan Casillas and Andrew Adams.","(15:00) Sam Bradford pass to the left to Charles Johnson for 30 yards to the NYG45. Tackled by Trevin Wade.","(15:00) Josh Brown kicks off to the endzone. Touchback.","(0:02) Josh Brown kicks off to the Min30. Laquon Treadwell - no return. Tackled by Dwayne Harris.","(0:06) Josh Brown 40 yard field goal attempt is GOOD. Holder: Brad Wing.","(0:06) Minnesota Vikings timeout.","(0:06) Penalty: Delay of Game on New York (Brad Wing) -5 yards.","(0:10) Eli Manning incomplete pass to the right intended for Victor Cruz.","(0:25) Eli Manning pass to the right to Victor Cruz for 10 yards to the Min17. Tackled by Terence Newman.","(0:25) New York Giants timeout.","(0:30) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by Xavier Rhodes.","(0:32) Eli Manning incomplete pass to the right intended for Victor Cruz.","(0:52) Eli Manning pass to the middle to Bobby Rainey for 10 yards to the Min27. Tackled by Captain Munnerlyn.","(0:54) Penalty: Offside on Minnesota (Everson Griffen) 5 yards.","(1:33) Bobby Rainey rush up the middle for a loss of 3 yards to the Min42. Tackled by Tom Johnson.","(1:36) Eli Manning incomplete pass to the left intended for Bobby Rainey.","(2:00) Eli Manning pass to the left to Victor Cruz for 9 yards to the Min39. Tackled by Terence Newman.","(2:00) Two Minute Warning.","(2:22) Bobby Rainey rush up the middle for 9 yards to the Min48. Tackled by Harrison Smith and Terence Newman.","(2:46) Eli Manning pass to the right to Victor Cruz for 9 yards to the NYG43. Tackled by Captain Munnerlyn.","(2:53) Jeff Locke punts for 46 yards to NYG34. No return.","(3:34) Matt Asiata rush to the right for a loss of 1 yard to the Min20. Tackled by Olivier Vernon.","(4:13) Jerick McKinnon rush to the left for 10 yards to the Min21. Tackled by Andrew Adams.","(4:58) Jerick McKinnon rush up the middle for a loss of 1 yard to the Min11. Tackled by Devon Kennard.","(5:08) Brad Wing punts for 48 yards to Min12. No return.","(5:08) New York Giants timeout.","(5:56) Eli Manning pass to the left to Sterling Shepard for 10 yards to the NYG40. Tackled by Andrew Sendejo.","(6:22) Eli Manning pass to the left to Odell Beckham Jr. for 10 yards to the NYG30. Tackled by Xavier Rhodes.","(6:47) Eli Manning pass to the left to Odell Beckham Jr. for 4 yards to the NYG35. Tackled by Xavier Rhodes. Penalty: Taunting on New York (Odell Beckham Jr.) -15 yards.","(7:25) Paul Perkins rush to the left for 5 yards to the NYG31. Tackled by Shamar Stephen and Eric Kendricks.","(7:54) Eli Manning pass to the right to Odell Beckham Jr. for 9 yards to the NYG26. Tackled by Harrison Smith.","(7:59) Blair Walsh kicks off to the NYG-3. Dwayne Harris return for 20 yards to NYG17. Tackled by Justin Trattou.","(7:59) Blair Walsh extra point is good.","(8:04) Sam Bradford pass to the left to Kyle Rudolph for 7 yards for a TOUCHDOWN.","(8:43) Jerick McKinnon rush up the middle for 3 yards to the NYG7. Tackled by Olivier Vernon.","(9:13) Sam Bradford pass to the left to Adam Thielen for 3 yards to the NYG10. Tackled by Trevin Wade.","(9:39) Sam Bradford pass to the right to Stefon Diggs for 21 yards to the NYG13. Tackled by Leon Hall.","(10:14) Matt Asiata rush up the middle for 4 yards to the NYG34. Tackled by Devon Kennard and Kelvin Sheppard.","(10:51) Jerick McKinnon rush to the left for 7 yards to the NYG38. Tackled by Leon Hall and Jonathan Casillas.","(11:26) Jerick McKinnon rush up the middle for 10 yards to the NYG45. Tackled by Michael Hunter.","(12:02) Sam Bradford pass to the right to Adam Thielen for 18 yards to the Min45. Tackled by Kelvin Sheppard and Leon Hall.","(12:27) Penalty: Holding on Minnesota (Alex Boone) -10 yards.","(12:55) Sam Bradford pass to the left to Stefon Diggs for 2 yards to the Min37. Tackled by Landon Collins.","(13:10) Brad Wing punts for 45 yards to Min27. Marcus Sherels return for 8 yards to Min35. Tackled by Zak DeOssie.","(13:14) Eli Manning incomplete pass to the right intended for Sterling Shepard.","(13:17) Eli Manning incomplete pass to the middle intended for Bobby Rainey.","(13:48) Orleans Darkwa rush to the left for 2 yards to the NYG28. Tackled by Tom Johnson.","(14:21) Eli Manning pass to the left to Victor Cruz for 8 yards to the NYG26. Tackled by Terence Newman.","(14:45) Orleans Darkwa rush up the middle for 5 yards to the NYG18. Tackled by Harrison Smith and Andrew Sendejo.","(14:56) Jeff Locke punts for 50 yards to NYG13. No return.","(15:00) Sam Bradford incomplete pass to the left intended for Stefon Diggs.","(0:10) Sam Bradford pass to the right to Rhett Ellison for 2 yards to the Min37. Tackled by Landon Collins.","(0:53) Cordarrelle Patterson rush to the right for 2 yards to the Min35. Tackled by Devon Kennard and Keenan Robinson.","(1:02) Brad Wing punts for 53 yards to Min28. Marcus Sherels return for 5 yards to Min33. Tackled by Dwayne Harris.","(1:38) Eli Manning pass to the left to Sterling Shepard for 6 yards to the NYG19. Tackled by Everson Griffen.","(1:43) Eli Manning incomplete pass to the middle intended for Will Tye.","(2:13) Penalty: Holding on New York (Ereck Flowers) -10 yards.","(2:47) Paul Perkins rush to the left for 3 yards to the NYG23. Tackled by Eric Kendricks.","(2:56) Jeff Locke punts for 53 yards to NYG0. Touchback.","(3:01) Sam Bradford incomplete pass to the left intended for Adam Thielen.","(3:07) Sam Bradford incomplete pass to the left intended for Charles Johnson.","(3:42) Zach Line rush to the right for 2 yards to the Min47. Tackled by Damon Harrison.","(4:12) Jerick McKinnon rush to the left for 25 yards to the Min45. Tackled by Leon Hall.","(4:18) Brad Wing punts for 48 yards to Min0. Touchback.","(4:44) Eli Manning pass to the right to Will Tye for 3 yards to the Min48. Tackled by Eric Kendricks and Captain Munnerlyn.","(4:47) Eli Manning incomplete pass to the left intended for Orleans Darkwa.","(5:23) Orleans Darkwa rush to the left for 2 yards to the NYG49. Tackled by Eric Kendricks.","(5:44) Orleans Darkwa rush to the right for 17 yards to the NYG42. Tackled by Anthony Barr. Penalty: Illegal Use of Hands on Minnesota (Xavier Rhodes) 5 yards.","(6:28) Orleans Darkwa rush to the left for no gain to the NYG25. Tackled by Linval Joseph.","(6:28) Blair Walsh kicks off to the endzone. Touchback.","(6:28) Blair Walsh extra point is good.","(6:30) Matt Asiata rush to the left for 1 yard for a TOUCHDOWN.","(6:34) Sam Bradford incomplete pass to the left intended for Kyle Rudolph.","(6:38) Penalty: Pass Interference on New York (Janoris Jenkins) 13 yards.","(7:02) Penalty: False Start on Minnesota (Brandon Fusco) -5 yards.","(7:39) Sam Bradford pass to the left to Jerick McKinnon for 6 yards to the NYG9. Tackled by Keenan Robinson.","(8:10) Jerick McKinnon rush up the middle for 2 yards to the NYG15. Tackled by Keenan Robinson and Landon Collins.","(8:45) Sam Bradford pass to the right to Jerick McKinnon for 3 yards to the NYG17. Tackled by Jonathan Casillas.","(9:10) Sam Bradford pass to the right to Cordarrelle Patterson for 21 yards to the NYG20. Tackled by Landon Collins.","(9:20) Jeff Locke punts for 53 yards to NYG39. Dwayne Harris - no return. FUMBLE, recovered by Min (Marcus Sherels). Tackled by Dwayne Harris.","(10:04) Sam Bradford pass to the left to Kyle Rudolph for 5 yards to the Min8. Tackled by Andrew Adams and Keenan Robinson.","(10:09) Sam Bradford incomplete pass to the right intended for Charles Johnson.","(10:44) Zach Line rush up the middle for 2 yards to the Min3. Tackled by Kelvin Sheppard and Jonathan Casillas.","(10:52) Brad Wing punts for 37 yards to Min1. No return.","(10:57) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(11:22) Penalty: False Start on New York (Ereck Flowers) -5 yards.","(12:03) Eli Manning pass to the left to Bobby Rainey for 11 yards to the Min33. Tackled by Anthony Barr.","(12:33) Orleans Darkwa rush to the left for 4 yards to the Min44. Tackled by Linval Joseph.","(13:03) Penalty: Illegal Block on New York (Victor Cruz) -10 yards.","(13:40) Orleans Darkwa rush to the right for 9 yards to the Min38. Tackled by Harrison Smith.","(14:22) Orleans Darkwa rush up the middle for 1 yard to the Min47. Tackled by Harrison Smith and Linval Joseph.","(14:50) Eli Manning pass to the middle to Sterling Shepard for 12 yards to the Min48. Tackled by Captain Munnerlyn.","(14:54) Eli Manning incomplete pass to the middle intended for Orleans Darkwa.","(15:00) Blair Walsh kicks off to the NYG-4. Dwayne Harris return for 44 yards to NYG40. Tackled by Marcus Sherels."]