["(0:33) Drew Brees rush up the middle for a loss of 1 yard to the SD34.","(1:07) Drew Brees rush up the middle for a loss of 1 yard to the SD33.","(1:07) San Diego Chargers timeout.","(1:10) Drew Brees rush up the middle for a loss of 1 yard to the SD32.","(1:18) Philip Rivers pass intended for Tyrell Williams INTERCEPTED by B.W. Webb and returned for 7 yards.","(1:27) Philip Rivers incomplete pass to the right intended for Dontrelle Inman defensed by Sterling Moore.","(1:27) Philip Rivers rush up the middle for no gain to the SD20. FUMBLE, recovered by SD (Philip Rivers).","(1:57) Philip Rivers sacked at SD20 for a loss of 5 yards by Nick Fairley.","(1:57) Wil Lutz kicks off to the endzone. Touchback.","(1:57) Wil Lutz extra point is good.","(2:00) John Kuhn rush to the right for 1 yard for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:13) Drew Brees pass to the middle to John Kuhn for 3 yards to the SD1. Tackled by Jerry Attaochu.","(2:39) Drew Brees pass to the left to Brandon Coleman for 6 yards to the SD4. Tackled by Casey Hayward.","(3:20) Mark Ingram rush up the middle for 3 yards to the SD10. Tackled by Corey Liuget.","(3:59) Drew Brees pass to the middle to Tommylee Lewis for 10 yards to the SD13. Tackled by Pierre Desir.","(4:04) Drew Brees incomplete pass to the right intended for Coby Fleener defensed by Dwight Lowery.","(4:42) Mark Ingram rush to the right for 8 yards to the SD23. Tackled by Joshua Perry.","(4:50) Philip Rivers pass to the middle to Travis Benjamin for 5 yards to the SD30. FUMBLE, recovered by NO (Nate Stupar). Tackled by Travis Benjamin.","(4:50) Wil Lutz kicks off to the endzone. Touchback.","(4:50) Wil Lutz extra point is good.","(4:55) Drew Brees pass to the left to Michael Thomas for 5 yards for a TOUCHDOWN.","(4:55) San Diego Chargers timeout.","(5:28) Mark Ingram rush to the left for 2 yards to the SD5. Tackled by Pierre Desir.","(6:06) Tim Hightower rush up the middle for 2 yards to the SD7. Tackled by Darius Philon.","(6:40) Mark Ingram rush to the left for 4 yards to the SD9. Tackled by Darius Philon and Dwight Lowery.","(6:50) Melvin Gordon rush to the right for 3 yards to the SD13. Tackled by Vonn Bell. FUMBLE, recovered by NO (Darryl Tapp). Tackled by Spencer Pulley.","(6:59) Thomas Morstead punts for 36 yards to SD20. No return. Penalty: Holding on San Diego (Korey Toomer) -10 yards.","(7:04) Drew Brees incomplete pass to the left intended for Coby Fleener defensed by Corey Liuget.","(7:08) Drew Brees incomplete pass to the right intended for Michael Thomas.","(7:35) Mark Ingram rush to the right for 4 yards to the NO44. Tackled by Melvin Ingram.","(8:05) Drew Brees pass to the right to Mark Ingram for 8 yards to the NO40. Tackled by Casey Hayward.","(8:39) Drew Brees pass to the right to Mark Ingram for 7 yards to the NO32. Tackled by Jason Verrett.","(8:39) Josh Lambo kicks off to the endzone. Touchback.","(8:43) Josh Lambo 47 yard field goal attempt is GOOD. Holder: Drew Kaser.","(9:01) Philip Rivers sacked at NO14 for a loss of 5 yards by Cameron Jordan. FUMBLE, recovered by SD (Philip Rivers). Penalty: Unnecessary Roughness on San Diego (Matt Slauson) -15 yards.","(9:44) Philip Rivers pass to the left to Tyrell Williams for 1 yard to the NO9. Tackled by Craig Robertson.","(10:23) Melvin Gordon rush up the middle for a loss of 2 yards to the NO10. Tackled by Cameron Jordan.","(10:52) Philip Rivers pass to the left to Hunter Henry for 18 yards to the NO8. Tackled by Nate Stupar.","(11:27) Melvin Gordon rush up the middle for no gain to the NO26. Tackled by Darryl Tapp.","(11:39) Drew Brees pass intended for Michael Thomas INTERCEPTED by Adrian Phillips and returned for 22 yards. Tackled by Michael Thomas.","(12:15) Mark Ingram rush to the left for 4 yards to the NO29. Tackled by Nick Dzubnar and Adrian Phillips.","(12:15) Josh Lambo kicks off to the endzone. Touchback.","(12:15) Josh Lambo extra point is good.","(12:19) Melvin Gordon rush to the right for 1 yard for a TOUCHDOWN.","(12:53) Philip Rivers pass to the left to Tyrell Williams for no gain to the NO1. Tackled by Kenny Vaccaro.","(12:57) Penalty: Pass Interference on New Orleans (Vonn Bell) 4 yards.","(13:35) Dexter McCluster rush up the middle for 2 yards to the NO5. Tackled by Nate Stupar.","(14:22) Philip Rivers pass to the middle to Tyrell Williams for 16 yards to the NO7. Tackled by Sterling Moore.","(15:00) Melvin Gordon rush up the middle for 2 yards to the NO23. Tackled by Nate Stupar.","(0:39) Philip Rivers pass to the left to Tyrell Williams for 11 yards to the NO25. Tackled by Ken Crawley.","(0:43) Philip Rivers incomplete pass to the right intended for Tyrell Williams.","(0:48) Philip Rivers incomplete pass to the right intended for Dontrelle Inman.","(1:34) Philip Rivers pass to the right to Hunter Henry for 7 yards to the NO36. Tackled by Kenny Vaccaro.","(1:42) Philip Rivers incomplete pass to the right intended for Travis Benjamin.","(2:22) Philip Rivers pass to the middle to Dontrelle Inman for 3 yards to the NO43. Tackled by Nate Stupar.","(3:06) Philip Rivers pass to the left to Dontrelle Inman for 22 yards to the NO46. Tackled by Ken Crawley.","(3:12) Philip Rivers incomplete pass to the right intended for Travis Benjamin defensed by B.W. Webb.","(3:43) Philip Rivers pass to the middle to Dontrelle Inman for 6 yards to the SD32. Tackled by Nate Stupar.","(3:48) Thomas Morstead punts for 59 yards to SD11. Travis Benjamin return for 10 yards to SD21. Tackled by Nate Stupar. Penalty: Illegal Return OOB on New Orleans (De'Vante Harris) 5 yards.","(4:01) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Corey Liuget.","(4:05) Drew Brees incomplete pass to the middle intended for Mark Ingram.","(4:41) Drew Brees pass to the left to Coby Fleener for 2 yards to the NO30. Tackled by Melvin Ingram.","(4:52) Drew Kaser punts for 40 yards to NO28. No return.","(4:56) Philip Rivers incomplete pass to the middle intended for Hunter Henry defensed by Craig Robertson.","(5:02) Philip Rivers incomplete pass to the right intended for Tyrell Williams defensed by B.W. Webb.","(5:42) Philip Rivers pass to the right to Melvin Gordon for 6 yards to the SD32. Tackled by Nate Stupar.","(6:07) Philip Rivers pass to the right to Travis Benjamin for 10 yards to the SD26. Tackled by B.W. Webb.","(6:10) Philip Rivers incomplete pass to the left intended for Travis Benjamin.","(6:44) Philip Rivers pass to the right to Tyrell Williams for 12 yards to the SD16. Tackled by B.W. Webb.","(7:16) Melvin Gordon rush up the middle for no gain to the SD4. Tackled by Nate Stupar.","(7:29) Thomas Morstead punts for 62 yards to SD4. No return.","(7:33) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(7:37) Drew Brees incomplete pass to the left intended for Brandin Cooks defensed by Dexter McCoil.","(8:15) Mark Ingram rush up the middle for 4 yards to the NO34. Tackled by Tenny Palepoi.","(8:24) Drew Kaser punts for 40 yards to NO30. No return.","(8:28) Philip Rivers incomplete pass to the left intended for Hunter Henry.","(8:55) Philip Rivers pass to the right to Melvin Gordon for 5 yards to the SD30. Tackled by Nate Stupar.","(9:00) Philip Rivers incomplete pass to the left intended for Dontrelle Inman defensed by Ken Crawley.","(9:00) Wil Lutz kicks off to the endzone. Touchback.","(9:00) Wil Lutz extra point is good.","(9:04) John Kuhn rush up the middle for 1 yard for a TOUCHDOWN.","(9:04) San Diego Chargers timeout.","(9:44) Drew Brees pass to the right to Mark Ingram for 4 yards to the SD1. Tackled by Casey Hayward.","(9:44) New Orleans Saints timeout.","(10:22) Tommylee Lewis rush to the right for 3 yards to the SD5. Tackled by Dexter McCoil.","(10:58) Tim Hightower rush up the middle for 4 yards to the SD8. Tackled by Jatavis Brown.","(11:35) Drew Brees pass to the right to Mark Ingram for 20 yards to the SD12. Tackled by Jatavis Brown.","(12:05) Mark Ingram rush up the middle for 6 yards to the SD32. Tackled by Jason Verrett.","(12:35) Drew Brees pass to the right to Coby Fleener for 8 yards to the SD38. Tackled by Adrian Phillips and Craig Mager.","(13:14) Mark Ingram rush to the left for 2 yards to the SD46. Tackled by Joshua Perry.","(13:18) Drew Brees incomplete pass to the right intended for Michael Thomas.","(13:28) Drew Kaser punts for 47 yards to NO47. Tommylee Lewis return for 5 yards to SD48. Tackled by Darrell Stuckey.","(13:30) Penalty: Delay of Game on San Diego (Drew Kaser) -5 yards.","(13:35) Philip Rivers incomplete pass to the left intended for Melvin Gordon defensed by Kasim Edebali.","(13:58) Penalty: False Start on San Diego (Tyrell Williams) -5 yards.","(14:23) Melvin Gordon rush to the left for 1 yard to the SD16. Tackled by Craig Robertson.","(14:55) Melvin Gordon rush to the right for no gain to the SD15. Tackled by Cameron Jordan.","(15:00) Wil Lutz kicks off to the SD-6. Dexter McCluster return for 21 yards to SD15. Tackled by Kasim Edebali.","(0:07) Drew Brees rush up the middle for a loss of 1 yard to the NO23.","(0:13) Josh Lambo kicks off to the NO-1. Travaris Cadet return for 25 yards to NO24. Tackled by Jerry Attaochu and Darrell Stuckey.","(0:13) Josh Lambo extra point is good.","(0:17) Melvin Gordon rush up the middle for 1 yard for a TOUCHDOWN.","(0:17) San Diego Chargers timeout.","(0:25) Melvin Gordon rush up the middle for 4 yards to the NO1. Tackled by Craig Robertson.","(0:33) Penalty: Offside on New Orleans (Nick Fairley) 5 yards.","(0:38) Philip Rivers incomplete pass to the left intended for Hunter Henry.","(1:12) Philip Rivers pass to the left to Dexter McCluster for 2 yards to the NO10. Tackled by Ken Crawley.","(1:12) New Orleans Saints timeout.","(1:23) Philip Rivers pass to the left to Melvin Gordon for 12 yards to the NO12. Tackled by Vonn Bell and Ken Crawley.","(1:25) Philip Rivers incomplete pass to the right intended for Dontrelle Inman defensed by Paul Kruger.","(1:32) Penalty: Holding on San Diego (D.J. Fluker) -11 yards.","(1:32) New Orleans Saints timeout.","(1:42) Philip Rivers pass to the right to Melvin Gordon for 9 yards to the NO13. Tackled by Tyeler Davison.","(1:42) New Orleans Saints timeout.","(1:47) Melvin Gordon rush up the middle for 3 yards to the NO22. Tackled by Vonn Bell.","(1:49) Philip Rivers pass to the left to Melvin Gordon for 7 yards to the NO25. Tackled by Vonn Bell.","(1:49) San Diego Chargers timeout.","(2:00) Philip Rivers pass to the left to Dontrelle Inman for 12 yards to the NO32. Tackled by John Jenkins.","(2:00) Two Minute Warning.","(2:27) Melvin Gordon rush to the right for 3 yards to the NO44. Tackled by Craig Robertson.","(2:36) Thomas Morstead punts for 47 yards to NO49. Travis Benjamin return for 2 yards to NO47. Tackled by De'Vante Harris.","(3:20) Drew Brees sacked at NO2 for a loss of 10 yards by Melvin Ingram.","(3:59) Mark Ingram rush up the middle for 1 yard to the NO12. Tackled by Corey Liuget.","(4:26) Drew Brees pass to the right to Brandin Cooks for 5 yards to the NO11. Tackled by Jason Verrett.","(4:43) Penalty: Holding on New Orleans (Jahri Evans) -5 yards.","(4:50) Josh Lambo kicks off to the NO-3. Travaris Cadet return for 24 yards to NO21. Tackled by Tourek Williams. Penalty: Holding on New Orleans (John Kuhn) -10 yards.","(4:53) Josh Lambo 30 yard field goal attempt is GOOD. Holder: Drew Kaser.","(5:00) Philip Rivers incomplete pass to the left intended for Dexter McCluster.","(5:38) Melvin Gordon rush up the middle for no gain to the NO12. Tackled by Kenny Vaccaro.","(6:00) Melvin Gordon rush to the right for 4 yards to the NO12. Tackled by Vonn Bell.","(6:55) Philip Rivers pass to the right to Travis Benjamin for 25 yards to the NO16. Tackled by B.W. Webb.","(7:04) Drew Brees pass intended for Brandon Coleman INTERCEPTED by Craig Mager defensed by Jason Verrett and returned for 8 yards. Tackled by Michael Thomas.","(7:04) Josh Lambo kicks off to the endzone. Touchback.","(7:04) Josh Lambo extra point is good.","(7:15) Philip Rivers pass to the left to Dontrelle Inman for 57 yards for a TOUCHDOWN.","(7:56) Philip Rivers pass to the middle to Dontrelle Inman for 17 yards to the SD43. Tackled by Sterling Moore.","(8:38) Philip Rivers pass to the left to Melvin Gordon for 4 yards to the SD26. Tackled by Ken Crawley.","(9:20) Philip Rivers sacked at SD22 for a loss of 3 yards by Paul Kruger and Nick Fairley.","(9:20) Wil Lutz kicks off to the endzone. Touchback.","(9:20) Wil Lutz extra point is good.","(9:24) Drew Brees pass to the right to John Kuhn for 4 yards for a TOUCHDOWN.","(10:02) Daniel Lasco rush up the middle for 1 yard to the SD4. Tackled by Adrian Phillips.","(10:32) Daniel Lasco rush to the right for 6 yards to the SD5. Tackled by Jason Verrett and Nick Dzubnar.","(11:10) Daniel Lasco rush up the middle for 3 yards to the SD11. Tackled by Jerry Attaochu.","(11:37) Drew Brees pass to the left to Michael Thomas for 9 yards to the SD14. Tackled by Jason Verrett.","(12:13) Drew Brees pass to the middle to Willie Snead for 23 yards to the SD23. Tackled by Dexter McCoil.","(12:55) Drew Brees pass to the left to Mark Ingram for 7 yards to the SD46. Tackled by Jatavis Brown.","(13:37) Mark Ingram rush up the middle for a loss of 2 yards to the NO47. Tackled by Kyle Emanuel.","(14:02) Drew Brees pass to the right to Brandin Cooks for 15 yards to the NO49.","(14:05) Drew Brees incomplete pass to the middle intended for Daniel Lasco.","(14:20) Penalty: False Start on New Orleans (Jahri Evans) -5 yards.","(15:00) Tim Hightower rush to the left for 2 yards to the NO39. Tackled by Jatavis Brown.","(0:04) John Kuhn rush up the middle for 3 yards to the NO37. Tackled by Denzel Perryman.","(0:41) Daniel Lasco rush up the middle for 2 yards to the NO34. Tackled by Melvin Ingram.","(1:10) Drew Brees pass to the middle to Daniel Lasco for 7 yards to the NO32. Tackled by Jatavis Brown and Denzel Perryman.","(1:10) Josh Lambo kicks off to the endzone. Touchback.","(1:10) Josh Lambo extra point is good.","(1:15) Philip Rivers pass to the right to Hunter Henry for 20 yards for a TOUCHDOWN.","(1:45) Melvin Gordon rush to the left for 2 yards to the NO20. Tackled by Paul Kruger and John Jenkins.","(2:20) Melvin Gordon rush up the middle for 10 yards to the NO22. Tackled by Ken Crawley and David Onyemata.","(2:51) Philip Rivers pass to the right to Dexter McCluster for 7 yards to the NO32. Tackled by Vonn Bell.","(3:33) Melvin Gordon rush to the left for 4 yards to the NO39. Tackled by Craig Robertson.","(4:11) Philip Rivers pass to the middle to Hunter Henry for 16 yards to the NO43. Tackled by Sterling Moore.","(4:40) Philip Rivers pass to the middle to Dontrelle Inman for 3 yards to the SD41. Tackled by Craig Robertson.","(4:56) Thomas Morstead punts for 52 yards to SD20. Travis Benjamin return for 18 yards to SD38. Tackled by Thomas Morstead.","(5:32) Drew Brees sacked at NO28 for a loss of 5 yards by Jerry Attaochu.","(6:16) Mark Ingram rush up the middle for a loss of 6 yards to the NO33. Tackled by Brandon Mebane.","(6:49) Mark Ingram rush up the middle for 3 yards to the NO39. Tackled by Caraun Reid and Denzel Perryman.","(7:16) Drew Brees pass to the right to Coby Fleener for 9 yards to the NO36. Tackled by Dexter McCoil.","(8:01) Drew Brees pass to the middle to Mark Ingram for 3 yards to the NO27. Tackled by Jatavis Brown and Denzel Perryman.","(8:39) Tim Hightower rush up the middle for 3 yards to the NO24. Tackled by Brandon Mebane and Tenny Palepoi.","(8:44) Drew Kaser punts for 49 yards to NO14. Tommylee Lewis return for 7 yards to NO21. Tackled by Joshua Perry.","(9:09) Philip Rivers pass to the right to Travis Benjamin for 8 yards to the SD37. Tackled by Sterling Moore.","(9:51) Melvin Gordon rush to the left for a loss of 3 yards to the SD29. Tackled by Ken Crawley.","(10:26) Melvin Gordon rush up the middle for 3 yards to the SD32. Tackled by Nick Fairley.","(10:32) Wil Lutz kicks off to the SD-1. Dexter McCluster return for 30 yards to SD29. Tackled by Roman Harper.","(10:32) Wil Lutz extra point is good.","(10:36) Mark Ingram rush to the left for 1 yard for a TOUCHDOWN.","(10:58) Drew Brees pass to the left to Michael Thomas for 15 yards to the SD1. Tackled by Jason Verrett.","(11:35) Mark Ingram rush to the left for 2 yards to the SD16. Tackled by Corey Liuget.","(12:01) Drew Brees pass to the right to Michael Thomas for 15 yards to the SD18. Tackled by Dexter McCoil.","(12:10) Drew Brees incomplete pass to the right intended for Brandin Cooks.","(12:42) Mark Ingram rush to the right for 6 yards to the SD33. Tackled by Jatavis Brown.","(13:08) Drew Brees pass to the right to Brandin Cooks for 11 yards to the SD39. Tackled by Melvin Ingram.","(13:42) Drew Brees pass to the middle to Brandon Coleman for 11 yards to the NO50. Tackled by Dexter McCoil.","(13:48) Drew Brees incomplete pass to the left intended for Michael Thomas defensed by Casey Hayward.","(14:27) Mark Ingram rush to the left for 4 yards to the NO39. Tackled by Casey Hayward.","(14:58) Mark Ingram rush to the left for 10 yards to the NO35. Tackled by Craig Mager and Dexter McCoil.","(15:00) Josh Lambo kicks off to the endzone. Touchback."]