["(0:05) Drew Stanton pass intended for Larry Fitzgerald INTERCEPTED by T.J. McDonald. No return. Touchback.","(0:12) Drew Stanton incomplete pass to the right intended for Jaron Brown defensed by Trumaine Johnson.","(0:13) Drew Stanton incomplete pass to the middle.","(0:27) Drew Stanton pass to the middle to Larry Fitzgerald for 15 yards to the LA37. Tackled by Alec Ogletree.","(0:33) Drew Stanton incomplete pass to the left intended for Michael Floyd defensed by T.J. McDonald.","(0:56) Drew Stanton pass to the left to Darren Fells for 2 yards to the Ari48. Tackled by E.J. Gaines.","(1:01) Penalty: Roughing Passer on Los Angeles (Eugene Sims) 15 yards.","(1:14) Johnny Hekker punts for 41 yards to Ari16. John Brown - no return. Tackled by Malcolm Brown. Penalty: Horse Collar Tackle on Los Angeles (Malcolm Brown) 15 yards.","(1:14) Arizona Cardinals timeout.","(1:18) Todd Gurley rush to the right for 2 yards to the LA43. Tackled by Chandler Jones.","(1:18) Arizona Cardinals timeout.","(1:22) Todd Gurley rush up the middle for a loss of 4 yards to the LA41. Tackled by Calais Campbell.","(1:22) Arizona Cardinals timeout.","(1:27) Todd Gurley rush to the right for no gain to the LA45. Tackled by Josh Mauro.","(1:34) Drew Stanton pass intended for Michael Floyd INTERCEPTED by Mark Barron and returned for 1 yard.","(1:38) Drew Stanton incomplete pass to the left intended for Jaron Brown.","(1:58) Drew Stanton pass to the middle to Larry Fitzgerald for 13 yards to the Ari40. Tackled by Mark Barron.","(1:58) Two Minute Warning.","(2:03) Drew Stanton incomplete pass to the right intended for John Brown.","(2:08) Penalty: Illegal Contact on Los Angeles (Alec Ogletree) 5 yards.","(2:32) Drew Stanton pass to the right to Jaron Brown for 7 yards to the Ari22. Tackled by Mark Barron.","(2:36) Greg Zuerlein kicks off to the Ari2. Andre Ellington return for 13 yards to Ari15. Tackled by Cory Littleton.","(2:36) Greg Zuerlein extra point is good.","(2:41) Case Keenum pass to the right to Brian Quick for 4 yards for a TOUCHDOWN.","(3:27) Todd Gurley rush to the right for 5 yards to the Ari4. Tackled by Tony Jefferson.","(4:16) Case Keenum pass to the right to Todd Gurley for 8 yards to the Ari9. Tackled by Kevin Minter and Deone Bucannon.","(4:24) Case Keenum incomplete pass to the right.","(5:09) Todd Gurley rush to the right for 2 yards to the Ari17. Tackled by Tony Jefferson.","(5:26) Ryan Quigley punts for 51 yards to LA19. Tavon Austin return for 47 yards to Ari34. Tackled by Ifeanyi Momah. Penalty: Face Mask on Arizona (Ifeanyi Momah) 15 yards.","(5:40) Carson Palmer sacked at Ari30 for a loss of 9 yards by Aaron Donald and Eugene Sims.","(6:23) Carson Palmer pass to the right to Andre Ellington for 4 yards to the Ari39. Tackled by Trumaine Johnson.","(6:58) Andre Ellington rush up the middle for no gain to the Ari35. Tackled by Aaron Donald.","(7:46) Carson Palmer pass to the right to John Brown for 29 yards to the Ari35. Tackled by Mark Barron.","(8:26) David Johnson rush up the middle for 1 yard to the Ari6. Tackled by Ethan Westbrooks.","(8:34) Johnny Hekker punts for 44 yards to Ari5. No return.","(8:34) Penalty: False Start on Los Angeles (Temarrick Hemingway) -5 yards.","(8:42) Los Angeles Rams timeout.","(8:42) Case Keenum incomplete pass to the right intended for Brian Quick.","(9:15) Penalty: Illegal Plyr Downfld on Los Angeles (Greg Robinson) -5 yards.","(10:01) Case Keenum pass to the left to Todd Gurley for 8 yards to the Ari39. Tackled by D.J. Swearinger.","(10:42) Todd Gurley rush up the middle for a loss of 1 yard to the Ari47. Tackled by Kevin Minter.","(11:05) Case Keenum rush up the middle for 13 yards to the Ari46. Tackled by Deone Bucannon.","(11:11) Case Keenum incomplete pass to the left intended for Lance Kendricks.","(11:23) David Johnson rush up the middle for 1 yard to the LA41. Tackled by Dominique Easley. FUMBLE, recovered by LA (Josh Forrest). Tackled by David Johnson.","(11:45) Chris Johnson rush to the left for 7 yards to the LA42. Tackled by E.J. Gaines.","(12:22) Carson Palmer pass to the left to Larry Fitzgerald for 12 yards to the LA49. Tackled by Maurice Alexander.","(12:29) Case Keenum incomplete pass to the left intended for Brian Quick defensed by Patrick Peterson.","(13:01) Case Keenum pass to the left to Todd Gurley for a loss of 4 yards to the Ari39. Tackled by Tyrann Mathieu.","(13:39) Case Keenum pass to the right to Tavon Austin for 6 yards to the Ari35. Tackled by Tyrann Mathieu.","(14:20) Todd Gurley rush to the left for 3 yards to the Ari41. Tackled by Tony Jefferson.","(15:00) Case Keenum pass to the left to Kenny Britt for 31 yards to the Ari44. Tackled by Marcus Cooper and Deone Bucannon.","(15:00) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:04) Chandler Catanzaro 21 yard field goal attempt is GOOD. Holder: Ryan Quigley.","(0:09) Carson Palmer incomplete pass to the left intended for John Brown defensed by E.J. Gaines.","(0:15) Carson Palmer incomplete pass to the right.","(0:56) David Johnson rush up the middle for 1 yard to the LA3. Tackled by Michael Brockers.","(1:34) Carson Palmer pass to the right to David Johnson for 24 yards to the LA4. Tackled by Alec Ogletree and Maurice Alexander.","(1:47) Penalty: False Start on Arizona (D.J. Humphries) -5 yards.","(2:24) David Johnson rush up the middle for 3 yards to the LA23. Tackled by Matt Longacre.","(3:03) David Johnson rush up the middle for 11 yards to the LA26. Tackled by Mark Barron.","(3:10) Carson Palmer pass to the right to J.J. Nelson for 24 yards to the LA37.","(3:17) Carson Palmer incomplete pass to the left intended for Jermaine Gresham defensed by E.J. Gaines.","(3:53) David Johnson rush up the middle for 3 yards to the Ari39. Tackled by Lamarcus Joyner.","(4:20) Carson Palmer pass to the left to Michael Floyd for 15 yards to the Ari36.","(5:05) Chris Johnson rush to the left for a loss of 4 yards to the Ari21. Tackled by Matt Longacre and E.J. Gaines.","(5:17) Johnny Hekker punts for 43 yards to Ari21. John Brown return for 4 yards to Ari25. Tackled by Jake McQuaide.","(5:53) Case Keenum sacked at LA36 for a loss of 14 yards by Markus Golden.","(5:58) Case Keenum incomplete pass to the left intended for Brian Quick.","(6:14) Penalty: False Start on Los Angeles (Cody Wichmann) -5 yards.","(6:45) Penalty: Holding on Los Angeles (Greg Robinson) -10 yards.","(7:26) Case Keenum rush to the right for 2 yards to the Ari35. Tackled by Tony Jefferson.","(8:04) Case Keenum pass to the right to Lance Kendricks for 10 yards to the Ari37. Tackled by Tony Jefferson.","(8:12) Case Keenum incomplete pass to the left intended for Brian Quick.","(8:18) Penalty: Offside on Arizona (Josh Mauro) 5 yards.","(8:57) Todd Gurley rush up the middle for 3 yards to the LA48. Tackled by Ed Stinson.","(9:15) Case Keenum pass to the left to Kenny Britt for 11 yards to the LA45. Tackled by Tyvon Branch.","(9:56) Todd Gurley rush to the left for 3 yards to the LA34. Tackled by Ed Stinson.","(10:32) Todd Gurley rush up the middle for no gain to the LA31. Tackled by Josh Mauro.","(10:40) Carson Palmer sacked at LA31 for a loss of 5 yards by Aaron Donald. FUMBLE, recovered by LA (Eugene Sims). Tackled by David Johnson.","(11:20) Larry Fitzgerald rush to the left for 1 yard to the LA26. Tackled by E.J. Gaines.","(11:54) Carson Palmer pass to the left to John Brown for 20 yards to the LA27. Tackled by Maurice Alexander.","(12:35) David Johnson rush up the middle for 5 yards to the LA47. Tackled by Lamarcus Joyner.","(13:12) David Johnson rush to the right for no gain to the Ari48. Tackled by Trumaine Johnson.","(13:21) Case Keenum sacked at Ari48 for a loss of 5 yards by Chandler Jones. FUMBLE, recovered by Ari (Chandler Jones). Tackled by Greg Robinson.","(14:05) Case Keenum pass to the right to Todd Gurley for 33 yards to the Ari43. Tackled by Marcus Cooper.","(14:44) Todd Gurley rush up the middle for 3 yards to the LA24. Tackled by Alex Okafor.","(14:54) Los Angeles Rams timeout.","(14:54) Case Keenum incomplete pass to the middle intended for Tavon Austin.","(15:00) Chandler Catanzaro kicks off to the LA-5. Benny Cunningham return for 26 yards to LA21. Tackled by Tyvon Branch.","(0:24) Case Keenum rush up the middle for a loss of 1 yard to the LA24.","(0:24) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:24) Chandler Catanzaro extra point is good.","(0:29) Carson Palmer pass to the left to Michael Floyd for 5 yards for a TOUCHDOWN.","(0:53) Carson Palmer pass to the left to Michael Floyd for 16 yards to the LA5. Tackled by Alec Ogletree.","(0:53) Arizona Cardinals timeout.","(1:01) Carson Palmer pass to the left to John Brown for 18 yards to the LA21. Tackled by E.J. Gaines.","(1:01) Arizona Cardinals timeout.","(1:08) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Trumaine Johnson.","(1:30) Carson Palmer pass to the left to John Brown for 20 yards to the LA39. Tackled by Lamarcus Joyner.","(1:38) Carson Palmer pass to the right to John Brown for 15 yards to the Ari41. Tackled by Trumaine Johnson.","(1:42) Carson Palmer incomplete pass to the right intended for John Brown defensed by Trumaine Johnson.","(1:48) Carson Palmer pass to the left to David Johnson for 6 yards to the Ari26. Tackled by Mark Barron.","(1:56) Johnny Hekker punts for 53 yards to Ari20. No return.","(2:00) Case Keenum incomplete pass to the left intended for Tavon Austin.","(2:00) Two Minute Warning.","(2:15) Case Keenum pass to the middle to Todd Gurley for 4 yards to the LA27. Tackled by Alex Okafor.","(2:53) Todd Gurley rush to the right for 3 yards to the LA23. Tackled by Chandler Jones.","(3:00) Carson Palmer pass intended for John Brown INTERCEPTED by Trumaine Johnson. No return. Touchback.","(3:28) Carson Palmer pass to the left to John Brown for 7 yards to the LA33. Tackled by E.J. Gaines.","(4:10) Carson Palmer pass to the left to Darren Fells for 5 yards to the LA40. Tackled by Mark Barron.","(4:23) Johnny Hekker punts for 55 yards to Ari36. John Brown return for 19 yards to LA45. Tackled by Cody Davis.","(4:27) Case Keenum incomplete pass to the left intended for Lance Kendricks.","(5:09) Case Keenum pass to the left to Lance Kendricks for 5 yards to the LA9. Tackled by Kevin Minter.","(5:49) Todd Gurley rush up the middle for 1 yard to the LA4. Tackled by Markus Golden.","(6:00) Ryan Quigley punts for 40 yards to LA3. No return.","(6:04) Carson Palmer incomplete pass to the right intended for Chris Johnson.","(6:25) Penalty: False Start on Arizona (A.Q. Shipley) -5 yards.","(7:09) Carson Palmer pass to the right to John Brown for 10 yards to the LA38. Tackled by Trumaine Johnson.","(7:50) David Johnson rush to the right for a loss of 3 yards to the LA48. Tackled by Eugene Sims.","(8:34) David Johnson rush to the right for 31 yards to the LA45. Tackled by Maurice Alexander.","(8:42) Greg Zuerlein kicks off to the Ari-1. Andre Ellington return for 25 yards to Ari24. Tackled by Benny Cunningham.","(8:46) Greg Zuerlein 29 yard field goal attempt is GOOD. Holder: Johnny Hekker.","(9:00) Case Keenum pass to the left to Tavon Austin for 8 yards to the Ari11. Tackled by Patrick Peterson.","(9:06) Case Keenum incomplete pass to the left intended for Tyler Higbee.","(9:44) Todd Gurley rush up the middle for 1 yard to the Ari19. Tackled by Ed Stinson.","(10:18) Case Keenum pass to the right to Kenny Britt for 34 yards to the Ari20. Tackled by Tony Jefferson.","(10:53) Case Keenum pass to the right to Lance Kendricks for 4 yards to the LA46. Tackled by Kevin Minter.","(11:36) Tavon Austin rush to the left for a loss of 6 yards to the LA42. Tackled by Tony Jefferson.","(12:18) Case Keenum pass to the right to Lance Kendricks for 23 yards to the LA48. Tackled by Kevin Minter.","(12:19) Chandler Catanzaro kicks off to the endzone. Touchback.","(12:23) Chandler Catanzaro 25 yard field goal attempt is GOOD. Holder: Ryan Quigley.","(13:10) Carson Palmer pass to the right to David Johnson for 5 yards to the LA7. Tackled by E.J. Gaines.","(13:50) Carson Palmer pass to the right to David Johnson for 6 yards to the LA12. Tackled by Michael Brockers.","(13:57) Chris Johnson rush to the right for 5 yards to the LA8. Penalty: Holding on Arizona (Jermaine Gresham) -10 yards.","(14:03) Carson Palmer incomplete pass to the left intended for John Brown defensed by Cody Davis.","(14:26) Chris Johnson rush to the left for 18 yards to the LA27. Tackled by Mark Barron. Penalty: Unnecessary Roughness on Los Angeles (Mark Barron) 14 yards.","(15:00) Chris Johnson rush to the right for 8 yards to the LA45. Tackled by Eugene Sims.","(0:34) Carson Palmer pass to the left to Larry Fitzgerald for 10 yards to the Ari47. Tackled by Troy Hill.","(0:40) Carson Palmer incomplete pass to the right intended for Jaron Brown.","(1:17) Chris Johnson rush up the middle for no gain to the Ari37. Tackled by Mark Barron.","(1:53) Carson Palmer pass to the left to Larry Fitzgerald for 12 yards to the Ari37. Tackled by Lamarcus Joyner.","(1:59) Carson Palmer incomplete pass to the left intended for John Brown.","(1:59) Greg Zuerlein kicks off to the endzone. Touchback.","(1:59) Greg Zuerlein extra point is good.","(2:11) Case Keenum pass to the right to Brian Quick for 65 yards for a TOUCHDOWN.","(2:15) Case Keenum incomplete pass to the middle intended for Tavon Austin.","(2:57) Todd Gurley rush to the right for 3 yards to the LA35. Tackled by Corey Peters.","(3:28) Penalty: Holding on Arizona (Patrick Peterson) 5 yards.","(3:34) Case Keenum incomplete pass to the right intended for Tavon Austin.","(4:12) Todd Gurley rush to the right for 5 yards to the LA27. Tackled by Deone Bucannon.","(4:50) Case Keenum pass to the right to Lance Kendricks for 10 yards to the LA22. Tackled by Tony Jefferson.","(5:27) Todd Gurley rush up the middle for 2 yards to the LA12. Tackled by Chandler Jones.","(5:36) Ryan Quigley punts for 41 yards to LA0. Touchback. Penalty: Holding on Los Angeles (Troy Hill) -10 yards.","(5:42) Carson Palmer incomplete pass to the right intended for Jaron Brown defensed by Trumaine Johnson.","(6:21) Carson Palmer sacked at LA41 for a loss of 9 yards by Maurice Alexander.","(6:27) Carson Palmer incomplete pass to the middle intended for Larry Fitzgerald.","(7:10) David Johnson rush up the middle for 2 yards to the LA32. Tackled by Aaron Donald.","(7:46) David Johnson rush up the middle for 3 yards to the LA34. Tackled by Alec Ogletree and Troy Hill.","(8:24) David Johnson rush up the middle for 6 yards to the LA37. Tackled by Alec Ogletree.","(9:04) David Johnson rush up the middle for 8 yards to the LA43. Tackled by Cody Davis.","(9:39) Carson Palmer pass to the right to John Brown for 8 yards to the Ari49. Tackled by Trumaine Johnson.","(10:19) David Johnson rush to the right for 10 yards to the Ari41. Tackled by Alec Ogletree and Eugene Sims.","(10:50) Carson Palmer pass to the left to John Brown for 14 yards to the Ari31. Tackled by Troy Hill.","(11:22) David Johnson rush to the left for 3 yards to the Ari17. Tackled by Troy Hill.","(11:32) Johnny Hekker punts for 41 yards to Ari14. No return.","(12:07) Todd Gurley rush to the right for a loss of 1 yard to the LA45. Tackled by Tony Jefferson.","(12:46) Case Keenum pass to the right to Kenny Britt for 6 yards to the LA46. Tackled by Marcus Cooper.","(13:23) Todd Gurley rush to the right for 3 yards to the LA40. Tackled by Deone Bucannon.","(13:32) Ryan Quigley punts for 37 yards to LA37. No return.","(13:39) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Trumaine Johnson.","(14:24) David Johnson rush to the right for a loss of 2 yards to the Ari26. Tackled by Aaron Donald.","(15:00) Carson Palmer pass to the right to John Brown for 3 yards to the Ari28. Tackled by T.J. McDonald.","(15:00) Greg Zuerlein kicks off to the endzone. Touchback."]