["(0:02) Andrew Luck pass to the middle to Josh Ferguson for 5 yards to the Ind22. Lateral to Chester Rogers for a loss of 3 yards to the Ind19. Tackled by Yannick Ngakoue. FUMBLE, recovered by Ind (Andrew Luck) and advanced for a loss of 1 yard. Lateral to Phillip Dorsett for a loss of 4 yards to the Ind14. Tackled by Prince Amukamara.","(0:02) Andrew Luck incomplete pass to the right.","(0:19) Andrew Luck sacked at Ind17 for a loss of 3 yards by Sen'Derrick Marks.","(0:26) Andrew Luck pass to the left to Josh Ferguson for 2 yards to the Ind20. Tackled by Jalen Ramsey.","(0:38) Brad Nortman punts for 38 yards to Ind18. No return.","(1:27) Penalty: Delay of Game on Jacksonville (Brad Nortman) -5 yards.","(1:27) T.J. Yeldon rush to the right for 3 yards to the Jax49. Tackled by Josh McNary.","(1:27) Indianapolis Colts timeout.","(1:31) T.J. Yeldon rush to the right for a loss of 2 yards to the Jax46. Tackled by David Parry.","(1:31) Indianapolis Colts timeout.","(1:36) T.J. Yeldon rush to the left for a loss of 1 yard to the Jax48. Tackled by Zach Kerr.","(1:42) Andrew Luck incomplete pass to the left intended for Dwayne Allen defensed by Josh Johnson.","(1:48) Andrew Luck pass to the left to T.Y. Hilton for 9 yards to the Jax49. Tackled by Prince Amukamara.","(1:53) Andrew Luck incomplete pass to the right intended for Phillip Dorsett.","(2:00) Andrew Luck incomplete pass to the right intended for Josh Ferguson.","(2:00) Two Minute Warning.","(2:08) Andrew Luck pass to the left to Chester Rogers for 23 yards to the Ind42. Tackled by Paul Posluszny.","(2:31) Andrew Luck pass to the right to Josh Ferguson for a loss of 1 yard to the Ind19. Tackled by Malik Jackson.","(2:41) Brad Nortman punts for 78 yards to Ind0. Touchback.","(2:45) Blake Bortles incomplete pass to the right intended for Marqise Lee defensed by Kendall Langford.","(2:45) Indianapolis Colts timeout.","(2:51) T.J. Yeldon rush to the right for 3 yards to the Jax22. Tackled by Erik Walden.","(2:56) Blake Bortles pass to the right to Arrelious Benn for 1 yard to the Jax19. Tackled by Mike Adams.","(3:03) Pat McAfee kicks off to the Jax9. Corey Grant return for 9 yards to Jax18. Tackled by Edwin Jackson.","(3:03) Adam Vinatieri extra point is good.","(3:10) Andrew Luck pass to the right to Phillip Dorsett for 64 yards for a TOUCHDOWN.","(3:42) Andrew Luck sacked at Ind36 for a loss of 4 yards by Chris Smith.","(4:05) Andrew Luck pass to the left to Josh Ferguson for 4 yards to the Ind40. Tackled by Josh Johnson.","(4:32) Andrew Luck pass to the right to Jack Doyle for 6 yards to the Ind36. Tackled by Johnathan Cyprien.","(4:58) Andrew Luck pass to the right to Josh Ferguson for 5 yards to the Ind30. Tackled by Prince Amukamara.","(5:03) Andrew Luck incomplete pass to the middle intended for Josh Ferguson.","(5:03) Jason Myers kicks off to the endzone. Touchback.","(5:03) Jason Myers extra point is good.","(5:15) Blake Bortles pass to the right to Allen Hurns for 42 yards for a TOUCHDOWN.","(5:57) Chris Ivory rush to the right for 2 yards to the Ind42. Tackled by Robert Mathis.","(6:29) Blake Bortles pass to the left to T.J. Yeldon for 15 yards to the Ind44. Tackled by Clayton Geathers.","(7:06) Blake Bortles pass to the left to T.J. Yeldon for 16 yards to the Jax41. Tackled by Sio Moore.","(7:06) Pat McAfee kicks off to the endzone. Touchback.","(7:06) Adam Vinatieri extra point is good.","(7:13) Andrew Luck pass to the right to T.Y. Hilton for 2 yards for a TOUCHDOWN.","(7:37) Andrew Luck pass to the right to T.Y. Hilton for no gain to the Jax2.","(8:17) Andrew Luck pass to the middle to Robert Turbin for 1 yard to the Jax2. Tackled by Paul Posluszny.","(8:55) Robert Turbin rush to the left for 2 yards to the Jax3. Tackled by Chris Smith.","(9:22) Andrew Luck rush to the left for 7 yards to the Jax5. Tackled by Josh Johnson.","(10:00) Frank Gore rush to the right for 2 yards to the Jax12. Tackled by Johnathan Cyprien and Abry Jones.","(10:06) Penalty: Pass Interference on Jacksonville (Davon House) 24 yards.","(10:12) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(10:37) Andrew Luck pass to the left to Frank Gore for 14 yards to the Jax38. Tackled by Josh Johnson.","(11:01) Andrew Luck rush to the left for 6 yards to the Ind48. Tackled by Telvin Smith.","(11:30) Andrew Luck pass to the left to T.Y. Hilton for 14 yards to the Ind42. Tackled by Yannick Ngakoue.","(12:16) Andrew Luck pass to the right to Josh Ferguson for 9 yards to the Ind28. Tackled by Telvin Smith.","(12:37) Josh Ferguson rush to the left for a loss of 3 yards to the Ind19. Tackled by Telvin Smith.","(12:50) Brad Nortman punts for 58 yards to Ind8. Quan Bray return for 14 yards to Ind22. Tackled by Peyton Thompson.","(12:54) Blake Bortles incomplete pass to the right intended for Bryan Walters.","(13:02) Blake Bortles incomplete pass to the left intended for Allen Robinson defensed by Vontae Davis.","(13:32) Blake Bortles pass to the left to Marqise Lee for 3 yards to the Jax34. Tackled by Erik Walden.","(14:04) Blake Bortles pass to the right to Neal Sterling for 10 yards to the Jax31. Tackled by Rashaan Melvin.","(14:39) T.J. Yeldon rush to the right for 3 yards to the Jax21. Tackled by Hassan Ridgeway.","(14:43) Blake Bortles incomplete pass to the right intended for Arrelious Benn.","(14:48) Pat McAfee kicks off to the Jax0. Corey Grant return for 18 yards to Jax18. Tackled by Akeem Ayers.","(14:48) Adam Vinatieri extra point is good.","(14:48) Penalty: False Start on Indianapolis (Pat McAfee) -5 yards.","(14:52) Frank Gore rush to the left for 1 yard for a TOUCHDOWN.","(15:00) Penalty: Pass Interference on Jacksonville (Johnathan Cyprien) 35 yards.","(0:21) Frank Gore rush to the right for a loss of 4 yards to the Jax36. Tackled by Sheldon Day.","(0:44) Andrew Luck pass to the middle to Dwayne Allen for 7 yards to the Jax32. Tackled by Johnathan Cyprien.","(0:44) Penalty: Offside on Jacksonville (Dante Fowler Jr.) 5 yards.","(0:49) Andrew Luck incomplete pass to the left intended for Robert Turbin defensed by Malik Jackson.","(1:18) Josh Ferguson rush to the right for no gain to the Jax44. Tackled by Malik Jackson.","(1:44) Andrew Luck pass to the left to Chester Rogers for 19 yards to the Jax44. Tackled by Tashaun Gipson.","(2:09) Andrew Luck pass to the right to Frank Gore for 1 yard to the Ind37. Tackled by Dante Fowler Jr..","(2:32) Andrew Luck pass to the right to Frank Gore for 6 yards to the Ind36. Tackled by Paul Posluszny.","(2:51) Frank Gore rush to the left for 5 yards to the Ind30. Tackled by Telvin Smith.","(2:51) Jason Myers kicks off to the endzone. Touchback.","(2:55) Jason Myers 49 yard field goal attempt is GOOD. Holder: Brad Nortman.","(3:01) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Rashaan Melvin.","(3:32) Chris Ivory rush to the left for a loss of 1 yard to the Ind31. Tackled by Sio Moore.","(4:06) Chris Ivory rush to the right for 5 yards to the Ind30. Tackled by D'Qwell Jackson.","(4:39) Blake Bortles pass to the right to T.J. Yeldon for 4 yards to the Ind35. Tackled by D'Qwell Jackson.","(5:24) Blake Bortles pass to the left to Allen Robinson for 15 yards to the Ind39. Tackled by Vontae Davis.","(6:06) Blake Bortles sacked at Jax46 for a loss of 4 yards by Erik Walden.","(6:45) Chris Ivory rush to the right for a loss of 4 yards to the Jax50. Tackled by D'Qwell Jackson.","(7:26) Chris Ivory rush to the left for 13 yards to the Ind46. Tackled by Mike Adams.","(8:01) Chris Ivory rush to the left for 4 yards to the Jax41. Tackled by Kendall Langford.","(8:31) Blake Bortles sacked at Jax20 for a loss of 5 yards by Akeem Ayers. Penalty: Unnecessary Roughness on Indianapolis (Curt Maggitt) 17 yards.","(9:02) T.J. Yeldon rush to the left for 1 yard to the Jax25. Tackled by Akeem Ayers.","(9:36) T.J. Yeldon rush to the left for 13 yards to the Jax24. Tackled by Mike Adams.","(9:39) Blake Bortles incomplete pass to the left intended for Marqise Lee.","(9:51) Pat McAfee punts for 54 yards to Jax21. Rashad Greene - no return. Tackled by Clayton Geathers. Penalty: Holding on Jacksonville (Josh Johnson) -10 yards.","(10:29) Andrew Luck sacked at Ind25 for a loss of 12 yards by Paul Posluszny.","(11:12) Frank Gore rush to the left for 1 yard to the Ind37. Tackled by Roy Miller III.","(11:45) Frank Gore rush to the left for 7 yards to the Ind36. Tackled by Yannick Ngakoue.","(11:50) Jason Myers kicks off to the Ind1. Jordan Todman return for 28 yards to Ind29. Tackled by Arrelious Benn.","(11:55) Jason Myers 46 yard field goal attempt is GOOD. Holder: Brad Nortman.","(11:59) Blake Bortles incomplete pass to the left intended for Allen Robinson defensed by Vontae Davis.","(12:39) Blake Bortles pass to the left to Allen Hurns for 5 yards to the Ind28. Tackled by Vontae Davis.","(12:47) Blake Bortles incomplete pass to the middle intended for Allen Hurns defensed by Henry Anderson.","(13:19) Blake Bortles pass to the right to Rashad Greene for 8 yards to the Ind33. Tackled by Patrick Robinson.","(13:57) Chris Ivory rush to the right for 8 yards to the Ind41. Tackled by Patrick Robinson.","(14:28) Blake Bortles pass to the right to Marqise Lee for 13 yards to the Ind49. Tackled by Rashaan Melvin.","(14:34) Blake Bortles incomplete pass to the left intended for Allen Robinson.","(14:54) T.J. Yeldon rush to the left for 9 yards to the Jax38. Tackled by Sio Moore.","(15:00) Pat McAfee kicks off to the Jax1. Corey Grant return for 28 yards to Jax29. Tackled by Erik Swoope.","(0:02) Jason Myers 22 yard field goal attempt is GOOD. Holder: Brad Nortman.","(0:07) Blake Bortles pass to the left to Marqise Lee for 3 yards to the Ind5.","(0:12) Penalty: Holding on Indianapolis (Antonio Cromartie) 5 yards.","(0:17) Blake Bortles pass to the right to Allen Robinson for 15 yards to the Ind13. Tackled by Patrick Robinson.","(0:17) Jacksonville Jaguars timeout.","(0:24) Blake Bortles sacked at Ind28 for a loss of 3 yards by Hassan Ridgeway and Zach Kerr.","(0:27) Penalty: Pass Interference on Indianapolis (Antonio Cromartie) 12 yards.","(0:32) Blake Bortles pass to the right to Allen Robinson for 5 yards to the Ind37. Tackled by Antonio Cromartie.","(0:36) Penalty: Unnecessary Roughness on Indianapolis (T.J. Green) 15 yards.","(0:40) Blake Bortles pass to the right to Marqise Lee for 9 yards to the Jax43. Tackled by Antonio Cromartie.","(0:40) Jacksonville Jaguars timeout.","(0:44) Blake Bortles rush to the right for 6 yards to the Jax34. Tackled by Josh McNary.","(1:06) T.J. Yeldon rush to the right for 8 yards to the Jax28. Tackled by Josh McNary.","(1:13) Pat McAfee punts for 46 yards to Jax0. Touchback.","(1:20) Andrew Luck incomplete pass to the left intended for T.Y. Hilton.","(2:00) Andrew Luck pass to the right to Josh Ferguson for 9 yards to the Jax46. Tackled by Malik Jackson.","(2:00) Two Minute Warning.","(2:30) Andrew Luck sacked at Ind45 for a loss of 8 yards by Tyson Alualu.","(3:08) Frank Gore rush to the right for 4 yards to the Jax47. Tackled by Tyson Alualu and Myles Jack.","(3:34) Andrew Luck pass to the left to T.Y. Hilton for 7 yards to the Ind49. Tackled by Jalen Ramsey.","(4:09) Frank Gore rush to the right for 17 yards to the Ind42. Tackled by Myles Jack.","(4:09) Jason Myers kicks off to the endzone. Touchback.","(4:09) Jason Myers extra point is good.","(4:13) Blake Bortles rush to the right for 1 yard for a TOUCHDOWN.","(4:16) Blake Bortles incomplete pass to the right intended for Allen Robinson defensed by Clayton Geathers.","(4:22) Penalty: Pass Interference on Indianapolis (Patrick Robinson) 19 yards.","(4:26) Blake Bortles incomplete pass to the right intended for Allen Hurns.","(4:53) Blake Bortles pass to the left to Marcedes Lewis for 12 yards to the Ind20. Tackled by Mike Adams.","(6:01) Blake Bortles rush to the left for 8 yards to the Ind32. Tackled by D'Qwell Jackson.","(6:29) Blake Bortles pass to the right to Allen Robinson for 17 yards to the Ind40. Tackled by Antonio Cromartie.","(6:55) T.J. Yeldon rush to the left for a loss of 3 yards to the Jax43. Tackled by Kendall Langford.","(7:34) Blake Bortles rush to the right for 9 yards to the Jax46. Tackled by Antonio Morrison.","(8:11) T.J. Yeldon rush to the left for 8 yards to the Jax37. Tackled by Akeem Ayers.","(8:53) Blake Bortles rush to the right for 4 yards to the Jax29. Tackled by D'Qwell Jackson.","(8:53) Pat McAfee kicks off to the endzone. Touchback.","(8:57) Adam Vinatieri 49 yard field goal attempt is GOOD. Holder: Pat McAfee.","(9:01) Andrew Luck incomplete pass to the middle intended for Phillip Dorsett.","(9:01) Indianapolis Colts timeout.","(9:28) Penalty: False Start on Indianapolis (Dwayne Allen) -5 yards.","(10:15) Andrew Luck pass to the right to Frank Gore for 1 yard to the Jax26. Tackled by Telvin Smith.","(10:56) Frank Gore rush to the left for 8 yards to the Jax27. Tackled by Telvin Smith.","(11:03) Penalty: Pass Interference on Jacksonville (Davon House) 20 yards.","(11:44) Andrew Luck sacked at Ind45 for a loss of 7 yards by Yannick Ngakoue.","(12:27) Josh Ferguson rush to the right for 1 yard to the Jax48. Tackled by Sen'Derrick Marks.","(13:09) Andrew Luck pass to the right to Dwayne Allen for 13 yards to the Jax49. Tackled by Josh Johnson and Paul Posluszny.","(13:45) Andrew Luck pass to the left to Robert Turbin for 2 yards to the Ind38. Tackled by Johnathan Cyprien.","(14:26) Frank Gore rush to the left for 2 yards to the Ind36. Tackled by Malik Jackson.","(15:00) Frank Gore rush to the left for 5 yards to the Ind34. Tackled by Myles Jack.","(0:03) Frank Gore rush to the left for 4 yards to the Ind29. Tackled by Roy Miller III.","(0:14) Brad Nortman punts for 50 yards to Ind21. Quan Bray return for 4 yards to Ind25. Tackled by Hayes Pullard III.","(0:40) Blake Bortles pass to the middle to T.J. Yeldon for 11 yards to the Jax29. Tackled by Antonio Cromartie.","(0:44) Blake Bortles incomplete pass to the left intended for Chris Ivory defensed by Hassan Ridgeway.","(1:08) Penalty: Holding on Jacksonville (Neal Sterling) -10 yards.","(1:45) Chris Ivory rush to the right for 2 yards to the Jax28. Tackled by D'Qwell Jackson.","(1:50) Pat McAfee kicks off to the Jax1. Corey Grant return for 25 yards to Jax26. Tackled by Josh Ferguson.","(1:54) Adam Vinatieri 53 yard field goal attempt is GOOD. Holder: Pat McAfee.","(1:58) Andrew Luck incomplete pass to the middle intended for Chester Rogers.","(2:02) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(2:47) Andrew Luck sacked at Jax35 for a loss of 10 yards by Josh Johnson and Paul Posluszny.","(3:32) Andrew Luck rush to the right for 4 yards to the Jax25. Tackled by Dante Fowler Jr..","(4:14) Phillip Dorsett rush to the left for 3 yards to the Jax29. Tackled by Jalen Ramsey.","(4:59) Andrew Luck pass to the right to T.Y. Hilton for 4 yards to the Jax32. Tackled by Abry Jones.","(5:42) Andrew Luck pass to the right to T.Y. Hilton for 6 yards to the Jax36. Tackled by Telvin Smith.","(5:48) Andrew Luck incomplete pass to the left intended for Frank Gore defensed by Myles Jack.","(6:31) Andrew Luck rush up the middle for 6 yards to the Jax42. Tackled by Telvin Smith.","(7:16) Frank Gore rush to the right for 4 yards to the Jax48. Tackled by Myles Jack.","(7:54) Frank Gore rush to the left for 7 yards to the Ind48. Tackled by Paul Posluszny.","(8:17) Penalty: Illegal Contact on Jacksonville (Jalen Ramsey) 5 yards.","(8:23) Jason Myers kicks off to the Ind-3. Quan Bray return for 39 yards to Ind36. Tackled by Arthur Brown.","(8:23) Jason Myers extra point is good.","(8:27) Blake Bortles pass to the left to Allen Robinson for 3 yards for a TOUCHDOWN.","(8:54) T.J. Yeldon rush to the right for 15 yards to the Ind3. Tackled by Mike Adams. FUMBLE, recovered by Jax.","(9:22) Blake Bortles rush to the right for 6 yards to the Ind18. Tackled by Antonio Morrison.","(9:22) Jacksonville Jaguars timeout.","(9:52) Penalty: Holding on Jacksonville (Marcedes Lewis) -10 yards.","(10:28) T.J. Yeldon rush to the right for 10 yards to the Ind14. Tackled by Clayton Geathers.","(10:33) Blake Bortles incomplete pass to the right intended for T.J. Yeldon defensed by Kendall Langford.","(10:39) Andrew Luck pass INTERCEPTED by Yannick Ngakoue defensed by Dante Fowler Jr. and returned for 9 yards. Tackled by Anthony Castonzo.","(10:44) Andrew Luck incomplete pass to the middle intended for Dwayne Allen.","(11:23) Frank Gore rush to the left for 2 yards to the Ind42. Tackled by Malik Jackson.","(11:50) Penalty: Face Mask on Jacksonville (Tyson Alualu) 15 yards.","(11:58) Brad Nortman punts for 45 yards to Ind25. No return.","(12:10) Penalty: False Start on Jacksonville (Peyton Thompson) -6 yards.","(12:51) Blake Bortles rush up the middle for 2 yards to the Jax36. Tackled by T.J. Green.","(12:55) Blake Bortles incomplete pass to the left intended for Marcedes Lewis.","(13:30) T.J. Yeldon rush to the right for 4 yards to the Jax34. Tackled by Sio Moore.","(13:41) Pat McAfee punts for 49 yards to Jax18. Rashad Greene return for 12 yards to Jax30. Tackled by Jordan Todman.","(13:45) Andrew Luck incomplete pass to the left intended for Josh Ferguson.","(14:28) Andrew Luck pass to the left to Frank Gore for 5 yards to the Ind33. Tackled by Jalen Ramsey.","(15:00) Frank Gore rush to the left for 3 yards to the Ind28. Tackled by Johnathan Cyprien.","(15:00) Jason Myers kicks off to the endzone. Touchback."]