["(0:17) Russell Wilson rush up the middle for a loss of 1 yard to the Sea46.","(0:48) Russell Wilson rush up the middle for a loss of 1 yard to the Sea47.","(0:55) Ryan Fitzpatrick pass intended for Brandon Marshall INTERCEPTED by Richard Sherman and returned for 6 yards. Penalty: Illegal Block on Seattle (Michael Bennett) -10 yards.","(0:59) Ryan Fitzpatrick incomplete pass to the middle intended for Bilal Powell.","(1:19) Bilal Powell rush up the middle for 8 yards to the NYJ30. Tackled by Bobby Wagner and K.J. Wright.","(1:21) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(1:41) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 9 yards to the NYJ22. Tackled by Bobby Wagner and Earl Thomas.","(1:51) Jon Ryan punts for 34 yards to NYJ13. No return.","(1:55) Russell Wilson incomplete pass to the right intended for Luke Willson.","(1:55) New York Jets timeout.","(2:00) Christine Michael rush to the left for no gain to the NYJ47. Tackled by Darron Lee.","(2:00) Two Minute Warning.","(2:14) Christine Michael rush up the middle for 6 yards to the NYJ47. Tackled by Erin Henderson.","(2:15) Nick Folk onside kickoff to the Sea47. Onside kick recovered by receiving team by Jimmy Graham.","(2:15) Nick Folk extra point is good.","(2:25) Ryan Fitzpatrick sacked at Sea45 for no gain by Cliff Avril. FUMBLE, recovered by NYJ (Charone Peake) and advanced for 42 yards for a TOUCHDOWN.","(2:45) Ryan Fitzpatrick pass to the right to Robby Anderson for 7 yards to the Sea45. Tackled by Deshawn Shead.","(2:51) Ryan Fitzpatrick incomplete pass to the right intended for Robby Anderson.","(3:15) Ryan Fitzpatrick pass to the right to Charone Peake for 9 yards to the NYJ48. Tackled by Richard Sherman.","(3:20) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(3:42) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 8 yards to the NYJ39. Tackled by Jeremy Lane.","(4:04) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 6 yards to the NYJ31. Tackled by Earl Thomas.","(4:04) Steven Hauschka kicks off to the endzone. Touchback.","(4:08) Steven Hauschka 53 yard field goal attempt is GOOD. Holder: Jon Ryan.","(4:08) Seattle Seahawks timeout.","(4:55) Russell Wilson sacked at NYJ35 for a loss of 14 yards by Buster Skrine.","(5:36) C.J. Spiller rush to the left for a loss of 1 yard to the NYJ21. Tackled by Steve McLendon.","(5:42) Russell Wilson incomplete pass to the left intended for Christine Michael.","(5:49) Ryan Fitzpatrick pass intended for Robby Anderson INTERCEPTED by Earl Thomas. No return. Tackled by Robby Anderson.","(5:56) Jon Ryan punts for 34 yards to NYJ9. No return.","(5:59) Russell Wilson incomplete pass to the right intended for Tyler Lockett defensed by Muhammad Wilkerson.","(5:59) Seattle Seahawks timeout.","(6:44) Alex Collins rush to the right for 1 yard to the NYJ43. Tackled by Leonard Williams.","(7:25) Christine Michael rush to the right for 4 yards to the NYJ44. Tackled by Muhammad Wilkerson and Darron Lee.","(8:06) Christine Michael rush to the left for 10 yards to the NYJ48. Tackled by Buster Skrine.","(8:47) Christine Michael rush to the right for 2 yards to the Sea42. Tackled by Darron Lee.","(9:13) Russell Wilson rush to the left for 2 yards to the Sea35. Penalty: Holding on New York (Darron Lee) 5 yards.","(9:52) Russell Wilson pass to the right to Doug Baldwin for a loss of 4 yards to the Sea33. Tackled by Muhammad Wilkerson.","(10:31) Russell Wilson pass to the right to Jimmy Graham for 13 yards to the Sea37. Tackled by Juston Burris.","(10:34) Russell Wilson incomplete pass to the left intended for Jimmy Graham.","(11:12) Christine Michael rush up the middle for a loss of 1 yard to the Sea24. Tackled by Steve McLendon and Calvin Pryor.","(11:22) Lachlan Edwards punts for 52 yards to Sea18. Tyler Lockett return for 7 yards to Sea25. Tackled by Josh Martin and Bruce Carter.","(11:26) Ryan Fitzpatrick incomplete pass to the left intended for Matt Forte.","(11:52) Ryan Fitzpatrick pass to the left to Charone Peake for 5 yards to the NYJ30. Tackled by Cliff Avril.","(12:20) Matt Forte rush up the middle for no gain to the NYJ25. Tackled by Michael Bennett.","(12:20) Steven Hauschka kicks off to the endzone. Touchback.","(12:20) Steven Hauschka extra point is good.","(12:26) Russell Wilson pass to the right to Christine Michael for 6 yards for a TOUCHDOWN.","(12:26) New York Jets timeout.","(13:06) Russell Wilson pass to the left to Paul Richardson for 27 yards to the NYJ6. Tackled by Calvin Pryor.","(13:41) New York Jets timeout.","(13:41) Russell Wilson pass to the left to Jimmy Graham for 24 yards to the NYJ33. Tackled by Darron Lee.","(14:27) Russell Wilson pass to the left to Doug Baldwin for 4 yards to the Sea43. Tackled by Buster Skrine.","(14:30) Ryan Fitzpatrick pass intended for Brandon Marshall INTERCEPTED by Richard Sherman. No return. Tackled by Brandon Marshall.","(15:00) Ryan Fitzpatrick pass to the left to Brandon Marshall for 17 yards to the NYJ47.","(0:21) Penalty: Holding on New York (Ryan Clady) -10 yards.","(0:57) Ryan Fitzpatrick pass to the left to Matt Forte for 4 yards to the NYJ40. Tackled by Bobby Wagner.","(1:04) Jon Ryan punts for 48 yards to NYJ36. No return.","(1:10) Russell Wilson incomplete pass to the left intended for Tyler Lockett.","(1:10) Seattle Seahawks timeout.","(1:47) Christine Michael rush to the right for a loss of 2 yards to the Sea16. Tackled by Jordan Jenkins.","(2:29) Christine Michael rush to the right for 9 yards to the Sea18. Tackled by Calvin Pryor.","(2:37) Lachlan Edwards punts for 39 yards to Sea18. No return. Penalty: Holding on Seattle (Neiko Thorpe) -9 yards.","(2:46) Ryan Fitzpatrick incomplete pass to the right intended for Robby Anderson defensed by Deshawn Shead.","(2:49) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall defensed by Earl Thomas.","(3:27) Matt Forte rush up the middle for 2 yards to the NYJ43. Tackled by Cliff Avril and Bobby Wagner.","(3:33) Penalty: Pass Interference on Seattle (Jeremy Lane) 22 yards.","(4:13) Ryan Fitzpatrick sacked at NYJ19 for a loss of 6 yards by Bobby Wagner.","(4:13) Steven Hauschka kicks off to the endzone. Touchback.","(4:16) Steven Hauschka 33 yard field goal attempt is GOOD. Holder: Jon Ryan.","(4:23) Russell Wilson incomplete pass to the left intended for C.J. Spiller.","(4:28) Russell Wilson incomplete pass to the left intended for Jimmy Graham.","(5:11) Christine Michael rush to the left for no gain to the NYJ14. Tackled by David Harris.","(5:49) Russell Wilson pass to the middle to Christine Michael for 9 yards to the NYJ14. Tackled by Rontez Miles and Erin Henderson.","(6:28) Russell Wilson pass to the middle to Christine Michael for 7 yards to the NYJ23. Tackled by Darron Lee.","(6:58) Russell Wilson pass to the right to Jimmy Graham for 12 yards to the NYJ30. Tackled by Marcus Gilchrist.","(7:39) Russell Wilson pass to the right to Tyler Lockett for 13 yards to the NYJ42. Tackled by Marcus Gilchrist.","(7:43) Russell Wilson incomplete pass to the left intended for Luke Willson.","(7:52) Lachlan Edwards punts for 41 yards to Sea44. Tyler Lockett return for 1 yard to Sea45. Tackled by Marcus Williams and Juston Burris.","(7:56) Ryan Fitzpatrick incomplete pass to the middle intended for Bilal Powell.","(8:01) Ryan Fitzpatrick incomplete pass to the right intended for Braedon Bowman.","(8:44) Ryan Fitzpatrick sacked at NYJ15 for a loss of 4 yards by Michael Bennett.","(9:30) Ryan Fitzpatrick pass to the left to Bilal Powell for 8 yards to the NYJ19. Tackled by Deshawn Shead.","(10:14) Matt Forte rush to the left for 2 yards to the NYJ11. Tackled by Tony McDaniel and Ahtyba Rubin.","(10:52) Matt Forte rush up the middle for 1 yard to the NYJ9. Tackled by Tony McDaniel and Kam Chancellor.","(10:59) Jon Ryan punts for 56 yards to NYJ8. No return.","(11:34) Russell Wilson pass to the right to C.J. Spiller for a loss of 3 yards to the Sea36. Tackled by Calvin Pryor.","(12:17) Russell Wilson rush to the left for a loss of 4 yards to the Sea39. Tackled by Sheldon Richardson.","(12:52) Russell Wilson pass to the left to Jermaine Kearse for 4 yards to the Sea43. Tackled by Darrelle Revis.","(13:38) Christine Michael rush to the right for 8 yards to the Sea39. Tackled by Marcus Gilchrist.","(14:18) Russell Wilson pass to the left to Christine Michael for 6 yards to the Sea31. Tackled by Calvin Pryor.","(14:55) Christine Michael rush up the middle for 3 yards to the Sea25. Tackled by Darron Lee and Steve McLendon.","(15:00) Nick Folk kicks off to the Sea0. C.J. Spiller return for 22 yards to Sea22. Tackled by Bruce Carter and Erin Henderson.","(0:08) Russell Wilson rush up the middle for a loss of 1 yard to the Sea29.","(0:13) Nick Folk kicks off to the Sea23. Cassius Marsh return for 7 yards to Sea30. Tackled by Juston Burris and Braedon Bowman.","(0:13) Nick Folk extra point is good.","(0:17) Ryan Fitzpatrick pass to the left to Brandon Marshall for 17 yards for a TOUCHDOWN.","(0:22) Penalty: Holding on Seattle (Cliff Avril) 5 yards.","(0:30) Ryan Fitzpatrick pass to the left to Bilal Powell for 11 yards to the Sea22. Tackled by Richard Sherman.","(0:34) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(0:37) Ryan Fitzpatrick incomplete pass to the left intended for Quincy Enunwa.","(0:56) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 11 yards to the Sea33. Tackled by Bobby Wagner.","(0:56) New York Jets timeout.","(1:04) Ryan Fitzpatrick pass to the left to Bilal Powell for 18 yards to the Sea44. Tackled by Earl Thomas and K.J. Wright.","(1:24) Ryan Fitzpatrick rush up the middle for 3 yards to the NYJ38. Tackled by Cassius Marsh.","(2:00) Matt Forte rush to the left for 2 yards to the NYJ35. Tackled by Frank Clark.","(2:00) Two Minute Warning.","(2:34) Ryan Fitzpatrick pass to the left to Charone Peake for 16 yards to the NYJ33. Tackled by Earl Thomas.","(3:05) Penalty: Holding on New York (James Carpenter) -10 yards.","(3:43) Ryan Fitzpatrick rush to the left for 2 yards to the NYJ27. Tackled by Michael Bennett.","(3:44) Steven Hauschka kicks off to the endzone. Touchback.","(3:44) Steven Hauschka extra point is good.","(3:54) Russell Wilson pass to the left to Tanner McEvoy for 42 yards for a TOUCHDOWN.","(4:31) Christine Michael rush to the left for 4 yards to the NYJ42. Tackled by Muhammad Wilkerson and David Harris.","(5:08) Christine Michael rush up the middle for 9 yards to the NYJ46. Tackled by Sheldon Richardson.","(5:30) Penalty: False Start on Seattle (Germain Ifedi) -5 yards.","(5:59) Russell Wilson pass to the left to Christine Michael for 4 yards to the Sea50. Tackled by Rontez Miles.","(6:30) Russell Wilson pass to the left to Jermaine Kearse for 10 yards to the Sea46.","(7:10) Christine Michael rush to the right for 1 yard to the Sea36. Tackled by Marcus Gilchrist.","(7:42) Russell Wilson pass to the left to Jimmy Graham for 20 yards to the Sea35. Tackled by Marcus Williams.","(7:49) Lachlan Edwards punts for 37 yards to Sea15. No return.","(8:25) Bilal Powell rush to the left for 10 yards to the NYJ48. Tackled by Jeremy Lane.","(9:03) Matt Forte rush to the right for a loss of 3 yards to the NYJ38. Tackled by Bobby Wagner.","(9:35) Matt Forte rush to the right for no gain to the Sea44. Tackled by Deshawn Shead. Penalty: Unnecessary Roughness on New York (Brian Winters) -15 yards.","(10:08) Ryan Fitzpatrick pass to the left to Robby Anderson for 5 yards to the NYJ41. Tackled by K.J. Wright. Penalty: Roughing Passer on Seattle (Cassius Marsh) 15 yards.","(10:40) Ryan Fitzpatrick pass to the left to Bilal Powell for 7 yards to the NYJ36. Tackled by Kam Chancellor.","(10:45) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(11:12) Penalty: Holding on New York (Kellen Davis) -10 yards.","(11:34) Ryan Fitzpatrick pass to the left to Brandon Marshall for 14 yards to the NYJ39.","(11:34) Steven Hauschka kicks off to the endzone. Touchback.","(11:34) Steven Hauschka extra point is good.","(11:34) Russell Wilson pass to the middle to C.J. Spiller for 8 yards for a TOUCHDOWN.","(12:04) Penalty: False Start on Seattle (Luke Willson) -5 yards.","(12:45) Christine Michael rush to the left for 2 yards to the NYJ3. Tackled by David Harris.","(13:16) Russell Wilson pass to the right to Doug Baldwin for 38 yards to the NYJ10. Tackled by Calvin Pryor. Penalty: Unnecessary Roughness on New York (Calvin Pryor) 5 yards.","(13:55) Christine Michael rush to the right for 2 yards to the NYJ48. Tackled by Deon Simon.","(14:24) Russell Wilson pass to the left to Doug Baldwin for 16 yards to the Sea50. Tackled by Marcus Gilchrist.","(15:00) Russell Wilson pass to the right to Jimmy Graham for 27 yards to the Sea34. Tackled by Darron Lee.","(0:06) Christine Michael rush up the middle for a loss of 1 yard to the Sea7. Tackled by Erin Henderson.","(0:13) Lachlan Edwards punts for 33 yards to Sea8. No return.","(0:52) Ryan Fitzpatrick pass to the middle to Bilal Powell for 9 yards to the Sea41. Tackled by Earl Thomas.","(0:57) Ryan Fitzpatrick incomplete pass to the right intended for Robby Anderson defensed by Deshawn Shead.","(1:38) Matt Forte rush to the left for 2 yards to the NYJ50. Tackled by Jeremy Lane and K.J. Wright.","(1:46) Penalty: Illegal Shift on New York -5 yards.","(2:18) Ryan Fitzpatrick pass to the right to Brandon Marshall for 41 yards to the Sea47. Tackled by Richard Sherman and Kam Chancellor.","(2:58) Matt Forte rush up the middle for 2 yards to the NYJ12. Tackled by Bobby Wagner.","(3:05) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(3:11) Jon Ryan punts for 31 yards to NYJ10. No return.","(3:54) C.J. Spiller rush up the middle for 13 yards to the NYJ41. Tackled by Marcus Gilchrist and Calvin Pryor.","(4:01) Russell Wilson incomplete pass to the right intended for Luke Willson.","(4:47) Russell Wilson sacked at Sea46 for a loss of 7 yards by Leonard Williams.","(5:18) Russell Wilson pass to the left to Jimmy Graham for 17 yards to the NYJ47. Tackled by Marcus Williams.","(6:02) Christine Michael rush to the left for 2 yards to the Sea36. Tackled by Marcus Williams.","(6:27) Russell Wilson pass to the left to Jermaine Kearse for 9 yards to the Sea34. Tackled by Buster Skrine and David Harris.","(6:27) Nick Folk kicks off to the endzone. Touchback.","(6:31) Nick Folk 34 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(6:42) Seattle Seahawks timeout.","(6:42) Ryan Fitzpatrick incomplete pass to the left intended for Bilal Powell defensed by Kam Chancellor.","(7:24) Ryan Fitzpatrick sacked at Sea16 for a loss of 4 yards by K.J. Wright.","(8:07) Matt Forte rush up the middle for 3 yards to the Sea12. Tackled by Cliff Avril and Kam Chancellor.","(8:51) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 11 yards to the Sea15. Tackled by Earl Thomas and Deshawn Shead.","(9:30) Bilal Powell rush to the right for 5 yards to the Sea26. Tackled by Richard Sherman.","(10:14) Ryan Fitzpatrick pass to the middle to Matt Forte for 12 yards to the Sea31. Tackled by Richard Sherman and Bobby Wagner.","(10:56) Matt Forte rush to the right for 3 yards to the Sea43. Tackled by Bobby Wagner.","(11:38) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 15 yards to the Sea46. Tackled by Jeremy Lane.","(12:16) Ryan Fitzpatrick pass to the left to Bilal Powell for 1 yard to the NYJ39. Tackled by K.J. Wright.","(12:56) Bilal Powell rush to the left for 3 yards to the NYJ38. Tackled by Tony McDaniel and Ahtyba Rubin.","(13:36) Matt Forte rush to the left for 4 yards to the NYJ35. Tackled by Tony McDaniel and K.J. Wright.","(14:16) Matt Forte rush to the left for 4 yards to the NYJ31. Tackled by Kam Chancellor.","(14:53) Matt Forte rush up the middle for 5 yards to the NYJ27. Tackled by K.J. Wright.","(15:00) Steven Hauschka kicks off to the NYJ-5. Jeremy Ross return for 27 yards to NYJ22. Tackled by Earl Thomas and Kam Chancellor."]