["(0:04) Duke Johnson Jr. rush to the right for 9 yards to the Was35. Tackled by Kendall Fuller.","(0:05) Cody Kessler incomplete pass to the middle.","(0:24) Cody Kessler pass to the left to Gary Barnidge for 8 yards to the Was44. Tackled by Kendall Fuller.","(0:31) Cody Kessler rush to the right for 2 yards to the Cle48. Tackled by Kendall Reyes.","(0:31) Cleveland Browns timeout.","(0:36) Cody Kessler pass to the right to Gary Barnidge for 6 yards to the Cle46. Tackled by Kendall Fuller.","(0:40) Cody Kessler incomplete pass to the left intended for Duke Johnson Jr..","(0:40) Cleveland Browns timeout.","(0:49) Cody Kessler pass to the left to Duke Johnson Jr. for 7 yards to the Cle40. Tackled by Will Blackmon.","(1:15) Cody Kessler pass to the middle to Duke Johnson Jr. for 12 yards to the Cle33. Tackled by Mason Foster.","(1:41) Cody Kessler pass to the right to Gary Barnidge for 2 yards to the Cle21. Tackled by Kendall Fuller.","(1:48) Tress Way punts for 39 yards to Cle17. Jordan Poyer return for 2 yards to Cle19.","(1:48) Washington Redskins timeout.","(1:53) Matt Jones rush to the left for 2 yards to the Was44. Tackled by Stephen Paea.","(1:53) Cleveland Browns timeout.","(1:57) Matt Jones rush to the right for no gain to the Was42. Tackled by Stephen Paea and Danny Shelton.","(1:57) Two Minute Warning.","(2:03) Matt Jones rush to the right for no gain to the Was42. Tackled by Jamie Meder.","(2:08) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr..","(2:47) Cody Kessler pass to the right to Isaiah Crowell for a loss of 1 yard to the Was42. Tackled by Josh Norman.","(2:52) Cody Kessler incomplete pass to the right intended for Ricardo Louis.","(3:14) Duke Johnson Jr. rush to the right for 10 yards to the Was41. Tackled by Trent Murphy.","(3:14) Penalty: False Start on Cleveland (Joe Thomas) -5 yards.","(3:24) Cody Kessler pass to the right to Gary Barnidge for 8 yards to the Was46. Tackled by Kendall Fuller.","(3:32) Cody Kessler pass to the left to Terrelle Pryor Sr. for 4 yards to the Cle46. Tackled by Will Compton.","(3:59) Cody Kessler pass to the right to Andrew Hawkins for 12 yards to the Cle42. Tackled by Will Blackmon and Chris Baker.","(4:25) Cody Kessler pass to the right to Duke Johnson Jr. for 5 yards to the Cle30. Tackled by Will Compton.","(4:25) Dustin Hopkins kicks off to the endzone. Touchback.","(4:25) Dustin Hopkins extra point is good.","(4:28) Matt Jones rush to the right for 1 yard for a TOUCHDOWN.","(4:28) Penalty: Offside on Cleveland (Cam Johnson) 0 yards.","(5:12) Matt Jones rush to the left for 16 yards to the Cle1. Tackled by Jordan Poyer.","(5:53) Kirk Cousins pass to the right to Pierre Garcon for 23 yards to the Cle17. Tackled by Jordan Poyer.","(6:28) Matt Jones rush to the left for a loss of 1 yard to the Cle40. Tackled by Cam Johnson and Jamar Taylor.","(6:37) Cody Kessler pass intended for Terrelle Pryor Sr. INTERCEPTED by Josh Norman and returned for 1 yard. Tackled by Andrew Hawkins. Penalty: Unsports. Conduct on Washington (Josh Norman) -15 yards.","(7:14) Isaiah Crowell rush up the middle for 8 yards to the Cle10. Tackled by Will Blackmon and Mason Foster.","(7:25) Tress Way punts for 48 yards to Cle2. No return.","(7:59) Kirk Cousins sacked at Was50 for a loss of 10 yards by Briean Boddy-Calhoun.","(7:59) Washington Redskins timeout.","(8:08) Kirk Cousins incomplete pass to the left intended for DeSean Jackson.","(8:54) Kirk Cousins sacked at Cle40 for a loss of 8 yards by Cam Johnson.","(9:32) Matt Jones rush to the left for 25 yards to the Cle32. Tackled by Joe Haden.","(9:41) Duke Johnson Jr. rush to the left for 5 yards to the Was45. Tackled by Ziggy Hood. FUMBLE, recovered by Was (Will Compton). Tackled by Joe Thomas.","(10:05) Isaiah Crowell rush to the left for 8 yards to the Cle50. Tackled by Kendall Reyes and Preston Smith.","(10:39) Isaiah Crowell rush to the left for 17 yards to the Cle42. Tackled by David Bruton Jr. and Josh Norman.","(10:39) Dustin Hopkins kicks off to the endzone. Touchback.","(10:39) Dustin Hopkins extra point is good.","(10:43) Kirk Cousins pass to the right to Chris Thompson for 5 yards for a TOUCHDOWN.","(11:04) Rob Kelley rush to the right for 4 yards to the Cle5. Tackled by Joe Schobert and Danny Shelton.","(11:48) Matt Jones rush to the right for 15 yards to the Cle9. Tackled by Jordan Poyer.","(12:24) Matt Jones rush to the right for 11 yards to the Cle24. Tackled by Joe Schobert.","(12:31) Penalty: Pass Interference on Cleveland (Joe Haden) 21 yards.","(13:12) Kirk Cousins pass to the right to Pierre Garcon for 4 yards to the Was44. Tackled by Joe Haden.","(13:35) Penalty: Holding on Washington (Brandon Scherff) -10 yards.","(14:21) Matt Jones rush to the left for 2 yards to the Was50. Tackled by Emmanuel Ogbah and Derrick Kindred.","(15:00) Matt Jones rush to the right for 8 yards to the Was48. Tackled by Danny Shelton and Demario Davis.","(0:20) Kirk Cousins pass to the right to Matt Jones for 16 yards to the Was40. Tackled by Jordan Poyer and Demario Davis.","(1:01) Kirk Cousins pass to the left to Jamison Crowder for 15 yards to the Was24. Tackled by Derrick Kindred.","(1:07) Kirk Cousins incomplete pass to the middle intended for Jordan Reed.","(1:14) Malcolm Johnson rush to the right for 2 yards to the Was14. Tackled by Will Compton. FUMBLE, recovered by Was (Quinton Dunbar). Tackled by Ricardo Louis.","(1:34) Cody Kessler pass to the right to Isaiah Crowell for 14 yards to the Was16. Tackled by Chris Baker.","(1:39) Cody Kessler incomplete pass to the left.","(2:08) Isaiah Crowell rush to the right for 2 yards to the Was30. Tackled by Will Blackmon.","(2:51) Cody Kessler pass to the left to Gary Barnidge for 13 yards to the Was32. Tackled by Duke Ihenacho.","(3:35) Duke Johnson Jr. rush to the right for no gain to the Was45. Tackled by Su'a Cravens and Houston Bates.","(3:41) Cody Kessler incomplete pass to the right intended for Ricardo Louis.","(4:21) Cody Kessler pass to the right to Malcolm Johnson for 11 yards to the Was45. Tackled by Josh Norman.","(5:03) Isaiah Crowell rush to the right for 2 yards to the Cle44. Tackled by Will Compton and Kendall Reyes.","(5:46) Isaiah Crowell rush to the right for 19 yards to the Cle42. Tackled by Mason Foster.","(5:59) Tress Way punts for 59 yards to Cle5. Duke Johnson Jr. return for 18 yards to Cle23. Tackled by David Bruton Jr. and Quinton Dunbar.","(6:22) Kirk Cousins pass to the left to Jordan Reed for 11 yards to the Was36. Tackled by Jamar Taylor and Demario Davis.","(7:01) Chris Thompson rush to the right for 2 yards to the Was25. Tackled by Corey Lemonier and Xavier Cooper.","(7:46) Kirk Cousins sacked at Was23 for a loss of 9 yards by Cam Johnson. FUMBLE, recovered by Was (Kirk Cousins).","(8:08) Penalty: False Start on Washington (Jordan Reed) -5 yards.","(8:37) Kirk Cousins pass to the right to Jordan Reed for 4 yards to the Was37. Tackled by Joe Haden.","(9:25) Kirk Cousins pass to the right to Vernon Davis for 8 yards to the Was33. Tackled by Demario Davis and Joe Schobert.","(9:25) Cody Parkey kicks off to the endzone. Touchback.","(9:30) Cody Parkey 45 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(9:41) Penalty: False Start on Cleveland -5 yards.","(10:06) Cody Kessler pass to the right to Duke Johnson Jr. for no gain to the Was22. Tackled by Josh Norman and Will Compton.","(10:46) Duke Johnson Jr. rush to the right for no gain to the Was22. Tackled by Ricky Jean Francois and Will Compton.","(11:18) Cody Kessler pass to the left to Ricardo Louis for 4 yards to the Was22. Tackled by Quinton Dunbar.","(11:43) Penalty: Holding on Washington (Quinton Dunbar) 4 yards.","(12:17) Isaiah Crowell rush to the left for 6 yards to the Was30. Tackled by Mason Foster and Will Blackmon.","(12:56) Cody Kessler pass to the left to Isaiah Crowell for 9 yards to the Was36. Tackled by Will Blackmon.","(13:01) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr..","(13:41) Isaiah Crowell rush up the middle for 18 yards to the Was45. Tackled by Will Blackmon.","(14:20) Cody Kessler pass to the middle to Ricardo Louis for 11 yards to the Cle37. Tackled by Kendall Fuller and Will Compton.","(14:24) Cody Kessler incomplete pass to the right intended for Terrelle Pryor Sr..","(15:00) Isaiah Crowell rush to the right for 1 yard to the Cle26. Tackled by Chris Baker and Will Compton.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback.","(0:05) Cody Parkey 51 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(0:05) Cleveland Browns timeout.","(0:44) Cody Kessler pass to the right to Duke Johnson Jr. for a loss of 1 yard to the Was33. Tackled by Su'a Cravens.","(1:12) Cody Kessler pass to the middle to Andrew Hawkins for 9 yards to the Was32. Tackled by Will Compton.","(1:12) Cleveland Browns timeout.","(1:27) Cody Kessler sacked at Was41 for a loss of 6 yards by Trent Murphy.","(1:32) Penalty: Pass Interference on Washington (Josh Norman) 11 yards.","(1:40) Cody Kessler pass to the right to Duke Johnson Jr. for 8 yards to the Was46. Tackled by Su'a Cravens.","(2:00) Duke Johnson Jr. rush to the left for 13 yards to the Cle46. Tackled by Trent Murphy.","(2:00) Two Minute Warning.","(2:29) Penalty: False Start on Cleveland (Cody Kessler) -5 yards.","(2:29) Cody Kessler pass to the left to Gary Barnidge for 13 yards to the Cle38. Tackled by Will Compton.","(2:29) Dustin Hopkins kicks off to the endzone. Touchback.","(2:35) Dustin Hopkins 49 yard field goal attempt is GOOD. Holder: Tress Way.","(3:18) Kirk Cousins pass to the right to Jordan Reed for a loss of 4 yards to the Cle31. Tackled by Gabe Wright.","(3:24) Kirk Cousins incomplete pass to the right intended for Chris Thompson defensed by Gabe Wright.","(3:49) Penalty: Pass Interference on Washington (Jordan Reed) -10 yards.","(3:55) Kirk Cousins incomplete pass to the right intended for Chris Thompson defensed by Jamie Meder.","(4:36) Matt Jones rush to the right for 2 yards to the Cle17. Tackled by Jamie Meder.","(5:14) Matt Jones rush to the right for 4 yards to the Cle19. Tackled by Emmanuel Ogbah and Christian Kirksey.","(5:59) Kirk Cousins pass to the middle to Matt Jones for 5 yards to the Cle23. Tackled by Emmanuel Ogbah and Jamie Meder.","(6:29) Kirk Cousins pass to the right to Jordan Reed for 26 yards to the Cle28. Tackled by Derrick Kindred.","(7:06) Matt Jones rush to the left for 6 yards to the Was46. Tackled by Corey Lemonier.","(7:49) Matt Jones rush to the right for 3 yards to the Was40. Tackled by Christian Kirksey and Emmanuel Ogbah.","(7:55) Cody Parkey kicks off to the Was11. Chris Thompson return for 26 yards to Was37. Tackled by Dominique Alexander and Don Jones.","(7:55) Cody Parkey extra point is good.","(7:55) Cody Kessler pass to the right to Terrelle Pryor Sr. for 9 yards for a TOUCHDOWN. Penalty: Unsports. Conduct on Cleveland (Terrelle Pryor Sr.) -15 yards.","(8:07) Cody Kessler incomplete pass to the right intended for Duke Johnson Jr. defensed by Su'a Cravens.","(8:39) Penalty: Offside on Washington (Trent Murphy) 5 yards.","(9:20) Cody Kessler rush up the middle for no gain to the Was12. FUMBLE, recovered by Cle (Cody Kessler).","(9:33) Kirk Cousins pass intended for Jamison Crowder INTERCEPTED by Jamar Taylor and returned for 29 yards. Tackled by Matt Jones.","(9:33) Cody Parkey kicks off to the endzone. Touchback.","(9:33) Cody Parkey extra point is good. Penalty: Offside on Washington (Josh Norman) 5 yards.","(9:38) Isaiah Crowell rush to the left for 2 yards for a TOUCHDOWN.","(10:18) Isaiah Crowell rush to the right for 3 yards to the Was2. Tackled by Preston Smith.","(10:50) Cody Kessler pass to the right to Ricardo Louis for 13 yards to the Was5. Tackled by Quinton Dunbar.","(11:25) Isaiah Crowell rush to the right for 11 yards to the Was18. Tackled by David Bruton Jr..","(11:59) Isaiah Crowell rush to the right for 4 yards to the Was29. Tackled by Cullen Jenkins and David Bruton Jr..","(12:34) Duke Johnson Jr. rush to the right for 9 yards to the Was33. Tackled by Trent Murphy and Mason Foster.","(13:05) Cody Kessler pass to the left to Terrelle Pryor Sr. for 12 yards to the Was42.","(13:10) Cody Kessler incomplete pass to the left intended for Randall Telfer.","(13:50) Duke Johnson Jr. rush to the right for a loss of 1 yard to the Cle46. Tackled by Trent Murphy.","(13:50) Cleveland Browns timeout.","(14:31) Cody Kessler pass to the left to Terrelle Pryor Sr. for 8 yards to the Cle47. Tackled by Josh Norman and Will Compton.","(15:00) Isaiah Crowell rush to the right for 3 yards to the Cle39. Tackled by David Bruton Jr..","(0:22) Isaiah Crowell rush to the right for 17 yards to the Cle36. Tackled by Duke Ihenacho.","(0:27) Dustin Hopkins kicks off to the Cle2. George Atkinson III return for 17 yards to Cle19. Tackled by Niles Paul.","(0:27) Dustin Hopkins extra point is good.","(0:34) Kirk Cousins pass to the left to Jordan Reed for 9 yards for a TOUCHDOWN.","(0:38) Kirk Cousins incomplete pass to the right intended for Pierre Garcon.","(1:19) Matt Jones rush to the left for no gain to the Cle9. Tackled by Emmanuel Ogbah and Derrick Kindred.","(2:00) Matt Jones rush to the right for 2 yards to the Cle9. Tackled by Demario Davis and Joe Schobert.","(2:41) Matt Jones rush to the right for 7 yards to the Cle11. Tackled by Xavier Cooper and Christian Kirksey.","(3:21) Kirk Cousins pass to the right to Jordan Reed for 2 yards to the Cle18. Tackled by Joe Haden.","(4:05) Kirk Cousins pass to the left to Jordan Reed for 7 yards to the Cle20. Tackled by Derrick Kindred and Christian Kirksey.","(4:31) Matt Jones rush to the left for 3 yards to the Cle27. Tackled by Jamie Meder.","(4:41) Penalty: Pass Interference on Cleveland (Jordan Poyer) 50 yards.","(4:51) Britton Colquitt punts for 55 yards to Was0. Touchback.","(5:28) Cody Kessler pass to the right to Gary Barnidge for 7 yards to the Cle45. Tackled by Quinton Dunbar and Kendall Fuller.","(5:33) Cody Kessler incomplete pass to the right intended for Isaiah Crowell.","(6:07) Isaiah Crowell rush up the middle for a loss of 1 yard to the Cle38. Tackled by Preston Smith.","(6:19) Cody Kessler pass to the left to Terrelle Pryor Sr. for 13 yards to the Cle39. Tackled by Josh Norman.","(7:03) Terrelle Pryor Sr. rush to the left for a loss of 6 yards to the Cle26. Tackled by Preston Smith.","(7:40) Cody Kessler pass to the right to Andrew Hawkins for 7 yards to the Cle32. Tackled by Kendall Fuller.","(7:40) Dustin Hopkins kicks off to the endzone. Touchback.","(7:40) Dustin Hopkins extra point is good.","(7:45) Kirk Cousins pass to the right to Jordan Reed for 8 yards for a TOUCHDOWN.","(8:19) Chris Thompson rush to the right for 2 yards to the Cle8. Tackled by Corey Lemonier and Jamie Meder.","(9:03) Chris Thompson rush to the right for 20 yards to the Cle10. Tackled by Joe Haden and Emmanuel Ogbah.","(9:30) Penalty: Holding on Washington (Vernon Davis) -10 yards.","(10:09) Kirk Cousins pass to the right to DeSean Jackson for 5 yards to the Cle20. Tackled by Jordan Poyer.","(10:46) Kirk Cousins pass to the left to Pierre Garcon for 3 yards to the Cle25. Tackled by Jamar Taylor.","(11:11) Kirk Cousins pass to the left to Pierre Garcon for 9 yards to the Cle28. Tackled by Jamar Taylor.","(11:53) Kirk Cousins pass to the left to Chris Thompson for 11 yards to the Cle37. Tackled by Christian Kirksey.","(12:34) Matt Jones rush to the left for 2 yards to the Cle48. Tackled by Jamar Taylor and Jordan Poyer.","(13:07) Kirk Cousins pass to the right to Jordan Reed for 10 yards to the Was50. Tackled by Christian Kirksey.","(13:46) Matt Jones rush to the right for 4 yards to the Was40. Tackled by Christian Kirksey.","(14:27) Matt Jones rush to the left for 5 yards to the Was36. Tackled by Jamar Taylor and Emmanuel Ogbah.","(15:00) Kirk Cousins pass to the right to Jamison Crowder for 6 yards to the Was31. Tackled by Jamar Taylor.","(15:00) Cody Parkey kicks off to the endzone. Touchback."]