["(0:04) Sam Bradford pass to the right to Cordarrelle Patterson for 21 yards to the Min23. Tackled by De'Vante Bausby.","(0:15) Patrick O'Donnell punts for 37 yards to . Stefon Diggs return for 4 yards to Min2. Tackled by Nick Kwiatkoski.","(1:04) Jordan Howard rush to the right for 3 yards to the Min35. Tackled by Eric Kendricks.","(1:54) Jordan Howard rush to the left for 2 yards to the Min38. Tackled by Chad Greenway and Brian Robison.","(1:54) Minnesota Vikings timeout.","(2:00) Jordan Howard rush to the right for no gain to the Min40. Tackled by Linval Joseph.","(2:00) Two Minute Warning.","(2:18) Jordan Howard rush to the left for 10 yards to the Min40. Tackled by Harrison Smith and Anthony Harris.","(3:07) Jay Cutler pass to the left to Zach Miller for 13 yards to the Chi50. Tackled by Anthony Harris.","(3:07) Minnesota Vikings timeout.","(3:11) Jordan Howard rush to the right for no gain to the Chi37. Tackled by Everson Griffen.","(4:00) Jordan Howard rush to the left for 5 yards to the Chi37. Tackled by Eric Kendricks.","(4:48) Jordan Howard rush to the right for 6 yards to the Chi32. Tackled by Linval Joseph.","(5:37) Jordan Howard rush to the left for 11 yards to the Chi26. Tackled by Anthony Harris.","(5:41) Blair Walsh kicks off to the Chi8. Deonte Thompson return for 7 yards to Chi15.","(5:41) Blair Walsh extra point is good.","(5:47) Sam Bradford pass to the right to Stefon Diggs for 25 yards for a TOUCHDOWN.","(5:51) Sam Bradford incomplete pass to the right intended for Stefon Diggs defensed by Cornelius Washington.","(5:55) Sam Bradford incomplete pass to the right intended for Ronnie Hillman.","(6:21) Sam Bradford pass to the middle to Stefon Diggs for 4 yards to the Chi25. Tackled by Jerrell Freeman.","(6:46) Sam Bradford pass to the left to Cordarrelle Patterson for 6 yards to the Chi29. Tackled by Cre'von LeBlanc.","(7:16) Sam Bradford pass to the middle to Ronnie Hillman for 4 yards to the Chi35. Tackled by Jerrell Freeman.","(7:51) Sam Bradford pass to the right to Stefon Diggs for 6 yards to the Chi39. Tackled by Tracy Porter.","(8:14) Sam Bradford pass to the right to Stefon Diggs for 7 yards to the Chi45. Tackled by Tracy Porter.","(8:45) Sam Bradford pass to the right to Matt Asiata for 31 yards to the Min48. Tackled by Harold Jones-Quartey.","(8:51) Sam Bradford incomplete pass to the middle intended for Matt Asiata defensed by Danny Trevathan.","(9:00) Patrick O'Donnell punts for 53 yards to Min10. Stefon Diggs return for 7 yards to Min17. Tackled by Sherrick McManis.","(9:03) Jay Cutler incomplete pass to the left intended for Zach Miller.","(9:50) Jordan Howard rush to the left for no gain to the Chi37. Tackled by Linval Joseph.","(10:37) Jay Cutler pass to the right to Zach Miller for 7 yards to the Chi37. Tackled by Eric Kendricks and Linval Joseph.","(11:22) Jay Cutler pass to the right to Alshon Jeffery for 11 yards to the Chi30. Tackled by Xavier Rhodes.","(12:05) Jordan Howard rush to the left for 5 yards to the Chi19. Tackled by Linval Joseph.","(12:48) Jordan Howard rush to the right for 4 yards to the Chi14. Tackled by Eric Kendricks.","(12:56) Jeff Locke punts for 39 yards to Chi10. No return.","(13:44) Sam Bradford sacked at Chi49 for a loss of 6 yards by Akiem Hicks.","(14:22) Matt Asiata rush to the right for 5 yards to the Chi43. Tackled by Mitch Unrein.","(14:25) Sam Bradford incomplete pass to the middle intended for Matt Asiata.","(14:46) Sam Bradford pass to the right to Kyle Rudolph for 3 yards to the Chi48. Tackled by Adrian Amos.","(15:00) Sam Bradford pass to the right to Matt Asiata for 5 yards to the Min49. Tackled by Danny Trevathan.","(0:31) Matt Asiata rush to the right for 3 yards to the Min44. Tackled by Danny Trevathan.","(0:36) Sam Bradford incomplete pass to the left intended for Ronnie Hillman.","(1:05) Sam Bradford pass to the middle to Kyle Rudolph for 11 yards to the Min41. Tackled by Cre'von LeBlanc.","(1:44) Matt Asiata rush to the right for 4 yards to the Min30. Tackled by Jerrell Freeman.","(2:18) Sam Bradford pass to the left to Adam Thielen for 7 yards to the Min26. Tackled by De'Vante Bausby.","(2:46) Sam Bradford pass to the right to Stefon Diggs for 6 yards to the Min19. Tackled by Jerrell Freeman and Sam Acho.","(2:55) Patrick O'Donnell punts for 43 yards to Min13. No return.","(3:35) Jay Cutler pass to the left to Jordan Howard for 1 yard to the Chi44. Tackled by Everson Griffen.","(4:16) Jay Cutler sacked at Chi43 for a loss of 7 yards by Everson Griffen.","(4:55) Jordan Howard rush to the right for a loss of 1 yard to the Chi50. Tackled by Danielle Hunter.","(5:46) Jay Cutler pass to the middle to Zach Miller for 17 yards to the Min49. Tackled by Eric Kendricks.","(6:31) Jordan Howard rush to the right for 5 yards to the Chi34. Tackled by Eric Kendricks.","(7:01) Jay Cutler rush to the left for 2 yards to the Chi29. Tackled by Everson Griffen.","(7:12) Jeff Locke punts for 43 yards to Chi21. Cre'von LeBlanc return for 6 yards to Chi27. Tackled by Kentrell Brothers.","(7:49) Sam Bradford pass to the left to Cordarrelle Patterson for 9 yards to the Min36. Tackled by Jerrell Freeman and Danny Trevathan.","(7:55) Sam Bradford incomplete pass to the right intended for Ronnie Hillman defensed by Willie Young.","(8:00) Penalty: Holding on Minnesota (T.J. Clemmings) -10 yards.","(8:38) Ronnie Hillman rush to the right for 2 yards to the Min37. Tackled by Akiem Hicks and Will Sutton.","(9:24) Sam Bradford pass to the right to Stefon Diggs for 4 yards to the Min35. Tackled by Tracy Porter.","(9:52) Ronnie Hillman rush to the right for 6 yards to the Min31. Tackled by Cre'von LeBlanc.","(9:52) Connor Barth kicks off to the endzone. Touchback.","(9:52) Connor Barth extra point is good.","(9:57) Jay Cutler pass to the left to Alshon Jeffery for 11 yards for a TOUCHDOWN.","(10:02) Jay Cutler incomplete pass to the right intended for Logan Paulsen.","(10:48) Jordan Howard rush to the left for 6 yards to the Min11. Tackled by Anthony Harris and Shamar Stephen.","(11:30) Ka'Deem Carey rush to the right for 1 yard to the Min17. Tackled by Chad Greenway.","(12:11) Jay Cutler pass to the right to Alshon Jeffery for 7 yards to the Min18. Tackled by Xavier Rhodes.","(12:52) Jay Cutler pass to the right to Jeremy Langford for 11 yards to the Min25. Tackled by Anthony Barr.","(12:56) Jay Cutler incomplete pass to the left intended for Joshua Bellamy.","(13:02) Jay Cutler incomplete pass to the right intended for Zach Miller.","(13:49) Jay Cutler pass to the right to Alshon Jeffery for 34 yards to the Min36. Tackled by Xavier Rhodes.","(13:49) Minnesota Vikings timeout.","(14:20) Jordan Howard rush to the left for no gain to the Chi30. Tackled by Brian Robison.","(15:00) Jay Cutler pass to the middle to Logan Paulsen for 5 yards to the Chi30. Tackled by Eric Kendricks.","(15:00) Blair Walsh kicks off to the endzone. Touchback.","(0:01) Jay Cutler incomplete pass to the right intended for Cameron Meredith defensed by Xavier Rhodes.","(0:09) Jay Cutler pass to the middle to Zach Miller for 15 yards to the Min42. Tackled by Harrison Smith.","(0:09) Chicago Bears timeout.","(0:17) Jordan Howard rush to the left for 11 yards to the Chi43. Tackled by Harrison Smith.","(0:17) Chicago Bears timeout.","(0:25) Jordan Howard rush to the left for 7 yards to the Chi32. Tackled by Eric Kendricks.","(0:25) Blair Walsh kicks off to the endzone. Touchback.","(0:30) Blair Walsh 30 yard field goal attempt is GOOD. Holder: Jeff Locke.","(0:30) Minnesota Vikings timeout.","(0:37) Sam Bradford sacked at Chi12 for a loss of 10 yards by Akiem Hicks.","(1:19) Matt Asiata rush to the right for no gain to the Chi2. Tackled by Adrian Amos.","(2:00) Matt Asiata rush to the right for 1 yard to the Chi2. Tackled by De'Vante Bausby.","(2:00) Two Minute Warning.","(2:27) Chicago Bears timeout.","(2:27) Matt Asiata rush to the right for 1 yard to the Chi3. Tackled by Danny Trevathan and Chris Prosinski.","(3:13) Matt Asiata rush to the right for 7 yards to the Chi4. Tackled by Harold Jones-Quartey.","(3:51) Sam Bradford pass to the left to Kyle Rudolph for 2 yards to the Chi11. Tackled by Adrian Amos.","(4:21) Sam Bradford pass to the left to Adam Thielen for 21 yards to the Chi13. Tackled by De'Vante Bausby.","(5:08) Sam Bradford pass to the left to Kyle Rudolph for 8 yards to the Chi34. Tackled by Harold Jones-Quartey.","(5:11) Sam Bradford incomplete pass to the right intended for Stefon Diggs defensed by Danny Trevathan.","(5:41) Sam Bradford sacked at Min43 for a loss of 3 yards by Pernell McPhee. FUMBLE, recovered by Min (Adam Thielen). Penalty: Unsports. Conduct on Chicago (Cornelius Washington) 15 yards.","(6:27) Matt Asiata rush to the left for 4 yards to the Min46. Tackled by Leonard Floyd.","(6:32) Sam Bradford incomplete pass to the left intended for Kyle Rudolph.","(7:01) Sam Bradford pass to the left to Stefon Diggs for 8 yards to the Min42. Tackled by Tracy Porter.","(7:40) Sam Bradford pass to the left to Ronnie Hillman for 5 yards to the Min34. Tackled by Adrian Amos.","(7:49) Connor Barth kicks off to the Min0. Cordarrelle Patterson return for 21 yards to Min21. Tackled by Nick Kwiatkoski. FUMBLE, recovered by Min (Charles Johnson) and advanced for 2 yards.","(7:49) Connor Barth extra point is good.","(7:54) Jordan Howard rush to the right for 2 yards for a TOUCHDOWN.","(8:39) Jay Cutler pass to the right to Ben Braunecker for 8 yards to the Min2. Tackled by Trae Waynes.","(9:20) Jay Cutler pass to the left to Zach Miller for 21 yards to the Min10. Tackled by Jayron Kearse and Harrison Smith.","(10:03) Jay Cutler pass to the left to Jordan Howard for 11 yards to the Min31. Tackled by Xavier Rhodes and Anthony Barr.","(10:49) Jordan Howard rush to the left for 1 yard to the Min42. Tackled by Everson Griffen.","(11:25) Jordan Howard rush to the left for no gain to the Min43. Tackled by Harrison Smith.","(11:35) Jeff Locke punts for 41 yards to Chi44. Cre'von LeBlanc return for 13 yards to Min43. Tackled by Trae Waynes.","(11:41) Sam Bradford incomplete pass to the left intended for Adam Thielen.","(12:25) Sam Bradford sacked at Min15 for a loss of 5 yards by Leonard Floyd.","(12:39) Ronnie Hillman rush to the right for 5 yards to the Min20. Tackled by Tracy Porter.","(12:44) Connor Barth kicks off to the Min0. Cordarrelle Patterson return for 15 yards to Min15. Tackled by Christian Jones.","(12:49) Connor Barth 28 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(12:53) Jay Cutler incomplete pass to the right intended for Alshon Jeffery defensed by Xavier Rhodes.","(13:32) Jay Cutler pass to the left to Jordan Howard for 3 yards to the Min10. Tackled by Captain Munnerlyn.","(14:10) Jordan Howard rush to the left for 1 yard to the Min13. Tackled by Shamar Stephen.","(14:53) Jay Cutler pass to the right to Jordan Howard for 34 yards to the Min14. Tackled by Eric Kendricks and Danielle Hunter.","(15:00) Jay Cutler incomplete pass to the right intended for Alshon Jeffery.","(0:35) Ka'Deem Carey rush to the left for 2 yards to the Min48. Tackled by Brian Robison.","(1:17) Jay Cutler pass to the right to Cameron Meredith for 24 yards to the Chi50. Tackled by Terence Newman.","(1:27) Jeff Locke punts for 40 yards to Chi19. Cre'von LeBlanc return for 7 yards to Chi26. Tackled by Cordarrelle Patterson.","(2:12) Matt Asiata rush to the left for 1 yard to the Min41. Tackled by Adrian Amos.","(2:36) Matt Asiata rush to the left for 1 yard to the Min40. Tackled by Jonathan Bullard.","(3:12) Matt Asiata rush to the right for 7 yards to the Min39. Tackled by Danny Trevathan and Harold Jones-Quartey.","(3:22) Patrick O'Donnell punts for 51 yards to Min28. Adam Thielen return for 4 yards to Min32. Tackled by Harold Jones-Quartey.","(3:27) Jay Cutler incomplete pass to the middle intended for Zach Miller.","(3:45) Penalty: False Start on Chicago (Charles Leno Jr.) -5 yards.","(4:16) Jay Cutler pass to the right to Zach Miller for 6 yards to the Chi26. Tackled by Captain Munnerlyn.","(4:23) Jay Cutler incomplete pass to the left intended for Deonte Thompson.","(4:34) Jeff Locke punts for 43 yards to Chi0. Touchback.","(5:09) Sam Bradford pass to the left to Kyle Rudolph for 7 yards to the Chi43. Tackled by Jerrell Freeman.","(5:15) Sam Bradford incomplete pass to the right intended for Stefon Diggs.","(5:19) Sam Bradford incomplete pass to the right intended for Stefon Diggs.","(5:26) Patrick O'Donnell punts for 38 yards to Chi50. No return.","(5:30) Jay Cutler incomplete pass to the right intended for Alshon Jeffery defensed by Xavier Rhodes.","(5:52) Jay Cutler pass to the left to Joshua Bellamy for 4 yards to the Chi12. Tackled by Terence Newman.","(6:38) Jordan Howard rush to the left for 3 yards to the Chi8. Tackled by Anthony Barr.","(6:51) Jeff Locke punts for 71 yards to Chi5. No return.","(7:43) Sam Bradford sacked at Min24 for a loss of 3 yards by Cornelius Washington.","(7:50) Sam Bradford incomplete pass to the left intended for Stefon Diggs.","(8:28) Ronnie Hillman rush to the right for 2 yards to the Min27. Tackled by Akiem Hicks.","(8:28) Connor Barth kicks off to the endzone. Touchback.","(8:32) Connor Barth 30 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(8:36) Jay Cutler incomplete pass to the left intended for Alshon Jeffery.","(9:23) Jordan Howard rush to the right for a loss of 4 yards to the Min12. Tackled by Linval Joseph.","(10:08) Jordan Howard rush to the right for 5 yards to the Min8. Tackled by Harrison Smith.","(10:55) Jordan Howard rush to the left for 69 yards to the Min13. Tackled by Xavier Rhodes.","(11:27) Jay Cutler pass to the right to Zach Miller for 9 yards to the Chi18. Tackled by Anthony Barr.","(12:08) Jordan Howard rush to the right for 2 yards to the Chi9. Tackled by Brian Robison.","(12:19) Jeff Locke punts for 32 yards to Chi7. No return.","(12:23) Sam Bradford incomplete pass to the left intended for Adam Thielen defensed by Akiem Hicks.","(12:25) Sam Bradford incomplete pass to the right intended for Matt Asiata.","(12:46) Matt Asiata rush to the left for 5 yards to the Chi39. Tackled by Jonathan Bullard.","(13:09) Sam Bradford pass to the right to Adam Thielen for 12 yards to the Chi44. Tackled by Tracy Porter.","(13:52) Matt Asiata rush to the right for 2 yards to the Min44. Tackled by Mitch Unrein.","(14:22) Sam Bradford pass to the right to Stefon Diggs for 16 yards to the Min42.","(15:00) Matt Asiata rush to the left for 1 yard to the Min26. Tackled by Jerrell Freeman.","(15:00) Connor Barth kicks off to the endzone. Touchback."]