["(0:02) Nick Foles rush up the middle for a loss of 1 yard to the KC39.","(0:07) Andrew Luck incomplete pass to the left intended for Devin Street defensed by Steven Nelson.","(0:25) Andrew Luck sacked at KC40 for a loss of 5 yards by Dee Ford.","(0:51) Andrew Luck sacked at KC35 for a loss of 5 yards by Frank Zombo.","(1:13) Andrew Luck pass to the right to Robert Turbin for 5 yards to the KC30. Tackled by Daniel Sorensen.","(1:37) Andrew Luck pass to the middle to T.Y. Hilton for 20 yards to the KC35. Tackled by Steven Nelson.","(1:45) Andrew Luck incomplete pass to the middle intended for Devin Street defensed by Phillip Gaines.","(1:51) Andrew Luck incomplete pass to the right intended for T.Y. Hilton defensed by Marcus Peters.","(1:58) Penalty: Holding on Indianapolis (Denzelle Good) -10 yards.","(1:58) Two Minute Warning.","(2:08) Andrew Luck rush up the middle for 17 yards to the KC45. Tackled by Steven Nelson.","(2:34) Andrew Luck pass to the left to Robert Turbin for 9 yards to the Ind38. Tackled by Derrick Johnson.","(2:57) Andrew Luck sacked at Ind29 for a loss of 5 yards by Dee Ford.","(3:27) Andrew Luck pass to the right to Phillip Dorsett for a loss of 2 yards to the Ind34. Tackled by Daniel Sorensen. FUMBLE, recovered by Ind (Phillip Dorsett).","(3:35) Andrew Luck pass to the right to Robert Turbin for 11 yards to the Ind36. Tackled by Derrick Johnson.","(3:35) Cairo Santos kicks off to the endzone. Touchback.","(3:40) Cairo Santos 44 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(3:40) Kansas City Chiefs timeout.","(4:27) Charcandrick West rush up the middle for 9 yards to the Ind26. Tackled by Clayton Geathers.","(4:27) Indianapolis Colts timeout.","(4:34) De'Anthony Thomas rush to the left for a loss of 1 yard to the Ind35. Tackled by Clayton Geathers.","(4:34) Indianapolis Colts timeout.","(4:39) Charcandrick West rush to the left for a loss of 2 yards to the Ind34. Tackled by Robert Mathis.","(4:48) Penalty: Holding on Indianapolis (Darius Butler) 5 yards.","(4:48) Indianapolis Colts timeout.","(4:54) De'Anthony Thomas rush to the left for 3 yards to the Ind37. Tackled by David Parry.","(5:39) Charcandrick West rush to the right for no gain to the Ind40. Tackled by Lavar Edwards.","(6:27) Nick Foles pass to the right to Jeremy Maclin for 28 yards to the Ind40. Tackled by Rashaan Melvin.","(7:09) Charcandrick West rush to the right for 2 yards to the KC32. Tackled by D'Qwell Jackson.","(7:17) Pat McAfee punts for 44 yards to KC30. No return.","(7:23) Andrew Luck incomplete pass to the right intended for T.Y. Hilton.","(7:55) Andrew Luck rush to the left for 1 yard to the Ind26. Tackled by Phillip Gaines.","(8:00) Andrew Luck incomplete pass to the left intended for T.Y. Hilton defensed by Dadi Nicolas.","(8:00) Cairo Santos kicks off to the endzone. Touchback.","(8:04) Cairo Santos 22 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(8:08) Nick Foles incomplete pass to the right intended for Chris Conley.","(8:13) Nick Foles incomplete pass to the right intended for Charcandrick West.","(8:57) Charcandrick West rush up the middle for a loss of 3 yards to the Ind4. Tackled by Hassan Ridgeway.","(9:44) Nick Foles pass to the right to Demetrius Harris for 12 yards to the Ind1. Tackled by Rashaan Melvin.","(10:25) Nick Foles pass to the right to Tyreek Hill for 4 yards to the Ind13. Tackled by Clayton Geathers.","(11:03) Nick Foles pass to the left to Jeremy Maclin for 2 yards to the Ind17. Tackled by Mike Adams.","(11:40) Nick Foles pass to the right to Chris Conley for 17 yards to the Ind19. Tackled by Rashaan Melvin.","(11:44) Penalty: Holding on Indianapolis (Patrick Robinson) 5 yards.","(11:44) Kansas City Chiefs timeout.","(12:25) Charcandrick West rush to the left for 2 yards to the Ind41. Tackled by D'Qwell Jackson.","(13:05) Charcandrick West rush to the right for 7 yards to the Ind43. Tackled by Robert Mathis and Rashaan Melvin.","(13:22) Pat McAfee punts for 58 yards to KC22. Tyreek Hill return for 28 yards to KC50. Tackled by Jack Doyle.","(14:05) Andrew Luck rush up the middle for 13 yards to the Ind20. Tackled by Derrick Johnson.","(14:37) Andrew Luck sacked at Ind7 for a loss of 7 yards by Chris Jones.","(14:42) Andrew Luck incomplete pass to the left intended for Erik Swoope.","(14:51) Dustin Colquitt punts for 44 yards to Ind9. T.Y. Hilton return for 5 yards to Ind14. Tackled by De'Anthony Thomas.","(15:00) Penalty: Illegal Formation on Kansas City -5 yards.","(0:08) Nick Foles sacked at Ind48 for a loss of 10 yards by Erik Walden.","(0:16) Nick Foles incomplete pass to the left intended for Travis Kelce defensed by Clayton Geathers.","(0:52) Charcandrick West rush up the middle for 4 yards to the Ind38. Tackled by David Parry.","(1:27) Nick Foles pass to the left to Chris Conley for 33 yards to the Ind42.","(2:05) Charcandrick West rush up the middle for no gain to the KC25. Tackled by David Parry.","(2:05) Pat McAfee kicks off to the endzone. Touchback.","(2:05) Adam Vinatieri extra point is good.","(2:12) Andrew Luck pass to the left to Donte Moncrief for 3 yards for a TOUCHDOWN.","(2:49) Frank Gore rush up the middle for 6 yards to the KC3. Tackled by Derrick Johnson.","(2:52) Andrew Luck incomplete pass to the right intended for Frank Gore.","(3:18) Penalty: Offside on Kansas City (Dee Ford) 5 yards.","(4:02) Andrew Luck pass to the right to Phillip Dorsett for 13 yards to the KC14. Tackled by Derrick Johnson.","(4:34) Andrew Luck pass to the left to Erik Swoope for 14 yards to the KC27. Tackled by Ron Parker.","(5:05) Donte Moncrief rush to the left for a loss of 1 yard to the KC41. Tackled by Jaye Howard.","(5:25) Penalty: Too Many Men on Field on Kansas City 5 yards.","(5:46) Robert Turbin rush up the middle for 2 yards to the KC45. Tackled by Tamba Hali.","(6:27) Frank Gore rush up the middle for 1 yard to the KC47. Tackled by Daniel Sorensen.","(6:55) Andrew Luck rush up the middle for 7 yards to the KC48. Tackled by Daniel Sorensen.","(7:34) Andrew Luck pass to the left to Jack Doyle for 20 yards to the Ind45. Tackled by Derrick Johnson.","(7:34) Cairo Santos kicks off to the endzone. Touchback.","(7:34) Cairo Santos extra point is good.","(7:41) Nick Foles pass to the left to Tyreek Hill for 34 yards for a TOUCHDOWN.","(8:25) Nick Foles pass to the right to Tyreek Hill for 1 yard to the Ind34. Tackled by Rashaan Melvin.","(8:57) Charcandrick West rush up the middle for 18 yards to the Ind25. Tackled by Darius Butler. Penalty: Illegal Block on Kansas City (De'Anthony Thomas) -10 yards.","(9:37) Nick Foles pass to the left to Travis Kelce for 5 yards to the Ind43. Tackled by Patrick Robinson.","(10:17) Nick Foles pass to the right to Charcandrick West for 2 yards to the Ind48. Tackled by Rashaan Melvin.","(10:54) Charcandrick West rush up the middle for 4 yards to the KC50. Tackled by Akeem Ayers.","(11:10) Alex Smith rush to the left for 1 yard to the KC46. Tackled by Clayton Geathers.","(11:51) Alex Smith rush to the right for 8 yards to the KC45. Tackled by Clayton Geathers.","(12:24) Alex Smith pass to the left to Tyreek Hill for 10 yards to the KC37. Tackled by Edwin Jackson.","(13:01) Charcandrick West rush to the right for 2 yards to the KC27. Tackled by Akeem Ayers.","(13:14) Pat McAfee punts for 49 yards to KC9. Tyreek Hill return for 16 yards to KC25. Tackled by Jack Doyle.","(13:19) Andrew Luck incomplete pass to the left intended for Donte Moncrief.","(13:55) Frank Gore rush to the left for 1 yard to the Ind42. Tackled by Dontari Poe and Ron Parker.","(14:28) Frank Gore rush up the middle for 2 yards to the Ind41. Tackled by Ramik Wilson.","(15:00) Andrew Luck pass to the left to Donte Moncrief for 14 yards to the Ind39. Tackled by Eric Berry.","(15:00) Cairo Santos kicks off to the endzone. Touchback.","(0:19) Andrew Luck rush up the middle for a loss of 1 yard to the Ind24.","(0:19) Cairo Santos kicks off to the endzone. Touchback.","(0:19) Cairo Santos extra point is good.","(0:24) Alex Smith pass to the right to Jeremy Maclin for 13 yards for a TOUCHDOWN.","(0:28) Alex Smith incomplete pass to the middle intended for Jeremy Maclin.","(0:28) Kansas City Chiefs timeout.","(0:38) Alex Smith pass to the left to Spencer Ware for 23 yards to the Ind13. Tackled by Erik Walden and Mike Adams.","(0:38) Indianapolis Colts timeout.","(0:42) Andrew Luck pass intended for Donte Moncrief INTERCEPTED by Phillip Gaines. No return. Tackled by Donte Moncrief.","(0:51) Dustin Colquitt punts for 44 yards to Ind29. No return.","(0:55) Alex Smith incomplete pass to the middle intended for Jeremy Maclin defensed by T.J. Green.","(0:59) Alex Smith incomplete pass to the middle intended for Jeremy Maclin.","(1:07) Penalty: Holding on Kansas City (Mitchell Schwartz) -10 yards.","(1:28) Alex Smith pass to the left to Chris Conley for 9 yards to the KC37. Tackled by Darius Butler.","(1:44) Pat McAfee punts for 57 yards to KC15. Tyreek Hill return for 13 yards to KC28. Tackled by Jordan Todman.","(1:48) Andrew Luck incomplete pass to the middle intended for T.Y. Hilton.","(1:52) Andrew Luck incomplete pass to the left intended for Donte Moncrief.","(2:00) Andrew Luck rush to the right for 7 yards to the Ind28. Tackled by Derrick Johnson.","(2:00) Two Minute Warning.","(2:05) Andrew Luck pass to the left to Donte Moncrief for 15 yards to the Ind21. Tackled by Phillip Gaines.","(2:18) Dustin Colquitt punts for 54 yards to Ind6. No return.","(2:22) Alex Smith incomplete pass to the middle intended for Tyreek Hill defensed by T.Y. McGill.","(2:22) Penalty: False Start on Kansas City (Jeremy Maclin) -5 yards.","(2:26) Alex Smith incomplete pass to the left intended for Chris Conley.","(2:31) Alex Smith incomplete pass to the left intended for Demetrius Harris.","(3:14) Alex Smith pass to the left to Travis Kelce for 21 yards to the KC45. Tackled by Darius Butler.","(3:56) Alex Smith pass to the right to Charcandrick West for 6 yards to the KC24. Tackled by Edwin Jackson.","(4:02) Alex Smith incomplete pass to the right intended for Travis Kelce.","(4:11) Pat McAfee punts for 41 yards to KC18. No return.","(4:48) Andrew Luck rush up the middle for 10 yards to the Ind41. Tackled by Derrick Johnson.","(5:32) Andrew Luck sacked at Ind31 for a loss of 10 yards by Tamba Hali and Dee Ford.","(6:11) Andrew Luck pass to the left to Phillip Dorsett for 3 yards to the Ind41. Tackled by Phillip Gaines.","(6:51) Robert Turbin rush up the middle for 7 yards to the Ind38. Tackled by Tamba Hali.","(7:25) Frank Gore rush to the left for 3 yards to the Ind31. Tackled by Dontari Poe.","(7:45) Frank Gore rush up the middle for 5 yards to the Ind28. Tackled by Daniel Sorensen.","(7:56) Dustin Colquitt punts for 52 yards to Ind24. Josh Ferguson - no return. FUMBLE, recovered by Ind (Rashaan Melvin).","(8:41) Spencer Ware rush to the left for no gain to the KC24. Tackled by Zach Kerr.","(9:24) Charcandrick West rush to the left for 7 yards to the KC24. Tackled by Patrick Robinson.","(10:00) Charcandrick West rush to the left for 2 yards to the KC17. Tackled by Patrick Robinson.","(10:07) Pat McAfee kicks off to the KC-6. Tyreek Hill return for 21 yards to KC15. Tackled by Josh Ferguson.","(10:07) Adam Vinatieri extra point is good.","(10:16) Andrew Luck pass to the middle to Frank Gore for 18 yards for a TOUCHDOWN.","(10:20) Andrew Luck incomplete pass to the left intended for Jack Doyle.","(10:59) Andrew Luck pass to the left to Jack Doyle for 16 yards to the KC18. Tackled by Ron Parker.","(11:45) Andrew Luck pass to the right to Erik Swoope for 16 yards to the KC34. Tackled by Dee Ford and Derrick Johnson.","(12:24) Frank Gore rush to the right for 2 yards to the Ind50. Tackled by Jaye Howard.","(12:57) Frank Gore rush up the middle for 11 yards to the Ind48. Tackled by Ramik Wilson and Derrick Johnson.","(12:58) Cairo Santos onside kickoff to the Ind37. Onside kick recovered by receiving team by Chris Carter.","(12:58) Cairo Santos extra point is good.","(12:58) Nick Foles pass to the middle to Travis Kelce for 14 yards for a TOUCHDOWN. Penalty: Unnecessary Roughness on Indianapolis (T.J. Green) 15 yards.","(13:43) Spencer Ware rush to the right for 4 yards to the Ind14. Tackled by Edwin Jackson.","(14:18) Nick Foles pass to the right to Spencer Ware for 5 yards to the Ind18. Tackled by Clayton Geathers and Robert Mathis.","(15:00) Nick Foles pass to the right to Demetrius Harris for 5 yards to the Ind23. Tackled by Patrick Robinson and Lavar Edwards.","(0:42) Spencer Ware rush up the middle for 3 yards to the Ind28. Tackled by D'Qwell Jackson.","(1:26) Nick Foles pass to the right to Tyreek Hill for 49 yards to the Ind31. Tackled by T.J. Green.","(1:39) Pat McAfee punts for 55 yards to KC0. Touchback.","(2:19) Andrew Luck sacked at Ind45 for a loss of 6 yards by Dee Ford.","(2:56) Andrew Luck pass to the right to Frank Gore for 7 yards to the KC49. Tackled by Daniel Sorensen.","(3:02) Andrew Luck incomplete pass to the left intended for Devin Street defensed by Steven Nelson.","(3:35) Andrew Luck pass to the right to Phillip Dorsett for 12 yards to the Ind44. Tackled by Eric Berry.","(4:09) Andrew Luck rush to the right for 6 yards to the Ind32. Tackled by Phillip Gaines.","(4:15) Andrew Luck incomplete pass to the middle intended for T.Y. Hilton.","(4:51) Frank Gore rush up the middle for 6 yards to the Ind26. Tackled by Ramik Wilson.","(4:57) 28 yard field goal attempt by Cairo Santos is NO GOOD. Holder: Dustin Colquitt.","(5:40) Nick Foles sacked at Ind10 for a loss of 6 yards by Robert Mathis.","(6:18) Spencer Ware rush to the left for 3 yards to the Ind4. Tackled by Robert Mathis.","(6:24) Nick Foles incomplete pass to the left intended for Travis Kelce.","(6:54) Nick Foles pass to the left to Travis Kelce for 16 yards to the Ind7. Tackled by Mike Adams.","(7:02) Andrew Luck rush up the middle for no gain to the Ind26. FUMBLE, recovered by KC (Ramik Wilson). Tackled by Andrew Luck.","(7:24) Andrew Luck pass to the middle to Donte Moncrief for 9 yards to the Ind26. Tackled by Eric Berry.","(7:32) Dustin Colquitt punts for 51 yards to Ind17. No return.","(7:38) Nick Foles incomplete pass to the right intended for Jeremy Maclin defensed by Patrick Robinson.","(8:18) Nick Foles pass to the left to Demetrius Harris for a loss of 4 yards to the KC32. Tackled by D'Qwell Jackson.","(8:54) Spencer Ware rush to the left for 1 yard to the KC36. Tackled by Hassan Ridgeway and Akeem Ayers.","(9:02) Pat McAfee punts for 43 yards to KC35. No return.","(9:43) Andrew Luck pass to the right to Phillip Dorsett for 7 yards to the Ind22. Tackled by Marcus Peters.","(10:09) Penalty: Holding on Indianapolis (Anthony Castonzo) -10 yards.","(10:13) Andrew Luck incomplete pass to the right intended for Donte Moncrief.","(10:20) Andrew Luck incomplete pass to the right intended for Donte Moncrief defensed by Marcus Peters.","(10:20) Cairo Santos kicks off to the endzone. Touchback.","(10:25) Cairo Santos 33 yard field goal attempt is GOOD. Holder: Dustin Colquitt.","(10:30) Nick Foles incomplete pass to the left intended for Jeremy Maclin.","(11:07) Spencer Ware rush up the middle for 7 yards to the Ind15. Tackled by D'Qwell Jackson and T.J. Green.","(11:38) Alex Smith sacked at Ind22 for no gain by Edwin Jackson.","(12:25) Alex Smith pass to the right to Travis Kelce for 15 yards to the Ind22. Tackled by T.J. Green.","(12:59) Tyreek Hill rush to the left for 7 yards to the Ind37. Tackled by Mike Adams.","(13:05) Alex Smith incomplete pass to the left intended for Jeremy Maclin defensed by Vontae Davis.","(13:41) Alex Smith pass to the right to Travis Kelce for 11 yards to the Ind44. Tackled by Clayton Geathers.","(14:14) Spencer Ware rush up the middle for 1 yard to the KC45. Tackled by D'Qwell Jackson.","(14:50) Alex Smith pass to the right to Travis Kelce for 19 yards to the KC44. Tackled by Clayton Geathers and T.J. Green.","(14:56) Alex Smith incomplete pass to the right intended for De'Anthony Thomas defensed by Patrick Robinson.","(15:00) Alex Smith incomplete pass to the right intended for Jeremy Maclin.","(15:00) Pat McAfee kicks off to the endzone. Touchback."]