["(0:05) 61 yard field goal attempt by Wil Lutz is NO GOOD. Holder: Thomas Morstead.","(0:05) Oakland Raiders timeout.","(0:09) Drew Brees incomplete pass to the right intended for Coby Fleener.","(0:10) Drew Brees incomplete pass to the middle.","(0:23) Drew Brees pass to the right to Willie Snead for 13 yards to the Oak43. Tackled by Reggie Nelson.","(0:24) Drew Brees incomplete pass to the middle.","(0:40) Drew Brees pass to the middle to Willie Snead for 21 yards to the NO44. Tackled by Malcolm Smith.","(0:47) Sebastian Janikowski kicks off to the NO5. Marcus Murphy return for 18 yards to NO23. Tackled by Brynden Trawick.","(0:47) Derek Carr 2 pt conversion pass to Michael Crabtree is GOOD. Penalty: Unsports. Conduct on Oakland (Michael Crabtree) -15 yards.","(0:47) Oakland Raiders timeout.","(0:52) Derek Carr pass to the left to Seth Roberts for 10 yards for a TOUCHDOWN.","(0:52) Oakland Raiders timeout.","(1:37) Derek Carr pass to the right to Jalen Richard for 3 yards to the NO10. Tackled by Craig Robertson.","(1:41) Penalty: Pass Interference on New Orleans (Craig Robertson) 5 yards.","(1:50) Derek Carr rush to the right for 5 yards to the NO18. Tackled by Kenny Vaccaro.","(1:55) Derek Carr incomplete pass to the right intended for Seth Roberts.","(2:00) Derek Carr incomplete pass to the right intended for Clive Walford.","(2:00) Two Minute Warning.","(2:41) Derek Carr pass to the right to Michael Crabtree for 12 yards to the NO23. Tackled by Jairus Byrd.","(3:18) Jalen Richard rush to the right for 1 yard to the NO35. Tackled by Craig Robertson.","(3:22) Penalty: Holding on New Orleans (P.J. Williams) 5 yards.","(4:04) Latavius Murray rush to the left for a loss of 2 yards to the NO41. Tackled by Stephone Anthony.","(4:43) Jalen Richard rush to the left for 8 yards to the NO39. Tackled by Craig Robertson.","(5:23) Derek Carr pass to the left to Clive Walford for 18 yards to the NO47. Tackled by Jairus Byrd and Craig Robertson.","(6:03) Latavius Murray rush to the left for 10 yards to the Oak35. Tackled by P.J. Williams and James Laurinaitis.","(6:03) Wil Lutz kicks off to the endzone. Touchback.","(6:03) Wil Lutz extra point is good.","(6:07) Drew Brees pass to the left to Travaris Cadet for 2 yards for a TOUCHDOWN.","(6:07) New Orleans Saints timeout.","(7:32) Drew Brees pass to the left to Willie Snead for 43 yards to the Oak26. Tackled by DJ Hayden. FUMBLE, recovered by NO (Michael Thomas) and advanced for 10 yards.","(8:15) Mark Ingram rush to the right for 4 yards to the NO31. Tackled by Khalil Mack.","(8:20) Penalty: Pass Interference on Oakland (DJ Hayden) 11 yards.","(8:26) Sebastian Janikowski kicks off to the NO2. Marcus Murphy return for 14 yards to NO16. Tackled by Brynden Trawick.","(8:26) Derek Carr 2 pt conversion pass to Amari Cooper is GOOD.","(8:38) Jalen Richard rush to the left for 75 yards for a TOUCHDOWN.","(8:42) Derek Carr incomplete pass to the right intended for Andre Holmes defensed by Kenny Vaccaro.","(8:42) Wil Lutz kicks off to the endzone. Touchback.","(8:46) Wil Lutz 20 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(8:46) New Orleans Saints timeout.","(9:31) Drew Brees rush to the left for 4 yards to the Oak2. Tackled by Stacy McGee.","(9:39) Drew Brees incomplete pass to the right intended for Travaris Cadet.","(10:15) Mark Ingram rush to the right for 2 yards to the Oak6. Tackled by Khalil Mack and Darius Latham.","(10:52) Mark Ingram rush to the right for 17 yards to the Oak8. Tackled by Reggie Nelson.","(10:58) Penalty: Pass Interference on Oakland (DJ Hayden) 17 yards.","(11:37) Drew Brees pass to the left to Coby Fleener for 6 yards to the Oak42. Tackled by Malcolm Smith and Jihad Ward.","(11:43) Penalty: Pass Interference on Oakland (Malcolm Smith) 23 yards.","(11:53) Sebastian Janikowski kicks off to the NO3. Marcus Murphy return for 26 yards to NO29. Tackled by Johnny Holton.","(11:53) Derek Carr 2 pt conversion pass is NO GOOD - intended for Michael Crabtree.","(11:57) Jamize Olawale rush to the left for 2 yards for a TOUCHDOWN.","(12:02) Derek Carr incomplete pass to the right intended for Amari Cooper.","(12:28) Derek Carr pass to the left to Michael Crabtree for 25 yards to the NO2. Tackled by James Laurinaitis and Kenny Vaccaro.","(13:12) Derek Carr pass to the left to Amari Cooper for 43 yards to the NO27. Tackled by P.J. Williams and Jairus Byrd.","(13:42) Penalty: Pass Interference on Oakland (Michael Crabtree) -10 yards.","(13:47) 50 yard field goal attempt by Wil Lutz is NO GOOD. Holder: Thomas Morstead.","(13:53) Drew Brees incomplete pass to the right intended for Coby Fleener defensed by Keith McGill.","(14:31) Mark Ingram rush to the left for 3 yards to the Oak33. Tackled by Khalil Mack and Jihad Ward.","(15:00) Drew Brees pass to the left to Michael Thomas for 2 yards to the Oak36. Tackled by DJ Hayden.","(0:27) Drew Brees pass to the right to Willie Snead for 11 yards to the Oak38. Tackled by Keith McGill.","(0:54) Drew Brees pass to the left to Travaris Cadet for 6 yards to the Oak49. Tackled by Malcolm Smith.","(1:28) Tim Hightower rush to the left for no gain to the NO45. Tackled by Denico Autry and Ben Heeney.","(2:03) Brandin Cooks rush to the left for 11 yards to the NO45. Tackled by DJ Hayden.","(2:38) Drew Brees pass to the left to Tim Hightower for 1 yard to the NO34. Tackled by Reggie Nelson and DJ Hayden.","(3:04) Drew Brees pass to the right to Michael Thomas for 9 yards to the NO33. Tackled by Ben Heeney.","(3:11) Sebastian Janikowski kicks off to the NO6. Marcus Murphy return for 18 yards to NO24. Tackled by Johnny Holton.","(3:16) Sebastian Janikowski 31 yard field goal attempt is GOOD. Holder: Marquette King.","(3:21) Derek Carr incomplete pass to the middle intended for Clive Walford.","(3:51) DeAndre Washington rush to the right for 2 yards to the NO13. Tackled by Craig Robertson and James Laurinaitis.","(3:55) Derek Carr incomplete pass to the right intended for Seth Roberts defensed by Craig Robertson.","(4:16) Derek Carr pass to the right to Michael Crabtree for 20 yards to the NO15. Tackled by Ken Crawley.","(5:02) Latavius Murray rush to the right for a loss of 1 yard to the NO35. Tackled by Kenny Vaccaro.","(5:31) Derek Carr pass to the left to Taiwan Jones for 16 yards to the NO34. Tackled by James Laurinaitis.","(6:08) Derek Carr pass to the left to Michael Crabtree for 9 yards to the Oak50. Tackled by De'Vante Harris.","(6:51) Latavius Murray rush to the left for 5 yards to the Oak41. Tackled by Kenny Vaccaro.","(7:22) Latavius Murray rush to the right for 3 yards to the Oak36. Tackled by Michael Mauti.","(7:22) New Orleans Saints timeout.","(7:27) Derek Carr incomplete pass to the right intended for Latavius Murray defensed by James Laurinaitis.","(7:52) Derek Carr pass to the right to Latavius Murray for 13 yards to the Oak33. Tackled by Paul Kruger.","(7:52) Penalty: False Start on Oakland (Matt McCants) -5 yards.","(7:52) Wil Lutz kicks off to the endzone. Touchback.","(7:52) Wil Lutz extra point is good.","(8:03) Drew Brees pass to the left to Brandin Cooks for 98 yards for a TOUCHDOWN.","(8:12) Marquette King punts for 43 yards to NO2. No return.","(8:17) Derek Carr incomplete pass to the left intended for Amari Cooper.","(9:00) DeAndre Washington rush to the right for no gain to the NO45. Tackled by John Jenkins and Craig Robertson.","(9:04) Derek Carr incomplete pass to the right intended for Amari Cooper.","(9:39) Latavius Murray rush to the left for 3 yards to the NO45. Tackled by David Onyemata and John Jenkins.","(10:20) Latavius Murray rush to the left for 9 yards to the NO48. Tackled by James Laurinaitis.","(11:00) Derek Carr pass to the right to Michael Crabtree for 7 yards to the Oak43. Tackled by Ken Crawley.","(11:23) Derek Carr pass to the right to Michael Crabtree for 6 yards to the Oak36. Tackled by Ken Crawley.","(11:37) Thomas Morstead punts for 51 yards to Oak34. Jalen Richard return for 6 yards to Oak40. Tackled by Daniel Lasco. Penalty: Holding on Oakland (Brynden Trawick) -10 yards.","(12:08) Drew Brees pass to the right to Michael Thomas for 4 yards to the NO15. Tackled by David Amerson.","(12:44) Drew Brees pass to the right to Brandin Cooks for 7 yards to the NO11. Tackled by David Amerson.","(12:57) Penalty: False Start on New Orleans (Tim Lelito) -5 yards.","(13:29) Mark Ingram rush to the right for a loss of 1 yard to the NO9. Tackled by Malcolm Smith.","(13:41) Marquette King punts for 53 yards to NO15. Marcus Murphy return for 5 yards to NO20. Tackled by Daren Bates. Penalty: Illegal Block on New Orleans (Ken Crawley) -10 yards.","(13:44) Derek Carr incomplete pass to the middle intended for Amari Cooper.","(14:22) DeAndre Washington rush to the left for 3 yards to the Oak32. Tackled by Nick Fairley and James Laurinaitis.","(15:00) DeAndre Washington rush to the right for 4 yards to the Oak29. Tackled by Nick Fairley.","(15:00) Wil Lutz kicks off to the endzone. Touchback.","(0:03) Derek Carr pass to the left to Amari Cooper for 21 yards to the NO35. Tackled by Kenny Vaccaro.","(0:03) Oakland Raiders timeout.","(0:06) Derek Carr pass to the right to Clive Walford for a loss of 2 yards to the Oak44. Tackled by Craig Robertson.","(0:06) New Orleans Saints timeout.","(0:08) Derek Carr incomplete pass to the middle.","(0:24) Derek Carr pass to the right to Michael Crabtree for 8 yards to the Oak46. Tackled by Roman Harper.","(0:45) Derek Carr pass to the right to Seth Roberts for 9 yards to the Oak38. Tackled by De'Vante Harris.","(0:45) Oakland Raiders timeout.","(0:49) Latavius Murray rush to the right for 2 yards to the Oak29. Tackled by Cameron Jordan.","(1:11) Derek Carr pass to the left to Clive Walford for 9 yards to the Oak27. Tackled by Craig Robertson.","(1:20) Thomas Morstead punts for 44 yards to Oak8. TJ Carrie return for 10 yards to Oak18. Tackled by Daniel Lasco.","(1:26) Penalty: Delay of Game on New Orleans (Thomas Morstead) -5 yards.","(1:26) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(1:32) Drew Brees pass to the right to Travaris Cadet for 6 yards to the Oak47. Tackled by Keith McGill.","(1:35) Drew Brees incomplete pass to the right intended for Travaris Cadet.","(1:40) Penalty: Holding on Oakland (DJ Hayden) 5 yards.","(1:43) Drew Brees incomplete pass to the right intended for Travaris Cadet.","(2:00) Drew Brees rush to the right for 1 yard to the NO42. Tackled by Khalil Mack.","(2:00) Two Minute Warning.","(2:15) Mark Ingram rush to the left for 2 yards to the NO41. Tackled by Denico Autry.","(2:40) Drew Brees pass to the right to Michael Thomas for 7 yards to the NO39. Tackled by David Amerson.","(2:52) Marquette King punts for 41 yards to NO26. Marcus Murphy return for 6 yards to NO32. Tackled by Jamize Olawale.","(3:31) Derek Carr pass to the middle to DeAndre Washington for 10 yards to the Oak33. Tackled by James Laurinaitis.","(4:09) Penalty: Holding on Oakland (Clive Walford) -10 yards.","(4:45) Latavius Murray rush to the right for 9 yards to the Oak33. Tackled by Ken Crawley.","(4:49) Derek Carr incomplete pass to the left intended for Michael Crabtree.","(4:55) Wil Lutz kicks off to the Oak3. Taiwan Jones return for 21 yards to Oak24. Tackled by Kenny Vaccaro.","(4:55) Wil Lutz extra point is good.","(5:02) Drew Brees pass to the right to Brandin Cooks for 15 yards for a TOUCHDOWN.","(5:36) Drew Brees pass to the left to Michael Thomas for 25 yards to the Oak15. Tackled by Reggie Nelson.","(6:12) Drew Brees pass to the right to Brandin Cooks for 16 yards to the Oak40. Tackled by DJ Hayden.","(6:46) Tim Hightower rush to the left for 1 yard to the NO44. Tackled by Justin Ellis.","(7:21) Mark Ingram rush to the right for 3 yards to the NO43. Tackled by Khalil Mack.","(7:59) Mark Ingram rush to the left for 9 yards to the NO40. Tackled by Ben Heeney and Malcolm Smith.","(8:33) Drew Brees pass to the left to Michael Thomas for 11 yards to the NO31. Tackled by Ben Heeney.","(9:01) Mark Ingram rush to the left for no gain to the NO20. Tackled by Justin Ellis.","(9:11) Marquette King punts for 62 yards to NO0. Touchback.","(9:16) Derek Carr incomplete pass to the right intended for Michael Crabtree.","(9:58) Latavius Murray rush to the right for 9 yards to the Oak38. Tackled by Michael Mauti.","(10:25) Taiwan Jones rush to the right for a loss of 8 yards to the Oak29. Tackled by Craig Robertson.","(11:03) Derek Carr rush to the left for 11 yards to the Oak37. Tackled by De'Vante Harris.","(11:07) Derek Carr incomplete pass to the right intended for Amari Cooper defensed by P.J. Williams.","(11:47) Latavius Murray rush to the right for 1 yard to the Oak26. Tackled by Craig Robertson.","(11:52) Penalty: Pass Interference on New Orleans (Delvin Breaux) 10 yards.","(11:57) Wil Lutz kicks off to the Oak8. Taiwan Jones return for 17 yards to Oak25. Tackled by Erik Harris. Penalty: Holding on Oakland (Daren Bates) -10 yards.","(11:57) Wil Lutz extra point is good.","(12:00) Drew Brees pass to the left to Willie Snead for 1 yard for a TOUCHDOWN.","(12:00) Oakland Raiders timeout.","(12:11) Penalty: Encroachment on Oakland (Shilique Calhoun) 1 yards.","(12:51) Drew Brees pass to the right to Brandin Cooks for 3 yards to the Oak2. Tackled by Malcolm Smith.","(12:56) Drew Brees incomplete pass to the right intended for Travaris Cadet.","(13:36) Drew Brees pass to the right to Brandin Cooks for 4 yards to the Oak5. Tackled by Reggie Nelson.","(14:27) Drew Brees pass to the left to Willie Snead for 49 yards to the Oak9. Tackled by Sean Smith.","(15:00) Tim Hightower rush to the left for 5 yards to the NO42. Tackled by Khalil Mack.","(0:28) Tim Hightower rush to the right for 3 yards to the NO37. Tackled by Ben Heeney.","(1:01) Drew Brees pass to the left to Willie Snead for 6 yards to the NO34. Tackled by Keith McGill.","(1:43) Mark Ingram rush to the left for 3 yards to the NO28. Tackled by Keith McGill.","(1:43) Sebastian Janikowski kicks off to the endzone. Touchback.","(1:43) Sebastian Janikowski extra point is good.","(1:48) Latavius Murray rush to the left for 6 yards for a TOUCHDOWN.","(2:35) Derek Carr pass to the left to Amari Cooper for 34 yards to the NO6. Tackled by Jairus Byrd.","(3:17) DeAndre Washington rush to the left for 5 yards to the NO40. Tackled by Nick Fairley.","(4:03) Derek Carr pass to the middle to Amari Cooper for 35 yards to the NO45. Tackled by P.J. Williams.","(4:34) Derek Carr pass to the left to Jalen Richard for 8 yards to the Oak20. Tackled by Craig Robertson.","(5:20) Derek Carr pass to the left to Amari Cooper for 4 yards to the Oak12. Tackled by P.J. Williams.","(5:43) Penalty: False Start on Oakland (Lee Smith) -5 yards.","(6:24) Latavius Murray rush to the right for 4 yards to the Oak13. Tackled by Kenny Vaccaro.","(6:31) Penalty: Holding on Oakland (Cory James) -9 yards.","(6:36) Wil Lutz 42 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(6:41) Drew Brees incomplete pass to the right. Penalty: Intentional Grounding on New Orleans (Drew Brees) -13 yards.","(7:18) John Kuhn rush to the left for 2 yards to the Oak11. Tackled by Denico Autry and Khalil Mack.","(7:22) Drew Brees incomplete pass to the left intended for John Kuhn.","(8:01) Drew Brees pass to the left to Mark Ingram for 20 yards to the Oak13. Tackled by Jihad Ward and Malcolm Smith.","(8:30) Mark Ingram rush to the left for 4 yards to the Oak33. Tackled by Keith McGill and Malcolm Smith.","(9:05) Drew Brees pass to the right to Willie Snead for 16 yards to the Oak37. Tackled by Reggie Nelson.","(9:49) Travaris Cadet rush to the right for 1 yard to the NO47. Tackled by Keith McGill and Bruce Irvin.","(10:22) Drew Brees pass to the left to Willie Snead for 12 yards to the NO46. Tackled by Reggie Nelson.","(11:01) Mark Ingram rush to the left for 12 yards to the NO34. Tackled by Reggie Nelson.","(11:42) John Kuhn rush to the right for 2 yards to the NO22. Tackled by Justin Ellis.","(12:15) Drew Brees pass to the middle to Mark Ingram for 9 yards to the NO20. Tackled by David Amerson.","(12:18) Drew Brees incomplete pass to the left intended for Brandin Cooks defensed by Sean Smith.","(12:23) Sebastian Janikowski kicks off to the NO1. Marcus Murphy return for 10 yards to NO11. Tackled by Taiwan Jones.","(12:28) Sebastian Janikowski 47 yard field goal attempt is GOOD. Holder: Marquette King.","(12:47) Derek Carr pass to the right to Amari Cooper for no gain to the NO29. FUMBLE, recovered by Oak.","(13:32) Latavius Murray rush to the right for 1 yard to the NO29. Tackled by Tyeler Davison.","(14:18) Derek Carr pass to the right to Taiwan Jones for 1 yard to the NO30. Tackled by P.J. Williams.","(14:45) Penalty: Holding on Oakland (Michael Crabtree) -10 yards.","(14:52) Drew Brees sacked at NO21 for a loss of 4 yards by Bruce Irvin. FUMBLE, recovered by Oak (Jihad Ward). Tackled by Jahri Evans.","(14:56) Drew Brees incomplete pass to the left intended for Brandin Cooks.","(15:00) Drew Brees incomplete pass to the left intended for Coby Fleener.","(15:00) Sebastian Janikowski kicks off to the endzone. Touchback."]