["(0:40) Andy Dalton rush up the middle for no gain to the NYJ25.","(0:46) Ryan Fitzpatrick pass intended for Eric Decker INTERCEPTED by Josh Shaw. No return. Tackled by Eric Decker. Penalty: Unnecessary Roughness on New York (Eric Decker) 15 yards.","(0:50) Ryan Fitzpatrick incomplete pass to the right intended for Eric Decker defensed by Carlos Dunlap.","(0:54) Ryan Fitzpatrick incomplete pass to the left intended for Brandon Marshall.","(0:54) Mike Nugent kicks off to the endzone. Touchback.","(0:58) Mike Nugent 47 yard field goal attempt is GOOD. Holder: Kevin Huber.","(0:58) New York Jets timeout.","(1:11) Andy Dalton pass to the right to A.J. Green for 11 yards to the NYJ29. Tackled by Darrelle Revis.","(1:11) Cincinnati Bengals timeout.","(1:17) Jeremy Hill rush to the right for a loss of 2 yards to the NYJ40. Tackled by Lawrence Thomas.","(1:55) Jeremy Hill rush up the middle for a loss of 1 yard to the NYJ38. Tackled by Lawrence Thomas and David Harris.","(1:55) Two Minute Warning.","(2:01) Andy Dalton pass to the right to James Wright for 7 yards to the NYJ37. Tackled by Darron Lee and Darrelle Revis.","(2:22) Jeremy Hill rush to the right for 4 yards to the NYJ44. Tackled by Muhammad Wilkerson.","(2:30) Andy Dalton pass to the right to A.J. Green for 9 yards to the Cin37. Tackled by Marcus Gilchrist and Muhammad Wilkerson. Penalty: Face Mask on New York (Marcus Gilchrist) 15 yards.","(2:52) Jeremy Hill rush up the middle for 6 yards to the Cin28. Tackled by Lorenzo Mauldin and Leonard Williams.","(3:18) Andy Dalton pass to the right to A.J. Green for 6 yards to the Cin22. Tackled by Darrelle Revis and Buster Skrine.","(3:23) Nick Folk kicks off to the Cin-3. Adam Jones return for 19 yards to Cin16. Tackled by Rontez Miles and Josh Martin.","(3:25) Nick Folk 23 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(4:14) Bilal Powell rush to the right for 2 yards to the Cin6. Tackled by Shawn Williams and Pat Sims.","(4:20) Ryan Fitzpatrick pass to the right to Brandon Marshall for 4 yards to the Cin8. Tackled by Shawn Williams.","(5:01) Matt Forte rush up the middle for 3 yards to the Cin12. Tackled by Karlos Dansby and Michael Johnson.","(5:44) Ryan Fitzpatrick pass to the left to Eric Decker for 22 yards to the Cin15. Tackled by Shawn Williams and Chris Lewis-Harris.","(5:44) New York Jets timeout.","(6:29) Matt Forte rush to the left for 1 yard to the Cin37. Tackled by Vincent Rey.","(7:09) Matt Forte rush to the left for 4 yards to the Cin38. Tackled by George Iloka and Vincent Rey.","(7:48) Ryan Fitzpatrick pass to the right to Quincy Enunwa for 17 yards to the Cin42. Tackled by Vincent Rey.","(8:32) Ryan Fitzpatrick rush up the middle for 9 yards to the NYJ41. Tackled by Karlos Dansby.","(9:02) Penalty: Pass Interference on New York (Brandon Marshall) -10 yards.","(9:06) 52 yard field goal attempt by Mike Nugent is NO GOOD. Holder: Kevin Huber.","(9:10) Andy Dalton incomplete pass to the right intended for A.J. Green.","(9:54) Andy Dalton sacked at NYJ34 for a loss of 8 yards by Leonard Williams.","(10:23) Giovani Bernard rush to the left for 6 yards to the NYJ26. Tackled by Buster Skrine.","(10:53) Andy Dalton pass to the left to A.J. Green for 32 yards to the NYJ32. Tackled by Darrelle Revis.","(11:26) Giovani Bernard rush to the left for 11 yards to the Cin36. Tackled by Steve McLendon.","(11:26) Nick Folk kicks off to the endzone. Touchback.","(11:29) Nick Folk 20 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(11:33) Ryan Fitzpatrick incomplete pass to the right intended for Eric Decker.","(12:14) Matt Forte rush up the middle for a loss of 1 yard to the Cin2. Tackled by Geno Atkins.","(12:50) Ryan Fitzpatrick rush up the middle for 2 yards to the Cin1. Tackled by Vincent Rey.","(13:33) Matt Forte rush up the middle for 9 yards to the Cin3. Tackled by George Iloka.","(14:14) Matt Forte rush to the right for 3 yards to the Cin12. Tackled by Shawn Williams and Domata Peko.","(15:00) Bilal Powell rush to the right for 16 yards to the Cin15. Tackled by Dre Kirkpatrick and Shawn Williams.","(0:35) Ryan Fitzpatrick pass to the right to Quincy Enunwa for no gain to the Cin31. Tackled by Chris Lewis-Harris.","(1:13) Bilal Powell rush to the right for 7 yards to the Cin31. Tackled by Shawn Williams and Pat Sims.","(1:52) Bilal Powell rush to the right for 16 yards to the Cin38. Tackled by Shawn Williams.","(2:30) Matt Forte rush to the right for 8 yards to the NYJ46. Tackled by Karlos Dansby.","(3:09) Matt Forte rush to the right for 13 yards to the NYJ38. Tackled by George Iloka.","(3:09) Mike Nugent kicks off to the endzone. Touchback.","(3:09) Mike Nugent extra point is good.","(3:15) Jeremy Hill rush to the left for 12 yards for a TOUCHDOWN.","(3:48) Jeremy Hill rush to the right for no gain to the NYJ12. Tackled by Muhammad Wilkerson.","(4:15) James Wright rush to the left for 2 yards to the NYJ12. Tackled by Darron Lee.","(4:46) Andy Dalton pass to the left to A.J. Green for 6 yards to the NYJ14.","(4:46) New York Jets timeout.","(5:19) Andy Dalton rush to the right for 2 yards to the NYJ20. Tackled by Darron Lee and Leonard Williams.","(5:50) Andy Dalton pass to the left to Brandon LaFell for 49 yards to the NYJ22. Tackled by Marcus Williams.","(5:54) Andy Dalton incomplete pass to the right intended for Giovani Bernard.","(6:36) James Wright rush to the left for a loss of 8 yards to the Cin29. Tackled by Steve McLendon.","(7:18) Andy Dalton pass to the left to A.J. Green for 29 yards to the Cin37.","(7:26) Lachlan Edwards punts for 53 yards to Cin8. No return.","(7:33) Ryan Fitzpatrick incomplete pass to the left intended for Bilal Powell.","(8:20) Ryan Fitzpatrick pass to the left to Matt Forte for 8 yards to the NYJ39. Tackled by Karlos Dansby.","(9:01) Ryan Fitzpatrick rush up the middle for no gain to the NYJ33. FUMBLE, recovered by NYJ (Ryan Fitzpatrick).","(9:47) Ryan Fitzpatrick pass to the left to Matt Forte for 17 yards to the NYJ33. Tackled by Carlos Dunlap.","(9:53) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall defensed by Margus Hunt.","(10:07) Kevin Huber punts for 56 yards to NYJ13. Jalin Marshall return for 3 yards to NYJ16. Tackled by James Wright and Josh Shaw.","(10:40) Andy Dalton pass to the left to Giovani Bernard for 4 yards to the Cin31. Tackled by Darron Lee.","(11:19) Giovani Bernard rush up the middle for 3 yards to the Cin27. Tackled by Leonard Williams.","(11:49) Andy Dalton sacked at Cin24 for a loss of 7 yards by Muhammad Wilkerson.","(11:49) Penalty: False Start on Cincinnati (Clint Boling) -5 yards.","(12:00) Lachlan Edwards punts for 47 yards to Cin30. Adam Jones return for 6 yards to Cin36. Tackled by Josh Martin.","(12:42) Ryan Fitzpatrick sacked at NYJ23 for a loss of 1 yard by Geno Atkins.","(12:45) Ryan Fitzpatrick incomplete pass to the middle intended for Eric Decker.","(13:29) Matt Forte rush to the left for 2 yards to the NYJ24. Tackled by Carlos Dunlap.","(14:10) Ryan Fitzpatrick pass to the left to Brandon Marshall for 10 yards to the NYJ22. Tackled by Adam Jones.","(14:52) Matt Forte rush to the right for 1 yard to the NYJ12. Tackled by Geno Atkins and Michael Johnson.","(15:00) Mike Nugent kicks off to the NYJ0. Jalin Marshall return for 21 yards to NYJ21. Tackled by Nick Vigil. Penalty: Holding on New York (Josh Martin) -10 yards.","(0:01) Mike Nugent 21 yard field goal attempt is GOOD. Holder: Kevin Huber.","(0:18) Andy Dalton pass to the middle to Tyler Boyd for 14 yards to the NYJ3. Tackled by Buster Skrine.","(0:47) Andy Dalton pass to the left to Giovani Bernard for 1 yard to the NYJ17. Tackled by David Harris.","(0:47) Cincinnati Bengals timeout.","(0:54) Andy Dalton sacked at NYJ18 for a loss of 11 yards by Leonard Williams.","(1:00) Andy Dalton pass to the right to A.J. Green for 7 yards to the NYJ7.","(1:25) Andy Dalton pass to the right to A.J. Green for 4 yards to the NYJ14. Tackled by Darrelle Revis.","(1:29) Penalty: Pass Interference on New York (Buster Skrine) 25 yards.","(1:55) Giovani Bernard rush to the left for 1 yard to the NYJ43. Tackled by David Harris and Lorenzo Mauldin.","(2:00) Andy Dalton pass to the left to Tyler Boyd for 10 yards to the NYJ44.","(2:00) Two Minute Warning.","(2:17) Andy Dalton pass to the right to C.J. Uzomah for 5 yards to the Cin46. Tackled by Darron Lee.","(2:40) Andy Dalton rush to the right for 5 yards to the Cin41.","(3:00) Andy Dalton pass to the right to Brandon LaFell for 6 yards to the Cin36. Tackled by Marcus Williams.","(3:10) Andy Dalton pass to the right to Brandon LaFell for 15 yards to the Cin30. Tackled by Marcus Williams.","(3:19) Nick Folk kicks off to the Cin-1. Adam Jones return for 16 yards to Cin15. Tackled by Lawrence Thomas.","(3:23) Nick Folk 45 yard field goal attempt is GOOD. Holder: Lachlan Edwards.","(3:27) Ryan Fitzpatrick incomplete pass to the right intended for Quincy Enunwa defensed by Michael Johnson.","(3:27) Cincinnati Bengals timeout.","(4:06) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for a loss of 1 yard to the Cin27. Tackled by Karlos Dansby.","(4:43) Matt Forte rush to the left for 6 yards to the Cin26. Tackled by Karlos Dansby and Vincent Rey.","(5:13) Ryan Fitzpatrick pass to the left to Bilal Powell for 7 yards to the Cin32. Tackled by Chris Lewis-Harris.","(5:56) Matt Forte rush up the middle for 2 yards to the Cin39. Tackled by Vincent Rey and Domata Peko.","(6:38) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 3 yards to the Cin41. Tackled by Adam Jones.","(7:20) Matt Forte rush to the right for 8 yards to the Cin44. Tackled by Josh Shaw.","(8:01) Matt Forte rush to the left for 3 yards to the NYJ48. Tackled by Karlos Dansby and Vincent Rey.","(8:08) Kevin Huber punts for 30 yards to Cin45. No return. Penalty: Holding on New York (Buster Skrine) -10 yards.","(8:13) Andy Dalton incomplete pass to the right intended for Giovani Bernard defensed by David Harris.","(8:57) Andy Dalton sacked at Cin15 for a loss of 1 yard by Leonard Williams and Muhammad Wilkerson.","(9:38) Andy Dalton sacked at Cin16 for a loss of 9 yards by Steve McLendon.","(9:38) Nick Folk kicks off to the endzone. Touchback.","(9:38) Nick Folk extra point is NO GOOD.","(9:44) Ryan Fitzpatrick pass to the right to Eric Decker for 15 yards for a TOUCHDOWN.","(10:28) Matt Forte rush up the middle for 10 yards to the Cin15. Tackled by Shawn Williams.","(10:30) Ryan Fitzpatrick incomplete pass to the left intended for Eric Decker.","(10:36) Penalty: Unnecessary Roughness on Cincinnati (George Iloka) 15 yards.","(10:38) Ryan Fitzpatrick incomplete pass to the left intended for Matt Forte.","(11:13) Matt Forte rush to the right for a loss of 1 yard to the Cin40. Tackled by Shawn Williams.","(11:23) Mike Nugent kicks off to the NYJ-4. Jalin Marshall return for 65 yards to Cin39. Tackled by Derron Smith.","(11:23) Mike Nugent extra point is good.","(11:31) Andy Dalton pass to the left to A.J. Green for 54 yards for a TOUCHDOWN.","(12:12) Andy Dalton pass to the middle to Brandon LaFell for 21 yards to the Cin46. Tackled by Darrelle Revis.","(12:55) Giovani Bernard rush up the middle for 4 yards to the Cin25. Tackled by Muhammad Wilkerson.","(13:34) Andy Dalton pass to the right to A.J. Green for a loss of 1 yard to the Cin21. Tackled by Marcus Gilchrist.","(13:46) Lachlan Edwards punts for 54 yards to Cin7. Alex Erickson return for 15 yards to Cin22. Tackled by Erin Henderson and Kellen Davis.","(13:51) Ryan Fitzpatrick incomplete pass to the right intended for Bilal Powell defensed by Margus Hunt.","(14:29) Ryan Fitzpatrick pass to the right to Matt Forte for no gain to the NYJ39. Tackled by Vincent Rey.","(15:00) Penalty: Holding on New York (Brian Winters) -10 yards.","(0:08) Matt Forte rush to the left for 5 yards to the NYJ49. Tackled by Adam Jones and Karlos Dansby.","(0:46) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 23 yards to the NYJ44. Tackled by Vincent Rey.","(1:24) Matt Forte rush to the right for a loss of 2 yards to the NYJ21. Tackled by Margus Hunt.","(1:29) Mike Nugent kicks off to the NYJ-1. Jalin Marshall return for 24 yards to NYJ23. Tackled by Marquis Flowers.","(1:32) Mike Nugent 33 yard field goal attempt is GOOD. Holder: Kevin Huber.","(1:36) Andy Dalton incomplete pass to the left intended for C.J. Uzomah.","(2:18) Jeremy Hill rush up the middle for 5 yards to the NYJ15. Tackled by Muhammad Wilkerson.","(2:23) Andy Dalton incomplete pass to the right intended for C.J. Uzomah.","(3:06) Andy Dalton pass to the right to C.J. Uzomah for 54 yards to the NYJ20. Tackled by Marcus Williams and Darron Lee.","(3:42) Jeremy Hill rush to the right for 6 yards to the Cin26. Tackled by David Harris.","(3:45) Nick Folk 22 yard field goal attempt is BLOCKED by Margus Hunt.","(4:28) Ryan Fitzpatrick pass to the right to Bilal Powell for no gain to the Cin4. Tackled by Josh Shaw.","(4:32) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(4:36) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall defensed by Dre Kirkpatrick.","(4:39) Penalty: Roughing Passer on Cincinnati (Michael Johnson) 5 yards.","(4:43) Ryan Fitzpatrick incomplete pass to the middle.","(5:21) Matt Forte rush to the right for 2 yards to the Cin9. Tackled by Carlos Dunlap.","(6:02) Ryan Fitzpatrick pass to the left to Matt Forte for 24 yards to the Cin11. Tackled by Josh Shaw.","(6:12) Andy Dalton pass intended for Tyler Boyd INTERCEPTED by Marcus Williams and returned for 14 yards. Tackled by Tyler Boyd.","(6:16) Andy Dalton incomplete pass to the left intended for C.J. Uzomah.","(6:59) Andy Dalton sacked at Cin31 for a loss of 5 yards by Steve McLendon.","(7:35) Andy Dalton pass to the left to A.J. Green for 15 yards to the Cin36. Tackled by Erin Henderson.","(7:40) Nick Folk kicks off to the Cin6. Alex Erickson return for 15 yards to Cin21. Tackled by Josh Martin.","(7:40) Nick Folk extra point is good.","(7:43) Ryan Fitzpatrick pass to the left to Quincy Enunwa for 3 yards for a TOUCHDOWN.","(7:47) Penalty: Pass Interference on Cincinnati (Dre Kirkpatrick) 14 yards.","(8:22) Matt Forte rush up the middle for 3 yards to the Cin17. Tackled by Karlos Dansby and George Iloka.","(9:07) Ryan Fitzpatrick pass to the left to Matt Forte for 10 yards to the Cin20. Tackled by Karlos Dansby.","(9:10) Ryan Fitzpatrick incomplete pass to the right intended for Brandon Marshall.","(9:48) Matt Forte rush to the right for 14 yards to the Cin30. Tackled by Adam Jones.","(10:28) Ryan Fitzpatrick pass to the left to Brandon Marshall for 18 yards to the Cin44. Tackled by Adam Jones.","(11:12) Matt Forte rush up the middle for 3 yards to the NYJ38. Tackled by Karlos Dansby and Carlos Dunlap.","(11:15) Ryan Fitzpatrick incomplete pass to the right intended for Matt Forte defensed by Carlos Dunlap.","(11:52) Ryan Fitzpatrick rush up the middle for 4 yards to the NYJ35. Tackled by Carlos Dunlap.","(12:29) Ryan Fitzpatrick pass to the middle to Quincy Enunwa for 9 yards to the NYJ31. Tackled by Adam Jones.","(12:42) Kevin Huber punts for 58 yards to NYJ14. Jalin Marshall return for 8 yards to NYJ22. Tackled by James Wright.","(13:20) Andy Dalton sacked at Cin28 for a loss of 1 yard by Lorenzo Mauldin.","(13:20) Cincinnati Bengals timeout.","(13:48) Penalty: False Start on Cincinnati (Jake Fisher) -5 yards.","(14:24) Andy Dalton pass to the right to A.J. Green for 8 yards to the Cin34. Tackled by Darrelle Revis.","(15:00) Jeremy Hill rush to the left for 1 yard to the Cin26. Tackled by Steve McLendon.","(15:00) Nick Folk kicks off to the endzone. Touchback."]