["(0:36) Jimmy Garoppolo rush up the middle for a loss of 1 yard to the NE36.","(0:41) 47 yard field goal attempt by Chandler Catanzaro is NO GOOD. Holder: Drew Butler.","(0:41) New England Patriots timeout.","(1:10) Carson Palmer pass to the right to Jaron Brown for 18 yards to the NE29. Tackled by Devin McCourty.","(1:10) New England Patriots timeout.","(1:51) Carson Palmer pass to the right to Andre Ellington for a loss of 4 yards to the NE47. Tackled by Jabaal Sheard.","(1:55) Penalty: Holding on Arizona (Earl Watford) -10 yards.","(1:55) New England Patriots timeout.","(2:00) David Johnson rush to the right for 1 yard to the NE33. Tackled by Dont'a Hightower.","(2:00) Two Minute Warning.","(2:06) Carson Palmer pass to the right to Larry Fitzgerald for 10 yards to the NE34. Tackled by Logan Ryan.","(2:11) Carson Palmer pass to the right to David Johnson for 4 yards to the NE44. Tackled by Devin McCourty.","(2:15) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Jamie Collins.","(2:42) Carson Palmer pass to the right to Larry Fitzgerald for 15 yards to the NE48. Tackled by Logan Ryan.","(2:47) Carson Palmer incomplete pass to the left intended for Jaron Brown defensed by Justin Coleman.","(3:15) Carson Palmer pass to the left to Larry Fitzgerald for 21 yards to the Ari37. Tackled by Duron Harmon.","(3:38) Carson Palmer pass to the right to John Brown for 8 yards to the Ari16. Tackled by Patrick Chung.","(3:44) Stephen Gostkowski kicks off to the Ari3. Andre Ellington return for 13 yards to Ari16. Tackled by Nate Ebner. Penalty: Holding on Arizona (Tyvon Branch) -8 yards.","(3:48) Stephen Gostkowski 32 yard field goal attempt is GOOD. Holder: Ryan Allen.","(4:33) Jimmy Garoppolo rush to the right for 3 yards to the Ari14. Tackled by Deone Bucannon.","(4:37) Jimmy Garoppolo pass to the right to Danny Amendola for 3 yards to the Ari17. Tackled by Tyvon Branch.","(4:37) Arizona Cardinals timeout.","(4:45) Jimmy Garoppolo pass to the left to James White for 7 yards to the Ari20. Tackled by Tyvon Branch.","(4:45) Penalty: Delay of Game on New England (Jimmy Garoppolo) -5 yards.","(5:35) LeGarrette Blount rush to the left for 13 yards to the Ari22. Tackled by Tony Jefferson.","(5:39) Jimmy Garoppolo incomplete pass to the right intended for Martellus Bennett.","(6:21) LeGarrette Blount rush up the middle for a loss of 1 yard to the Ari35. Tackled by Tony Jefferson.","(6:58) Jimmy Garoppolo pass to the right to James White for 7 yards to the Ari34. Tackled by Tony Jefferson.","(7:43) Jimmy Garoppolo pass to the middle to Danny Amendola for 13 yards to the Ari41. Tackled by Kevin Minter.","(8:23) LeGarrette Blount rush up the middle for a loss of 6 yards to the NE46. Tackled by Tony Jefferson.","(9:04) Jimmy Garoppolo pass to the left to Danny Amendola for 32 yards to the Ari48. Tackled by Tyvon Branch.","(9:07) Jimmy Garoppolo incomplete pass to the middle intended for James White.","(9:46) Jimmy Garoppolo sacked at NE20 for a loss of 5 yards by Chandler Jones.","(9:46) Chandler Catanzaro kicks off to the endzone. Touchback.","(9:46) Chandler Catanzaro extra point is good. Penalty: Leaping on New England (Jamie Collins) 15 yards.","(9:51) Carson Palmer pass to the left to Larry Fitzgerald for 1 yard for a TOUCHDOWN.","(10:08) Carson Palmer pass to the left to Michael Floyd for 11 yards to the NE1. Tackled by Malcolm Butler.","(10:13) Carson Palmer incomplete pass to the right intended for Michael Floyd.","(10:18) Carson Palmer incomplete pass to the right intended for Michael Floyd defensed by Malcolm Butler.","(10:18) Arizona Cardinals timeout.","(11:08) David Johnson rush up the middle for 45 yards to the NE12. Tackled by Devin McCourty.","(11:13) Penalty: Holding on New England (Malcolm Butler) 5 yards.","(11:49) Carson Palmer pass to the left to Andre Ellington for 12 yards to the Ari38. Tackled by Jamie Collins.","(12:29) Carson Palmer pass to the left to David Johnson for 5 yards to the Ari26. Tackled by Devin McCourty.","(12:35) Stephen Gostkowski kicks off to the Ari5. Andre Ellington return for 16 yards to Ari21. Tackled by Patrick Chung.","(12:40) Stephen Gostkowski 53 yard field goal attempt is GOOD. Holder: Ryan Allen.","(12:50) Jimmy Garoppolo incomplete pass to the left intended for Malcolm Mitchell.","(13:18) Penalty: Holding on New England (Martellus Bennett) -10 yards.","(14:14) Jimmy Garoppolo pass to the left to Martellus Bennett for 5 yards to the Ari25. Tackled by Brandon Williams.","(14:57) LeGarrette Blount rush up the middle for 1 yard to the Ari30. Tackled by Corey Peters and Chandler Jones.","(15:00) Penalty: Roughing Passer on Arizona (Kevin Minter) 15 yards.","(0:27) Jimmy Garoppolo pass to the right to Julian Edelman for 6 yards to the Ari46. Tackled by Kevin Minter.","(1:12) LeGarrette Blount rush to the left for 1 yard to the NE48. Tackled by Calais Campbell.","(1:46) Jimmy Garoppolo pass to the left to Martellus Bennett for 5 yards to the NE47. Tackled by Tyvon Branch.","(2:29) LeGarrette Blount rush up the middle for 1 yard to the NE42. Tackled by Tony Jefferson and Calais Campbell.","(3:05) Jimmy Garoppolo pass to the right to Chris Hogan for 4 yards to the NE41. Tackled by Deone Bucannon.","(3:51) Julian Edelman rush to the right for 9 yards to the NE37. Tackled by Tyrann Mathieu.","(4:29) LeGarrette Blount rush to the left for 3 yards to the NE28. Tackled by Josh Mauro.","(4:29) Chandler Catanzaro kicks off to the endzone. Touchback.","(4:29) Chandler Catanzaro extra point is good.","(4:33) David Johnson rush up the middle for 1 yard for a TOUCHDOWN.","(4:58) David Johnson rush up the middle for 3 yards to the NE1. Tackled by Chris Long.","(5:41) Carson Palmer pass to the right to Larry Fitzgerald for 14 yards to the NE4. Tackled by Devin McCourty.","(5:46) Carson Palmer incomplete pass to the right intended for David Johnson.","(6:20) Carson Palmer pass to the right to Jermaine Gresham for 15 yards to the NE18. Tackled by Malcolm Butler.","(6:30) LeGarrette Blount rush up the middle for no gain to the NE33. Tackled by Frostee Rucker. FUMBLE, recovered by Ari (Calais Campbell). Tackled by Joe Thuney.","(7:01) Jimmy Garoppolo pass to the left to Malcolm Mitchell for 5 yards to the NE33. Tackled by Brandon Williams.","(7:08) Drew Butler punts for 39 yards to NE28. No return.","(7:14) Carson Palmer incomplete pass to the middle intended for Larry Fitzgerald defensed by Logan Ryan.","(7:19) Carson Palmer incomplete pass to the right intended for John Brown defensed by Malcolm Butler.","(7:58) Carson Palmer rush up the middle for no gain to the Ari35. FUMBLE, recovered by Ari (Carson Palmer).","(8:45) Carson Palmer rush up the middle for 1 yard to the Ari35. Tackled by Devin McCourty.","(9:21) David Johnson rush to the right for 5 yards to the Ari34. Tackled by Jabaal Sheard.","(10:00) Carson Palmer pass to the right to Jermaine Gresham for 4 yards to the Ari29. Tackled by Patrick Chung and Logan Ryan.","(10:00) Stephen Gostkowski kicks off to the endzone. Touchback.","(10:00) Stephen Gostkowski extra point is good.","(10:08) LeGarrette Blount rush up the middle for 8 yards for a TOUCHDOWN.","(10:44) Jimmy Garoppolo pass to the left to Malcolm Mitchell for 28 yards to the Ari8. Tackled by D.J. Swearinger.","(11:26) Jimmy Garoppolo pass to the right to Martellus Bennett for 4 yards to the Ari36. Tackled by Patrick Peterson.","(12:05) LeGarrette Blount rush to the right for a loss of 1 yard to the Ari40. Tackled by Markus Golden.","(12:25) LeGarrette Blount rush to the right for 13 yards to the Ari39. Tackled by Deone Bucannon.","(13:02) Jimmy Garoppolo pass to the right to Julian Edelman for 9 yards to the NE48. Tackled by Patrick Peterson.","(13:46) Jimmy Garoppolo rush up the middle for 10 yards to the NE39. Tackled by Tyrann Mathieu.","(14:24) LeGarrette Blount rush to the left for 1 yard to the NE29. Tackled by Frostee Rucker and Corey Peters.","(15:00) Jimmy Garoppolo pass to the left to Jimmy Garoppolo for 3 yards to the NE28. Tackled by Patrick Peterson.","(15:00) Chandler Catanzaro kicks off to the endzone. Touchback.","(0:15) Carson Palmer sacked at Ari24 for a loss of 8 yards by Jamie Collins.","(0:22) Ryan Allen punts for 45 yards to Ari32. No return.","(0:22) Arizona Cardinals timeout.","(0:27) LeGarrette Blount rush to the right for 4 yards to the NE23. Tackled by Chandler Jones.","(0:27) Arizona Cardinals timeout.","(0:33) LeGarrette Blount rush up the middle for 4 yards to the NE19. Tackled by Chandler Jones and Kevin Minter.","(0:39) Penalty: Holding on New England (Shaq Mason) -10 yards.","(0:47) LeGarrette Blount rush to the right for 3 yards to the NE35. Tackled by Patrick Peterson. Penalty: Tripping on New England (David Andrews) -10 yards.","(1:24) LeGarrette Blount rush up the middle for 1 yard to the NE32. Tackled by Tony Jefferson.","(1:34) Drew Butler punts for 41 yards to NE21. Cyrus Jones return for 10 yards to NE31. Tackled by Jaron Brown.","(1:39) Carson Palmer incomplete pass to the right intended for John Brown defensed by Justin Coleman.","(1:45) Carson Palmer incomplete pass to the right intended for Larry Fitzgerald.","(1:50) Carson Palmer incomplete pass to the left intended for John Brown.","(2:00) Ryan Allen punts for 44 yards to Ari30. Patrick Peterson return for 8 yards to Ari38. Tackled by Brandon Bolden.","(2:00) Two Minute Warning.","(2:44) Jimmy Garoppolo pass to the left to James White for a loss of 2 yards to the NE26. Tackled by Tyrann Mathieu.","(3:26) Jimmy Garoppolo rush up the middle for no gain to the NE30. FUMBLE, recovered by NE (Brandon Bolden).","(4:00) Brandon Bolden rush up the middle for 4 yards to the NE30. Tackled by Tyvon Branch.","(4:06) Chandler Catanzaro kicks off to the NE0. Cyrus Jones return for 26 yards to NE26. Tackled by Troy Niklas.","(4:06) Chandler Catanzaro extra point is good.","(4:10) Carson Palmer pass to the left to Larry Fitzgerald for 3 yards for a TOUCHDOWN.","(4:55) David Johnson rush up the middle for 3 yards to the NE3. Tackled by Devin McCourty.","(5:36) David Johnson rush up the middle for no gain to the NE6. Tackled by Logan Ryan and Alan Branch.","(6:15) Carson Palmer pass to the left to Jermaine Gresham for 9 yards to the NE6. Tackled by Shea McClellin.","(6:47) Chris Johnson rush up the middle for 2 yards to the NE15. Tackled by Vincent Valentine.","(7:21) Carson Palmer pass to the right to Larry Fitzgerald for 6 yards to the NE17. Tackled by Patrick Chung.","(8:07) David Johnson rush up the middle for 3 yards to the NE23. Tackled by Vincent Valentine.","(8:43) David Johnson rush to the right for 3 yards to the NE26. Tackled by Chris Long.","(9:21) David Johnson rush up the middle for 8 yards to the NE29. Tackled by Jamie Collins.","(9:47) Carson Palmer pass to the right to Michael Floyd for 11 yards to the NE37. Tackled by Jamie Collins and Malcolm Butler.","(10:26) David Johnson rush up the middle for 6 yards to the NE48. Tackled by Logan Ryan.","(10:32) Jimmy Garoppolo sacked at NE39 for a loss of 2 yards by Markus Golden. FUMBLE, recovered by Ari (Chandler Jones). Tackled by Jimmy Garoppolo. Penalty: Unsports. Conduct on Arizona -15 yards.","(11:10) LeGarrette Blount rush up the middle for 1 yard to the NE41. Tackled by Chandler Jones.","(11:14) Jimmy Garoppolo incomplete pass to the left intended for Malcolm Mitchell.","(11:48) Jimmy Garoppolo pass to the left to Chris Hogan for 19 yards to the NE40. Tackled by Tyrann Mathieu.","(11:53) Jimmy Garoppolo incomplete pass to the right intended for Martellus Bennett.","(12:22) Jimmy Garoppolo pass to the right to Julian Edelman for 10 yards to the NE21. Tackled by Tyvon Branch.","(12:22) Penalty: False Start on New England (A.J. Derby) -5 yards.","(12:30) Drew Butler punts for 23 yards to NE16. No return.","(12:40) Carson Palmer sacked at NE39 for a loss of 8 yards by Chris Long.","(13:19) David Johnson rush to the right for 7 yards to the NE31. Tackled by Devin McCourty and Patrick Chung.","(13:58) David Johnson rush up the middle for 1 yard to the NE38. Tackled by Anthony Johnson.","(14:22) Carson Palmer pass to the left to J.J. Nelson for 11 yards to the NE39. Tackled by Malcolm Butler.","(15:00) Carson Palmer pass to the left to David Johnson for 8 yards to the Ari50. Tackled by Patrick Chung and Trey Flowers.","(0:08) Carson Palmer sacked at Ari42 for a loss of 3 yards by Vincent Valentine.","(0:52) Carson Palmer pass to the left to David Johnson for 26 yards to the Ari45. Tackled by Shea McClellin.","(1:00) Stephen Gostkowski kicks off to the Ari-2. Andre Ellington return for 21 yards to Ari19. Tackled by Devin McCourty.","(1:05) Stephen Gostkowski 47 yard field goal attempt is GOOD. Holder: Ryan Allen.","(1:10) Jimmy Garoppolo incomplete pass to the left intended for Danny Amendola defensed by Tyvon Branch.","(1:56) Julian Edelman rush to the left for 7 yards to the Ari29. Tackled by Tony Jefferson.","(2:02) Jimmy Garoppolo incomplete pass to the middle intended for Malcolm Mitchell.","(2:40) Jimmy Garoppolo pass to the right to James White for 7 yards to the Ari36. Tackled by Tyrann Mathieu.","(3:18) LeGarrette Blount rush to the right for 2 yards to the Ari43. Tackled by Tony Jefferson.","(3:50) Jimmy Garoppolo pass to the right to Julian Edelman for 3 yards to the Ari45. Tackled by Tyrann Mathieu and Frostee Rucker.","(4:27) LeGarrette Blount rush up the middle for 13 yards to the Ari48. Tackled by Tyvon Branch.","(4:57) James White rush up the middle for 4 yards to the NE39. Tackled by Kevin Minter.","(4:57) Penalty: Offside on Arizona (Robert Nkemdiche) 5 yards.","(5:03) Jimmy Garoppolo incomplete pass to the right intended for James White.","(5:40) LeGarrette Blount rush to the right for 1 yard to the NE30. Tackled by Deone Bucannon.","(6:12) Jimmy Garoppolo pass to the left to James White for 21 yards to the NE29. Tackled by Kevin Minter.","(6:18) Drew Butler punts for 39 yards to NE8. No return.","(6:22) Carson Palmer incomplete pass to the left intended for J.J. Nelson.","(6:26) Carson Palmer incomplete pass to the right intended for David Johnson.","(7:02) David Johnson rush up the middle for 3 yards to the NE47. Tackled by Malcom Brown.","(7:29) Carson Palmer pass to the left to Michael Floyd for 39 yards to the Ari50.","(7:34) Stephen Gostkowski kicks off to the Ari0. Andre Ellington return for 11 yards to Ari11. Tackled by Jonathan Jones.","(7:34) Stephen Gostkowski extra point is good.","(7:42) Jimmy Garoppolo pass to the left to Chris Hogan for 37 yards for a TOUCHDOWN.","(8:23) LeGarrette Blount rush to the right for 6 yards to the Ari37. Tackled by Kevin Minter.","(8:47) Jimmy Garoppolo pass to the left to Julian Edelman for 8 yards to the Ari43. Tackled by Tony Jefferson.","(9:30) LeGarrette Blount rush up the middle for 2 yards to the NE49. Tackled by Calais Campbell.","(10:01) Jimmy Garoppolo pass to the middle to Julian Edelman for 19 yards to the NE47. Tackled by Tony Jefferson.","(10:29) Penalty: Holding on New England (Ted Karras) -9 yards.","(11:02) Jimmy Garoppolo pass to the left to Julian Edelman for 11 yards to the NE37. Tackled by Tyrann Mathieu.","(11:41) Julian Edelman rush to the right for no gain to the NE26. Tackled by Deone Bucannon.","(11:47) Jimmy Garoppolo incomplete pass to the right intended for Chris Hogan.","(11:59) Drew Butler punts for 38 yards to NE18. Danny Amendola return for 8 yards to NE26. Tackled by Deone Bucannon.","(12:09) Penalty: Delay of Game on Arizona (Drew Butler) -5 yards.","(13:03) Carson Palmer pass to the right to Larry Fitzgerald for 11 yards to the Ari49. Tackled by Logan Ryan.","(13:40) David Johnson rush to the right for a loss of 2 yards to the Ari38. Tackled by Jabaal Sheard.","(13:45) Carson Palmer incomplete pass to the left intended for Michael Floyd.","(14:25) Carson Palmer pass to the left to Jermaine Gresham for 13 yards to the Ari40. Tackled by Devin McCourty.","(15:00) David Johnson rush to the left for 2 yards to the Ari27. Tackled by Alan Branch.","(15:00) Stephen Gostkowski kicks off to the endzone. Touchback."]