["(0:07) Isaiah Crowell rush up the middle for 4 yards to the Phi35. Tackled by Fletcher Cox.","(0:37) Isaiah Crowell rush up the middle for 20 yards to the Phi39. Tackled by Jordan Hicks.","(1:12) Isaiah Crowell rush up the middle for 16 yards to the Cle41. Tackled by Rodney McLeod.","(1:12) Caleb Sturgis kicks off to the endzone. Touchback.","(1:12) Caleb Sturgis extra point is good.","(1:16) Ryan Mathews rush to the left for 1 yard for a TOUCHDOWN.","(1:19) Penalty: Offside on Cleveland (Nate Orchard) 0 yards.","(2:00) Ryan Mathews rush to the right for 1 yard to the Cle1. Tackled by Xavier Cooper.","(2:00) Two Minute Warning.","(2:11) Ryan Mathews rush to the right for 1 yard to the Cle2. Tackled by Demario Davis.","(2:54) Ryan Mathews rush to the right for 6 yards to the Cle3. Tackled by Ibraheim Campbell.","(3:36) Ryan Mathews rush up the middle for 6 yards to the Cle9. Tackled by Demario Davis.","(3:41) Robert Griffin III incomplete pass to the left intended for Andrew Hawkins.","(3:49) Robert Griffin III rush to the right for 11 yards to the Cle15. Tackled by Jalen Mills.","(3:53) Robert Griffin III incomplete pass to the left intended for Duke Johnson Jr..","(4:26) Robert Griffin III sacked at Cle4 for a loss of 4 yards by Brandon Graham. FUMBLE, recovered by Cle (Robert Griffin III).","(4:35) Donnie Jones punts for 32 yards to Cle8. No return.","(4:40) Carson Wentz incomplete pass to the middle intended for Zach Ertz defensed by Joe Schobert.","(5:04) Penalty: False Start on Philadelphia (Jason Peters) -5 yards.","(5:25) Penalty: False Start on Philadelphia (Carson Wentz) -5 yards.","(6:08) Carson Wentz pass to the left to Nelson Agholor for 7 yards to the Cle30. Tackled by Jamar Taylor.","(6:08) Philadelphia Eagles timeout.","(6:51) Darren Sproles rush to the right for a loss of 3 yards to the Cle37. Tackled by Jamie Meder and Danny Shelton.","(7:36) Carson Wentz pass to the right to Jordan Matthews for 16 yards to the Cle34. Tackled by Joe Haden.","(7:42)  FUMBLE, recovered by Phi (Carson Wentz). Carson Wentz incomplete pass to the right intended for Jordan Matthews defensed by Joe Haden.","(8:28) Ryan Mathews rush to the right for 5 yards to the Phi50. Tackled by Xavier Cooper.","(9:13) Ryan Mathews rush to the left for 7 yards to the Phi45. Tackled by Carl Nassib.","(9:57) Carson Wentz pass to the right to Jordan Matthews for 9 yards to the Phi38. Tackled by Joe Haden.","(10:08) Britton Colquitt punts for 58 yards to Phi21. Darren Sproles return for 8 yards to Phi29. Tackled by Isaiah Crowell.","(10:48) Duke Johnson Jr. rush up the middle for 11 yards to the Cle21. Tackled by Rodney McLeod.","(11:30) Robert Griffin III sacked at Cle10 for a loss of 10 yards by Connor Barwin.","(11:33) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(11:41) Donnie Jones punts for 45 yards to Cle0. Touchback.","(12:07) Carson Wentz pass to the right to Darren Sproles for 9 yards to the Cle45. Tackled by Christian Kirksey.","(12:43) Carson Wentz rush to the left for 1 yard to the Phi46.","(13:24) Ryan Mathews rush to the left for 2 yards to the Phi45. Tackled by Carl Nassib.","(13:49) Penalty: Holding on Philadelphia (Lane Johnson) -10 yards.","(13:56) Britton Colquitt punts for 43 yards to Cle47. No return.","(14:01) Robert Griffin III incomplete pass to the right intended for Terrelle Pryor Sr..","(14:06) Robert Griffin III incomplete pass to the right intended for Corey Coleman.","(14:51) Robert Griffin III pass to the right to Malcolm Johnson for 3 yards to the Cle4. Tackled by Nigel Bradham.","(15:00) Donnie Jones punts for 42 yards to Cle1. No return.","(0:05) Carson Wentz sacked at Cle43 for a loss of 4 yards by Carl Nassib.","(0:50) Carson Wentz rush up the middle for no gain to the Cle33. FUMBLE, recovered by Phi (Darren Sproles).","(1:28) Darren Sproles rush to the left for 6 yards to the Cle33.","(2:12) Kenjon Barner rush to the left for 19 yards to the Cle39. Tackled by Derrick Kindred.","(2:48) Ryan Mathews rush to the left for 6 yards to the Phi42. Tackled by Derrick Kindred.","(3:24) Carson Wentz pass to the left to Zach Ertz for 15 yards to the Phi36. Tackled by Derrick Kindred.","(3:34) Britton Colquitt punts for 42 yards to Phi15. Darren Sproles return for 6 yards to Phi21. Tackled by Dominique Alexander.","(4:13) Robert Griffin III pass to the right to Corey Coleman for 11 yards to the Cle43. Tackled by Jalen Mills.","(4:21) Robert Griffin III incomplete pass to the left intended for Terrelle Pryor Sr..","(4:44) Penalty: Offside on Philadelphia (Vinny Curry) 5 yards.","(5:34) Robert Griffin III sacked at Cle27 for a loss of 8 yards by Fletcher Cox.","(6:17) Isaiah Crowell rush to the right for 10 yards to the Cle35. Tackled by Jordan Hicks.","(6:17) Caleb Sturgis kicks off to the endzone. Touchback.","(6:17) Caleb Sturgis extra point is good.","(6:23) Carson Wentz pass to the right to Nelson Agholor for 35 yards for a TOUCHDOWN.","(7:04) Carson Wentz pass to the middle to Zach Ertz for 5 yards to the Cle35. Tackled by Jordan Poyer.","(7:08) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(7:53) Carson Wentz pass to the left to Dorial Green-Beckham for 5 yards to the Cle40. Tackled by Jamar Taylor.","(8:38) Wendell Smallwood rush up the middle for 1 yard to the Cle45. Tackled by Tramon Williams.","(9:22) Carson Wentz pass to the right to Jordan Matthews for 12 yards to the Cle46. Tackled by Joe Haden.","(10:03) Ryan Mathews rush to the left for 6 yards to the Phi42. Tackled by Jamar Taylor.","(10:36) Carson Wentz pass to the left to Dorial Green-Beckham for 9 yards to the Phi36. Tackled by Jordan Poyer.","(10:42) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(10:49) Britton Colquitt kicks off to the Phi8. Darren Sproles return for 19 yards to Phi27. Tackled by Ricardo Louis.","(10:54) Robert Griffin III rush up the middle for no gain to the Cle15. FUMBLE, recovered by Cle. Safety.","(11:02) Donnie Jones punts for 37 yards to Cle15. No return.","(11:38) Carson Wentz pass to the middle to Zach Ertz for 6 yards to the Phi48. Tackled by Christian Kirksey.","(11:43) Carson Wentz incomplete pass to the left intended for Darren Sproles.","(12:10) Penalty: Pass Interference on Philadelphia (Brent Celek) -10 yards.","(12:48) Darren Sproles rush up the middle for 4 yards to the Cle48. Tackled by Joe Schobert.","(13:15) Carson Wentz pass to the middle to Jordan Matthews for 22 yards to the Phi48. Tackled by Ibraheim Campbell.","(13:18) Carson Wentz incomplete pass to the middle intended for Josh Huff.","(13:57) Ryan Mathews rush to the left for 1 yard to the Phi26. Tackled by Danny Shelton.","(13:57) Patrick Murray kicks off to the endzone. Touchback.","(14:01) Patrick Murray 35 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(14:07) Robert Griffin III incomplete pass to the left intended for Andrew Hawkins.","(14:07) Cleveland Browns timeout.","(14:13) Robert Griffin III incomplete pass to the left intended for Terrelle Pryor Sr..","(14:48) Isaiah Crowell rush to the right for no gain to the Phi17. Tackled by Fletcher Cox.","(15:00) Robert Griffin III pass to the left to Corey Coleman for 58 yards to the Phi17. Tackled by Nolan Carroll.","(15:00) Caleb Sturgis kicks off to the endzone. Touchback.","(0:09) Robert Griffin III pass to the right to Isaiah Crowell for 14 yards to the Phi42. Tackled by Nigel Bradham.","(0:14) Robert Griffin III incomplete pass to the right intended for Duke Johnson Jr..","(0:21) Robert Griffin III rush to the right for 2 yards to the Cle44.","(0:27) Duke Johnson Jr. rush to the right for 17 yards to the Cle42.","(0:27) Caleb Sturgis kicks off to the endzone. Touchback.","(0:28) Caleb Sturgis 38 yard field goal attempt is GOOD. Holder: Donnie Jones.","(0:28) Cleveland Browns timeout.","(0:35) Carson Wentz incomplete pass to the left intended for Darren Sproles.","(0:40) Carson Wentz incomplete pass to the right intended for Darren Sproles defensed by Carl Nassib.","(0:42) Carson Wentz incomplete pass to the left intended for Jordan Matthews.","(1:11) Carson Wentz pass to the left to Darren Sproles for 15 yards to the Cle19. Tackled by Demario Davis.","(1:11) Philadelphia Eagles timeout.","(1:18) Carson Wentz pass to the left to Nelson Agholor for 11 yards to the Cle34. Tackled by Jamar Taylor.","(1:38) Carson Wentz pass to the middle to Jordan Matthews for 8 yards to the Cle45. Tackled by Tramon Williams.","(2:00) Carson Wentz pass to the right to Zach Ertz for 5 yards to the Phi47. Tackled by Jamar Taylor.","(2:00) Two Minute Warning.","(2:23) Ryan Mathews rush up the middle for 1 yard to the Phi42. Tackled by Derrick Kindred.","(3:00) Kenjon Barner rush to the right for 17 yards to the Phi41.","(3:43) Darren Sproles rush to the left for 3 yards to the Phi24. Tackled by Xavier Cooper.","(3:52) Robert Griffin III pass intended for Corey Coleman INTERCEPTED by Rodney McLeod defensed by Jordan Hicks and returned for 5 yards. Tackled by Joel Bitonio.","(4:33) Isaiah Crowell rush to the right for 5 yards to the Phi28. Tackled by Nigel Bradham.","(4:58) Robert Griffin III rush to the right for 20 yards to the Phi33.","(5:29) Robert Griffin III pass to the left to Duke Johnson Jr. for 12 yards to the Cle47. Tackled by Connor Barwin.","(6:09) Isaiah Crowell rush to the left for a loss of 4 yards to the Cle35. Tackled by Brandon Graham.","(6:53) Isaiah Crowell rush to the left for 6 yards to the Cle39. Tackled by Nigel Bradham.","(7:35) Robert Griffin III pass to the middle to Terrelle Pryor Sr. for 13 yards to the Cle33. Tackled by Rodney McLeod.","(7:43) Donnie Jones punts for 72 yards to Cle0. Touchback.","(7:49) Carson Wentz incomplete pass to the middle intended for Nelson Agholor.","(8:31) Ryan Mathews rush to the left for 1 yard to the Phi28. Tackled by Jordan Poyer.","(9:06) Carson Wentz pass to the left to Nelson Agholor for 4 yards to the Phi27. Tackled by Demario Davis.","(9:11) Patrick Murray kicks off to the Phi0. Wendell Smallwood return for 23 yards to Phi23. Tackled by Derrick Kindred.","(9:11) Patrick Murray extra point is good.","(9:15) Isaiah Crowell rush to the left for 2 yards for a TOUCHDOWN.","(9:23) Penalty: Pass Interference on Philadelphia (Malcolm Jenkins) 6 yards.","(9:27) Robert Griffin III incomplete pass to the left intended for Andrew Hawkins.","(10:07) Isaiah Crowell rush to the right for 1 yard to the Phi8. Tackled by Beau Allen and Brandon Graham.","(10:52) Robert Griffin III pass to the left to Terrelle Pryor Sr. for 44 yards to the Phi9. Tackled by Nolan Carroll.","(11:09) Penalty: False Start on Cleveland (Terrelle Pryor Sr.) -5 yards.","(11:48) Robert Griffin III pass to the right to Duke Johnson Jr. for 16 yards to the Phi48. Tackled by Malcolm Jenkins.","(12:01) Robert Griffin III incomplete pass to the left intended for Corey Coleman.","(12:01) Robert Griffin III pass to the right to Terrelle Pryor Sr. for 11 yards to the Cle36. Tackled by Leodis McKelvin.","(12:30) Caleb Sturgis kicks off to the endzone. Touchback.","(12:33) Caleb Sturgis 22 yard field goal attempt is GOOD. Holder: Donnie Jones.","(12:36) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(13:21) Ryan Mathews rush to the right for 2 yards to the Cle4. Tackled by Ibraheim Campbell.","(14:03) Ryan Mathews rush to the right for 1 yard to the Cle6. Tackled by Demario Davis and Christian Kirksey.","(14:44) Carson Wentz pass to the right to Jordan Matthews for 28 yards to the Cle7. Tackled by Ibraheim Campbell.","(14:50) Duke Johnson Jr. rush to the right for a loss of 6 yards to the Cle35. Tackled by Kamu Grugier-Hill.","(15:00) Robert Griffin III incomplete pass to the left intended for Gary Barnidge.","(0:09) Andrew Hawkins rush to the left for a loss of 1 yard to the Cle41. Tackled by Rodney McLeod.","(0:47) Robert Griffin III pass to the left to Malcolm Johnson for 6 yards to the Cle42. Tackled by Nolan Carroll.","(0:51) 46 yard field goal attempt by Caleb Sturgis is NO GOOD. Holder: Donnie Jones.","(1:32) Carson Wentz sacked at Cle28 for a loss of 4 yards by Christian Kirksey.","(2:17) Darren Sproles rush to the right for 2 yards to the Cle24. Tackled by Derrick Kindred.","(2:54) Ryan Mathews rush to the right for 4 yards to the Cle26. Tackled by Christian Kirksey.","(3:37) Ryan Mathews rush up the middle for 5 yards to the Cle30. Tackled by Demario Davis.","(4:16) Ryan Mathews rush to the right for 7 yards to the Cle35. Tackled by Xavier Cooper.","(4:30) Britton Colquitt punts for 59 yards to Phi18. Darren Sproles return for 40 yards to Cle42. Tackled by Ibraheim Campbell.","(5:06) Robert Griffin III pass to the right to Duke Johnson Jr. for no gain to the Cle23. Tackled by Nigel Bradham and Leodis McKelvin.","(5:44) Robert Griffin III pass to the right to Isaiah Crowell for 2 yards to the Cle23. Tackled by Jordan Hicks.","(6:15) Isaiah Crowell rush to the right for 1 yard to the Cle21.","(6:25) Donnie Jones punts for 67 yards to Cle0. Touchback.","(6:30) Carson Wentz incomplete pass to the left intended for Josh Huff defensed by Emmanuel Ogbah.","(6:53) Penalty: False Start on Philadelphia (Jason Peters) -5 yards.","(7:36) Ryan Mathews rush up the middle for 3 yards to the Phi38. Tackled by Demario Davis.","(7:41) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(7:46) Penalty: Holding on Cleveland (Tramon Williams) 5 yards.","(7:54) Carson Wentz incomplete pass to the right intended for Josh Huff.","(8:31) Ryan Mathews rush up the middle for 4 yards to the Phi30. Tackled by Emmanuel Ogbah.","(8:44) Britton Colquitt punts for 49 yards to Phi21. Darren Sproles return for 5 yards to Phi26. Tackled by Charley Hughlett.","(9:06) Robert Griffin III rush to the right for 4 yards to the Cle30. Tackled by Jordan Hicks.","(9:46) Isaiah Crowell rush up the middle for 1 yard to the Cle26. Tackled by Fletcher Cox.","(9:50) Robert Griffin III incomplete pass to the right intended for Gary Barnidge.","(9:50) Caleb Sturgis kicks off to the endzone. Touchback.","(9:50) Caleb Sturgis extra point is good.","(9:56) Carson Wentz pass to the left to Jordan Matthews for 19 yards for a TOUCHDOWN.","(10:39) Ryan Mathews rush to the right for 1 yard to the Cle19. Tackled by Danny Shelton.","(11:12) Carson Wentz pass to the right to Zach Ertz for 13 yards to the Cle20.","(11:52) Kenjon Barner rush up the middle for 5 yards to the Cle33. Tackled by Danny Shelton.","(12:32) Carson Wentz pass to the left to Brent Celek for 11 yards to the Cle38. Tackled by Ibraheim Campbell.","(13:16) Carson Wentz pass to the right to Zach Ertz for 14 yards to the Cle49. Tackled by Jordan Poyer.","(13:21) Carson Wentz incomplete pass to the right intended for Jordan Matthews.","(13:46) Penalty: Offside on Cleveland (Xavier Cooper) 5 yards.","(14:24) Kenjon Barner rush to the left for 1 yard to the Phi32. Tackled by Jamie Meder and Christian Kirksey.","(15:00) Ryan Mathews rush up the middle for 6 yards to the Phi31. Tackled by Jordan Poyer.","(15:00) Patrick Murray kicks off to the endzone. Touchback."]