["(0:00) Ryan Tannehill sacked at Mia1 for a loss of 8 yards by Cliff Avril.","(0:20) Ryan Tannehill sacked at Mia9 for a loss of 9 yards by Cassius Marsh. FUMBLE, recovered by Mia.","(0:26) Ryan Tannehill incomplete pass to the left intended for Kenny Stills.","(0:31) Steven Hauschka kicks off to the Mia-4. Jakeem Grant return for 22 yards to Mia18. Tackled by Kevin Pierre-Louis.","(0:31) Steven Hauschka extra point is BLOCKED.","(0:35) Russell Wilson pass to the left to Doug Baldwin for 2 yards for a TOUCHDOWN.","(0:57) Christine Michael rush to the left for no gain to the Mia2. Tackled by Ndamukong Suh.","(0:57) Miami Dolphins timeout.","(1:09) Russell Wilson pass to the right to Doug Baldwin for 9 yards to the Mia2. Tackled by Reshad Jones and Xavien Howard.","(1:09) Miami Dolphins timeout.","(1:28) Russell Wilson pass to the right to Tyler Lockett for 5 yards to the Mia11. Tackled by Xavien Howard.","(1:57) Russell Wilson pass to the left to Jimmy Graham for 11 yards to the Mia16. Tackled by Byron Maxwell.","(1:57) Two Minute Warning.","(2:02) Russell Wilson rush to the left for 4 yards to the Mia27. Tackled by Jelani Jenkins.","(2:08) Russell Wilson pass to the left to Doug Baldwin for 22 yards to the Mia31. Tackled by Isa Abdul-Quddus.","(2:08) Seattle Seahawks timeout.","(2:11) Russell Wilson incomplete pass to the left intended for Jermaine Kearse defensed by Ndamukong Suh.","(2:11) Miami Dolphins timeout.","(2:14) Russell Wilson incomplete pass to the middle intended for Christine Michael.","(2:39) Russell Wilson pass to the left to Jermaine Kearse for 6 yards to the Sea47. Tackled by Kiko Alonso and Reshad Jones.","(3:05) Christine Michael rush up the middle for 7 yards to the Sea41. Tackled by Kiko Alonso.","(3:36) Christine Michael rush to the left for 1 yard to the Sea34. Tackled by Kiko Alonso.","(4:01) Christine Michael rush up the middle for 8 yards to the Sea33. Tackled by Kiko Alonso and Reshad Jones.","(4:08) Russell Wilson incomplete pass to the right intended for Luke Willson.","(4:08) Andrew Franks kicks off to the endzone. Touchback.","(4:08) Andrew Franks extra point is good.","(4:12) Ryan Tannehill rush up the middle for 2 yards for a TOUCHDOWN.","(4:19) Ryan Tannehill incomplete pass to the left.","(4:28) Ryan Tannehill pass to the left to Damien Williams for 29 yards to the Sea2. Tackled by Bobby Wagner.","(5:16) Ryan Tannehill pass to the left to Jarvis Landry for 28 yards to the Sea31. Tackled by K.J. Wright and Deshawn Shead.","(5:57) Ryan Tannehill pass to the left to Jarvis Landry for 9 yards to the Mia41. Tackled by Earl Thomas.","(6:33) Arian Foster rush to the right for 2 yards to the Mia32. Tackled by Cliff Avril.","(7:09) Ryan Tannehill pass to the left to Kenny Stills for 16 yards to the Mia30. Tackled by Earl Thomas.","(7:17) Jon Ryan punts for 27 yards to Mia14. No return.","(7:20) Russell Wilson incomplete pass to the right intended for Christine Michael.","(7:20) Seattle Seahawks timeout.","(8:05) Christine Michael rush up the middle for a loss of 4 yards to the Mia41. Tackled by Reshad Jones.","(8:50) Christine Michael rush to the right for 8 yards to the Mia37. Tackled by Reshad Jones and Kiko Alonso.","(9:24) Russell Wilson pass to the left to Jermaine Kearse for 24 yards to the Mia45.","(10:08) Thomas Rawls rush up the middle for 5 yards to the Sea31. Tackled by Koa Misi and Kiko Alonso.","(10:41) Russell Wilson pass to the right to Thomas Rawls for 6 yards to the Sea26. Tackled by Koa Misi.","(10:45) Andrew Franks 27 yard field goal attempt is BLOCKED by Cassius Marsh.","(11:21) Ryan Tannehill sacked at Sea9 for a loss of 2 yards by K.J. Wright.","(12:02) Ryan Tannehill rush to the left for a loss of 2 yards to the Sea7. Tackled by K.J. Wright and Michael Bennett.","(12:05) Ryan Tannehill incomplete pass to the left intended for Arian Foster defensed by Deshawn Shead.","(12:48) Ryan Tannehill pass to the right to Leonte Carroo for 12 yards to the Sea5. Tackled by Jeremy Lane and K.J. Wright.","(12:52) Ryan Tannehill incomplete pass to the middle intended for Jarvis Landry defensed by Jarran Reed.","(13:23) Ryan Tannehill rush to the right for 5 yards to the Sea17. Tackled by Bobby Wagner.","(14:07) Ryan Tannehill pass to the middle to Jarvis Landry for 14 yards to the Sea22. Tackled by Jeremy Lane.","(14:46) Arian Foster rush up the middle for no gain to the Sea36. Tackled by Deshawn Shead and Jarran Reed.","(14:53) Ryan Tannehill incomplete pass to the right.","(15:00) Russell Wilson rush up the middle for no gain to the Sea44. FUMBLE, recovered by Mia (Kiko Alonso) and returned for 2 yards. Tackled by Garry Gilliam.","(0:11) Penalty: Illegal Shift on Seattle -5 yards.","(0:56) Christine Michael rush to the left for 6 yards to the Sea49. Tackled by Jelani Jenkins and Jason Jones.","(1:03) Penalty: Roughing Passer on Miami (Cameron Wake) 15 yards.","(1:42) Christine Michael rush to the left for 3 yards to the Sea28. Tackled by Kiko Alonso.","(2:15) Thomas Rawls rush up the middle for 1 yard to the Sea25. Tackled by Koa Misi.","(2:47) Russell Wilson pass to the right to Paul Richardson for 11 yards to the Sea24. Tackled by Jelani Jenkins and Xavien Howard.","(3:25) Thomas Rawls rush up the middle for 2 yards to the Sea13. Tackled by Andre Branch and Isa Abdul-Quddus.","(3:32) Matt Darr punts for 38 yards to Sea11. No return.","(3:36) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry defensed by Jeremy Lane.","(4:10) Arian Foster rush to the left for 3 yards to the Sea49. Tackled by Michael Bennett and Kam Chancellor.","(4:39) Arian Foster rush to the right for no gain to the Mia48. Tackled by Michael Bennett and Kam Chancellor.","(4:58) Arian Foster rush to the right for 2 yards to the Mia33. Tackled by Tony McDaniel and Kam Chancellor. Penalty: Unnecessary Roughness on Seattle (Kam Chancellor) 15 yards.","(5:02) Russell Wilson incomplete pass to the right intended for Doug Baldwin defensed by Isa Abdul-Quddus.","(6:00) Thomas Rawls rush up the middle for no gain to the Mia31. Tackled by Andre Branch and Jordan Phillips.","(6:39) Christine Michael rush to the right for 4 yards to the Mia31. Tackled by Reshad Jones.","(7:11) Thomas Rawls rush to the right for 5 yards to the Mia35. Tackled by Koa Misi.","(7:58) Russell Wilson pass to the right to Thomas Rawls for 11 yards to the Mia40. Tackled by Koa Misi and Isa Abdul-Quddus.","(8:10) Matt Darr punts for 45 yards to Sea27. Tyler Lockett return for 22 yards to Sea49. Tackled by Spencer Paysinger.","(8:13) Ryan Tannehill incomplete pass to the right intended for Jarvis Landry.","(8:55) Ryan Tannehill rush to the right for 1 yard to the Mia28. Tackled by Kam Chancellor and Jarran Reed.","(9:22) Ryan Tannehill pass to the right to Jordan Cameron for 1 yard to the Mia27. Tackled by Jeremy Lane.","(9:33) Jon Ryan punts for 50 yards to Mia32. Jakeem Grant return for 4 yards to Mia36. Tackled by Cassius Marsh. Penalty: Illegal Block on Miami (Damien Williams) -10 yards.","(9:37) Russell Wilson incomplete pass to the left intended for Tyler Lockett.","(10:18) Thomas Rawls rush to the left for 1 yard to the Sea18. Tackled by Julius Warmsley and Kiko Alonso.","(11:02) Russell Wilson sacked at Sea17 for a loss of 13 yards by Ndamukong Suh.","(11:39) Thomas Rawls rush up the middle for 2 yards to the Sea30. Tackled by Jelani Jenkins and Isa Abdul-Quddus.","(12:15) Thomas Rawls rush to the left for 2 yards to the Sea28. Tackled by Isa Abdul-Quddus.","(12:43) Russell Wilson pass to the left to Jermaine Kearse for 7 yards to the Sea26. Tackled by Byron Maxwell.","(12:56) Matt Darr punts for 53 yards to Sea6. Tyler Lockett return for 13 yards to Sea19. Tackled by MarQueis Gray and Mike Hull.","(13:35) Ryan Tannehill pass to the left to Arian Foster for 6 yards to the Mia41. Tackled by K.J. Wright and Frank Clark.","(14:08) Ryan Tannehill sacked at Mia35 for a loss of 9 yards by Michael Bennett.","(14:51) Arian Foster rush up the middle for 3 yards to the Mia44. Tackled by Ahtyba Rubin. FUMBLE, recovered by Mia (Ja'Wuan James).","(15:00) Steven Hauschka kicks off to the Mia-4. Jakeem Grant return for 45 yards to Mia41. Tackled by Steven Hauschka.","(0:04) Steven Hauschka 38 yard field goal attempt is GOOD. Holder: Jon Ryan.","(0:04) Miami Dolphins timeout.","(0:09) Russell Wilson incomplete pass to the left intended for Doug Baldwin.","(0:15) Russell Wilson pass to the right to Luke Willson for 19 yards to the Mia20. Tackled by Reshad Jones.","(0:30) Russell Wilson pass to the right to Christine Michael for 5 yards to the Mia39. Tackled by Xavien Howard.","(0:30) Seattle Seahawks timeout.","(0:37) Russell Wilson pass to the left to Doug Baldwin for 18 yards to the Mia44. Tackled by Reshad Jones.","(0:37) Seattle Seahawks timeout.","(0:44) Russell Wilson pass to the right to Jermaine Kearse for 15 yards to the Sea38. Tackled by Xavien Howard.","(0:44) Seattle Seahawks timeout.","(0:52) Russell Wilson sacked at Sea23 for no gain by Jordan Phillips and Jason Jones.","(0:57) Russell Wilson pass to the left to Doug Baldwin for 6 yards to the Sea23. Tackled by Bobby McCain.","(1:23) Christine Michael rush up the middle for 11 yards to the Sea17. Tackled by Isa Abdul-Quddus and Bobby McCain.","(1:30) Penalty: Holding on Seattle (Bradley Sowell) -6 yards.","(1:52) Christine Michael rush to the left for 4 yards to the Sea12. Tackled by Ndamukong Suh and Jordan Phillips.","(2:00) Matt Darr punts for 45 yards to Sea16. No return. Penalty: Holding on Seattle (Kelcie McCray) -8 yards.","(1:52) Two Minute Warning.","(2:25) Ryan Tannehill pass to the right to Arian Foster for 6 yards to the Mia39. Tackled by K.J. Wright and Earl Thomas.","(2:42) Penalty: False Start on Miami (Ja'Wuan James) -5 yards.","(3:23) Arian Foster rush to the right for no gain to the Mia38. Tackled by K.J. Wright and Richard Sherman.","(3:28) Ryan Tannehill incomplete pass to the right intended for Jordan Cameron.","(3:38) Jon Ryan punts for 49 yards to Mia33. Jakeem Grant return for 5 yards to Mia38. Tackled by Cassius Marsh and Mike Morgan.","(3:47) Russell Wilson incomplete pass to the right.","(3:51) Russell Wilson incomplete pass to the left intended for Paul Richardson.","(3:57) Russell Wilson incomplete pass to the right.","(4:21) Thomas Rawls rush to the right for 8 yards to the Sea28. Tackled by Jelani Jenkins and Koa Misi. Penalty: Holding on Seattle (Brandon Williams) -10 yards.","(4:30) Matt Darr punts for 57 yards to Sea0. Touchback.","(4:34) Ryan Tannehill incomplete pass to the right intended for Arian Foster.","(4:38) Ryan Tannehill incomplete pass to the right intended for Damien Williams defensed by Jarran Reed.","(5:13) Damien Williams rush up the middle for 5 yards to the Mia43. Tackled by Frank Clark and Tony McDaniel.","(5:40) Ryan Tannehill rush to the right for 11 yards to the Mia38. Tackled by Bobby Wagner.","(5:52) Jon Ryan punts for 48 yards to Mia11. Jarvis Landry return for 16 yards to Mia27. Tackled by Tyvis Powell and Brandon Williams.","(5:56) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(6:36) Russell Wilson pass to the left to Thomas Rawls for 9 yards to the Sea41. Tackled by Isa Abdul-Quddus.","(6:43) Penalty: Holding on Seattle (Bradley Sowell) -10 yards.","(7:19) Christine Michael rush up the middle for 3 yards to the Sea42. Tackled by Koa Misi.","(7:55) Russell Wilson pass to the middle to Doug Baldwin for 10 yards to the Sea39. Tackled by Koa Misi and Kiko Alonso.","(8:39) Russell Wilson pass to the left to Doug Baldwin for 4 yards to the Sea29. Tackled by Reshad Jones.","(8:45) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(8:45) Andrew Franks kicks off to the endzone. Touchback.","(8:49) Andrew Franks 41 yard field goal attempt is GOOD. Holder: Matt Darr.","(8:55) Ryan Tannehill incomplete pass to the left intended for Kenny Stills defensed by Deshawn Shead.","(9:37) Damien Williams rush to the right for 4 yards to the Sea23. Tackled by Richard Sherman.","(9:43) Ryan Tannehill incomplete pass to the left intended for Kenny Stills.","(10:16) Arian Foster rush to the left for 9 yards to the Sea27. Tackled by Bobby Wagner.","(10:51) Arian Foster rush to the right for 6 yards to the Sea36. Tackled by K.J. Wright.","(11:01) Russell Wilson pass intended for Luke Willson INTERCEPTED by Isa Abdul-Quddus and returned for 9 yards. Tackled by Luke Willson.","(11:40) Thomas Rawls rush to the right for a loss of 1 yard to the Sea23. Tackled by Reshad Jones and Jelani Jenkins.","(12:26) Thomas Rawls rush up the middle for 6 yards to the Sea24. Tackled by Xavien Howard and Mario Williams.","(12:40) Matt Darr punts for 46 yards to Sea23. Tyler Lockett return for 5 yards to Sea28. Tackled by Michael Thomas. Penalty: Illegal Block on Seattle (Brock Coyle) -10 yards.","(13:22) Ryan Tannehill pass to the middle to Jarvis Landry for 10 yards to the Mia31. Tackled by Earl Thomas and Quinton Jefferson.","(14:01) Ryan Tannehill sacked at Mia21 for a loss of 8 yards by Frank Clark.","(14:09) Ryan Tannehill incomplete pass to the left intended for Kenny Stills.","(14:09) Miami Dolphins timeout.","(14:20) Jon Ryan punts for 42 yards to Mia32. Jakeem Grant return for 7 yards to Mia39. Tackled by Cassius Marsh. Penalty: Illegal Block on Miami -10 yards.","(15:00) Christine Michael rush up the middle for 2 yards to the Sea26. Tackled by Koa Misi and Ndamukong Suh.","(0:33) Russell Wilson rush to the left for 9 yards to the Sea24. Tackled by Byron Maxwell.","(1:09) C.J. Prosise rush up the middle for a loss of 2 yards to the Sea15. Tackled by Jordan Phillips and Andre Branch.","(1:21) Arian Foster rush up the middle for no gain to the Sea17. Tackled by Kam Chancellor.","(2:06) Ryan Tannehill pass to the middle to Jordan Cameron for 5 yards to the Sea17. Tackled by Bobby Wagner.","(2:42) Ryan Tannehill pass to the right to Jarvis Landry for 1 yard to the Sea22. Tackled by Bobby Wagner.","(3:15) Arian Foster rush to the left for 3 yards to the Sea23. Tackled by Michael Bennett.","(3:48) Ryan Tannehill pass to the left to Arian Foster for 50 yards to the Sea26. Tackled by K.J. Wright.","(4:31) Arian Foster rush to the left for 2 yards to the Mia24. Tackled by Michael Bennett and K.J. Wright.","(5:05) Ryan Tannehill pass to the right to Leonte Carroo for 2 yards to the Mia22. Tackled by Richard Sherman.","(5:11) Steven Hauschka kicks off to the Mia3. Damien Williams return for 17 yards to Mia20. Tackled by Mike Morgan.","(5:15) Steven Hauschka 39 yard field goal attempt is GOOD. Holder: Jon Ryan.","(5:56) Russell Wilson sacked at Mia21 for a loss of 5 yards by Mario Williams.","(6:05) Russell Wilson incomplete pass to the right intended for Jermaine Kearse defensed by Reshad Jones.","(6:42) Thomas Rawls rush up the middle for 1 yard to the Mia16. Tackled by Julius Warmsley.","(7:19) Christine Michael rush to the right for 12 yards to the Mia17. Tackled by Xavien Howard and Reshad Jones.","(7:49) Russell Wilson pass to the right to Doug Baldwin for 14 yards to the Mia29. Tackled by Xavien Howard.","(8:23) Russell Wilson pass to the right to Luke Willson for 7 yards to the Mia43. Tackled by Jelani Jenkins and Xavien Howard.","(9:02) Russell Wilson pass to the left to Jermaine Kearse for 5 yards to the Sea50. Tackled by Michael Thomas and Kiko Alonso.","(9:23) Christine Michael rush to the right for 1 yard to the Sea45. Tackled by Andre Branch and Earl Mitchell.","(10:04) Russell Wilson pass to the left to C.J. Prosise for 13 yards to the Sea44. Tackled by Kiko Alonso and Isa Abdul-Quddus.","(10:45) Russell Wilson pass to the right to Christine Michael for no gain to the Sea31. Tackled by Koa Misi.","(11:19) Russell Wilson rush to the right for 3 yards to the Sea31. Tackled by Reshad Jones.","(11:19) Penalty: False Start on Seattle (Garry Gilliam) -5 yards.","(11:27) Matt Darr punts for 43 yards to Sea33. No return.","(12:08) Ryan Tannehill pass to the left to Jarvis Landry for no gain to the Mia24. Tackled by K.J. Wright and Deshawn Shead.","(12:45) Arian Foster rush to the right for 8 yards to the Mia24. Tackled by Kam Chancellor.","(13:03) Ryan Tannehill pass to the left to Jarvis Landry for a loss of 3 yards to the Mia16. Tackled by Kam Chancellor.","(13:11) Jon Ryan punts for 37 yards to Mia19. No return.","(13:19) Russell Wilson incomplete pass to the left intended for Tyler Lockett defensed by Byron Maxwell.","(13:23) Russell Wilson incomplete pass to the right intended for Tyler Lockett.","(13:54) Russell Wilson pass to the right to Tyler Lockett for 6 yards to the Sea44. Tackled by Xavien Howard.","(14:29) Russell Wilson pass to the left to Tyler Lockett for 6 yards to the Sea38. Tackled by Byron Maxwell.","(15:00) Russell Wilson pass to the right to Doug Baldwin for 7 yards to the Sea32. Tackled by Xavien Howard.","(15:00) Andrew Franks kicks off to the endzone. Touchback."]