["(0:19) Rex Burkhead rush to the right for 6 yards to the Cin32. Tackled by Danny Shelton.","(1:07) Rex Burkhead rush to the left for 6 yards to the Cin26. Tackled by Derrick Kindred and Christian Kirksey.","(1:52) Rex Burkhead rush to the right for no gain to the Cin20. Tackled by Xavier Cooper.","(2:00) Kevin Hogan pass INTERCEPTED by Vincent Rey defensed by Carlos Dunlap and returned for 6 yards. Tackled by John Greco.","(2:00) Two Minute Warning.","(2:18) Kevin Hogan pass to the right to Gary Barnidge for 17 yards to the Cin21. Tackled by Derron Smith.","(2:22) Kevin Hogan incomplete pass to the middle intended for Isaiah Crowell.","(2:27) Kevin Hogan incomplete pass to the right intended for Ricardo Louis defensed by Darqueze Dennard.","(2:59) Kevin Hogan rush to the right for 16 yards to the Cin38. Tackled by Shawn Williams.","(3:27) Kevin Hogan pass to the right to Ricardo Louis for 5 yards to the Cle46. Tackled by Darqueze Dennard and Carlos Dunlap.","(3:34) Kevin Hogan pass to the right to Duke Johnson Jr. for 4 yards to the Cle41. Tackled by George Iloka.","(3:57) Kevin Hogan pass to the left to Rashard Higgins for 17 yards to the Cle37. Tackled by Adam Jones.","(4:04) Kevin Huber punts for 41 yards to Cle0. Touchback.","(4:10) Andy Dalton incomplete pass to the left intended for Giovani Bernard.","(4:56) Giovani Bernard rush to the left for 5 yards to the Cle41. Tackled by Danny Shelton.","(5:02) Andy Dalton incomplete pass to the right intended for Brandon LaFell.","(5:02) Cleveland Browns timeout.","(5:24) Giovani Bernard rush to the left for 17 yards to the Cle46. Tackled by Emmanuel Ogbah.","(6:10) Giovani Bernard rush to the left for 9 yards to the Cin37. Tackled by Demario Davis and Jamie Meder.","(6:17) Britton Colquitt punts for 36 yards to Cin28. No return.","(6:24) Kevin Hogan incomplete pass to the right intended for Andrew Hawkins.","(6:28) Kevin Hogan incomplete pass to the right intended for Terrelle Pryor Sr..","(7:12) Duke Johnson Jr. rush to the right for 1 yard to the Cle36. Tackled by Karlos Dansby.","(7:17) 45 yard field goal attempt by Mike Nugent is NO GOOD. Holder: Kevin Huber.","(7:56) Andy Dalton sacked at Cle27 for a loss of 6 yards by Emmanuel Ogbah.","(8:39) Giovani Bernard rush to the right for 3 yards to the Cle21. Tackled by Demario Davis.","(9:19) Giovani Bernard rush to the right for 2 yards to the Cle24. Tackled by Xavier Cooper.","(10:00) Rex Burkhead rush to the right for 11 yards to the Cle26. Tackled by Tracy Howard.","(10:42) Giovani Bernard rush to the right for 2 yards to the Cle37. Tackled by Carl Nassib.","(11:23) Giovani Bernard rush to the right for 7 yards to the Cle39. Tackled by Demario Davis.","(11:48) Andy Dalton pass to the left to A.J. Green for 15 yards to the Cle46.","(12:36) Andy Dalton pass to the right to Rex Burkhead for 10 yards to the Cin39. Tackled by Jamar Taylor and Xavier Cooper.","(12:40) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(13:25) Giovani Bernard rush to the left for no gain to the Cin29. Tackled by Derrick Kindred and Emmanuel Ogbah.","(14:12) Jeremy Hill rush to the left for 20 yards to the Cin29. Tackled by Christian Kirksey and Jamar Taylor.","(14:47) Jeremy Hill rush to the left for 5 yards to the Cin9. Tackled by Derrick Kindred.","(15:00) Britton Colquitt punts for 54 yards to Cin9. Alex Erickson - no return. Tackled by Joe Schobert. Penalty: Unsports. Conduct on Cincinnati (James Wright) -5 yards.","(0:08) Duke Johnson Jr. rush up the middle for 5 yards to the Cle37. Tackled by Michael Johnson.","(0:51) Kevin Hogan sacked at Cle32 for a loss of 6 yards by Carlos Dunlap.","(1:29) Isaiah Crowell rush to the right for a loss of 3 yards to the Cle38. Tackled by Michael Johnson.","(1:38) Penalty: Running into Kicker on Cincinnati (Derron Smith) 15 yards.","(1:45) Kevin Hogan incomplete pass to the right intended for Andrew Hawkins defensed by Vontaze Burfict defensed by Karlos Dansby.","(2:06) Penalty: Delay of Game on Cleveland (Kevin Hogan) -5 yards.","(2:36) Kevin Hogan pass to the right to Duke Johnson Jr. for 1 yard to the Cle31. Tackled by Dre Kirkpatrick.","(3:19) Isaiah Crowell rush to the right for 3 yards to the Cle30. Tackled by Domata Peko and Karlos Dansby.","(3:32) Kevin Hogan pass intended for Ricardo Louis INTERCEPTED by Shawn Williams and returned for 13 yards. Tackled by Ricardo Louis. FUMBLE, recovered by Cle (Austin Pasztor). Tackled by Karlos Dansby.","(4:11) Duke Johnson Jr. rush to the right for 2 yards to the Cle27. Tackled by Vontaze Burfict and Pat Sims.","(4:19) Kevin Hogan incomplete pass to the right.","(4:19) Mike Nugent kicks off to the endzone. Touchback.","(4:24) Mike Nugent 36 yard field goal attempt is GOOD. Holder: Kevin Huber.","(5:06) Andy Dalton pass to the right to Tyler Boyd for 3 yards to the Cle18. Tackled by Briean Boddy-Calhoun.","(5:42) Giovani Bernard rush to the left for 4 yards to the Cle21. Tackled by Christian Kirksey.","(5:48) Andy Dalton incomplete pass to the right intended for James Wright.","(6:26) Jeremy Hill rush to the left for 7 yards to the Cle25. Tackled by Christian Kirksey.","(7:04) Jeremy Hill rush to the right for 4 yards to the Cle32. Tackled by Carl Nassib and Demario Davis.","(7:35) Andy Dalton pass to the right to A.J. Green for 48 yards to the Cle36. Tackled by Briean Boddy-Calhoun.","(7:48) Britton Colquitt punts for 48 yards to Cin13. Alex Erickson return for 3 yards to Cin16. FUMBLE, recovered by Cin (Alex Erickson).","(7:55) Kevin Hogan incomplete pass to the right intended for Duke Johnson Jr..","(8:33) Kevin Hogan sacked at Cle39 for a loss of 4 yards by Shawn Williams.","(9:14) Kevin Hogan pass to the left to Isaiah Crowell for 2 yards to the Cle43. Tackled by Vontaze Burfict.","(9:43) Kevin Hogan rush to the left for 16 yards to the Cle41. Tackled by George Iloka.","(9:47) Kevin Hogan incomplete pass to the right intended for Malcolm Johnson.","(9:47) Mike Nugent kicks off to the endzone. Touchback.","(9:47) Mike Nugent extra point is good.","(9:59) Jeremy Hill rush to the right for 74 yards for a TOUCHDOWN.","(10:43) Jeremy Hill rush to the right for 1 yard to the Cin26. Tackled by Emmanuel Ogbah.","(10:43) Cody Parkey kicks off to the endzone. Touchback.","(10:43) Cody Parkey extra point is good.","(10:54) Kevin Hogan rush to the left for 28 yards for a TOUCHDOWN.","(11:36) Kevin Hogan pass to the left to Andrew Hawkins for 15 yards to the Cin28. Tackled by Will Clarke.","(11:58) Isaiah Crowell rush up the middle for 4 yards to the Cin43. Tackled by Karlos Dansby.","(12:27) Isaiah Crowell rush to the right for 13 yards to the Cin47. Tackled by George Iloka.","(13:08) Kevin Hogan pass to the right to Gary Barnidge for 5 yards to the Cle40. Tackled by Vontaze Burfict.","(13:43) Kevin Hogan pass to the right to Terrelle Pryor Sr. for 5 yards to the Cle35. Tackled by Dre Kirkpatrick.","(14:28) Kevin Hogan pass to the right to Andrew Hawkins for 4 yards to the Cle30. Tackled by George Iloka.","(15:00) Isaiah Crowell rush to the left for 1 yard to the Cle26. Tackled by Michael Johnson.","(15:00) Mike Nugent kicks off to the endzone. Touchback.","(15:00) Mike Nugent extra point is good.","(0:07) Andy Dalton pass to the left to A.J. Green for 48 yards for a TOUCHDOWN.","(0:12) Andy Dalton pass to the right to Giovani Bernard for 7 yards to the Cle48.","(0:12) Cincinnati Bengals timeout.","(0:20) Andy Dalton sacked at Cin45 for a loss of 6 yards by Emmanuel Ogbah.","(0:26) Andy Dalton pass to the right to A.J. Green for 16 yards to the Cle49. Tackled by Briean Boddy-Calhoun.","(0:47) Andy Dalton pass to the left to Tyler Eifert for 9 yards to the Cin35. Tackled by Tracy Howard.","(0:47) Cincinnati Bengals timeout.","(0:58) Giovani Bernard rush to the right for 6 yards to the Cin26. Tackled by Xavier Cooper.","(0:58) Cleveland Browns timeout.","(1:03) Giovani Bernard rush to the right for 5 yards to the Cin20. Tackled by Christian Kirksey.","(1:10) Britton Colquitt punts for 28 yards to Cin15. No return.","(1:10) Penalty: Delay of Game on Cleveland (Kevin Hogan) -5 yards.","(2:00) Kevin Hogan rush to the left for 7 yards to the Cin38. Tackled by Karlos Dansby.","(2:00) Two Minute Warning.","(2:03) Kevin Hogan incomplete pass to the middle intended for Gary Barnidge defensed by Vincent Rey.","(2:11) Kevin Hogan incomplete pass to the right.","(2:11) Cincinnati Bengals timeout.","(2:49) Kevin Hogan pass to the left to Gary Barnidge for 12 yards to the Cin45. Tackled by George Iloka.","(3:26) Kevin Hogan pass to the left to Gary Barnidge for 13 yards to the Cle43. Tackled by Shawn Williams.","(4:09) Duke Johnson Jr. rush to the right for 5 yards to the Cle30. Tackled by Karlos Dansby.","(4:09) Mike Nugent kicks off to the endzone. Touchback.","(4:09) Mike Nugent extra point is good.","(4:17) Andy Dalton pass to the left to Brandon LaFell for 44 yards for a TOUCHDOWN.","(4:38) Cleveland Browns timeout.","(4:38) Andy Dalton pass to the right to Brandon LaFell for 21 yards to the Cle44. Tackled by Derrick Kindred.","(5:22) Giovani Bernard rush to the right for 3 yards to the Cin35. Tackled by Jamie Meder.","(5:52) Giovani Bernard rush to the right for 3 yards to the Cin32. Tackled by Carl Nassib.","(6:15) Giovani Bernard rush to the left for 9 yards to the Cin29. Tackled by Jamie Meder.","(6:20) Cody Parkey kicks off to the Cin-3. Adam Jones return for 23 yards to Cin20. Tackled by Joe Schobert and Ibraheim Campbell.","(6:20) Cody Parkey extra point is good.","(6:23) Isaiah Crowell rush to the right for 1 yard for a TOUCHDOWN.","(7:06) Isaiah Crowell rush to the left for 4 yards to the Cin1. Tackled by Carlos Dunlap and George Iloka.","(7:39) Cody Kessler pass to the right to Gary Barnidge for 11 yards to the Cin5. Tackled by George Iloka and Vontaze Burfict.","(8:20) Isaiah Crowell rush to the left for a loss of 3 yards to the Cin16. Tackled by Pat Sims.","(9:03) Isaiah Crowell rush to the left for 12 yards to the Cin13. Tackled by Shawn Williams and Vontaze Burfict.","(9:46) Cody Kessler pass to the left to Malcolm Johnson for 21 yards to the Cin25. Tackled by Karlos Dansby.","(10:01) Penalty: Holding on Cleveland (Cameron Erving) -10 yards.","(10:36) Kevin Hogan rush to the right for 15 yards to the Cin36. Tackled by Karlos Dansby.","(11:16) Cody Kessler pass to the right to Isaiah Crowell for 4 yards to the Cle49. Tackled by Will Clarke and Karlos Dansby.","(11:59) Kevin Hogan rush to the right for 15 yards to the Cle45. Tackled by George Iloka.","(12:11) Kevin Huber punts for 48 yards to Cle27. Duke Johnson Jr. return for 3 yards to Cle30. Tackled by James Wright and Rex Burkhead.","(12:17) Andy Dalton incomplete pass to the left.","(12:54) Giovani Bernard rush to the left for a loss of 2 yards to the Cin25. Tackled by Christian Kirksey.","(13:26) Giovani Bernard rush to the right for 2 yards to the Cin27. Tackled by Danny Shelton.","(13:26) Cody Parkey kicks off to the endzone. Touchback.","(13:30) Cody Parkey 28 yard field goal attempt is GOOD. Holder: Britton Colquitt.","(13:37) Penalty: Delay of Game on Cleveland (Britton Colquitt) -5 yards.","(14:25) Duke Johnson Jr. rush to the right for 1 yard to the Cin5. Tackled by Domata Peko.","(14:53) Isaiah Crowell rush to the right for 8 yards to the Cin6. Tackled by Rey Maualuga and Shawn Williams.","(15:00) Cody Kessler incomplete pass to the left.","(0:30) Cody Kessler pass to the middle to Terrelle Pryor Sr. for 13 yards to the Cin14. Tackled by Dre Kirkpatrick.","(1:12) Cody Kessler pass to the left to Duke Johnson Jr. for 13 yards to the Cin27. Tackled by Vontaze Burfict.","(1:54) Duke Johnson Jr. rush to the left for 1 yard to the Cin40. Tackled by Karlos Dansby.","(2:28) Cody Kessler rush to the left for a loss of 2 yards to the Cin41. Tackled by Vontaze Burfict.","(3:04) Cody Kessler pass to the left to Isaiah Crowell for 10 yards to the Cin39. Tackled by Rey Maualuga.","(3:42) Isaiah Crowell rush to the left for 21 yards to the Cin49. Tackled by George Iloka.","(3:48) 40 yard field goal attempt by Mike Nugent is NO GOOD. Holder: Kevin Huber.","(4:25) Andy Dalton pass to the right to Brandon LaFell for 10 yards to the Cle22. Tackled by Tramon Williams.","(4:31) Andy Dalton incomplete pass to the right intended for Tyler Eifert defensed by Christian Kirksey.","(5:12) Andy Dalton sacked at Cle32 for a loss of 8 yards by Christian Kirksey and Carl Nassib.","(5:47) Andy Dalton pass to the left to Jeremy Hill for 11 yards to the Cle24. Tackled by Ibraheim Campbell.","(5:55) Andy Dalton incomplete pass to the right.","(6:21) Andy Dalton pass to the left to A.J. Green for 9 yards to the Cle35. Tackled by Jamar Taylor.","(7:00) Andy Dalton pass to the left to Brandon LaFell for 8 yards to the Cle44. Tackled by Jamar Taylor.","(7:04) Andy Dalton incomplete pass to the left intended for Tyler Boyd.","(7:37) Jeremy Hill rush to the right for 8 yards to the Cin48. Tackled by Emmanuel Ogbah.","(8:01) Andy Dalton pass to the right to Tyler Kroft for 3 yards to the Cin40. Tackled by Tracy Howard.","(8:35) Andy Dalton pass to the right to A.J. Green for 15 yards to the Cin37. Tackled by Tramon Williams.","(8:43) Britton Colquitt punts for 43 yards to Cin12. No return. Penalty: Holding on Cleveland (Charley Hughlett) 10 yards.","(8:47) Cody Kessler incomplete pass to the left intended for Terrelle Pryor Sr..","(9:33) Kevin Hogan rush to the left for 7 yards to the Cle45. Tackled by George Iloka.","(10:10) Cody Kessler pass to the right to Duke Johnson Jr. for no gain to the Cle38. Tackled by Vincent Rey.","(10:50) Cody Kessler pass to the middle to Gary Barnidge for 8 yards to the Cle38. Tackled by Karlos Dansby.","(11:31) Cody Kessler pass to the right to Rashard Higgins for 2 yards to the Cle30. Tackled by Dre Kirkpatrick.","(12:10) Isaiah Crowell rush to the left for 2 yards to the Cle28. Tackled by Vontaze Burfict.","(12:14) Mike Nugent kicks off to the Cle8. Tracy Howard return for 18 yards to Cle26. Tackled by Rex Burkhead.","(12:14) Mike Nugent extra point is good.","(12:19) Giovani Bernard rush to the right for 5 yards for a TOUCHDOWN.","(13:01) Jeremy Hill rush to the right for 40 yards to the Cle5. Tackled by Jamar Taylor.","(13:08) Andy Dalton incomplete pass to the right intended for James Wright defensed by Briean Boddy-Calhoun.","(13:37) Andy Dalton pass to the middle to Jeremy Hill for 13 yards to the Cle45. Tackled by Christian Kirksey and Tramon Williams.","(14:04) Jeremy Hill rush to the right for 9 yards to the Cle48. Tackled by Ibraheim Campbell. Penalty: Illegal Block on Cincinnati (A.J. Green) -10 yards.","(14:30) Andy Dalton pass to the right to A.J. Green for 6 yards to the Cin43. Tackled by Briean Boddy-Calhoun.","(15:00) Andy Dalton pass to the right to A.J. Green for 12 yards to the Cin37. Tackled by Jamie Meder and Tracy Howard.","(15:00) Cody Parkey kicks off to the endzone. Touchback."]