["(0:04) Brock Osweiler pass to the right to DeAndre Hopkins for 3 yards to the Hou15. Lateral to Will Fuller V for 5 yards to the Hou20. Lateral to Lamar Miller for a loss of 11 yards to the Hou9. Lateral to Brock Osweiler for a loss of 8 yards to the Hou1. Penalty: Illegal Forward Pass on Houston (Brock Osweiler) 0 yards.","(0:12) Jacob Schum punts for 36 yards to Hou12. No return.","(0:12) Green Bay Packers timeout.","(0:58) Christine Michael rush to the left for a loss of 2 yards to the Hou48. Tackled by D.J. Reader.","(0:58) Green Bay Packers timeout.","(1:44) Christine Michael rush up the middle for 1 yard to the Hou46. Tackled by Antonio Smith.","(1:44) Houston Texans timeout.","(1:50) Christine Michael rush to the left for 1 yard to the Hou47. Tackled by Brian Cushing.","(1:51) Nick Novak onside kickoff to the Hou48. Onside kick recovered by receiving team by Davante Adams.","(1:51) Nick Novak extra point is NO GOOD.","(2:00) Brock Osweiler pass to the right to DeAndre Hopkins for 44 yards for a TOUCHDOWN.","(2:00) Two Minute Warning.","(2:16) Brock Osweiler pass to the right to Ryan Griffin for 18 yards to the GB44. Tackled by Quinten Rollins.","(2:28) Penalty: Pass Interference on Houston (Ryan Griffin) -10 yards.","(3:02) Brock Osweiler pass to the middle to Jonathan Grimes for 15 yards to the Hou48. Tackled by Joe Thomas.","(3:30) Brock Osweiler pass to the left to Ryan Griffin for 5 yards to the Hou33. Tackled by Micah Hyde.","(3:35) Brock Osweiler incomplete pass to the middle intended for Ryan Griffin defensed by Joe Thomas.","(4:04) Brock Osweiler pass to the left to Will Fuller V for 6 yards to the Hou28. Tackled by Ha Ha Clinton-Dix.","(4:11) Mason Crosby kicks off to the Hou0. Akeem Hunt return for 22 yards to Hou22. Tackled by Aaron Ripkowski.","(4:11) Mason Crosby extra point is good.","(4:18) Aaron Ripkowski rush up the middle for 3 yards for a TOUCHDOWN.","(5:06) Jeff Janis rush to the left for 19 yards to the Hou3. Tackled by Kareem Jackson.","(5:54) Aaron Rodgers pass to the left to Jordy Nelson for 28 yards to the Hou22. Tackled by Kareem Jackson.","(6:37) Ty Montgomery rush to the right for 4 yards to the GB50. Tackled by Robert Nelson Jr..","(6:37) Green Bay Packers timeout.","(6:42) Aaron Rodgers incomplete pass to the left intended for Jared Cook.","(7:29) Ty Montgomery rush to the left for 11 yards to the GB46. Tackled by Eddie Pleasant.","(8:16) Aaron Rodgers pass to the right to Jordy Nelson for 21 yards to the GB35. Tackled by Corey Moore.","(8:52) Ty Montgomery rush to the right for 3 yards to the GB14. Tackled by Antonio Smith.","(8:59) Shane Lechler punts for 33 yards to GB11. No return.","(9:04) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz defensed by Micah Hyde.","(9:51) Brock Osweiler pass to the right to Alfred Blue for 12 yards to the GB44. Tackled by Damarious Randall.","(10:39) Brock Osweiler pass to the right to Alfred Blue for a loss of 9 yards to the Hou44. Tackled by Letroy Guion.","(11:14) Alfred Blue rush to the right for 25 yards to the GB47. Tackled by Ha Ha Clinton-Dix.","(11:20) Brock Osweiler incomplete pass to the left intended for Will Fuller V defensed by Ladarius Gunter.","(12:00) Alfred Blue rush to the right for 10 yards to the Hou28. Tackled by Morgan Burnett.","(12:37) Brock Osweiler pass to the left to Will Fuller V for 3 yards to the Hou18. Tackled by Quinten Rollins.","(12:42) Mason Crosby kicks off to the Hou0. Akeem Hunt return for 15 yards to Hou15. Tackled by Jayrone Elliott.","(12:42) Mason Crosby extra point is good.","(12:50) Aaron Rodgers pass to the left to Jordy Nelson for 32 yards for a TOUCHDOWN.","(12:54) Aaron Rodgers incomplete pass to the right intended for Davante Adams.","(13:39) Aaron Rodgers rush to the right for 11 yards to the Hou32. Tackled by Charles James.","(14:15) Ty Montgomery rush up the middle for 4 yards to the Hou43. Tackled by Whitney Mercilus.","(15:00) Aaron Rodgers pass to the right to Davante Adams for 17 yards to the Hou47. Tackled by Kareem Jackson.","(0:23) Aaron Rodgers pass to the left to Jared Cook for 10 yards to the GB36. Tackled by Eddie Pleasant.","(0:33) Aaron Rodgers incomplete pass to the right intended for Davante Adams.","(1:10) Aaron Rodgers rush to the right for 5 yards to the GB26. Tackled by Christian Covington.","(1:51) Aaron Rodgers pass to the middle to Richard Rodgers for 7 yards to the GB31. Tackled by Benardrick McKinney. Penalty: Illegal Block on Green Bay (Davante Adams) -10 yards.","(2:13) Ty Montgomery rush to the right for 13 yards to the GB24. Tackled by Johnathan Joseph.","(2:55) Aaron Rodgers pass to the right to Richard Rodgers for 9 yards to the GB11. Tackled by Johnathan Joseph.","(3:02) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(3:10) Shane Lechler punts for 34 yards to GB2. No return.","(3:15) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(3:20) Brock Osweiler incomplete pass to the middle intended for DeAndre Hopkins.","(4:05) Lamar Miller rush to the right for 5 yards to the GB36. Tackled by Letroy Guion.","(4:44) Jonathan Grimes rush up the middle for 14 yards to the GB41. Tackled by Ha Ha Clinton-Dix and Micah Hyde.","(5:25) Lamar Miller rush up the middle for a loss of 4 yards to the Hou45. Tackled by Mike Pennel.","(6:09) Lamar Miller rush to the right for 2 yards to the Hou49. Tackled by Julius Peppers.","(6:16) Aaron Ripkowski rush to the left for 1 yard to the Hou47. Tackled by Vince Wilfork.","(6:16) Houston Texans timeout.","(6:33) Aaron Rodgers pass to the left to Randall Cobb for 7 yards to the Hou48. Tackled by A.J. Bouye.","(7:17) Christine Michael rush to the left for 1 yard to the GB45. Tackled by Ufomba Kamalu and Brian Cushing.","(7:24) Aaron Rodgers incomplete pass to the left intended for Davante Adams.","(7:32) Nick Novak kicks off to the GB5. Ty Montgomery return for 39 yards to GB44. Tackled by Robert Nelson Jr..","(7:32) Nick Novak extra point is good.","(7:37) Brock Osweiler pass to the right to Ryan Griffin for 6 yards for a TOUCHDOWN.","(7:37) Houston Texans timeout.","(8:24) Jonathan Grimes rush up the middle for 5 yards to the GB6. Tackled by Datone Jones.","(9:09) Lamar Miller rush to the right for 4 yards to the GB11. Tackled by Jake Ryan.","(9:13) Brock Osweiler incomplete pass to the right intended for C.J. Fiedorowicz.","(9:54) Brock Osweiler pass to the right to DeAndre Hopkins for 11 yards to the GB15. Tackled by Morgan Burnett and Jake Ryan.","(10:38) Lamar Miller rush up the middle for 4 yards to the GB26. Tackled by Ha Ha Clinton-Dix.","(11:18) Brock Osweiler pass to the right to C.J. Fiedorowicz for 8 yards to the GB30. Tackled by Morgan Burnett.","(11:47) Brock Osweiler pass to the right to Will Fuller V for 24 yards to the GB38. Tackled by Ha Ha Clinton-Dix and Damarious Randall.","(12:25) Lamar Miller rush up the middle for 1 yard to the Hou38. Tackled by Julius Peppers.","(12:29) Brock Osweiler incomplete pass to the middle intended for C.J. Fiedorowicz defensed by Dean Lowry.","(12:42) Jacob Schum punts for 48 yards to Hou21. Will Fuller V return for 16 yards to Hou37. Tackled by Josh Hawkins.","(13:23) Aaron Rodgers pass to the middle to Ty Montgomery for 10 yards to the GB31. Tackled by Quintin Demps.","(14:09) Aaron Rodgers sacked at GB21 for a loss of 9 yards by Whitney Mercilus.","(14:53) James Starks rush up the middle for no gain to the GB30. Tackled by Benardrick McKinney and Brian Cushing.","(15:00) Nick Novak kicks off to the GB2. Jeff Janis return for 28 yards to GB30. Tackled by Alfred Blue.","(0:10) Jonathan Grimes rush up the middle for 7 yards to the Hou38. Tackled by Morgan Burnett and Joe Thomas.","(0:56) Brock Osweiler sacked at Hou31 for a loss of 10 yards by Julius Peppers.","(0:56) Houston Texans timeout.","(1:05) Brock Osweiler pass to the middle to C.J. Fiedorowicz for 9 yards to the Hou41. Tackled by Morgan Burnett.","(1:12) Brock Osweiler pass to the left to C.J. Fiedorowicz for 13 yards to the Hou32. Tackled by Ha Ha Clinton-Dix.","(1:37) Brock Osweiler pass to the left to C.J. Fiedorowicz for 8 yards to the Hou19. Tackled by Micah Hyde.","(1:47) Jacob Schum punts for 40 yards to Hou11. No return.","(1:52) Aaron Rodgers incomplete pass to the middle intended for Davante Adams.","(2:00) Aaron Rodgers incomplete pass to the right intended for Jordy Nelson.","(2:00) Two Minute Warning.","(2:30) Aaron Rodgers pass to the left to Randall Cobb for 3 yards to the GB49. Tackled by Kareem Jackson.","(3:08) Aaron Ripkowski rush to the right for 10 yards to the GB46. Tackled by Benardrick McKinney.","(3:38) Aaron Rodgers pass to the right to Jordy Nelson for 8 yards to the GB36. Tackled by Johnathan Joseph.","(3:46) Shane Lechler punts for 51 yards to GB38. Marwin Evans - no return. Tackled by Akeem Dent. Penalty: Holding on Green Bay (Josh Hawkins) -10 yards.","(3:54) Brock Osweiler incomplete pass to the middle intended for Braxton Miller.","(3:59) Brock Osweiler incomplete pass to the right intended for Braxton Miller.","(4:03) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins defensed by Ladarius Gunter.","(4:10) Jacob Schum punts for 44 yards to Hou11. No return.","(4:16) Aaron Rodgers incomplete pass to the left intended for Ty Montgomery.","(4:21) Aaron Rodgers incomplete pass to the right intended for Davante Adams.","(5:06) Christine Michael rush up the middle for 5 yards to the GB45. Tackled by Quintin Demps and Joel Heath.","(5:20) Shane Lechler punts for 35 yards to GB17. Randall Cobb return for 23 yards to GB40. Tackled by Shane Lechler and Robert Nelson Jr..","(5:57) Brock Osweiler pass to the left to Will Fuller V for 11 yards to the Hou48. Tackled by Ladarius Gunter.","(6:44) Brock Osweiler sacked at Hou37 for a loss of 8 yards by Dean Lowry.","(7:20) Lamar Miller rush up the middle for no gain to the Hou45. Tackled by Joe Thomas and Letroy Guion.","(7:55) Brock Osweiler pass to the right to Will Fuller V for 10 yards to the Hou45. Tackled by Morgan Burnett.","(8:02) Mason Crosby kicks off to the Hou6. Akeem Hunt return for 29 yards to Hou35. Tackled by Josh Hawkins.","(8:02) Mason Crosby extra point is good.","(8:10) Aaron Rodgers pass to the right to Randall Cobb for 9 yards for a TOUCHDOWN.","(8:55) Aaron Rodgers pass to the middle to Aaron Ripkowski for 4 yards to the Hou9. Tackled by Quintin Demps.","(9:02) Aaron Rodgers pass to the right to Jordy Nelson for 7 yards to the Hou13. Tackled by Kareem Jackson.","(9:41) Ty Montgomery rush to the left for 5 yards to the Hou20. Tackled by Quintin Demps and Benardrick McKinney.","(10:32) Aaron Rodgers pass to the left to Ty Montgomery for 6 yards to the Hou25. Tackled by Brian Cushing.","(11:15) Aaron Rodgers pass to the right to Jordy Nelson for 6 yards to the Hou31. Tackled by Johnathan Joseph.","(11:49) Christine Michael rush to the left for 5 yards to the Hou37. Tackled by Quintin Demps.","(12:37) Christine Michael rush to the left for a loss of 1 yard to the Hou42. Tackled by Whitney Mercilus and A.J. Bouye.","(13:18) Christine Michael rush to the left for 2 yards to the Hou41. Tackled by Benardrick McKinney and Brian Cushing.","(14:00) Christine Michael rush to the right for 7 yards to the Hou43. Tackled by Quintin Demps.","(14:06) Alfred Blue rush to the left for no gain to the GB49. Tackled by Datone Jones and Ha Ha Clinton-Dix.","(15:00) Brock Osweiler pass to the left to C.J. Fiedorowicz for 4 yards to the GB49. Tackled by Morgan Burnett.","(0:33) Lamar Miller rush to the right for 3 yards to the Hou47. Tackled by Datone Jones.","(1:12) Lamar Miller rush to the left for 2 yards to the Hou44. Tackled by Joe Thomas.","(1:55) Brock Osweiler rush to the left for 8 yards to the Hou42. Tackled by Ladarius Gunter.","(2:35) Lamar Miller rush up the middle for 3 yards to the Hou34. Tackled by Datone Jones.","(2:39) Brock Osweiler incomplete pass to the right intended for DeAndre Hopkins defensed by Quinten Rollins.","(3:18) Jonathan Grimes rush up the middle for 8 yards to the Hou31. Tackled by Joe Thomas and Julius Peppers.","(4:04) Brock Osweiler pass to the right to Lamar Miller for 7 yards to the Hou23. Tackled by Julius Peppers.","(4:41) Lamar Miller rush to the right for a loss of 4 yards to the Hou16. Tackled by Jake Ryan.","(4:51) Jacob Schum punts for 47 yards to Hou0. Touchback.","(5:30) James Starks rush to the left for a loss of 3 yards to the Hou47. Tackled by Corey Moore.","(5:57) James Starks rush to the right for no gain to the Hou44. Tackled by Whitney Mercilus.","(6:03) Aaron Rodgers pass to the left to Jordy Nelson for 9 yards to the Hou44. Tackled by A.J. Bouye.","(6:15) Shane Lechler punts for 52 yards to GB26. Randall Cobb return for 21 yards to GB47. Tackled by Corey Moore.","(6:19) Brock Osweiler incomplete pass to the left intended for DeAndre Hopkins.","(7:05) Jonathan Grimes rush up the middle for 9 yards to the Hou22. Tackled by Morgan Burnett.","(7:42) Alfred Blue rush to the left for a loss of 3 yards to the Hou13. Tackled by Letroy Guion.","(8:19) Alfred Blue rush to the right for 6 yards to the Hou16. Tackled by Micah Hyde.","(8:19) Penalty: Offside on Green Bay (Letroy Guion) 5 yards.","(8:29) Aaron Rodgers rush up the middle for no gain to the Hou2. FUMBLE, recovered by Hou (Whitney Mercilus). Tackled by Ty Montgomery.","(8:30) Houston Texans timeout.","(8:38) Aaron Rodgers incomplete pass to the middle intended for Jordy Nelson.","(8:43) Penalty: Offside on Houston (Antonio Smith) 2 yards.","(8:49) Aaron Rodgers pass to the left to Jordy Nelson for 7 yards to the Hou4. Tackled by A.J. Bouye.","(9:23) Aaron Rodgers pass to the right to Jared Cook for 10 yards to the Hou11. Tackled by Corey Moore.","(10:06) Aaron Rodgers pass to the left to Jared Cook for a loss of 1 yard to the Hou21. Tackled by Quintin Demps.","(10:42) James Starks rush to the right for 4 yards to the Hou20. Tackled by Corey Moore and Brian Cushing.","(10:56) Brock Osweiler pass to the left to Ryan Griffin for 6 yards to the GB44. Tackled by Ladarius Gunter. FUMBLE, recovered by GB (Morgan Burnett) and returned for 35 yards. Tackled by Will Fuller V.","(11:37) Lamar Miller rush up the middle for 1 yard to the Hou50. Tackled by Nick Perry.","(11:43) Brock Osweiler incomplete pass to the right intended for Ryan Griffin defensed by Morgan Burnett.","(12:24) Brock Osweiler pass to the right to C.J. Fiedorowicz for 2 yards to the Hou49. Tackled by Morgan Burnett.","(13:03) Lamar Miller rush to the left for 4 yards to the Hou47. Tackled by Jake Ryan and Nick Perry.","(13:09) Penalty: Offside on Green Bay (Letroy Guion) 5 yards.","(13:43) Brock Osweiler rush to the right for 9 yards to the Hou38. Tackled by Quinten Rollins.","(14:25) Brock Osweiler rush up the middle for 3 yards to the Hou29. Tackled by Nick Perry.","(15:00) Lamar Miller rush to the left for 1 yard to the Hou26. Tackled by Nick Perry.","(15:00) Mason Crosby kicks off to the endzone. Touchback."]