["(0:39) Jameis Winston rush up the middle for a loss of 1 yard to the TB27.","(1:19) Jameis Winston rush up the middle for a loss of 1 yard to the TB28.","(2:00) Jameis Winston rush up the middle for a loss of 2 yards to the TB29.","(2:00) Two Minute Warning.","(2:05) Jacquizz Rodgers rush up the middle for 2 yards to the TB31. Tackled by Kyle Emanuel.","(2:05) Tampa Bay Buccaneers timeout.","(2:50) Jacquizz Rodgers rush up the middle for 2 yards to the TB29. Tackled by Kyle Emanuel.","(2:50) San Diego Chargers timeout.","(2:56) Jacquizz Rodgers rush up the middle for 7 yards to the TB27. Tackled by Craig Mager and Korey Toomer.","(3:04) Philip Rivers pass intended for Dontrelle Inman INTERCEPTED by Keith Tandy. No return. Tackled by Dontrelle Inman. Touchback.","(3:50) Philip Rivers rush up the middle for 9 yards to the TB31. Tackled by Clinton McDonald.","(3:58) Philip Rivers rush to the right for 6 yards to the TB45. Tackled by Bradley McDougald. Penalty: Holding on Tampa Bay (Kwon Alexander) 5 yards.","(4:43) Melvin Gordon rush up the middle for 1 yard to the SD49. Tackled by Robert Ayers Jr..","(5:26) Melvin Gordon rush up the middle for 1 yard to the SD48. Tackled by Clinton McDonald.","(5:26) San Diego Chargers timeout.","(6:11) Philip Rivers pass to the left to Tyrell Williams for 7 yards to the SD47. Tackled by Vernon Hargreaves III.","(6:49) Melvin Gordon rush to the right for 2 yards to the SD40. Tackled by Bradley McDougald.","(7:26) Philip Rivers pass to the middle to Antonio Gates for 14 yards to the SD38. Tackled by Kwon Alexander.","(8:13) Philip Rivers pass to the middle to Antonio Gates for 6 yards to the SD24. Tackled by Lavonte David and Kwon Alexander.","(9:01) Philip Rivers sacked at SD18 for a loss of 7 yards by Robert Ayers Jr..","(9:01) Roberto Aguayo kicks off to the endzone. Touchback.","(9:01) Jameis Winston 2 pt conversion pass to Mike Evans is GOOD.","(9:06) Jameis Winston pass to the left to Cameron Brate for 12 yards for a TOUCHDOWN.","(9:48) Jacquizz Rodgers rush up the middle for 5 yards to the SD12. Tackled by Denzel Perryman and Adrian Phillips.","(10:35) Jameis Winston pass to the right to Jacquizz Rodgers for 21 yards to the SD17. Tackled by Korey Toomer.","(11:15) Jameis Winston pass to the right to Freddie Martino for 16 yards to the SD38. Tackled by Trevor Williams.","(11:25) Drew Kaser punts for 38 yards to TB41. Vernon Hargreaves III return for 5 yards to TB46. Tackled by Darrell Stuckey and Kyle Emanuel.","(11:34) Philip Rivers incomplete pass to the left intended for Travis Benjamin.","(11:48) Penalty: False Start on San Diego (Joe Barksdale) -5 yards.","(12:32) Melvin Gordon rush to the right for 4 yards to the SD26. Tackled by Brent Grimes.","(13:03) Melvin Gordon rush up the middle for a loss of 3 yards to the SD22. Tackled by William Gholston.","(13:03) Roberto Aguayo kicks off to the endzone. Touchback.","(13:07) Roberto Aguayo 35 yard field goal attempt is GOOD. Holder: Bryan Anger.","(13:12) Jameis Winston incomplete pass to the left intended for Mike Evans.","(13:57) Jameis Winston pass to the right to Freddie Martino for 8 yards to the SD16. Tackled by Denzel Perryman.","(14:35) Jacquizz Rodgers rush up the middle for no gain to the SD24. Tackled by Jahleel Addae and Corey Liuget.","(15:00) Jameis Winston rush up the middle for 5 yards to the SD29. Tackled by Jahleel Addae and Korey Toomer. Penalty: Holding on San Diego (Trevor Williams) 5 yards.","(0:18) Jameis Winston pass to the left to Mike Evans for 4 yards to the SD34. Tackled by Denzel Perryman.","(0:56) Jacquizz Rodgers rush up the middle for a loss of 1 yard to the SD38. Tackled by Corey Liuget.","(1:33) Jameis Winston pass to the right to Cameron Brate for 38 yards to the SD37. Tackled by Korey Toomer.","(1:33) Josh Lambo kicks off to the endzone. Touchback.","(1:33) Josh Lambo extra point is good.","(1:42) Philip Rivers pass to the right to Tyrell Williams for 40 yards for a TOUCHDOWN.","(1:42) San Diego Chargers timeout.","(2:31) Melvin Gordon rush to the left for 23 yards to the TB40. Tackled by Vernon Hargreaves III.","(3:18) Melvin Gordon rush up the middle for 2 yards to the SD37. Tackled by Daryl Smith.","(3:57) Melvin Gordon rush up the middle for 11 yards to the SD35. Tackled by Keith Tandy and Clinton McDonald.","(4:25) Melvin Gordon rush up the middle for a loss of 1 yard to the SD24. Tackled by Akeem Spence.","(4:25) Roberto Aguayo kicks off to the endzone. Touchback.","(4:25) Roberto Aguayo extra point is good.","(4:32) Philip Rivers pass intended for Tyrell Williams INTERCEPTED by Lavonte David defensed by Vernon Hargreaves III and returned for 15 yards for a TOUCHDOWN.","(4:42) Bryan Anger punts for 54 yards to SD8. No return.","(5:21) Doug Martin rush up the middle for no gain to the TB38. Tackled by Corey Liuget and Tenny Palepoi.","(5:47) Jameis Winston pass to the right to Cameron Brate for 8 yards to the TB38. Tackled by Denzel Perryman.","(6:26) Doug Martin rush to the left for no gain to the TB30. Tackled by Chris Landrum and Darius Philon.","(6:37) Drew Kaser punts for 49 yards to TB21. Vernon Hargreaves III return for 9 yards to TB30. Tackled by Darrell Stuckey.","(6:41) Philip Rivers incomplete pass to the right intended for Dontrelle Inman defensed by Lavonte David.","(6:48) Philip Rivers incomplete pass to the right.","(6:55) Penalty: Illegal Use of Hands on San Diego (King Dunlap) -10 yards.","(7:37) Melvin Gordon rush up the middle for 4 yards to the SD40. Tackled by William Gholston.","(8:14) Philip Rivers pass to the middle to Antonio Gates for 11 yards to the SD36. Tackled by Bradley McDougald.","(8:19) Philip Rivers incomplete pass to the right intended for Tyrell Williams defensed by Kwon Alexander.","(8:25) Philip Rivers incomplete pass to the right intended for Melvin Gordon.","(8:25) Roberto Aguayo kicks off to the endzone. Touchback.","(8:29) Roberto Aguayo 27 yard field goal attempt is GOOD. Holder: Bryan Anger.","(8:29) Penalty: False Start on Tampa Bay (Caleb Benenoch) -5 yards.","(8:38) Jameis Winston incomplete pass to the right intended for Russell Shepard. Penalty: Illegal Touch on Tampa Bay (Russell Shepard) 0 yards.","(8:43) Jameis Winston incomplete pass to the right intended for Mike Evans.","(8:48) Penalty: Offside on San Diego (Melvin Ingram) 4 yards.","(9:34) Peyton Barber rush up the middle for 4 yards to the SD8. Tackled by Craig Mager and Jahleel Addae.","(10:14) Jameis Winston pass to the right to Freddie Martino for 15 yards to the SD12. Tackled by Kyle Emanuel and Craig Mager.","(10:58) Jameis Winston pass to the left to Cameron Brate for 4 yards to the SD27. Tackled by Korey Toomer.","(11:35) Doug Martin rush to the left for 8 yards to the SD31. Tackled by Denzel Perryman.","(11:42) Jameis Winston incomplete pass to the left intended for Cameron Brate.","(12:26) Doug Martin rush up the middle for 2 yards to the SD39. Tackled by Melvin Ingram.","(13:09) Doug Martin rush to the left for 1 yard to the SD41. Tackled by Jahleel Addae and Joey Bosa.","(13:46) Jameis Winston pass to the left to Alan Cross for 8 yards to the SD42. Tackled by Korey Toomer.","(14:25) Jameis Winston pass to the left to Doug Martin for 23 yards to the TB50. Tackled by Craig Mager and Kyle Emanuel.","(15:00) Doug Martin rush up the middle for 2 yards to the TB27. Tackled by Corey Liuget.","(15:00) Josh Lambo kicks off to the endzone. Touchback.","(0:41) Melvin Gordon rush up the middle for 7 yards to the SD28. Tackled by Lavonte David and Keith Tandy.","(0:45) Philip Rivers incomplete pass to the left intended for Melvin Gordon.","(0:49) 31 yard field goal attempt by Roberto Aguayo is NO GOOD. Holder: Bryan Anger.","(0:49) San Diego Chargers timeout.","(0:58) Jacquizz Rodgers rush up the middle for 14 yards to the SD13. Tackled by Kyle Emanuel.","(0:58) Tampa Bay Buccaneers timeout.","(1:08) Jameis Winston sacked at SD27 for a loss of 12 yards by Joey Bosa.","(1:12) Jameis Winston incomplete pass to the right intended for Cameron Brate.","(1:12) San Diego Chargers timeout.","(2:00) Jameis Winston pass to the right to Russell Shepard for 15 yards to the SD15. Tackled by Craig Mager and Melvin Ingram.","(2:00) Two Minute Warning.","(2:06) Doug Martin rush up the middle for no gain to the SD30. Tackled by Korey Toomer.","(2:41) Jameis Winston pass to the middle to Cameron Brate for 18 yards to the SD30. Tackled by Jahleel Addae.","(3:21) Peyton Barber rush up the middle for 2 yards to the SD48. Tackled by Kyle Emanuel.","(4:08) Jameis Winston pass to the right to Freddie Martino for 17 yards to the TB50. Tackled by Trevor Williams.","(4:34) Penalty: Illegal Use of Hands on Tampa Bay (Demar Dotson) -10 yards.","(5:15) Doug Martin rush to the right for 7 yards to the TB43. Tackled by Adrian Phillips.","(5:22) Jameis Winston incomplete pass to the left intended for Alan Cross.","(5:46) Penalty: Delay of Game on Tampa Bay (Jameis Winston) -5 yards.","(6:21) Jameis Winston pass to the middle to Adam Humphries for 7 yards to the TB41. Tackled by Adrian Phillips.","(7:15) Jameis Winston pass to the left to Cameron Brate for 6 yards to the TB34. Tackled by Denzel Perryman.","(7:54) Doug Martin rush up the middle for no gain to the TB28. Tackled by Korey Toomer and Jahleel Addae.","(7:55) Drew Kaser punts for 40 yards to TB21. Adam Humphries return for 7 yards to TB28. Tackled by Tourek Williams.","(8:12) Philip Rivers incomplete pass to the right intended for Travis Benjamin defensed by Brent Grimes.","(8:56) Philip Rivers pass to the left to Travis Benjamin for 18 yards to the SD39. Tackled by Vernon Hargreaves III.","(9:01) Philip Rivers incomplete pass to the left. Penalty: Intentional Grounding on San Diego (Philip Rivers) -11 yards.","(9:14) Bryan Anger punts for 54 yards to SD20. Isaiah Burse return for 12 yards to SD32. Tackled by Peyton Barber.","(9:19) Jameis Winston incomplete pass to the left intended for Cameron Brate defensed by Dwight Lowery.","(9:59) Doug Martin rush to the right for 1 yard to the TB26. Tackled by Denzel Perryman.","(10:04) Jameis Winston incomplete pass to the middle intended for Brandon Myers.","(10:04) Josh Lambo kicks off to the endzone. Touchback.","(10:04) Josh Lambo extra point is good.","(10:08) Melvin Gordon rush up the middle for 2 yards for a TOUCHDOWN.","(10:42) Philip Rivers rush to the right for 3 yards to the TB2. Tackled by Vernon Hargreaves III.","(11:22) Philip Rivers pass to the left to Hunter Henry for 14 yards to the TB5. Tackled by Kwon Alexander.","(12:01) Philip Rivers pass to the left to Dontrelle Inman for 14 yards to the TB19. Tackled by Alterraun Verner.","(12:06) Philip Rivers incomplete pass to the middle intended for Dontrelle Inman.","(12:54) Derek Watt rush up the middle for 2 yards to the TB33. Tackled by William Gholston and Kwon Alexander.","(13:36) Kenneth Farrow rush up the middle for 2 yards to the TB35. Tackled by Vernon Hargreaves III.","(14:11) Melvin Gordon rush to the right for 7 yards to the TB37. Tackled by William Gholston and Bradley McDougald.","(15:00) Philip Rivers pass to the right to Melvin Gordon for 17 yards to the TB44. Tackled by Bradley McDougald and Lavonte David.","(0:33) Melvin Gordon rush to the left for 3 yards to the SD39. Tackled by William Gholston.","(1:08) Philip Rivers pass to the right to Melvin Gordon for 11 yards to the SD36. Tackled by Kwon Alexander.","(1:08) Roberto Aguayo kicks off to the endzone. Touchback.","(1:08) Roberto Aguayo extra point is good.","(1:15) Doug Martin rush to the left for 2 yards for a TOUCHDOWN.","(1:53) Doug Martin rush to the right for 1 yard to the SD2. Tackled by Denzel Perryman.","(2:25) Jameis Winston pass to the right to Adam Humphries for 12 yards to the SD3. Tackled by Jahleel Addae and Adrian Phillips.","(3:08) Doug Martin rush up the middle for a loss of 2 yards to the SD15. Tackled by Corey Liuget.","(3:45) Jameis Winston pass to the left to Mike Evans for 22 yards to the SD13. Tackled by Jahleel Addae.","(4:25) Doug Martin rush to the left for 4 yards to the SD35. Tackled by Korey Toomer and Melvin Ingram.","(4:50) Penalty: Holding on Tampa Bay (Joe Hawley) -10 yards.","(5:18) Doug Martin rush up the middle for 15 yards to the SD29. Tackled by Jahleel Addae.","(5:34) Jameis Winston pass to the left to Mike Evans for 12 yards to the SD44. Tackled by Korey Toomer.","(5:40) 53 yard field goal attempt by Josh Lambo is NO GOOD. Holder: Kellen Clemens.","(6:23) Philip Rivers sacked at TB36 for a loss of 7 yards by Gerald McCoy and Robert Ayers Jr..","(7:09) Philip Rivers pass to the right to Melvin Gordon for 9 yards to the TB29. Tackled by Kwon Alexander and Brent Grimes.","(7:49) Philip Rivers pass to the right to Travis Benjamin for 6 yards to the TB38. Tackled by Vernon Hargreaves III.","(8:21) Penalty: Holding on San Diego (Orlando Franklin) -10 yards.","(8:59) Melvin Gordon rush to the right for 17 yards to the TB34. Tackled by Keith Tandy.","(9:05) Jameis Winston pass intended for Mike Evans INTERCEPTED by Casey Hayward and returned for 2 yards. Tackled by Mike Evans.","(9:48) Doug Martin rush to the right for 3 yards to the TB43. Tackled by Kyle Emanuel.","(10:15) Jameis Winston pass to the middle to Cecil Shorts III for 14 yards to the TB40. Tackled by Jahleel Addae.","(10:22) Jameis Winston incomplete pass to the middle intended for Cecil Shorts III.","(10:53) Doug Martin rush up the middle for 1 yard to the TB26. Tackled by Denzel Perryman.","(10:53) Josh Lambo kicks off to the endzone. Touchback.","(10:53) Josh Lambo extra point is good.","(11:03) Philip Rivers pass to the left to Dontrelle Inman for 35 yards for a TOUCHDOWN.","(11:35) Kenneth Farrow rush to the right for 1 yard to the TB35. Tackled by Akeem Spence.","(12:09) Kenneth Farrow rush to the right for 4 yards to the TB36. Tackled by Clinton McDonald.","(12:41) Kenneth Farrow rush up the middle for 8 yards to the TB40. Tackled by Keith Tandy and William Gholston.","(13:20) Philip Rivers pass to the right to Melvin Gordon for 17 yards to the TB48. Tackled by Alterraun Verner.","(13:56) Melvin Gordon rush up the middle for a loss of 1 yard to the SD35. Tackled by Kwon Alexander.","(14:34) Melvin Gordon rush up the middle for 5 yards to the SD36. Tackled by Keith Tandy and Vernon Hargreaves III.","(15:00) Philip Rivers pass to the middle to Antonio Gates for 6 yards to the SD31. Tackled by Bradley McDougald.","(15:00) Roberto Aguayo kicks off to the endzone. Touchback."]