["(0:02) Drew Brees pass intended for Coby Fleener INTERCEPTED by Miles Killebrew and returned for 7 yards. Tackled by Travaris Cadet.","(0:02) Penalty: Delay of Game on New Orleans (Drew Brees) -5 yards.","(0:03) Drew Brees incomplete pass to the middle.","(0:18) Drew Brees pass to the right to Coby Fleener for 7 yards to the Det9. Tackled by Miles Killebrew.","(0:37) Drew Brees pass to the middle to Michael Thomas for 10 yards to the Det16. Tackled by Josh Bynes.","(0:37) New Orleans Saints timeout.","(0:44) Drew Brees pass to the left to Travaris Cadet for 18 yards to the Det26. Tackled by Tyrunn Walker.","(1:08) Drew Brees pass to the left to Travaris Cadet for 11 yards to the Det44. Tackled by Josh Bynes and Rafael Bush.","(1:30) Drew Brees pass to the right to Brandin Cooks for 7 yards to the NO45. Tackled by Nevin Lawson.","(1:36) Drew Brees pass to the right to Brandin Cooks for 3 yards to the NO38. Tackled by Nevin Lawson.","(1:41) Penalty: Holding on New Orleans (Jahri Evans) -10 yards.","(2:00) Drew Brees pass to the middle to Coby Fleener for 23 yards to the NO45. Tackled by Miles Killebrew.","(2:00) Two Minute Warning.","(2:17) Drew Brees pass to the middle to Travaris Cadet for 4 yards to the NO22. Tackled by Adairius Barnes.","(2:42) Drew Brees pass to the right to Brandin Cooks for 7 yards to the NO18. Tackled by Nevin Lawson.","(2:48) Sam Martin punts for 32 yards to NO11. No return.","(2:48) Penalty: Delay of Game on Detroit (Matthew Stafford) -4 yards.","(2:48) New Orleans Saints timeout.","(3:07) Matthew Stafford pass to the right to Golden Tate for 9 yards to the NO39. Tackled by Sterling Moore.","(3:51) Zach Zenner rush to the right for a loss of 1 yard to the NO48. Tackled by Stephone Anthony.","(4:35) Zach Zenner rush to the right for 1 yard to the NO47. Tackled by Kenny Vaccaro.","(4:41) Zach Zenner rush to the left for 2 yards to the Det47. Tackled by David Onyemata. Penalty: Illegal Use of Hands on New Orleans (Paul Kruger) 5 yards.","(5:23) Zach Zenner rush to the right for 1 yard to the Det45. Tackled by Darryl Tapp.","(5:26) Drew Brees pass intended for Willie Snead INTERCEPTED by Tavon Wilson and returned for 18 yards. Tackled by Michael Thomas.","(5:58) Drew Brees pass to the left to Coby Fleener for 12 yards to the Det43. Tackled by Darius Slay.","(6:17) Drew Brees pass to the right to Willie Snead for 24 yards to the NO45. Tackled by Tavon Wilson.","(6:39) Drew Brees pass to the left to Travaris Cadet for 3 yards to the NO21. Tackled by A'Shawn Robinson.","(7:10) Drew Brees sacked at NO18 for a loss of 7 yards by Devin Taylor.","(7:10) Sam Martin kicks off to the endzone. Touchback.","(7:15) Matt Prater 52 yard field goal attempt is GOOD. Holder: Sam Martin.","(7:22) Matthew Stafford incomplete pass to the right intended for Eric Ebron.","(8:10) Matthew Stafford rush to the right for 2 yards to the NO33. Tackled by Cameron Jordan.","(8:31) Penalty: False Start on Detroit (Eric Ebron) -5 yards.","(8:52) Zach Zenner rush to the left for 9 yards to the NO30. Tackled by Vonn Bell.","(9:38) Zach Zenner rush to the right for 9 yards to the NO39. Tackled by Sterling Moore.","(10:16) Zach Zenner rush to the right for 6 yards to the NO48. Tackled by Cameron Jordan.","(10:21) Thomas Morstead punts for 19 yards to Det46. No return.","(10:26) Drew Brees incomplete pass to the right intended for Michael Thomas defensed by Darius Slay.","(10:30) Drew Brees incomplete pass to the middle intended for Willie Snead defensed by Haloti Ngata.","(10:34) Drew Brees incomplete pass to the right intended for Willie Snead defensed by Josh Bynes.","(11:08) Drew Brees pass to the right to Mark Ingram for 8 yards to the NO35. Tackled by Kerry Hyder.","(11:38) Mark Ingram rush to the right for 2 yards to the NO27. Tackled by Ezekiel Ansah.","(11:38) Sam Martin kicks off to the endzone. Touchback.","(11:38) Matthew Stafford 2 pt conversion pass is NO GOOD - intended for TJ Jones.","(11:50) Matthew Stafford pass to the right to Golden Tate for 66 yards for a TOUCHDOWN.","(11:55) Matthew Stafford incomplete pass to the left defensed by Cameron Jordan.","(12:00) Matthew Stafford incomplete pass to the right intended for Golden Tate.","(12:46) Matthew Stafford pass to the left to Theo Riddick for 6 yards to the Det34. Tackled by Delvin Breaux and Vonn Bell.","(13:25) Theo Riddick rush to the left for 6 yards to the Det28. Tackled by Craig Robertson.","(13:32) Wil Lutz kicks off to the Det1. Andre Roberts return for 21 yards to Det22. Tackled by Roman Harper.","(13:32) Wil Lutz extra point is good. Penalty: Offside on Detroit (Darius Slay) 5 yards.","(13:40) John Kuhn rush to the left for 1 yard for a TOUCHDOWN.","(14:18) New Orleans Saints timeout.","(14:18) Drew Brees pass to the right to Brandin Cooks for 8 yards to the Det1. Tackled by Glover Quin.","(15:00) Drew Brees pass to the right to Brandin Cooks for 5 yards to the Det9. Tackled by Nevin Lawson.","(0:17) Mark Ingram rush to the right for no gain to the Det14. Tackled by Tavon Wilson.","(0:32) Drew Brees pass to the left to Michael Thomas for 14 yards to the Det14. Tackled by Darius Slay.","(1:06) Drew Brees pass to the middle to Michael Thomas for 16 yards to the Det28. Tackled by Tavon Wilson.","(1:42) Drew Brees pass to the right to Coby Fleener for 31 yards to the Det44. Tackled by Antwione Williams.","(1:42) Sam Martin kicks off to the endzone. Touchback.","(1:46) Matt Prater 27 yard field goal attempt is GOOD. Holder: Sam Martin.","(2:26) Matthew Stafford pass to the left to Andre Roberts for 1 yard to the NO9. Tackled by Jairus Byrd.","(2:29) Matthew Stafford incomplete pass to the right intended for Anquan Boldin defensed by Jairus Byrd.","(2:33) Matthew Stafford incomplete pass to the left intended for Andre Roberts.","(3:17) Matthew Stafford pass to the middle to Anquan Boldin for 11 yards to the NO10. Tackled by Kenny Vaccaro.","(3:22) Matthew Stafford incomplete pass to the left intended for Andre Roberts.","(4:04) Zach Zenner rush to the right for 5 yards to the NO21. Tackled by Cameron Jordan.","(4:44) Matthew Stafford rush to the left for 11 yards to the NO26. Tackled by David Onyemata.","(5:27) Matthew Stafford pass to the left to Anquan Boldin for 9 yards to the NO37. Tackled by Sterling Moore.","(5:36) Matthew Stafford incomplete pass to the right intended for Andre Roberts defensed by Sterling Moore.","(6:15) Zach Zenner rush to the left for 8 yards to the NO46. Tackled by Sheldon Rankins.","(6:15) Drew Brees pass intended for Brandin Cooks INTERCEPTED by Glover Quin. No return.","(6:41) Penalty: Delay of Game on New Orleans (Mark Ingram) -5 yards.","(6:41) Drew Brees pass to the left to Mark Ingram for a loss of 4 yards to the NO40. Tackled by Josh Bynes.","(7:15) Mark Ingram rush to the right for 4 yards to the NO44. Tackled by Thurston Armbrister.","(7:51) Drew Brees pass to the right to John Kuhn for 11 yards to the NO40. Tackled by Adairius Barnes and Josh Bynes.","(8:03) Drew Brees incomplete pass to the right intended for Brandin Cooks defensed by Glover Quin.","(8:29) Drew Brees pass to the middle to Willie Snead for 14 yards to the NO29. Tackled by Quandre Diggs.","(8:57) Penalty: Holding on New Orleans (Senio Kelemete) -10 yards.","(8:57) Sam Martin kicks off to the endzone. Touchback.","(9:00) Matt Prater 32 yard field goal attempt is GOOD. Holder: Sam Martin.","(9:04) Matthew Stafford incomplete pass to the right intended for Anquan Boldin.","(9:47) Matthew Stafford pass to the right to Theo Riddick for no gain to the NO14. Tackled by Dannell Ellerbe.","(10:32) Matthew Stafford pass to the right to Golden Tate for 5 yards to the NO14. Tackled by Jairus Byrd and Sterling Moore.","(11:21) Matthew Stafford pass to the left to TJ Jones for 36 yards to the NO19. Tackled by Vonn Bell and Delvin Breaux.","(12:07) Matthew Stafford sacked at Det45 for a loss of 3 yards by Sheldon Rankins.","(12:53) Theo Riddick rush to the left for a loss of 3 yards to the Det48. Tackled by Delvin Breaux.","(13:00) Penalty: Holding on New Orleans (Delvin Breaux) 5 yards.","(13:39) Dwayne Washington rush to the right for no gain to the Det46. Tackled by Cameron Jordan.","(14:23) Matthew Stafford pass to the left to Golden Tate for 15 yards to the Det46. Tackled by Vonn Bell.","(14:54) Matthew Stafford pass to the right to Anquan Boldin for 8 yards to the Det31. Tackled by Sterling Moore.","(15:00) Wil Lutz kicks off to the Det-5. Andre Roberts return for 28 yards to Det23. Tackled by Chris Banjo.","(0:05) Wil Lutz 32 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(0:09) Drew Brees incomplete pass to the middle intended for Coby Fleener.","(0:15) Drew Brees pass to the right to Travaris Cadet for 17 yards to the Det14. Tackled by Darius Slay.","(0:15) New Orleans Saints timeout.","(0:21) Drew Brees pass to the right to Brandin Cooks for 39 yards to the Det31. Tackled by Rafael Bush.","(0:42) Drew Brees pass to the right to Brandin Cooks for 4 yards to the NO30. Tackled by Nevin Lawson.","(0:45) Drew Brees incomplete pass to the left intended for Travaris Cadet.","(0:49) Penalty: Roughing Passer on Detroit (Kerry Hyder) 15 yards.","(0:56) Sam Martin kicks off to the NO2. Tommylee Lewis return for 9 yards to NO11. Tackled by Adairius Barnes.","(0:59) Matt Prater 29 yard field goal attempt is GOOD. Holder: Sam Martin.","(1:02) Matthew Stafford incomplete pass to the left intended for Theo Riddick.","(1:06) Matthew Stafford incomplete pass to the left intended for Golden Tate.","(1:12) Matthew Stafford pass to the right to Eric Ebron for 3 yards to the NO11. Tackled by Kenny Vaccaro.","(1:46) Matthew Stafford pass to the right to Eric Ebron for 12 yards to the NO14. Tackled by Kenny Vaccaro.","(1:46) New Orleans Saints timeout.","(1:54) Matthew Stafford pass to the right to Eric Ebron for 11 yards to the NO26. Tackled by Jairus Byrd.","(1:59) Matthew Stafford incomplete pass to the middle intended for Eric Ebron.","(1:59) Two Minute Warning.","(2:05) Matthew Stafford pass to the left to Andre Roberts for 10 yards to the NO37. Tackled by Delvin Breaux.","(2:46) Dwayne Washington rush to the left for 4 yards to the NO47. Tackled by Jairus Byrd.","(3:29) Matthew Stafford pass to the left to Golden Tate for 9 yards to the Det49. Tackled by Jairus Byrd.","(3:34) Penalty: Pass Interference on New Orleans (Delvin Breaux) 8 yards.","(4:18) Matthew Stafford pass to the left to TJ Jones for 8 yards to the Det32. Tackled by Delvin Breaux.","(5:05) Matthew Stafford sacked at Det24 for a loss of 1 yard by Dannell Ellerbe.","(5:05) Wil Lutz kicks off to the endzone. Touchback.","(5:11) Wil Lutz 40 yard field goal attempt is GOOD. Holder: Thomas Morstead.","(5:49) Drew Brees pass to the right to Michael Thomas for 2 yards to the Det22. Tackled by Kerry Hyder and Ezekiel Ansah.","(6:24) Drew Brees pass to the left to Mark Ingram for 3 yards to the Det24. Tackled by Josh Bynes.","(7:05) Drew Brees pass to the middle to Tim Hightower for 4 yards to the Det27. Tackled by Josh Bynes.","(7:28) Penalty: Holding on New Orleans (Senio Kelemete) -10 yards.","(8:08) Mark Ingram rush to the right for 22 yards to the Det21. Tackled by Glover Quin.","(8:50) Mark Ingram rush to the left for no gain to the Det43. Tackled by Tyrunn Walker.","(8:50) Penalty: Offside on Detroit (Devin Taylor) 5 yards.","(9:02) Sam Martin punts for 53 yards to NO28. Tommylee Lewis return for 24 yards to Det48. Tackled by Tavon Wilson.","(9:34) Matthew Stafford pass to the right to Theo Riddick for 7 yards to the Det19. Tackled by Kenny Vaccaro.","(10:18) Matthew Stafford pass to the right to Golden Tate for a loss of 3 yards to the Det12. Tackled by Kenny Vaccaro.","(10:42) Dwayne Washington rush to the left for 2 yards to the Det15. Tackled by Jairus Byrd.","(10:54) Thomas Morstead punts for 47 yards to Det13. No return.","(11:10) Drew Brees pass to the left to Josh Hill for 3 yards to the NO40. Tackled by Kerry Hyder and Josh Bynes.","(11:14) Drew Brees incomplete pass to the left intended for Josh Hill defensed by A'Shawn Robinson.","(11:19) Drew Brees incomplete pass to the left intended for Willie Snead.","(11:54) John Kuhn rush to the left for 3 yards to the NO37. Tackled by A'Shawn Robinson.","(12:32) Tim Hightower rush to the left for 5 yards to the NO34. Tackled by Nevin Lawson.","(13:03) Brandin Cooks rush to the left for 4 yards to the NO29. Tackled by Antwione Williams.","(13:03) Sam Martin kicks off to the endzone. Touchback.","(13:03) Matt Prater extra point is good.","(13:05) Matthew Stafford pass to the left to Theo Riddick for 1 yard for a TOUCHDOWN.","(13:52) Matthew Stafford pass to the left to Anquan Boldin for 12 yards to the NO1. Tackled by Jairus Byrd.","(14:20) Matthew Stafford pass to the left to Golden Tate for 35 yards to the NO13. Tackled by Delvin Breaux.","(15:00) Matthew Stafford pass to the left to Andre Roberts for 8 yards to the NO48. Tackled by Delvin Breaux.","(0:47) Dwayne Washington rush to the right for 5 yards to the Det44. Tackled by Craig Robertson.","(1:26) Matthew Stafford pass to the right to TJ Jones for 5 yards to the Det39. Tackled by Sterling Moore and Vonn Bell.","(2:15) Matthew Stafford pass to the left to Eric Ebron for 12 yards to the Det34. Tackled by Vonn Bell.","(2:39) Penalty: False Start on Detroit (Graham Glasgow) -5 yards.","(3:26) Matthew Stafford pass to the left to Theo Riddick for 1 yard to the Det27. Tackled by Craig Robertson.","(4:11) Dwayne Washington rush to the left for 3 yards to the Det26. Tackled by Dannell Ellerbe.","(4:50) Matthew Stafford pass to the left to Dwayne Washington for 11 yards to the Det23. Tackled by Dannell Ellerbe.","(5:28) Dwayne Washington rush to the left for 4 yards to the Det12. Tackled by Sheldon Rankins.","(5:37) Thomas Morstead punts for 50 yards to Det8. No return.","(5:45) Penalty: Delay of Game on New Orleans (Drew Brees) -5 yards.","(6:49) Tim Hightower rush to the left for no gain to the NO47. Tackled by Haloti Ngata and Brandon Copeland.","(7:22) Mark Ingram rush to the right for 2 yards to the NO47. Tackled by Khyri Thornton.","(7:53) Mark Ingram rush to the right for 7 yards to the NO45. Tackled by Josh Bynes.","(8:14) Drew Brees pass to the right to Coby Fleener for 13 yards to the NO38. Tackled by Glover Quin.","(8:14) Sam Martin kicks off to the endzone. Touchback.","(8:18) Matt Prater 27 yard field goal attempt is GOOD. Holder: Sam Martin.","(8:57) Theo Riddick rush to the left for a loss of 3 yards to the NO9. Tackled by Craig Robertson.","(9:47) Matthew Stafford rush to the right for 9 yards to the NO6. Tackled by Jairus Byrd and Nick Fairley.","(9:52) Matthew Stafford incomplete pass to the right intended for TJ Jones defensed by Sterling Moore.","(10:36) Matthew Stafford pass to the right to Andre Roberts for 16 yards to the NO15. Tackled by Jairus Byrd.","(11:21) Matthew Stafford pass to the right to Dwayne Washington for 8 yards to the NO31. Tackled by Sterling Moore.","(12:00) Dwayne Washington rush to the left for 3 yards to the NO39. Tackled by Delvin Breaux.","(12:42) Theo Riddick rush to the right for 2 yards to the NO42. Tackled by Paul Kruger.","(13:23) Matthew Stafford pass to the middle to Golden Tate for 9 yards to the NO44. Tackled by Dannell Ellerbe.","(13:30) Thomas Morstead punts for 46 yards to Det47. No return.","(13:36)  FUMBLE, recovered by NO (Drew Brees). Drew Brees incomplete pass to the right. Penalty: Intentional Grounding on New Orleans (Drew Brees) -20 yards.","(14:17) Drew Brees pass to the left to Mark Ingram for 6 yards to the NO27. Tackled by Glover Quin.","(14:56) Drew Brees pass to the right to Mark Ingram for 3 yards to the NO21. Tackled by Glover Quin and Nevin Lawson.","(15:00) Sam Martin kicks off to the NO1. Tommylee Lewis return for 17 yards to NO18. Tackled by Miles Killebrew."]