["(0:39) Matt Barkley rush up the middle for a loss of 1 yard to the Chi32.","(1:08) Matt Barkley rush up the middle for a loss of 1 yard to the Chi33.","(1:54) Jordan Howard rush to the left for 1 yard to the Chi34. Tackled by Nick Bellore.","(1:55) Bradley Pinion kicks off to the Chi33. Bryce Callahan - no return. Tackled by Marcus Ball.","(2:00) Blaine Gabbert sacked at SF0 for a loss of 8 yards by Leonard Floyd. Safety.","(2:00) Two Minute Warning.","(2:12) Blaine Gabbert pass to the left to Vance McDonald for 5 yards to the SF8. Tackled by Cre'von LeBlanc.","(2:21) Patrick O'Donnell punts for 36 yards to SF3. No return.","(2:21) San Francisco 49ers timeout.","(2:27) Jordan Howard rush to the right for 4 yards to the SF39. Tackled by DeForest Buckner.","(3:14) Jordan Howard rush to the left for 2 yards to the SF43. Tackled by Antoine Bethea.","(3:55) Jordan Howard rush to the left for a loss of 2 yards to the SF45. Tackled by Glenn Dorsey.","(4:00) Matt Barkley pass to the right to Daniel Brown for 6 yards to the SF43. Tackled by Jaquiski Tartt.","(4:47) Jordan Howard rush to the right for 4 yards to the SF49. Tackled by Glenn Dorsey.","(5:31) Jordan Howard rush to the left for 1 yard to the Chi47. Tackled by Jimmie Ward.","(5:39) Bradley Pinion punts for 41 yards to Chi46. No return.","(5:44) Blaine Gabbert incomplete pass to the right intended for Torrey Smith.","(5:48) Blaine Gabbert incomplete pass to the right intended for Shaun Draughn defensed by Nick Kwiatkoski.","(6:24) Blaine Gabbert rush to the right for 1 yard to the SF13. Tackled by Tracy Porter.","(6:52) Penalty: Holding on San Francisco (Daniel Kilgore) -10 yards.","(7:22) Blaine Gabbert pass to the right to Chris Harper for 6 yards to the SF22. Tackled by Nick Kwiatkoski.","(7:30) Blaine Gabbert incomplete pass to the left intended for Chris Harper defensed by Nick Kwiatkoski.","(8:05) Blaine Gabbert pass to the right to Carlos Hyde for 6 yards to the SF16. Tackled by Harold Jones-Quartey.","(8:14) Patrick O'Donnell punts for 52 yards to SF0. Touchback. Penalty: Holding on San Francisco (Rashard Robinson) -10 yards.","(9:01) Jordan Howard rush to the left for a loss of 1 yard to the Chi48. Tackled by Nick Bellore and Chris Jones.","(9:45) Jordan Howard rush to the right for 4 yards to the Chi49. Tackled by Glenn Dorsey.","(10:29) Jordan Howard rush to the right for 4 yards to the Chi45. Tackled by Ahmad Brooks.","(11:16) Jordan Howard rush to the right for 2 yards to the Chi41. Tackled by Quinton Dial.","(11:54) Jordan Howard rush to the right for 8 yards to the Chi39. Tackled by Antoine Bethea.","(12:03) Bradley Pinion punts for 38 yards to Chi28. Bryce Callahan return for 3 yards to Chi31. Tackled by Kyle Nelson.","(12:07) Blaine Gabbert incomplete pass to the right intended for Vance McDonald.","(12:11) Blaine Gabbert incomplete pass to the left intended for Torrey Smith.","(12:17) Blaine Gabbert incomplete pass to the left intended for Carlos Hyde.","(12:51) Blaine Gabbert pass to the right to Jeremy Kerley for 18 yards to the SF34. Tackled by Nick Kwiatkoski.","(12:55) Connor Barth kicks off to the SF0. JaCorey Shepherd return for 16 yards to SF16. Tackled by Sherrick McManis.","(13:01) Connor Barth 45 yard field goal attempt is GOOD. Holder: Patrick O'Donnell.","(13:46) Matt Barkley sacked at SF27 for a loss of 8 yards by Ahmad Brooks.","(13:51) Matt Barkley incomplete pass to the right intended for Cameron Meredith.","(14:12) Jordan Howard rush to the right for 2 yards to the SF19. Tackled by Nick Bellore.","(15:00) Joshua Bellamy rush to the left for 12 yards to the SF21. Tackled by Jaquiski Tartt.","(0:35) Jordan Howard rush to the left for 25 yards to the SF33. Tackled by Gerald Hodges Jr..","(0:54) Matt Barkley pass to the middle to Joshua Bellamy for 16 yards to the Chi42. Tackled by Nick Bellore.","(1:14) Bradley Pinion punts for 43 yards to Chi36. No return. Penalty: Pass Interference on Chicago (Deonte Thompson) -10 yards.","(1:27) Colin Kaepernick incomplete pass to the right intended for Vance McDonald.","(2:10) Carlos Hyde rush to the left for 6 yards to the SF21. Tackled by Harold Jones-Quartey.","(2:55) Colin Kaepernick sacked at SF15 for no gain by Akiem Hicks. FUMBLE, recovered by SF (Joshua Garnett).","(3:03) Patrick O'Donnell punts for 46 yards to SF15. No return.","(3:09) Matt Barkley incomplete pass to the middle intended for Joshua Bellamy.","(3:48) Jordan Howard rush to the left for no gain to the Chi39. Tackled by Nick Bellore.","(4:22) Jordan Howard rush to the left for 4 yards to the Chi39. Tackled by Nick Bellore.","(4:29) Bradley Pinion punts for 44 yards to Chi35. No return.","(5:08) Colin Kaepernick sacked at SF21 for a loss of 7 yards by Akiem Hicks.","(5:50) Colin Kaepernick sacked at SF28 for no gain by Leonard Floyd.","(6:19) Carlos Hyde rush to the right for 8 yards to the SF28. Tackled by Cornelius Washington.","(6:19) Penalty: False Start on San Francisco (Zane Beadles) -5 yards.","(6:19) Connor Barth kicks off to the endzone. Touchback.","(6:19) Connor Barth extra point is good.","(6:25) Jordan Howard rush to the left for 5 yards for a TOUCHDOWN.","(7:18) Matt Barkley pass to the right to Joshua Bellamy for 31 yards to the SF5. Tackled by Jimmie Ward.","(7:52) Jordan Howard rush to the right for 1 yard to the SF36. Tackled by Gerald Hodges Jr..","(8:32) Matt Barkley pass to the left to Joshua Bellamy for 22 yards to the SF37. Tackled by Tramaine Brock.","(8:39) Bradley Pinion punts for 40 yards to Chi36. No return. Penalty: Illegal Shift on San Francisco (Aaron Burbridge) 5 yards.","(8:46) Colin Kaepernick incomplete pass to the left intended for Shaun Draughn defensed by John Timu.","(8:51) Colin Kaepernick incomplete pass to the left intended for Jeremy Kerley.","(9:26) Carlos Hyde rush to the right for 4 yards to the SF24. Tackled by Akiem Hicks and Mitch Unrein.","(9:32) Connor Barth kicks off to the SF3. JaCorey Shepherd return for 17 yards to SF20. Tackled by Ben Braunecker.","(9:32) Connor Barth extra point is good.","(9:36) Jordan Howard rush to the left for 2 yards for a TOUCHDOWN.","(10:14) Matt Barkley pass to the left to Daniel Brown for 7 yards to the SF2. Tackled by Antoine Bethea.","(10:50) Jeremy Langford rush to the left for 2 yards to the SF9. Tackled by Gerald Hodges Jr..","(11:32) Matt Barkley pass to the left to Joshua Bellamy for 24 yards to the SF11. Tackled by Rashard Robinson.","(12:15) Jordan Howard rush to the left for 3 yards to the SF35. Tackled by Nick Bellore.","(12:20) Matt Barkley incomplete pass to the left intended for Jordan Howard.","(13:00) Matt Barkley pass to the left to Cameron Meredith for 22 yards to the SF38. Tackled by Jaquiski Tartt.","(13:39) Jordan Howard rush to the right for no gain to the Chi40. Tackled by DeForest Buckner.","(14:16) Jordan Howard rush to the left for 4 yards to the Chi40. Tackled by DeForest Buckner.","(14:24) Jordan Howard rush to the left for 6 yards to the Chi31. Tackled by Nick Bellore. Penalty: Holding on San Francisco (Tramaine Brock) 5 yards.","(15:00) Phil Dawson kicks off to the endzone. Touchback.","(0:31) Colin Kaepernick rush up the middle for a loss of 1 yard to the SF24.","(0:31) Connor Barth kicks off to the endzone. Touchback.","(0:31) Connor Barth extra point is good.","(0:35) Jordan Howard rush to the left for 1 yard for a TOUCHDOWN.","(0:39) Chicago Bears timeout. Penalty: Pass Interference on San Francisco (Tramaine Brock) 11 yards.","(0:47) Matt Barkley pass to the right to Cameron Meredith for 17 yards to the SF12. Tackled by Jimmie Ward.","(0:51) Matt Barkley incomplete pass to the right intended for Deonte Thompson.","(1:16) Matt Barkley pass to the right to Cameron Meredith for 28 yards to the SF29. Tackled by Antoine Bethea.","(1:21) Matt Barkley pass to the left to Deonte Thompson for 11 yards to the Chi43. Tackled by Tramaine Brock.","(1:43) Matt Barkley pass to the left to Deonte Thompson for 8 yards to the Chi32. Tackled by Tramaine Brock.","(1:43) San Francisco 49ers timeout.","(1:48) Jordan Howard rush to the right for 4 yards to the Chi24. Tackled by Michael Wilhoite.","(1:48) San Francisco 49ers timeout.","(1:52) Jordan Howard rush to the right for 1 yard to the Chi20. Tackled by Nick Bellore.","(1:56) Phil Dawson kicks off to the Chi14. Paul Lasike return for 5 yards to Chi19. Tackled by Aaron Burbridge.","(2:00) Phil Dawson 28 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(2:00) Two Minute Warning.","(2:45) Carlos Hyde rush to the left for 5 yards to the Chi10. Tackled by Harold Jones-Quartey and John Timu.","(3:26) Colin Kaepernick rush to the right for a loss of 3 yards to the Chi15. Tackled by Harold Jones-Quartey.","(4:11) DuJuan Harris rush to the left for a loss of 1 yard to the Chi12. Tackled by Nick Kwiatkoski.","(4:52) DuJuan Harris rush to the left for 9 yards to the Chi11. Tackled by Harold Jones-Quartey.","(5:25) Shaun Draughn rush to the right for 3 yards to the Chi20. Tackled by Nick Kwiatkoski.","(6:01) Carlos Hyde rush to the left for 6 yards to the Chi23. Tackled by Cre'von LeBlanc.","(6:11) Colin Kaepernick rush to the left for 2 yards to the Chi29. Tackled by Harold Jones-Quartey.","(6:47) Carlos Hyde rush to the left for 6 yards to the Chi31. Tackled by Nick Kwiatkoski.","(6:47) Phil Dawson kicks off to the Chi9. Deonte Thompson return for 28 yards to Chi37. Tackled by Jimmie Ward. FUMBLE, recovered by SF (Jimmie Ward). Tackled by Deonte Thompson.","(6:59) Phil Dawson 31 yard field goal attempt is GOOD. Holder: Bradley Pinion.","(7:41) Colin Kaepernick pass to the right to Vance McDonald for 4 yards to the Chi13. Tackled by Harold Jones-Quartey.","(8:23) Carlos Hyde rush to the left for 3 yards to the Chi17. Tackled by Akiem Hicks.","(9:07) Carlos Hyde rush to the left for a loss of 1 yard to the Chi20. Tackled by Nick Kwiatkoski.","(9:18) Patrick O'Donnell punts for 15 yards to Chi29. Dontae Johnson return for 25 yards to Chi4. Tackled by Ben Braunecker. Penalty: Unsports. Conduct on San Francisco (Rashard Robinson) -15 yards.","(9:18) Penalty: Delay of Game on Chicago (Patrick O'Donnell) -5 yards.","(9:23) Matt Barkley incomplete pass to the right intended for Joshua Bellamy.","(10:07) Ka'Deem Carey rush to the left for 4 yards to the Chi19. Tackled by Nick Bellore and Glenn Dorsey.","(10:42) Ka'Deem Carey rush to the left for 4 yards to the Chi15. Tackled by DeForest Buckner.","(11:11) Penalty: Illegal Plyr Downfld on Chicago (Charles Leno Jr.) -5 yards.","(11:47) Jordan Howard rush to the left for 3 yards to the Chi16. Tackled by Chris Jones.","(12:32) Jordan Howard rush to the right for 4 yards to the Chi13. Tackled by Glenn Dorsey.","(13:11) Jordan Howard rush to the right for 4 yards to the Chi9. Tackled by Gerald Hodges Jr..","(13:18) Bradley Pinion punts for 26 yards to Chi5. No return.","(13:53) Carlos Hyde rush to the right for 7 yards to the Chi31. Tackled by Cornelius Washington.","(13:53) Chicago Bears timeout.","(14:30) Carlos Hyde rush to the left for 5 yards to the Chi38. Tackled by Nick Kwiatkoski.","(15:00) Penalty: Holding on San Francisco (Joshua Garnett) -10 yards.","(0:30) Carlos Hyde rush to the right for a loss of 1 yard to the Chi33. Tackled by Akiem Hicks.","(1:08) Shaun Draughn rush to the right for 5 yards to the Chi32. Tackled by Akiem Hicks and Harold Jones-Quartey.","(1:40) Colin Kaepernick rush to the left for 6 yards to the Chi37. Tackled by Harold Jones-Quartey.","(2:15) Shaun Draughn rush to the right for 2 yards to the Chi43. Tackled by Akiem Hicks.","(2:54) Carlos Hyde rush to the left for 1 yard to the Chi45. Tackled by John Timu.","(3:21) Carlos Hyde rush to the left for 8 yards to the Chi46. Tackled by Akiem Hicks.","(3:41) Colin Kaepernick rush to the right for 14 yards to the SF46. Tackled by Tracy Porter.","(4:24) Shaun Draughn rush to the right for 1 yard to the SF32. Tackled by Leonard Floyd.","(4:51) Carlos Hyde rush to the right for 4 yards to the SF31. Tackled by Nick Kwiatkoski.","(5:22) Carlos Hyde rush to the left for 12 yards to the SF27. Tackled by Leonard Floyd.","(5:52) Carlos Hyde rush to the left for 3 yards to the SF15. Tackled by John Timu.","(6:00) Patrick O'Donnell punts for 40 yards to SF22. No return. Penalty: Holding on San Francisco (Shaun Draughn) -10 yards.","(6:05) Matt Barkley incomplete pass to the left intended for Marquess Wilson.","(6:42) Jordan Howard rush to the left for 3 yards to the Chi38. Tackled by Glenn Dorsey and DeForest Buckner.","(7:22) Jordan Howard rush to the left for a loss of 2 yards to the Chi35. Tackled by Eli Harold.","(7:22) Penalty: False Start on Chicago (Eric Kush) -5 yards.","(7:32) Bradley Pinion punts for 37 yards to Chi42. No return.","(8:00) Colin Kaepernick sacked at SF21 for a loss of 5 yards by Eddie Goldman.","(8:39) Colin Kaepernick rush to the left for 2 yards to the SF26. Tackled by Deon Bush.","(9:10) Carlos Hyde rush to the left for 4 yards to the SF24. Tackled by Nick Kwiatkoski.","(9:19) Patrick O'Donnell punts for 44 yards to SF0. Touchback.","(9:53) Matt Barkley rush to the left for 5 yards to the SF44. Tackled by Michael Wilhoite.","(9:59) Matt Barkley incomplete pass to the left intended for Ka'Deem Carey defensed by Rashard Robinson.","(10:37) Matt Barkley rush up the middle for no gain to the SF46. FUMBLE, recovered by Chi (Jordan Howard).","(11:15) Jordan Howard rush to the right for 17 yards to the SF46. Tackled by Antoine Bethea and Jaquiski Tartt.","(11:51) Jordan Howard rush to the left for 3 yards to the Chi37. Tackled by Nick Bellore.","(11:58) Bradley Pinion punts for 39 yards to Chi19. No return. Penalty: FC Interference on San Francisco 15 yards.","(12:28) Carlos Hyde rush to the right for no gain to the SF42. Tackled by Akiem Hicks.","(13:00) Colin Kaepernick sacked at SF42 for a loss of 13 yards by Willie Young.","(13:36) Shaun Draughn rush to the right for 9 yards to the Chi35. Tackled by Deon Bush. Penalty: Holding on San Francisco (Vance McDonald) -10 yards.","(13:39) Colin Kaepernick incomplete pass to the middle intended for Rod Streater.","(14:12) Carlos Hyde rush to the right for 5 yards to the Chi44. Tackled by Eddie Goldman.","(14:46) Carlos Hyde rush to the left for 7 yards to the Chi49. Tackled by Cre'von LeBlanc.","(14:50) Penalty: Roughing Passer on Chicago (Akiem Hicks) 15 yards.","(15:00) Connor Barth kicks off to the SF5. JaCorey Shepherd return for 24 yards to SF29. Tackled by Chris Prosinski."]