["(0:22) Kirk Cousins rush up the middle for a loss of 1 yard to the NYG43.","(1:02) Kirk Cousins rush up the middle for a loss of 1 yard to the NYG42.","(1:09) Eli Manning pass intended for Shane Vereen INTERCEPTED by Su'a Cravens and returned for 2 yards. Tackled by Shane Vereen.","(1:09) New York Giants timeout.","(1:19) Eli Manning pass to the right to Victor Cruz for 18 yards to the NYG39. Tackled by Quinton Dunbar.","(1:24) Eli Manning incomplete pass to the left intended for Shane Vereen.","(1:30) Penalty: Pass Interference on New York (Odell Beckham Jr.) -10 yards.","(1:51) Eli Manning pass to the right to Larry Donnell for 6 yards to the NYG31. Tackled by David Bruton Jr..","(1:51) Dustin Hopkins kicks off to the endzone. Touchback.","(1:55) Dustin Hopkins 37 yard field goal attempt is GOOD. Holder: Tress Way.","(1:55) New York Giants timeout.","(2:00) Matt Jones rush to the right for a loss of 2 yards to the NYG19. Tackled by Jason Pierre-Paul and Johnathan Hankins.","(2:00) Two Minute Warning.","(2:46) Matt Jones rush up the middle for 2 yards to the NYG17. Tackled by Damon Harrison and Devon Kennard.","(3:32) Matt Jones rush to the right for 5 yards to the NYG19. Tackled by Jonathan Casillas and Kelvin Sheppard.","(4:13) Matt Jones rush to the left for 12 yards to the NYG24. Tackled by Jason Pierre-Paul and Nat Berhe.","(4:52) Kirk Cousins pass to the right to DeSean Jackson for 9 yards to the NYG36. Tackled by Nat Berhe.","(5:31) Matt Jones rush to the left for 10 yards to the NYG45. Tackled by Nat Berhe.","(6:14) Matt Jones rush up the middle for 3 yards to the Was45. Tackled by Damon Harrison and Landon Collins.","(6:48) Matt Jones rush to the left for 6 yards to the Was42. Tackled by Damon Harrison and Kelvin Sheppard.","(6:54) Penalty: Roughing Passer on New York (Olivier Vernon) 15 yards.","(7:10) Penalty: False Start on Washington (Spencer Long) -5 yards.","(7:53) Matt Jones rush to the right for 1 yard to the Was26. Tackled by Johnathan Hankins.","(7:53) Josh Brown kicks off to the endzone. Touchback.","(7:59) Josh Brown 30 yard field goal attempt is GOOD. Holder: Brad Wing.","(8:36) Eli Manning pass to the right to Odell Beckham Jr. for 8 yards to the Was12. Tackled by Josh Norman.","(8:43) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by Josh Norman.","(8:49) Eli Manning incomplete pass to the right intended for Shane Vereen defensed by Su'a Cravens.","(9:19) Eli Manning pass to the right to Shane Vereen for 16 yards to the Was20. Tackled by Quinton Dunbar.","(9:27) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(9:57) Eli Manning pass to the left to Odell Beckham Jr. for 12 yards to the Was36. Tackled by Duke Ihenacho.","(10:26) Eli Manning pass to the middle to Odell Beckham Jr. for 14 yards to the Was48. Tackled by Duke Ihenacho.","(11:00) Eli Manning pass to the middle to Sterling Shepard for 8 yards to the NYG38. Tackled by Duke Ihenacho and Will Compton.","(11:08) Tress Way punts for 35 yards to NYG30. No return.","(11:52) Kirk Cousins pass to the right to Chris Thompson for a loss of 7 yards to the Was35. Tackled by Keenan Robinson.","(11:52) Penalty: Offside on New York (Jason Pierre-Paul) 5 yards.","(11:52) Washington Redskins timeout.","(11:58) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(12:29) Matt Jones rush to the left for 3 yards to the Was37. Tackled by Trevin Wade.","(13:09) Matt Jones rush to the left for 6 yards to the Was34. Tackled by Jonathan Casillas.","(13:35) Kirk Cousins pass to the left to Matt Jones for 8 yards to the Was28. Tackled by Landon Collins.","(13:42) Eli Manning pass intended for Will Tye INTERCEPTED by Quinton Dunbar. No return. Touchback.","(14:03) Penalty: Holding on Washington (Josh Norman) 5 yards.","(14:18) Eli Manning pass to the left to Odell Beckham Jr. for 24 yards to the Was5. Tackled by Mason Foster. Penalty: Disqualification on New York (Weston Richburg) -15 yards.","(14:39) Eli Manning pass to the left to Odell Beckham Jr. for 19 yards to the Was29. Tackled by David Bruton Jr..","(14:57) Eli Manning pass to the left to Sterling Shepard for 12 yards to the NYG37. Tackled by Josh Norman. Penalty: Unnecessary Roughness on Washington (Josh Norman) 15 yards.","(14:57) Dustin Hopkins kicks off to the endzone. Touchback.","(15:00) Dustin Hopkins 25 yard field goal attempt is GOOD. Holder: Tress Way.","(0:02) Kirk Cousins rush up the middle for a loss of 3 yards to the NYG7. Tackled by Damon Harrison.","(0:07) Kirk Cousins incomplete pass to the right intended for Jamison Crowder.","(0:47) Rob Kelley rush to the right for no gain to the NYG4. Tackled by Devon Kennard.","(1:31) Kirk Cousins pass to the right to Pierre Garcon for 11 yards to the NYG4. Tackled by Keenan Robinson and Leon Hall.","(2:14) Rob Kelley rush up the middle for 1 yard to the NYG15. Tackled by Damon Harrison and Jason Pierre-Paul.","(2:55) Rob Kelley rush to the right for 5 yards to the NYG16. Tackled by Nat Berhe.","(3:17) Tress Way pass to the left to Quinton Dunbar for 31 yards to the NYG21. Tackled by Dwayne Harris.","(3:33) Kirk Cousins sacked at Was48 for a loss of 8 yards by Olivier Vernon.","(4:20) Rob Kelley rush to the left for 1 yard to the NYG44. Tackled by Nat Berhe and Jonathan Casillas.","(4:57) Matt Jones rush to the right for 5 yards to the NYG45. Tackled by Nat Berhe and Devon Kennard. FUMBLE, recovered by Was (Matt Jones).","(5:34) Kirk Cousins pass to the left to Jordan Reed for 13 yards to the Was50. Tackled by Damon Harrison and Jonathan Casillas.","(5:42) Kirk Cousins incomplete pass to the left intended for Ryan Grant defensed by Landon Collins.","(6:25) Kirk Cousins pass to the left to Jamison Crowder for 12 yards to the Was37. Tackled by Landon Collins.","(6:29) Kirk Cousins incomplete pass to the right intended for DeSean Jackson.","(6:29) Josh Brown kicks off to the endzone. Touchback.","(6:33) Josh Brown 29 yard field goal attempt is GOOD. Holder: Brad Wing.","(6:40) Washington Redskins timeout.","(6:40) Eli Manning incomplete pass to the right intended for Bobby Rainey defensed by David Bruton Jr..","(6:50) Eli Manning incomplete pass to the left intended for Odell Beckham Jr..","(7:30) Eli Manning sacked at Was11 for a loss of 1 yard by Trent Murphy. FUMBLE, recovered by NYG (Orleans Darkwa).","(8:00) Orleans Darkwa rush to the right for 6 yards to the Was10. Tackled by Mason Foster and Trent Murphy.","(8:34) Eli Manning pass to the left to Orleans Darkwa for 9 yards to the Was16. Tackled by Josh Norman and Will Blackmon.","(9:14) Orleans Darkwa rush to the right for 13 yards to the Was25. Tackled by David Bruton Jr..","(9:22) Eli Manning incomplete pass to the middle intended for Will Tye defensed by Will Compton.","(9:45) Eli Manning pass to the right to Victor Cruz for 37 yards to the Was38. Tackled by David Bruton Jr..","(9:45) Dustin Hopkins kicks off to the endzone. Touchback.","(9:45) Dustin Hopkins extra point is good.","(9:55) Kirk Cousins pass to the left to Jamison Crowder for 55 yards for a TOUCHDOWN.","(10:02) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(10:39) Chris Thompson rush to the right for 5 yards to the Was45. Tackled by Keenan Robinson.","(11:02) Penalty: Holding on Washington (Brandon Scherff) -10 yards.","(11:13) Brad Wing punts for 42 yards to Was42. Jamison Crowder return for 8 yards to Was50. Tackled by Trevin Wade and Keenan Robinson.","(11:21) Eli Manning incomplete pass to the left intended for Sterling Shepard.","(12:04) Orleans Darkwa rush to the left for 4 yards to the NYG16. Tackled by Preston Smith.","(12:46) Orleans Darkwa rush up the middle for 2 yards to the NYG12. Tackled by Ryan Kerrigan.","(13:10) Penalty: Illegal Formation on New York -5 yards.","(13:22) Tress Way punts for 56 yards to NYG11. Dwayne Harris return for 14 yards to NYG25. Tackled by Will Compton. Penalty: Illegal Block on New York (Paul Perkins) -10 yards.","(13:31) Kirk Cousins incomplete pass to the right intended for Pierre Garcon defensed by Dominique Rodgers-Cromartie.","(14:14) Matt Jones rush to the left for 2 yards to the Was33. Tackled by Damon Harrison.","(14:54) Kirk Cousins pass to the left to DeSean Jackson for 3 yards to the Was31. Tackled by Leon Hall.","(15:00) Josh Brown kicks off to the Was3. Chris Thompson return for 25 yards to Was28. Tackled by Dwayne Harris and Andrew Adams.","(0:06) Kirk Cousins sacked at NYG10 for a loss of 6 yards by Jason Pierre-Paul. FUMBLE, recovered by Was (Kirk Cousins).","(0:11) Kirk Cousins incomplete pass to the left intended for Jamison Crowder.","(0:12) Kirk Cousins incomplete pass to the middle.","(0:30) Kirk Cousins pass to the left to Jordan Reed for 24 yards to the NYG4. Tackled by Janoris Jenkins and Landon Collins.","(0:30) Washington Redskins timeout.","(0:35) Kirk Cousins incomplete pass to the middle intended for DeSean Jackson defensed by Nat Berhe.","(0:38) Kirk Cousins incomplete pass to the right intended for Jordan Reed defensed by Jason Pierre-Paul.","(0:58) Chris Thompson rush to the right for 2 yards to the NYG28. Tackled by Keenan Robinson and Jason Pierre-Paul.","(1:03) Kirk Cousins pass to the left to Pierre Garcon for 8 yards to the NYG30. Tackled by Janoris Jenkins.","(1:10) Penalty: Pass Interference on New York (Trevin Wade) 23 yards.","(1:10) Penalty: Encroachment on New York (Owamagbe Odighizuwa) 5 yards.","(1:18) Eli Manning pass to the left to Shane Vereen for 12 yards to the Was35. Tackled by Will Blackmon and Su'a Cravens. FUMBLE, recovered by Was (Greg Toler). Tackled by Justin Pugh.","(1:26) Penalty: Face Mask on New York (Ereck Flowers) -15 yards.","(2:00) Shane Vereen rush to the left for a loss of 2 yards to the Was32. Tackled by Cullen Jenkins and Trent Murphy.","(2:00) Two Minute Warning.","(2:09) Shane Vereen rush to the right for 25 yards to the Was30. Tackled by Greg Toler.","(2:38) Eli Manning pass to the right to Larry Donnell for 3 yards to the NYG45. Tackled by David Bruton Jr..","(3:13) Eli Manning pass to the left to Odell Beckham Jr. for 18 yards to the NYG42. Tackled by DeAngelo Hall.","(3:35) Shane Vereen rush to the right for 2 yards to the NYG24. Tackled by Ryan Kerrigan and Ziggy Hood.","(3:40) Dustin Hopkins kicks off to the NYG7. Dwayne Harris return for 15 yards to NYG22. Tackled by Will Blackmon and Terence Garvin.","(3:40) Dustin Hopkins extra point is good.","(3:49) Kirk Cousins pass to the middle to DeSean Jackson for 44 yards for a TOUCHDOWN.","(4:12) Kirk Cousins pass to the left to DeSean Jackson for 31 yards to the NYG44. Tackled by Landon Collins.","(4:12) Josh Brown kicks off to the endzone. Touchback.","(4:12) Josh Brown extra point is good.","(4:16) Orleans Darkwa rush to the left for 2 yards for a TOUCHDOWN.","(4:52) Orleans Darkwa rush up the middle for 15 yards to the Was2. Tackled by David Bruton Jr. and Josh Norman.","(5:15) Penalty: Roughing Passer on Washington (Trent Murphy) 15 yards.","(5:27) Penalty: Illegal Contact on Washington (Su'a Cravens) 5 yards.","(5:59) Eli Manning pass to the right to Will Tye for 6 yards to the NYG45. Tackled by DeAngelo Hall.","(6:30) Shane Vereen rush up the middle for 2 yards to the NYG39. Tackled by Cullen Jenkins.","(7:01) Eli Manning pass to the left to Victor Cruz for 15 yards to the NYG37. Tackled by Quinton Dunbar.","(7:33) Shane Vereen rush to the left for 3 yards to the NYG22. Tackled by Preston Smith and Ricky Jean Francois.","(7:57) Penalty: Holding on New York (Ereck Flowers) -10 yards.","(8:34) Orleans Darkwa rush to the left for 4 yards to the NYG29. Tackled by Preston Smith and Ziggy Hood.","(8:34) Dustin Hopkins kicks off to the endzone. Touchback.","(8:39) Dustin Hopkins 45 yard field goal attempt is GOOD. Holder: Tress Way.","(8:45) Kirk Cousins incomplete pass to the middle intended for Chris Thompson defensed by Leon Hall.","(9:22) Kirk Cousins pass to the left to DeSean Jackson for 9 yards to the NYG27. Tackled by Janoris Jenkins.","(9:48) Penalty: False Start on Washington (Morgan Moses) -5 yards.","(10:26) Chris Thompson rush to the left for 2 yards to the NYG31. Tackled by Damon Harrison and Leon Hall.","(10:34) Penalty: Holding on Washington (Trent Williams) -10 yards.","(11:17) Kirk Cousins pass to the right to Pierre Garcon for 9 yards to the NYG23. Tackled by Dominique Rodgers-Cromartie.","(11:51) Chris Thompson rush to the left for 3 yards to the NYG32. Tackled by Jonathan Casillas.","(11:51) Washington Redskins timeout.","(12:32) Matt Jones rush to the right for 1 yard to the NYG35. Tackled by Devon Kennard.","(12:59) Brad Wing punts for 56 yards to Was14. Jamison Crowder return for 50 yards to NYG36. Tackled by Dwayne Harris.","(13:16) Penalty: Unsports. Conduct on New York (Weston Richburg) -15 yards.","(13:47) Orleans Darkwa rush up the middle for a loss of 2 yards to the NYG39. Tackled by Ryan Kerrigan and Preston Smith.","(14:26) Eli Manning sacked at NYG41 for a loss of 12 yards by Chris Baker. FUMBLE, recovered by NYG (John Jerry).","(15:00) Eli Manning pass to the left to Odell Beckham Jr. for 26 yards to the Was47. Tackled by Josh Norman.","(0:22) Shane Vereen rush to the left for 2 yards to the NYG27. Tackled by Mason Foster.","(0:25) Eli Manning incomplete pass to the left intended for Odell Beckham Jr. defensed by Preston Smith.","(0:25) Dustin Hopkins kicks off to the endzone. Touchback.","(0:30) Dustin Hopkins 33 yard field goal attempt is GOOD. Holder: Tress Way.","(1:08) Kirk Cousins pass to the middle to Jamison Crowder for 3 yards to the NYG15. Tackled by Keenan Robinson.","(1:49) Chris Thompson rush to the right for 3 yards to the NYG18. Tackled by Jay Bromley.","(1:53) Kirk Cousins incomplete pass to the left intended for Jordan Reed.","(2:35) Kirk Cousins pass to the left to Jamison Crowder for 8 yards to the NYG21. Tackled by Dominique Rodgers-Cromartie.","(3:16) Kirk Cousins pass to the right to Jordan Reed for 5 yards to the NYG29. Tackled by Janoris Jenkins and Jonathan Casillas.","(3:56) Matt Jones rush to the right for 1 yard to the NYG34. Tackled by Jason Pierre-Paul and Landon Collins.","(4:41) Kirk Cousins pass to the middle to Pierre Garcon for 20 yards to the NYG35. Tackled by Jonathan Casillas.","(5:21) Kirk Cousins pass to the right to Jordan Reed for 14 yards to the Was45. Tackled by Leon Hall.","(5:28) Kirk Cousins incomplete pass to the left intended for Pierre Garcon.","(6:10) Matt Jones rush to the right for 6 yards to the Was31. Tackled by Damon Harrison and Devon Kennard.","(6:10) Josh Brown kicks off to the endzone. Touchback.","(6:10) Josh Brown extra point is good.","(6:16) Eli Manning pass to the right to Sterling Shepard for 23 yards for a TOUCHDOWN.","(6:25) Eli Manning incomplete pass to the right intended for Odell Beckham Jr. defensed by Josh Norman.","(6:57) Eli Manning pass to the left to Bobby Rainey for 24 yards to the Was23. Tackled by Will Compton.","(7:30) Shane Vereen rush to the left for 3 yards to the Was47. Tackled by DeAngelo Hall.","(8:11) Shane Vereen rush to the left for 14 yards to the NYG50. Tackled by David Bruton Jr. and Trent Murphy.","(8:47) Eli Manning pass to the left to Will Tye for 3 yards to the NYG36. Tackled by Su'a Cravens.","(9:09) Orleans Darkwa rush up the middle for 3 yards to the NYG33. Tackled by Chris Baker and David Bruton Jr..","(9:35) Eli Manning pass to the middle to Will Tye for 5 yards to the NYG30. Tackled by Mason Foster.","(9:35) Dustin Hopkins kicks off to the endzone. Touchback.","(9:40) Dustin Hopkins 49 yard field goal attempt is GOOD. Holder: Tress Way.","(9:46) Kirk Cousins incomplete pass to the left intended for Jordan Reed.","(10:21) Matt Jones rush to the left for 2 yards to the NYG31. Tackled by Devon Kennard and Jonathan Casillas.","(10:39) Kirk Cousins pass to the left to Matt Jones for 6 yards to the NYG33. Tackled by Landon Collins.","(11:08) Kirk Cousins pass to the right to Pierre Garcon for 11 yards to the NYG39. Tackled by Landon Collins and Jonathan Casillas.","(11:43) Chris Thompson rush to the left for 8 yards to the Was50. Tackled by Eli Apple and Keenan Robinson.","(12:18) Matt Jones rush to the left for 2 yards to the Was42. Tackled by Olivier Vernon and Damon Harrison.","(12:18) Josh Brown kicks off to the Was7, out of bounds. No return.","(12:18) Josh Brown extra point is good.","(12:35) Shane Vereen rush to the right for 1 yard for a TOUCHDOWN.","(12:54) Eli Manning pass to the right to Sterling Shepard for 12 yards to the Was1. Tackled by Ricky Jean Francois.","(13:23) Shane Vereen rush to the left for 15 yards to the Was13. Tackled by David Bruton Jr. and DeAngelo Hall.","(13:37) Brad Wing punts for 44 yards to Was27. Quinton Dunbar - no return. FUMBLE, recovered by NYG (Dwayne Harris). Tackled by Niles Paul.","(13:45) Eli Manning incomplete pass to the left intended for Larry Donnell.","(14:27) Eli Manning pass to the left to Larry Donnell for 2 yards to the NYG29. Tackled by Josh Norman.","(15:00) Shane Vereen rush to the right for 2 yards to the NYG27. Tackled by Preston Smith.","(15:00) Dustin Hopkins kicks off to the endzone. Touchback."]