["(0:21) Sam Bradford rush up the middle for a loss of 1 yard to the Car33.","(0:30) Cam Newton pass to the right to Corey Brown for 12 yards to the Car32. Tackled by Mackensie Alexander and Emmanuel Lamur.","(1:18) Cam Newton sacked at Car20 for a loss of 15 yards by Everson Griffen.","(1:20) Cam Newton incomplete pass to the middle intended for Greg Olsen defensed by Eric Kendricks.","(1:27) Cam Newton pass to the left to Fozzy Whittaker for 1 yard to the Car35. Tackled by Trae Waynes.","(1:53) Cam Newton pass to the left to Fozzy Whittaker for 14 yards to the Car34. Tackled by Brian Robison.","(1:57) Jeff Locke punts for 53 yards to Car0. Touchback.","(1:57) Two Minute Warning.","(2:15) Sam Bradford pass to the left to Matt Asiata for 4 yards to the Min47. Tackled by Kurt Coleman and Star Lotulelei.","(2:15) Carolina Panthers timeout.","(2:15) Jerick McKinnon rush to the right for no gain to the Min43. Tackled by Kawann Short and Kony Ealy.","(2:15) Carolina Panthers timeout.","(2:21) Matt Asiata rush up the middle for 3 yards to the Min43. Tackled by Kurt Coleman and Kawann Short.","(2:29) Cam Newton pass intended for Mike Tolbert INTERCEPTED by Tom Johnson and returned for 4 yards. Tackled by Mike Tolbert. FUMBLE, recovered by Min (Harrison Smith).","(2:34) Cam Newton incomplete pass to the left intended for Kelvin Benjamin defensed by Marcus Sherels.","(2:40) Cam Newton incomplete pass to the left intended for Greg Olsen.","(2:44) Cam Newton incomplete pass to the left intended for Corey Brown.","(2:53) Cam Newton rush to the right for 11 yards to the Min24.","(3:19) Cam Newton pass to the left to Greg Olsen for 16 yards to the Min35. Tackled by Anthony Barr and Captain Munnerlyn.","(3:26) Penalty: Pass Interference on Carolina (Greg Olsen) -10 yards.","(3:59) Cam Newton sacked at Min41 for a loss of 6 yards by Harrison Smith.","(4:06) Cam Newton pass to the left to Corey Brown for 15 yards to the Min35. Tackled by Captain Munnerlyn.","(4:06) Penalty: Delay of Game on Carolina (Cam Newton) -5 yards.","(4:12) Cam Newton incomplete pass to the left intended for Devin Funchess.","(4:39) Cam Newton pass to the right to Greg Olsen for 7 yards to the Min45. Tackled by Trae Waynes.","(5:07) Cam Newton pass to the right to Ed Dickson for 23 yards to the Car48. Tackled by Andrew Sendejo.","(5:07) Blair Walsh kicks off to the endzone. Touchback.","(5:11) Blair Walsh 31 yard field goal attempt is GOOD. Holder: Jeff Locke.","(5:18) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(6:00) Matt Asiata rush up the middle for 1 yard to the Car13. Tackled by Kony Ealy and Kawann Short.","(7:00) Jerick McKinnon rush to the left for a loss of 4 yards to the Car14. Tackled by Kawann Short.","(7:00) Sam Bradford pass to the left to Adam Thielen for 19 yards to the Car5. Tackled by Robert McClain. Penalty: Delay of Game on Minnesota (Adam Thielen) -5 yards.","(7:45) Jerick McKinnon rush to the right for 7 yards to the Car24. Tackled by Thomas Davis.","(7:45) Minnesota Vikings timeout.","(8:31) Jerick McKinnon rush up the middle for a loss of 2 yards to the Car31. Tackled by Mario Addison.","(9:10) Sam Bradford pass to the middle to Kyle Rudolph for 14 yards to the Car29. Tackled by Luke Kuechly.","(9:52) Jerick McKinnon rush up the middle for a loss of 1 yard to the Car43. Tackled by Luke Kuechly.","(10:29) Sam Bradford pass to the right to Kyle Rudolph for 18 yards to the Car42. Tackled by Thomas Davis.","(11:02) Jerick McKinnon rush to the left for 2 yards to the Min40. Tackled by Lavar Edwards.","(11:18) Andy Lee punts for 58 yards to Min34. Marcus Sherels return for 4 yards to Min38. Tackled by David Mayo.","(11:36) Cam Newton sacked at Car8 for a loss of 7 yards by Anthony Barr.","(11:36) Minnesota Vikings timeout.","(12:08) Fozzy Whittaker rush to the right for 9 yards to the Car15. Tackled by Eric Kendricks and Linval Joseph.","(12:52) Cam Newton sacked at Car6 for a loss of 10 yards by Everson Griffen.","(13:14) Ted Ginn Jr. rush to the left for 1 yard to the Car26. Tackled by Andrew Sendejo. Penalty: Holding on Carolina (Michael Oher) -10 yards.","(13:14) Blair Walsh kicks off to the endzone. Touchback.","(13:17) Blair Walsh 28 yard field goal attempt is GOOD. Holder: Jeff Locke.","(13:24) Sam Bradford incomplete pass to the right intended for Kyle Rudolph.","(13:59) Sam Bradford pass to the right to Adam Thielen for 4 yards to the Car10. Tackled by Luke Kuechly.","(14:26) Jerick McKinnon rush to the left for no gain to the Car14. Tackled by Luke Kuechly and Star Lotulelei.","(15:00) Sam Bradford pass to the middle to Kyle Rudolph for 8 yards to the Car14. Tackled by Luke Kuechly.","(0:21) Jerick McKinnon rush to the right for 3 yards to the Car22. Tackled by Luke Kuechly and Kawann Short.","(1:00) Sam Bradford pass to the left to Rhett Ellison for 18 yards to the Car25. Tackled by Luke Kuechly.","(1:07) Cam Newton pass intended for Ted Ginn Jr. INTERCEPTED by Terence Newman. No return.","(1:54) Cam Newton sacked at Car33 for a loss of 5 yards by Brian Robison.","(2:30) Cameron Artis-Payne rush to the right for 4 yards to the Car38. Tackled by Terence Newman and Andrew Sendejo.","(2:40) Jeff Locke punts for 50 yards to Car35. Ted Ginn Jr. return for a loss of 1 yard to Car34. Tackled by Cordarrelle Patterson.","(3:09) Sam Bradford pass to the left to Kyle Rudolph for 6 yards to the Min15. Tackled by Luke Kuechly.","(3:14) Sam Bradford incomplete pass to the right intended for Stefon Diggs.","(3:55) Jerick McKinnon rush to the right for a loss of 1 yard to the Min9. Tackled by Thomas Davis.","(4:03) Andy Lee punts for 34 yards to Min10. No return.","(4:10) Cam Newton incomplete pass to the right intended for Greg Olsen.","(4:55) Fozzy Whittaker rush to the left for 2 yards to the Min44. Tackled by Harrison Smith.","(5:33) Fozzy Whittaker rush to the left for 2 yards to the Min46. Tackled by Anthony Barr and Everson Griffen.","(6:10) Cam Newton pass to the right to Fozzy Whittaker for 7 yards to the Min48. Tackled by Eric Kendricks.","(6:45) Cameron Artis-Payne rush to the right for 3 yards to the Car45. Tackled by Linval Joseph and Chad Greenway.","(6:53) Penalty: Illegal Contact on Minnesota (Andrew Sendejo) 5 yards.","(7:31) Cameron Artis-Payne rush to the left for 6 yards to the Car37. Tackled by Linval Joseph.","(7:39) Cam Newton incomplete pass to the right intended for Ted Ginn Jr..","(8:21) Cam Newton rush to the right for 3 yards to the Car31. Tackled by Captain Munnerlyn and Tom Johnson.","(9:05) Cam Newton rush to the left for 4 yards to the Car28. Tackled by Captain Munnerlyn.","(9:39) Cameron Artis-Payne rush to the left for 4 yards to the Car24. Tackled by Harrison Smith.","(9:43) Blair Walsh kicks off to the Car-6. Ted Ginn Jr. return for 26 yards to Car20. Tackled by Anthony Harris.","(9:43) Jerick McKinnon 2 pt rush attempt. Successful.","(9:49) Sam Bradford pass to the left to Kyle Rudolph for 15 yards for a TOUCHDOWN.","(10:27) Sam Bradford pass to the middle to Stefon Diggs for 6 yards to the Car15. Tackled by Thomas Davis.","(10:49) Jerick McKinnon rush up the middle for 4 yards to the Car21. Tackled by Vernon Butler and Thomas Davis.","(11:22) Sam Bradford pass to the left to Stefon Diggs for 16 yards to the Car25. Tackled by James Bradberry.","(12:02) Matt Asiata rush up the middle for 8 yards to the Car41. Tackled by Luke Kuechly.","(13:19) Jerick McKinnon rush to the right for 9 yards to the Car49. Tackled by Kurt Coleman.","(13:19) Sam Bradford pass to the left to Kyle Rudolph for 5 yards to the Min42. Tackled by Kurt Coleman and Kony Ealy.","(14:01) Sam Bradford pass to the middle to Jerick McKinnon for 2 yards to the Min37. Tackled by Thomas Davis.","(14:26) Jerick McKinnon rush up the middle for 4 yards to the Min35. Tackled by Thomas Davis and Luke Kuechly.","(14:54) Sam Bradford pass to the left to Stefon Diggs for 10 yards to the Min31. Tackled by James Bradberry.","(15:00) Graham Gano kicks off to the Min-4. Cordarrelle Patterson return for 25 yards to Min21. Tackled by Mario Addison and Tre Boston.","(0:07) Sam Bradford rush up the middle for a loss of 1 yard to the Min4.","(0:15) Cam Newton pass intended for Ted Ginn Jr. INTERCEPTED by Trae Waynes. No return. Tackled by Ted Ginn Jr..","(0:50) Cam Newton sacked at Min48 for a loss of 12 yards by Everson Griffen.","(0:50) Carolina Panthers timeout.","(0:57) Cam Newton pass to the middle to Mike Tolbert for 7 yards to the Min36. Tackled by Anthony Barr and Captain Munnerlyn.","(0:57) Carolina Panthers timeout.","(1:08) Fozzy Whittaker rush up the middle for 3 yards to the Min43. Tackled by Tom Johnson and Eric Kendricks.","(1:49) Cam Newton pass to the right to Ted Ginn Jr. for 8 yards to the Min46. Tackled by Andrew Sendejo.","(1:54) Cam Newton incomplete pass to the left intended for Ted Ginn Jr..","(1:54) Two Minute Warning.","(2:01) Cam Newton pass to the left to Greg Olsen for 10 yards to the Car46. Tackled by Eric Kendricks.","(2:35) Cam Newton rush up the middle for 2 yards to the Car36. Tackled by Eric Kendricks and Danielle Hunter.","(3:15) Cam Newton pass to the right to Greg Olsen for 9 yards to the Car34. Tackled by Terence Newman.","(3:21) Cam Newton incomplete pass to the right intended for Fozzy Whittaker.","(3:21) Blair Walsh kicks off to the endzone. Touchback.","(3:21) Blair Walsh extra point is NO GOOD.","(3:37) Andy Lee punts for 48 yards to Min46. Marcus Sherels return for 54 yards for a TOUCHDOWN.","(3:43) Cam Newton incomplete pass to the right intended for Greg Olsen.","(4:27) Cam Newton rush to the right for 2 yards to the Car6. Tackled by Eric Kendricks and Harrison Smith.","(5:00) Mike Tolbert rush up the middle for 2 yards to the Car4. Tackled by Chad Greenway and Eric Kendricks.","(5:11) Jeff Locke punts for 58 yards to Car2. No return.","(5:51) Sam Bradford sacked at Min40 for a loss of 8 yards by Lavar Edwards.","(6:21) Jerick McKinnon rush to the left for 3 yards to the Min48. Tackled by Luke Kuechly.","(6:26) Sam Bradford incomplete pass to the right intended for Stefon Diggs.","(6:31) 54 yard field goal attempt by Graham Gano is NO GOOD. Holder: Andy Lee.","(6:36) Cam Newton incomplete pass to the left intended for Devin Funchess defensed by Xavier Rhodes.","(7:17) Cameron Artis-Payne rush to the left for 1 yard to the Min37. Tackled by Danielle Hunter and Eric Kendricks.","(7:59) Cameron Artis-Payne rush to the left for 4 yards to the Min38. Tackled by Danielle Hunter and Eric Kendricks.","(8:12) Jeff Locke punts for 44 yards to Car47. Ted Ginn Jr. return for 1 yard to Car48. Tackled by Anthony Harris. Penalty: Illegal Use of Hands on Minnesota (Jayron Kearse) 10 yards.","(8:43) Sam Bradford pass to the left to Adam Thielen for 6 yards to the Min9. Tackled by Robert McClain.","(8:47) Sam Bradford incomplete pass to the right intended for Adam Thielen.","(9:22) Matt Asiata rush to the right for no gain to the Min3. Tackled by Kurt Coleman and Thomas Davis.","(9:35) Andy Lee punts for 49 yards to Min5. No return. Penalty: Holding on Minnesota (Audie Cole) -2 yards.","(9:43) Penalty: Illegal Motion on Carolina (Daryl Worley) -5 yards.","(10:19) Cam Newton pass to the right to Mike Tolbert for 7 yards to the Min49. Tackled by Terence Newman.","(10:33) Cam Newton pass to the right to Fozzy Whittaker for 10 yards to the Min46. Penalty: Illegal Block on Carolina (Kelvin Benjamin) -10 yards.","(11:15) Derek Anderson pass to the right to Corey Brown for 3 yards to the Car44. Tackled by Trae Waynes and Captain Munnerlyn.","(11:55) Cam Newton sacked at Car41 for a loss of 4 yards by Linval Joseph.","(12:44) Cam Newton pass to the middle to Ted Ginn Jr. for 23 yards to the Car45. Tackled by Trae Waynes.","(13:21) Cameron Artis-Payne rush up the middle for 3 yards to the Car22. Tackled by Andrew Sendejo and Anthony Barr.","(13:30) Penalty: Illegal Plyr Downfld on Carolina (Andrew Norwell) -5 yards.","(14:10) Cam Newton pass to the left to Cameron Artis-Payne for 11 yards to the Car24. Tackled by Harrison Smith.","(14:48) Cameron Artis-Payne rush to the right for 3 yards to the Car13. Tackled by Captain Munnerlyn and Danielle Hunter.","(14:55) Jeff Locke punts for 38 yards to Car10. No return.","(15:00) Sam Bradford incomplete pass to the left intended for Charles Johnson defensed by Daryl Worley.","(0:18) Sam Bradford pass to the left to Cordarrelle Patterson for 8 yards to the Car48. Tackled by Luke Kuechly and Kony Ealy.","(0:22) Sam Bradford incomplete pass to the right intended for Stefon Diggs defensed by James Bradberry.","(1:00) Jerick McKinnon rush to the right for 14 yards to the Min44. Tackled by Tre Boston.","(1:38) Jerick McKinnon rush to the right for 3 yards to the Min30. Tackled by Charles Johnson.","(1:44) Andy Lee kicks off to the Min9. Marcus Sherels return for 18 yards to Min27. Tackled by Kurt Coleman.","(1:51) Cam Newton sacked at Car0 for a loss of 5 yards by Danielle Hunter. Safety.","(2:34) Mike Tolbert rush up the middle for 3 yards to the Car5. Tackled by Eric Kendricks and Linval Joseph.","(2:57) Penalty: Holding on Carolina (Ed Dickson) -2 yards.","(3:10) Jeff Locke punts for 62 yards to Car7. No return. Penalty: Holding on Carolina (James Bradberry) -3 yards.","(3:48) Sam Bradford sacked at Min31 for a loss of 10 yards by Thomas Davis.","(3:52) Sam Bradford incomplete pass to the left intended for Kyle Rudolph defensed by Vernon Butler.","(4:18) Jerick McKinnon rush up the middle for 4 yards to the Min41. Tackled by Robert McClain and Lavar Edwards.","(4:46) Sam Bradford pass to the right to Kyle Rudolph for 4 yards to the Min37. Tackled by Thomas Davis.","(5:15) Sam Bradford pass to the right to Stefon Diggs for 8 yards to the Min33. Tackled by Kurt Coleman and James Bradberry.","(5:20) Sam Bradford incomplete pass to the left intended for Jerick McKinnon.","(5:20) Graham Gano kicks off to the endzone. Touchback.","(5:20) Graham Gano extra point is good. Penalty: Leverage on Minnesota (Shamar Stephen) 15 yards.","(5:25) Cam Newton rush to the right for 3 yards for a TOUCHDOWN.","(5:58) Fozzy Whittaker rush to the right for 6 yards to the Min3. Tackled by Terence Newman.","(6:43) Cam Newton pass to the left to Corey Brown for 27 yards to the Min9. Tackled by Captain Munnerlyn.","(7:20) Cam Newton rush to the right for 1 yard to the Min36. Tackled by Anthony Barr.","(8:00) Cameron Artis-Payne rush to the right for 3 yards to the Min37. Tackled by Linval Joseph and Anthony Barr.","(8:23) Ted Ginn Jr. rush to the right for 4 yards to the Min30. Tackled by Harrison Smith. Penalty: Holding on Carolina (Kelvin Benjamin) -10 yards.","(8:30) Penalty: Illegal Contact on Minnesota (Terence Newman) 5 yards.","(9:11) Cam Newton pass to the right to Greg Olsen for 18 yards to the Min39. Tackled by Eric Kendricks and Andrew Sendejo.","(9:22) Jeff Locke punts for 34 yards to Car43. No return.","(9:29) Sam Bradford incomplete pass to the right intended for Charles Johnson defensed by Luke Kuechly.","(10:11) Matt Asiata rush to the left for no gain to the Min23. Tackled by Luke Kuechly.","(10:46) Matt Asiata rush to the right for 3 yards to the Min23. Tackled by Kurt Coleman.","(10:52) Graham Gano kicks off to the Min5. Cordarrelle Patterson return for 15 yards to Min20. Tackled by Joe Webb.","(10:57) Graham Gano 48 yard field goal attempt is GOOD. Holder: Andy Lee.","(11:34) Cam Newton pass to the right to Greg Olsen for 4 yards to the Min30. Tackled by Eric Kendricks.","(12:11) Cam Newton pass to the left to Fozzy Whittaker for 2 yards to the Min34. Tackled by Harrison Smith.","(12:45) Cameron Artis-Payne rush to the left for 2 yards to the Min36. Tackled by Linval Joseph and Shamar Stephen.","(13:04) Penalty: False Start on Carolina (Ted Ginn Jr.) -5 yards.","(13:39) Cam Newton pass to the left to Ted Ginn Jr. for 31 yards to the Min33. Tackled by Andrew Sendejo.","(14:16) Cameron Artis-Payne rush to the left for 2 yards to the Car36. Tackled by Chad Greenway.","(14:56) Cameron Artis-Payne rush to the left for 12 yards to the Car34. Tackled by Andrew Sendejo and Captain Munnerlyn.","(15:00) Blair Walsh kicks off to the Car4. Ted Ginn Jr. return for 18 yards to Car22. Tackled by Adam Thielen."]